{
  "id": "8352975408978217085",
  "title": "A Day at the Museum",
  "published": "2009-01-11T16:13:00.001-08:00",
  "updated": "2009-01-13T23:44:54.827-08:00",
  "content": "I'd been [hyping Wild Beauty](http://worldgame.blogspot.com/2009/01/columbia-gorge-recent-history.html) to Tara and today was the last day, plus I'd missed much of the 2nd tier (lower level), wanted more puzzle pieces, then there's the whole rest of the gallery.We took in the 2K year old Chinese artifacts (some look [good as new](http://controlroom.blogspot.com/2007/04/night-at-museum-movie-review.html)), later Japanese and Korean pieces.One sign lectures the Chinese about Western superiority (barbarians do that), another was sexist, saying [an eminent scholar](http://controlroom.blogspot.com/2007/05/incompleteness.html) no doubt sketched the pictures, but the embroidery would have been done by women.  Given the culture of that day, this probably made sense.Yes, Sarah Ladd was connected to Portland's Ladd of Ladd Addition fame, was his daughter in law.  She and Lily White ran the photography boathouse, a place for their guests to learn the skills in the company of some intelligent role models.Sam Hill was King of Roads, Lancaster his engineer.  The Columbia Scenic Highway was a dream come true for a generation of Americans, until a \"been there done that\" feeling set in, paving the way for I-84.[The movie Cars](http://mybizmo.blogspot.com/2006/06/cars-movie-review.html) captures some of the feeling, of destroying wild America.  You kill the soul of a place.  Healing takes time, and more enlightened generations.The tunnel connecting the two buildings is shorter than WDC's to the East Wing, but the converted Masonic Temple is somewhat reminiscent in containing a mobile, many contemporary pieces, including the [tensegrity sculpture](http://www.flickr.com/photos/17157315@N00/3153748785/) Forest Devil by Kenneth Snelson, a native Oregonian and friend.  Tara well remembered [our visit to his studio](http://worldgame.blogspot.com/2006/10/our-big-new-york-adventure.html) in Soho that time.  There's also a Picasso sculpture, and a photograph of Steve Martin (the actor) [by Annie Liebowitz](http://www.zimbio.com/pictures/C85PYmeKAzM/Anne+Leibowitz+Out+Halloween).By this time I was sweltering, feeling too grungy, walking around in my railroad tycoon gown coat, minus the [Quaker futurist hat](http://worldgame.blogspot.com/2009/01/repatriation.html).  Checking the [gown coat](http://worldgame.blogspot.com/2005/02/methodist-morning.html) didn't help, so I found the only XL T-shirt in the gift shop, which turned out to be a winner ([lovely design](http://www.flickr.com/photos/17157315@N00/3189825675/)).  That solved the problem.We left \"Wild L. Hickcox\" (related to Bill somehow, serious about photography) to savor the remaining pix in peace. Five Mile Rapids, Big Eddy... Army Corps of Engineers negatives, many aerial views.I also bought First Americans for Michael, celebrating his birthday this evening (Michael, no fair peaking until you [open it](http://www.flickr.com/photos/17157315@N00/3189823941/)).Addendum:  Michael [called it](http://www.flickr.com/photos/17157315@N00/3189825501/) my \"[Abramoff hat](http://controlroom.blogspot.com/2008/09/blogging-from-pdx.html)\" -- I said I was impressed he'd noticed the resemblance.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}