{
  "id": "1520152783565951438",
  "title": "A Fine Friday",
  "published": "2007-10-26T22:00:00.001-07:00",
  "updated": "2011-02-09T22:36:28.255-08:00",
  "content": "I'm sipping a DragonFly Chai milkshake, prepared by barrista Megan, Tara doing hot chocolate, a regular hangout, good for doing homework, wifi-enabled.Earlier today:  more executive toys purchased, imported coffee procured (Celebes, for celebrations). Tara and I visited a neighborhood bike shop to add a rack & removable receptacle (velcro bonds). Some telecommuting to work (a VPN type setup).  Some preparing for classes (also work related).My Uncle Bill, the [maritime scholar](http://web.archive.org/web/20061214062253/http://beneaththesurface.biz/), appeared out of the blue and invited me to lunch at the Bagdad.  Then we had coffee at Starbucks and I took him to Missing Link. Plus he went to Presents of Mind to buy gifts, then met up with mom before re-vectoring his Aztec back north to Seattle, to visit with other family.  I'm hoping we'll get him lined up for a Wanderers presentation some day soon.  Like Allen Taylor, Bill has experience doing a cruise ship gig.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg77BJ2BPsSACSUPpl2iLLgy-wQDAzQ8ocaY10kV7mNUuVelVd6pTNVVLbkMeUaI-xSCOTZ6Hq4TDnP8UrieZqAj6otLb3DK_OOPqt20gWZ-J1dEBgIrSX-HpT5HmqBKUbSmOff/s1600-h/frontcover.jpg)Maureen dropped by, also out of the blue, with news of the [death of Admiral William Crowe](http://seattletimes.nwsource.com/html/nationworld/2003964990_croweobit21.html), the spouse of her cousin, bringing me some bio, which I was grateful to get.  Thank you Maureen. My condolences to the family.Mom got to speak to school kids today, in one of Portland's more opulent schools, in the sense of owning good recording equipment.  I talked to a teacher and know they plan to share eventually, maybe streaming media, which I wish Wanderers could do more with as well.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}