{
  "id": "8117735433931897767",
  "title": "A Front Door",
  "published": "2018-09-18T13:37:00.001-07:00",
  "updated": "2018-09-20T12:05:27.129-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/43857854005/in/dateposted-public/)\n\nIn this day and age, if operating in compatibility mode with USA OS ([more elsewhere](http://grunch.net/synergetics/usaos.html)), there's a way to do it in Windows.  You need a friendly front door in the Citizens' Desktop (not its real name), which is part of Homeland.\n\nJungle-ware (multi-species), such as Anaconda/Python, need to obey rules of the road, starting with Start Menu aesthetics.  The above screen shot shows that happening, with Spyder also along for the ride.  Spyder is another IDE (interactive development environment) for Python.  Python is a computer language.\n\n[One of my pillar tenants](https://worldgame.blogspot.com/2009/03/urner-workshop.html) is both pedagogy and andragogy benefit when the needle wavers between two extremes, we might call them left and right brained, but don't have to.  I waver between (1) storytelling, lore, and (2) deep dives into the details of syntax, getting technical.\n\nContrary to stereotypes, computer programming does not require shutting down one's imagination, draining one's fantasy life, fighting one's propensity to daydream.  On the contrary, keeping story lines in mind and visualizing theatrically, like a movie director, helps glue together what one is reading and writing.  Programs have a plot.\n\nStepping back from any specific drama and considering one's possibilities in the abstract, is what it's like to focus on the language itself.  We might want to code up a Supermarket, a Casino, an Observatory, a Spaceship.  What these have in common, in Python, or in any computer language, is their grammar.\n\nIn mathematics we face something similar:  a need to keep the imagination fired, and abstract at the same time.  Here is where polyhedrons enter the picture, in the form of one's own visual and tactile environment.  We're in a scenario already, with furniture, with sets.  Lights, camera, action.  \"Camera\" means \"room\".\n\n[](https://www.flickr.com/photos/kirbyurner/44769210681/in/dateposted-public/)\n\nUnifying computer programming and polyhedrons is another pillar aspect of my curriculum writing. The stereotype around polyhedrons is they're a topic in computer graphics, first and foremost.  However consider leaving visualization to the imagination and coding only numeric changes in surface area and volume as a function of changes in radius.  Using @property, we may inter-relate all three.\n\nYes, I'm talking about scale, which is turning out to be an important source of generalizations.\n\nThrough Windows, I provide a front door into PATH and STEM.  Anaconda creates a space, after which [Jupyter Notebooks](https://github.com/4dsolutions/SAISOFT/blob/master/OrderingPolys.ipynb) kick in.  We learn Python in connection with its ability to sort polyhedrons in order by volume.  The focus is on grammar, however in a way that fires the imagination rather than damps it down.\n\n[](https://www.flickr.com/photos/kirbyurner/29832307687/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}