{
  "id": "2418312665136154324",
  "title": "A Tipping Point",
  "published": "2016-10-06T15:50:00.001-07:00",
  "updated": "2016-10-08T15:23:30.925-07:00",
  "content": "Patrick did a good job pulling together new Python teaching materials.  These are for a class he's running, completely separately from mine, though also on-line in real time.  His company wants to hand out something thick, made of paper.  Mine doesn't go there, presently.\n\nWe're both tracking the hurricane in Florida, among many catastrophes in the making.  The [human-made catastrophes](http://controlroom.blogspot.com/2005/09/katrina-aftermath.html) are even more lethal sometimes.  The wreckage around the Mediterranean, on into Mesopotamia, or \"Arabia\" as a former US senator from Oregon calls it, is so much worse.\n\nI saw on Twitter about that giant Putin flag hanging off a bridge in New York City.  So how sympathetic was Kerry towards Russia keeping a base in the Mediterranean, regardless of what nations we see?\n\nI haven't seen any nations in a long time, on the maps I'm using, but that's because I was trained in the World Game, a specialized form of modeling only a few got to study.  We look at geography, geology, ecosystems, but not the political layer as much, though we have that overlay.\n\nNATO has a bazillion bases all over the place, we've all seen those maps, so begrudging Russia having [a few](http://www.bloomberg.com/news/articles/2016-10-07/russia-hints-at-reclaiming-cuba-vietnam-bases-in-test-for-u-s) outside its nominal borders, whether or not that includes Crimea, should not be that controversial. \n\nSurely the US isn't so psychologically insecure that it can't abide even a single Russian base anywhere outside Russia.  Organizing inter-visitation might be the next confidence building measure.\n\nI don't think \"bases\" in the obsolete sense are needed at all, but the infrastructure is useful, for [disaster relief](http://controlroom.blogspot.com/2009/12/disaster-relief.html) and human relocation. \n\nCalling for the complete evacuation of Aleppo, as I've been doing, sounds more realistic when one has bases for the refugees to flee to.  They'd've been out long ago, like Floridians from their east coast.\n\nHowever I'm just another Tweeter, these days without even a gym membership, so my views hardly register, whereas Kerry gets to [set the tone](http://controlroom.blogspot.com/2015/10/black-panthers-vanguard-movie-review.html).\n\nI know a lot of people say it's about pipelines, gold, other treasure.  We all have our ways of sounding worldly, knowing. \n\nSo-called \"rich people\" (often among the most ignorant) like to ape one another, competing to sound \"more insider\". \n\nSocial media have amplified and expanded that workflow, to where now pretty much everyone gets to sound like a rich ape.  That's a shift, even a tipping point.\n\n[https://t.co/i95u72BtSg](https://t.co/i95u72BtSg) [https://t.co/hTxI6mmzc2](https://t.co/hTxI6mmzc2)\n— Kirby Urner (@thekirbster) [October 6, 2016](https://twitter.com/thekirbster/status/784151070775750656)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}