{
  "id": "6905178880081468671",
  "title": "Abandoned Projects",
  "published": "2014-11-09T23:17:00.000-08:00",
  "updated": "2014-11-10T20:40:04.452-08:00",
  "content": "I haven't had time to explore my free Amazon Web Services and they were soon to convert to pay-as-you-go.  As a defensive measure, I cancelled the account, not really having learned anything.  Nor have I gotten anywhere with Cypher, the Neo4j language I was [hoping to tackle](http://mybizmo.blogspot.com/2014/10/graphing-relationships.html).\n\nLike anyone, I think I'm lunging toward X and find myself embracing Y instead.  Perhaps momentum is conserved if nothing else, or inertia if you prefer to call it that (coordinate systems talk).\n\nQuakerism tends to have some liberal dharmas (teachings) about how \"the way will open\" and your work as the receiver is \"expectant waiting\".  The ego doesn't get to own the road in this picture.  But then perhaps one may legitimately worry this bigger Self is just another egoic projection, a shadow puppet. Projection is certainly a strong psychological phenomenon, good thing they came up with that name for it.\n\nOne might distinguish projects based on their point of abandonment.  Consider a ship.  Some never make it off the drawing board whereas others plow the world's oceans for decades before finding retirement.  Both may be accounted \"ended projects\" but certainly at different chapters or phases. The other variable to remember is that projects spawn other projects to varying degree.\n\nTonight I was watching a EuroPython video mentioning Rope, Pykka, Bottle and Traad (\"thread\" in Norwegian), the talk by Traad's author.  Probably that, and the email from Amazon about my twelve month free trial period coming to an end, got me meditating on Abandoned Projects as a theme. \n\nNot that these excellent Python projects (Rope etc.) have been abandoned, more they've been spawned, adding to a thriving ecosystem. \n\nLikewise the projects I've thought of doing, or have gotten into part way, have sometimes produced results in other, perhaps unanticipated directions.  Precession.\n\n====\n\nGreetings from Amazon Web Services,\n\nThis e-mail confirms that you have cancelled your access to AWS Unified Registration. Your access to following services is canceled:\nAmazon Simple Storage Service\nAmazon Elastic Compute Cloud\nAmazon Simple Queue Service\nAmazon SimpleDB\nAmazon CloudFront\nAmazon RDS Service\nAmazon Elastic MapReduce\nAWS Import/Export\nAmazon Virtual Private Cloud\nAmazon CloudWatch\nAmazon Simple Notification Service\nAmazon Simple Email Service\nAWS CloudFormation\nAmazon Route 53\nAWS Elastic Beanstalk\nAWS Direct Connect\nAWS Storage Gateway\nAmazon ElastiCache\nAmazon CloudSearch\nAmazon Simple Workflow Service\nAmazon DynamoDB\nAmazon Glacier\nAmazon Elastic Transcoder\nAWS Data Pipeline\nAmazon Redshift\nAWS OpsWorks\nAWS CloudHSM\nURPProduct\nAmazon WorkSpaces\nAmazon AppStream\nAmazon Kinesis\nAmazon Zocalo\nAmazonCloudWatch\nAmazon Cognito\nAmazon Mobile Analytics",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}