{
  "id": "7568084447760989753",
  "title": "About Earthala TV",
  "published": "2007-04-12T09:35:00.000-07:00",
  "updated": "2007-04-13T21:10:44.947-07:00",
  "content": "Over dinner at Dave 'n Jane's last night I was discussing Project Earthala, a designed community with lots of Quaker heritage (especially in business meetings), perhaps even with a foot print at Ghost Ranch, NM -- but with some facilities so remote you'd need a helicopter to get to 'em (unless you enjoy backpacking for several days).Our remote campus satellite dish receivers pick up lots of global TV however (we tune 'em ourselves), plus we open source a lot of our own shows. [Multi-track editing](http://worldgame.blogspot.com/2006/07/pr-for-pl.html) is one of the skills our students get good at, thanks to their public schooling. We generate lots of interesting programming, and don't mind if you share it peer to peer or remix it using Intel's Viiv (we do that too).On this touchy subject of TV programming, I admit to this censorious reflex that'd lead me to ban all sitcoms with fake laugh tracks. Like [Woody Allen](http://worldgame.blogspot.com/2006/12/superman-returns-movie-review.html), I consider laugh machines unethical and damaging to viewer reflexes, as viewers get exposed to hours of phony/inauthentic emoting making up for what're often lame/lazy scripts -- a form of brain damage if you ask me.Then I remembered I'm not a dictator plus I might like to use those laugh machines for my own purposes. Better, and thinking more as a teacher, I could wire it up so you could watch those stupid sitcoms, but your grade in my courses might suffer as a result, i.e. there'd be such a thing as \"academic debits\" as well as credits, and your prized A might become a mere B if you self-indulged in too much phony laugh track television.That's still kinda \"V chip\" thinking though -- a tad too big brothery. Oh well, I'll keep thinking about it.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}