{
  "id": "3470635606488009163",
  "title": "About Racism (Lesson Plan)",
  "published": "2020-07-21T12:36:00.001-07:00",
  "updated": "2020-07-21T13:07:40.939-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/50138249346/in/dateposted-public/)\n\nAbout Racism (a lesson plan)\n\nMe: memetic, ethnic, cultural, software\nMe: genetic, physical, hominid, hardware\n\nMemes are not just miniature billboards on Facebook. I'm stealing from Dawkins (\"borrowing\") and making memes mean a lot more than commercial jingles or fragments from films. Memes comprise the \"daydream\" of what one muses about, considers. Memes come up in meditation, sometimes from deeper levels than Surface Me. A lot of memes come through television and other social media.\n\nGenes do not always translate into visible traits and they don't define character, personality, moral qualities, other attributes of a soul. That's all epigenetic stuff. DNA does govern eye color, skin color, nose shape, physical features (inside and outside) more generally, and because physically inherited, is not nearly as transmissible or alterable (flexible) as memes or culture. \n\nWhat is Race? \n\nA given race is usually a mixed up soup, a mishmash, of both memetic and genetic traits, sufficiently memorable to form stereotypes, a kind of default mnemonic typology (like dwarves and elves). Racist cultures encourage thinking in such racial terms (by definition). \n\nThe notion of race closely relates to \"breed\" in animal husbandry, including the language of mixed or mongrel, versus pure (perhaps with pedigrees to prove lineage). \n\nThe names of the races and the stories behind them, form a kaleidoscopic, ever-shifting tableau, made from memes. The Book of Genesis is a good place to start, if looking for conceptual roots (i.e. memetic content), at least for some people. \n\nWe will be reading the stories of Noah, and the Tower of Babel to get a sense of how people thought (or even think today). We'll also be watching various animated and live action versions of these narratives. We will discover what forms of racism might be traced to this part of scripture by studying a variety of curricula.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}