{
  "id": "475556953677450676",
  "title": "About Elly (movie review)",
  "published": "2015-06-27T10:44:00.002-07:00",
  "updated": "2015-07-01T10:13:18.793-07:00",
  "content": "Given [STEAM as a premise](http://mybizmo.blogspot.com/2015/02/thirsters-2015226.html), with A = Anthropology (not Art, which Anthro includes), one needs to first ask if the source is veridical, by which I mean truthful, authoritative.\n\nI will briefly compare this film to another one, [Villa Touma](http://controlroom.blogspot.com/2015/06/villa-touma-movie-review.html) (2014), which I saw recently, also with Dr. Tag (we're like Siskel and Ebert, or grad students in a film-meets-culture Anthro class, very doable in Portland, Oregon).  [Dr. Tag](http://controlroom.blogspot.com/2010/03/serene-scene.html), for those new to my blogs, is a bona fide Palestinian though with US citizenship by this time.  She's also a PhD which is why the nickname.\n\nThe first film, [Villa Touma](http://www.imdb.com/title/tt3837950/), set in Ramallah, Palestine (Mesopotamia) is not to be seen as a documentary, as if the camera were observing real peoples lives.  There's a layer of satire, of spoof, which makes these characters into caricatures, like in political cartoons.  Shades of Being There in terms of the time warp the sisters are in (whereas [Sellers is timeless](http://mybizmo.blogspot.com/2006/01/being-there-movie-review.html)).\n\nThe second film, on the other hand, [About Elly ](http://www.imdb.com/title/tt1360860/)(2009), is a masterful work in the \"silent camera\" tradition in that we're very much a participant.  When people run, we run (\"we\" the viewers, in the director's hands) i.e. the camera is hand-held and jerky-on-purpose.  When people look around frantically, so does the camera. \n\nWe're another person, deaf, mute and invisible, but vested.  And what's mind-blowing is we're also left in the dark about so much, like an ordinary human being would be.\n\nWe're not that privileged, as just a fly on the wall, nor do we get to be Sherlock Holmes and figure it all out.\n\nAbout Elly requires less of a lens, in other words, if you want to study the actual dynamics between social classes, males and females, attitudes toward marriage, relationships, in a contemporary subculture in Persia.  It's less a spoof and more an investigation.\n\nNevertheless, these young people [remain masks](http://mybizmo.blogspot.com/2015/06/ex-machina-movie-review.html) to us in many ways.  We may judge the sincerity of their emotions.  As character actors, the cast is collectively great at projecting plausible people, real personalities, but not people we necessarily know.  Believability is high.\n\nWe're another stranger in the car, like Elly, trying to put the pieces together, trying to figure it all out.\n\nOne sees the men kicked back enjoying their hookahs, a paternal activity, like sharing cigars in a men's club.  The women feel uncomfortable being typecast as the kitchen crew, repeating all the karma their mothers went through.\n\nThe urge to not take gender roles for granted is the hallmark of a university-based conversation that connects people of privilege in a kind of virtual Global U.  They (we) have cars, vacations, prospects, even past relationships.\n\nA man is divorced from a wife in Germany (sounds like she dumped him) but still has currency as someone eligible, is Elly interested?\n\nWhat's fascinating about the subculture portrayed is how people readily busy themselves with others business -- as a lonesome urbanite like me might see it.  People help their peers get on board, if that's what they want, on the road to family and kids.  Time is of the essence.  People do favors for one another.\n\nFinding eligible others was the theme of both films, an important connection.\n\nThe \"takes a village\" mentality is more like that of a church or temple congregation in that one's spiritual peers are ready and willing to play a match-maker role if called upon.  People help other people find the right others given there's no dating service on-line.\n\nThat's the premise for Elly's being along in the first place.  The dynamics are fairly clear.\n\nWomen have an extremely limited opportunity to \"play the field\" in Elly's World and you don't always know what you're getting.  Should she have been eager to dump that boyfriend i.e. future husband?  We (not so omniscient) clearly don't know everything.  We just get a glimpse.  How much is explained?  About as much as in real life?\n\nWho said anyone gets to be all knowing?  There's a kind of democracy in leaving us in the dark \"just like real people\".  So often the camera's viewpoint gets to be all-knowing in these films, so we notice when that's missing.\n\nI should mention for context that I spent some time in the Oregon Crafts Museum [(wow Eric Franklin](http://www.ericfranklin.com/), Pacific Northwest School of Art (PNCA, new location, old Customs Building), and Powell's Books in the time frame before this movie.\n\nI'd taken the bus 4 from SE Portland where I'd left [the Nissan](http://controlroom.blogspot.com/2013/10/winter-repairs.html) for repairs ([mass airflow sensor](https://www.yourmechanic.com/services/mass-airflow-sensor-replacement)).\n\nAt Powell's, I read a lot about the UK - Ottoman wars, plus a bunch of other military history (where I spent the most time).  That was in Eugene Rogan's The Fall of the Ottomans, published just this year.  Base Politics by Alexander Cooley (Cornell University, 2008) was also my focus.\n\nI'll be renting a car tomorrow, for Carol's gig, plus she wants to hear the [Barker family talk](http://worldgame.blogspot.com/2015/06/quakers-2015628.html) about Peace Corps experiences in Iran.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}