{
  "id": "8438902571998316748",
  "title": "Adventures in Quakerism",
  "published": "2022-11-26T11:31:00.009-08:00",
  "updated": "2023-01-30T22:07:14.906-08:00",
  "content": "Everyone has a different experience (of life) of Quakerism, in terms of vantage points assumed and/or achieved. I did a lot of the small meetup stuff, in part because my parents found sitting in silence a great way to get to know strangers, who then become Friends in one's own eyes.  The proverbial beholder's.\n\nThe above YouTube continues an earlier one that should just was well be entitled \"experiments in\" (versus \"adventures in\") Quakerism, which is not meant to sound cynical, as if Quakers were my guinea pigs.  I'm the guinea pig, and I'm encouraged to explore my religion \"experimentally\".\n\nWhat's \"my religion\"?  Again, that's whatever pass for priors in terms of one's own dogmatism.  Not all beliefs can be under the microscope at every moment.  \n\nOne has to believe Google Maps or just trust intuition, unless one knows one's way about.  My friend Steve had a cul-de-sac dead end loop for an address, but the mapping software showed the street went through.  The procession of lost vehicles was endless.\n\nWhat's critical is your religion have an update or upgrade process, whereby \"waste beliefs\" get dealt with and excreted. Nostalgically curating \"bad beliefs\" (as in \"no longer useful\") results in a level of metaphysical constipation that may become uncomfortable, not only personally, but institutionally, depending on one's role in society.\n\nQuakerism, in focusing on silent worship, interrupted with ministry (aka ranting), does not get hung up on a bunch of \"credos\" wherein people give themselves the self indulgent benefit of being able to debate the trivial stuff quasi-endlessly.  You know you're dealing with the over-entitled when their predilection is to fiddle as Rome burns.\n\nMy hope for Quakerism, in a nutshell, is silent worship, as a central practice, as a catalyst, akin to various forms of meditation, will keep some of the least beneficial viral memeplexes from taking root.  Too many religions prove vulnerable to satanic \"mind thetans\" or whatever we wanna call 'em.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}