{
  "id": "8649568563692236190",
  "title": "Adventure Story",
  "published": "2007-07-13T18:20:00.000-07:00",
  "updated": "2024-04-12T07:04:35.421-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157600695798539)\n\nAfter publishing some [technoinvective](http://mybizmo.blogspot.com/2006/10/more-technoinvective.html) to [edu-sig](http://mail.python.org/pipermail/edu-sig/2007-July/008065.html), cc [math-teach](http://mathforum.org/kb/thread.jspa?threadID=1594788&tstart=0), followed by a healthy breakfast in my hotel, I set out to achieve today's objective: the TV tower, the local version of the [Space Needle](http://controlroom.blogspot.com/2006/11/space-needle.html).\n\nDid it have a revolving restaurant inside? I set out on foot, first stopping to buy stamps for, and mailing, Alexia's postcards.\n\nAlthough Portland boasts some record number of city acres devoted to parks, Vilnius must be up there, given these large swatches of forest hugging both banks of the river Neris.\n\nWith my iPod blaring ([Condi](http://http//www.state.gov/secretary/rm/2007/87826.htm) has one too), newly stocked with tunes from Tara's collection, I stealthily approached said tower, wandering up through some apartment blocks on the outskirts of the [CBD](http://en.wikipedia.org/wiki/Central_business_district).\n\nYes, there's a revolving restaurant inside, a 1970s design. Over a beer, I surveyed the scene: CBD, Old Town, airport, apartment blocks, power stations, the river winding through it all.\n\nUnfortunately use of a camera is strictly forbidden, although the young woman who sold me the ticket had no idea why (\"it's just the rule\"). I used the opportunity to mentally plan my route back to the hotel, noticing a strange looking playground I'd have to visit along the way.\n\nPretending to be a Lithuanian kid pretending to be a partisan nationalist, I dove head first into the forest, a wilderness of unsigned sometimes eroding trails. Obviously the locals use this place to party, as there's lots of trash -- a good opportunity for community service projects, like our annual [Oregon Beach cleanup](http://www.solv.org/programs/spring_beach_cleanup.asp).\n\nFinding my way to the river bank was a challenge. I slipped and slid a few times, getting quite dirty. By the time I re-emerged into civilization, I was somewhat of a sight, in need of a shower. I had enjoyed my adventure though. I hope the city planners aren't too quick to zone away all these river side forests, though adding more bicycle trails (and trash receptacles) might be a nice touch.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}