{
  "id": "115635869377800775",
  "title": "Adventures in ToonTown",
  "published": "2006-08-23T15:10:00.000-07:00",
  "updated": "2008-02-09T11:37:14.977-08:00",
  "content": "[](http://photos1.blogger.com/blogger/1134/545/1600/eventlog.png)event log screen captureWe've set up a new workstation in the living room, using Toshiba + wireless peripherals, which is where I'm posting from, via http, to my blog. KTU2 is unusable for the moment -- a thread running through this tale...We received an electric service interruption notice by USPO some days ago, a postcard, but I'd forgotten all about it.Anyway, the battery backup kicked in, saving work on computers in the back office (but not Tara's Sims 2), Dawn switched to a tank for 02 (the oxygenator requires AC), and all was well.Until the power came back on, just minutes later. Then, my [troll of a computer](http://worldgame.blogspot.com/2005/12/big-foot-strikes.html) decided to power down with short-to-no notice.Lucky for Rybo.  I was busy throwing chapter and verse at him, cutting and pasting from [Synergetics on-line](http://www.rwgrayprojects.com/synergetics/synergetics.html) like some High Gothic Cleric, jealously guarding my Unorthodoxy (aka [Synergetics.4D](http://worldgame.blogspot.com/2004/11/matrix.html) -- cite [527.712](http://www.rwgrayprojects.com/synergetics/s05/p2700.html#527.705)). I sometimes get into this mode contra the [HyperCross Dogmatists](http://www.grunch.net/synergetics/hypercross.html), a competing school of thought (though containing many friends and relations, as well as bitter foes).So lucky for Rybo the troll computer had a brain seizure and kicked over, per power outage, before I could hit the Send button. The irony is KTU2 got through the outage OK, on battery, and only died when the power returned. Fie, I say, fie.Speaking of 4D, we were treated to a presentation by Nathaniel Bobbit from Eugene at the [Pauling House](http://mybizmo.blogspot.com/2006/08/linus-pauling-house.html) last night. Here, I'll cut and paste his blurb from [wwwanderers.org](http://wwwanderers.org/)::: Tuesday ::               August 22 :: 7 pm  : : Nathaniel Bobbit : :                will present on why a new number systemNathaniel Bobbitt’s groundbreaking work in lowering the acoustics of a flute by two octaves in 1993 resulted in an investigative method for modeling and notating nonlinear behaviors. Nathaniel Bobbitt continues research in direct models of higher dimensional spaces in his technology transfer center [NABSLAB](http://www.nabslab.com/)                :: Very eclectic this guy, and talented to boot. I encouraged him to go ahead and capture the Texas K-12 curriculum standards in one of his 4D fractals, so I could see what he's talking about. Or maybe we could make a science fiction short, in which his ideas went mainstream -- like I try to do around me, including on reality TV sometimes.Once powered down, the Belkin battery stayed dead -- no blinkin lights. I unplugged it from the dusty maze of wires (AC, USB, phone) and hauled it to the kitchen. Just needed to hold down the little green button longer I guess -- still doesn't explain its going out in the first place (we probably sucked the battery dry in just those few minutes -- but so what, AC was back on so why didn't that register?).So now he's reinstalled in his corner (Belkin battery with Bulldog for brains), but rebooting my troll computer ([KTU2](http://worldgame.blogspot.com/2004/12/welcome-to-my-world.html)) takes like an hour, plus then I have to manually turn on various services (Control Panal | Administrative Tools), like Windows Audio and the Print Spooler.Haven't gotten to it yet. Needed to clean a neighbor's C: drive (even though D: is like 99% free, every Windows game in the universe has this native C: fixation). Showed Harmony some stuff.Whoah! was just about to Publish, when Toshiba here went into sudden hibernation. Unbeknownst to me, she'd been unplugged. Fortunately, hibernation actually works on this model, and no work was lost. Publishing now...Appending from Synergeo #28435 (Rybo quoted in red):> The metaphysical mathematics of XYZ 90 degree> coordination are inherently associated to> metaphysical mathematics of A, B, C, D 60 degree> planes of a tetrahedron.I'll meet you half way: IVM.4d == XYZ.3di.e. what we mean by Synergetics.4D is *close* to what others mean by HighSchoolMath.3D.Then we go \"4D++\" to mean \"instances of prefrequency concepts\" while the 3D people say things like \"reality is not 'just more dimensions'!\" or something (except then they talk about kilowatts as dimensional, so go figure).More re 4D++ ( = synergetics computer language):[http://worldgame.blogspot.com/2006/08/4d.html](http://worldgame.blogspot.com/2006/08/4d.html)Kirby[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhipSvQvP8Nc4IyW52sIdAzYSaMiJG_M973IxGhPFvWOEB1C946QL8uv5yUK7B-wLo2kXKuZyUpWHSTgvS-S-rUfiubdWA-P82iem-X7IkQYpJPhlZFb_TyqU5X5iM_jD82OaiI/s1600-h/nat_young_nyc.jpg):: young Nat, NYC ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}