{
  "id": "9054934143832599510",
  "title": "Advice to the Sanders Campaign",
  "published": "2015-10-25T10:03:00.004-07:00",
  "updated": "2015-10-29T10:45:51.768-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/22588905031/in/dateposted-public/)\n\nAs I've mentioned on Facebook, I agree with the view that the more imperial-minded in the media need to start [closing doors on Bernie](http://www.globalresearch.ca/despite-cnn-propaganda-post-debate-polls-show-sanders-crushing-hillary-78-to-13/5482240), regardless of his populist appeal.  His USA has too many inconceivable elements whereas they see Hillary as a known quantity.  These journalists simply feel more confidant, more ready to write about her trajectory, whereas Bernie, like Donald, is [a wild card](http://www.huffingtonpost.com/robert-naiman/anderson-cooper-opposing_b_8297944.html).  They'd have to do a lot more homework, a daunting prospect.\n\nMy suggestion to the Bernie Sanders campaign is to take the edge off \"socialism\" by advertising how Americans practice military socialism with dignity and professionalism, co-owning, as a people, huge fleets of monster weapons, intimidating to say the least.\n\nSure, a percentage of \"we the people\" may feel suckered into buying a lot of [these toyz](http://mybizmo.blogspot.com/2015/10/bizops.html), aircraft carriers in particular, but hey, the Chinese and Russians build those too, so if there's a sucker in the room, at least the sucker is not alone.  We have a fellowship of the ring thing going, a community of dolts.  Hasn't it always been this way:  stuck at the bottom of a gravity well in a pile of Fallen humans.  Welcome to the Big Apple (in the sense of planet -- New York City a cosmopolitan mirroring thereof).\n\nThat's why \"making the world safe for socialism\" is really no longer a battle.  We won!  The Americans, Chinese and Russians all practice military socialism in one form or another.  Each has a \"people\" (pueblo) that owns vast arsenals and feels patriotic about it.  [Nuclear weapons, wow](http://www.4dsolutions.net/mycartoons/cartoon3.html).  That's socialism in action.  Rising through the ranks in the military is also a form of social mobility, a way of circumventing hereditary classisms.  Again, all the weaponry states practice this from of ladder climbing (social promotion).\n\nSo whereas Socialism is in good shape around the world, Democracy could use some stronger defendants.  Relatively few had a say in making these great decisions (e.g. to go whole hog into nuclear waste as a primary investment, which it now is for the foreseeable future), [including Einstein](http://worldgame.blogspot.com/2010/07/einstein-omsi.html), who didn't think the US would actually go beyond testing.  He regretted that the physics community had helped the rest of humanity come to the low IQ brink of self destruction through stupidity.  Scientists in the main are not eager to see their knowledge exploited towards purely misanthropic ends, with those few Dr. Evil exceptions.\n\nOnce we take the edge off \"socialism\" then we can get back to thinking about both capitalism and democracy and how to best serve them and their flagship institutions.  Bernie has never said we should not have private ownership or even secret ownership, which was the original goal of the LLC.\n\nWhen investors wanted to back risky ventures, starting in the early days of the East India Company, they wanted to limit their exposure or potential loss, without closing the door to future benefits should the risk actually pay off e.g. should one's proverbial \"ship come in\" laden with scarce hard-to-come-by luxuries.  You'd get your share, some to keep, some to resell for a pretty penny. \n\nWithout some measure of control and self protection, a wealthy doctor, for example, would not wager on an adventure.  Not if the widows and orphans left in the wake of said venture could haul said doctor before the magistrate as a scrooge and war profiteer who only faked being a doctor while making sure the war was fed.  The public had to understand that his personal liability was only up to a point, and no further, plus all the good doctor's investments were philanthropic and socially responsible.  Buying shares in \"Killing Commies Inc.\" went out of style in the 1960s, at least among the 0.1%.\n\nIndeed, buying shares in \"America Inc.\" has not been as trendy ever since the Imperial Presidency got out of control (JFK onwards).  Truman saw it coming but couldn't head it off.  [Allen Dulles](http://grunch.net/synergetics/gst2.html) was one of the chief perps, but only one of them.\n\nNot that the USA was really set up to be an empire in any constitutional sense -- it wasn't.  A federation of states is more like a strong alliance.  And that's where Bernie should jump in:  remind voters that investing in America could be sexy again, if only she were a little more like Canada, a little less like a Bridge Troll.  Lose the battle ax and camo, step into something less thuggish, and you'll do better in the ratings.  Or should that be Donald's line?\n\nFinally, lets remember that workers of the world have as much a need to invest (their labor and its fruits, their savings) and limit exposure.  A safety net is so important because it empowers the worker, like the rich doctor, to take the risk of retraining in some new skill set.  That's like leaping from one trapeze to another in a circus act, and if the safety net is not there, why risk it?  Better to stay stuck in a rut, trapped in a dead end job.  The economy stagnates and dies when workers cannot afford to jump ship and take on new challenges.  That's the flip side of limiting liability for the estate-minded.\n\nBernie is already strong on the need for a safety net, so lets help bolster capitalism and celebrate its embrace of Open Source, as a bridge to a more civilian-minded socialism.  Given the military is already socialized, lets focus on the benefits to the civilian sector, of 21st century engineering.  That's where we have many capitalist celebrities eager to talk on TV.  Some of them would be happy to promote Bernie.  [Silicon Valley](http://controlroom.blogspot.com/2012/03/occupy-silicon-valley.html) is not pre-committed to the Republicans I don't think, despite the reputation of Venture Capitalists.  Stay tuned.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}