{
  "id": "2302180237617637616",
  "title": "Afghanistan Again",
  "published": "2013-10-05T22:13:00.005-07:00",
  "updated": "2013-10-06T13:41:04.346-07:00",
  "content": "[](http://www.flickr.com/photos/kirbyurner/10112207364/)\n\n:: chatting with Afghanistan ::\n\nThe invasion of Afghanistan, [ostensibly](http://controlroom.blogspot.com/2009/05/bait-and-switch.html) a manhunt [for Osama Bin Laden](http://controlroom.blogspot.com/2007/10/more-autobio.html), commenced about twelve years ago, making this the longest \"war\" in \"US\" history.\n\nI put \"war\" in quotes because it's not headline news and few people care about it.  \"[Dirty wars](http://controlroom.blogspot.com/2013/07/dirty-wars-movie-review.html)\" are like that:  clandestine / covert.\n\nThis \"war\" is more the kind of thing Orwell envisioned:  a hell pit in which to dispose of million dollar soldiers and equipment, a black hole for contractors and profiteers who need to perpetually resupply and restaff the operation.\n\nMany militias participate in this gold mine for mercenaries, not just the Pentagon's.\n[](http://worldgame.blogspot.com/2004/11/pentagon-public-or-private.html)\n[The private sector](http://worldgame.blogspot.com/2004/11/pentagon-public-or-private.html) runs this war internationally, mainly through its sham non-democracy aka the Beltway Junta in DC (currently [in \"shutdown mode\"](http://mybizmo.blogspot.com/2013/10/dc-withdraws-from-governance.html) -- though not when it comes to the resupply effort, which is endless).\n\nThat's why I put \"US\" in quotes.  The private sector has [a jobs program](http://controlroom.blogspot.com/2008/12/iron-mountain-revisted.html) to keep the assembly lines going, but said program has nothing to do with the US Constitution or Declaration of Independence.\n\nThe age of once-proud nations is well behind us by now.  This is what \"[desovereignization](http://grunch.net/archives/64)\" looks like:  a lot of pretenders behind the masks, trying to keep the illusion of \"sovereign states\" alive.  A bit of a corpse show.\n\nKeeping the North Americans employed in bases around the world is a mainstay, and the legacy of the WW2 prime contractors irrigation system (aka [LAWCAP](http://www.grunch.net/synergetics/gst2.html)).  They like the perks that come with the various occupations (pun intended) and stay compliant / obedient in exchange for low PX prices (comparable to Costco's) and access to [red light districts](http://controlroom.blogspot.com/2013/07/migrants-everywhere.html), with veterans' benefits to follow if they hang in there and stay out of [harm's way](http://controlroom.blogspot.com/2010/11/hurt-locker-movie-review.html).\n\nAs Marty the PhD economist (panelist) pointed out:  on paper, the US squanders over a trillion a year on its military jobs program, a gross monument to the ineffectiveness of mankind.  If you ever wanted proof that patriarchs are incapable, here's your proof.  You might say the space program proves the opposite but the violence-prone want to ruin that too, make no mistake.\n\nWe had [a Skype connection](http://worldgame.blogspot.com/2013/10/afghanistan-revisited.html) to Afghani non-violent activists which was cool (thanks Mireaya).  They were in an early morning time zone while ours was late evening.  Lots of translating went on as speeches and Q&A occurred.  One guy reminded us none of the 911 hijackers were Afghani.  That's true, but then gaining control over the world's [opiate and cocoa leaf crops](http://worldgame.blogspot.com/2010/01/wanderers-2010113.html) has little to do with 911 either.\n\nOne of our panelists (not mom) was in the frontier area a year ago, where most of [the drone attacks](http://controlroom.blogspot.com/2013/02/report-from-afghanistan.html) occur.  Shameless dishonorable [uber-cowards](http://controlroom.blogspot.com/2009/06/killing-field.html) are in charge of those.\n\n[Mom](http://mybizmo.blogspot.com/2013/09/lunch-at-maru.html) was prepared to give a much longer talk, not an 8 minute lightning talk.  She got the audience interested, talking about our bus trip from Peshawar, with what amounted to a teaser or trailer (like a movie preview).  She did bring in her hero [Ghaffer Khan](http://controlroom.blogspot.com/2007/08/liberal-islam.html), and did so again during the panel discussion.\n\nAs [the off-duty chauffeur](http://mybizmo.blogspot.com/2009/03/chauffeur-duty.html) I ducked out to a liquor store during part of that getting Smirnoff's vodka and Bailey's irish cream.  Yes, I was escaping being social around then.  I get upset by these stupid ape-like creatures sometimes, though I'm one of them.  Is misanthropy \"self hating\" or more \"alienating\" or are these two the same?  [Existentialists](http://worldgame.blogspot.com/2005/11/jarhead-movie-review.html) should discuss this question.\n\nWe and the Afghanis think the same way about the low-life scumbags who murder by remote control.  War criminals.  Like Nazis.  They'll be vilified for decades to come, in children's books, in museums, in history books.  Like the [thugs running Gitmo](http://worldgame.blogspot.com/2010/02/lame-analysis.html) (the puppet US presidents are helpless against them).\n\nNeither we nor the Afghanis on the line had any easy solutions to recommend.  The militaries of the world have the weapons and use them to extort from less well armed civilians.   Or at least that's what the disreputable militaries are doing.\n\nThey perhaps have no choice, given they have no real \nskills or marketable talents other than stealing from others at \ngunpoint.  The education system has let us all down.\n\nLet's be clear these Afghanis were as disgusted by Taliban violence as any brand name violence.  All brutal violence is ugly and stupid and hurtful (the antithesis of \"sexy\" except in [Hollywood movies](http://mybizmo.blogspot.com/2012/11/seven-psychopaths-movie-review.html) and [uncool gringo TV](http://worldgame.blogspot.com/2013/08/chicago.html)) -- on that [most religions](http://controlroom.blogspot.com/2013/09/interfaith-meetup.html) can agree, despite their own track records.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}