{
  "id": "8863236930366194997",
  "title": "AFSC Support Committee",
  "published": "2013-10-23T18:22:00.000-07:00",
  "updated": "2014-10-27T17:08:48.541-07:00",
  "content": "We haven't met in months.  Those of us around the table may be a little hazy about what our purpose is (to support local staff and program).\n\nTonight we're meeting the [Assistant Regional Director for the Western Region](http://www.opportunityknocks.org/jobs/350813-48778/Assistant-Regional-Director-West-Region-AFSC-American-Friends-Service-Committee-US-USA), Marielle Oetjen.  She works with [Sonia Tuma](https://www.facebook.com/sonia.tumaafsc), the Regional Director (replacing Susan Segal -- except [the regions](http://mybizmo.blogspot.com/2013/08/planning-committees.html) have also been changed).  There's also an Associate Regional Director.\n\nMarielle will have a base in the Portland Office.\n\nAt the Philadelphia level, AFSC and FCNL have put out [a document called Shared Security](https://afsc.org/story/shared-security-quaker-vision-us-foreign-policy-launched), which I still need to read and blog about.\n\nOur recording clerk, Eddy Crouch, is also on the Western Region Executive Committee and has already started a series of meetings at the Multnomah Meeting House following the study guide that goes with this document.\n\nI know other denominations work this way:  they develop program around [Great Decisions](http://www.fpa.org/great_decisions/) for example, I know [the Methodists](http://worldgame.blogspot.com/2005/02/methodist-morning.html) use that.\n\nI'm suspicious of these studies usually because [they instill nationalism in a non-critical manner](http://worldgame.blogspot.com/2010/07/einstein-omsi.html).  The whole idea of \"foreign policy\" on a tiny spherical ball is a tad ridiculous, as is the whole idea of \"sovereign nations\".\n\nBucky Fuller was [right to resist politicos](http://controlroom.blogspot.com/2005/12/thinking-globally.html) marring his map with a lot of their corrupting data.   Our Promised Land is less stupid than the Land we have.\n\nSpeaking of sovereigns, did I mention I was [reading Royal Babylon](http://www.amazon.com/Royal-Babylon-Alarming-History-European/dp/0767907558)? The author refreshingly turns the tables on these so-called royal families.\n\nI can see how Shared Security (I'm scanning it now) could help with the creation of new \"schools for diplomats\" developed with some Quaker influence.  These my high tech boarding schools, part of the larger \"eco-village\" phenomenon, slow in materializing given various [vicious circles](http://mybizmo.blogspot.com/2009/11/increasing-military-iq.html).\n\nPedro and I discussed the military's use of immigrant conscripts to pad itself out.  Pedro pointed out a core irony:  when one of these immigrants is killed in the line of duty, they're declared a citizen postmortem, whereas the wounded are more likely to be deported, as a budget liability.\n\n[](http://www.flickr.com/photos/kirbyurner/10450518786/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}