{
  "id": "1966599571067678549",
  "title": "After Princeton",
  "published": "2022-12-27T12:01:00.002-08:00",
  "updated": "2023-08-31T00:25:40.196-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52525632600/in/dateposted-public/)\n\nThese were my digs in Jersey City, post Princeton, a shared group house, more Platonic than polyamorous, though we certainly loved each other as schoolmates do.  We somewhat continued our lifestyle from 2 Dickinson Street.\n\nMy cohort was mostly using JCNJ as a springboard, to promising careers in the Big Apple, and they'd find a new place pretty soon.  I found work within walking distance, as a high school teacher, and continued on in this space, renting from Mr. Chang, through other chapters of housemates.\n\nWhich house again? Immediately adjacent to the apartment building.  No solar panels.  Two cars.\n\n[](https://www.flickr.com/photos/kirbyurner/52524629342/in/dateposted-public/)\n\nAbove, you'll see that same apartment building with the house behind it (red balloon).  You're looking at Loews Theater on Journal Square, courtesy of Google Earth.  The alley to the left of Loews, connecting JSQ to Magnolia, our old street, was used for a scene in The Joker.  Newark was also used for that movie.\n\nNearby: The Stanley, used in a movie directed by Woody Allen. \n\nThis all happened in the early 1980s.  By 1984, I was living on the opposite side of Manhattan, in Queens, sharing digs with Ray Simon, along with a job at McGraw-Hill courtesy of Nola Hague.  \n\nBy then, I was also on the other side of a gig with Project VOTE!, aka Americans for Civic Participation, headed by Sandy Newman.  That was a rooming situation in Washington, DC (thanks Brenda), during the Reagan versus Mondale presidential contest.\n\nBelow:  Journal Square, across from Loews, back in the day.\n\n[](https://www.flickr.com/photos/kirbyurner/2560252510/in/album-72157605485853546/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}