{
  "id": "1549543720267821100",
  "title": "After Life (movie review)",
  "published": "2009-05-25T12:35:00.000-07:00",
  "updated": "2009-05-26T16:17:33.817-07:00",
  "content": "[This exquisite film](http://www.imdb.com/title/tt0165078/) inherits from Spirited Away, Beetle Juice, Defending Your Life... Lost, or one could see it that way, though it's also plenty original and deftly executed, a highly competent work of art.Every week a few more of the recently dead trickle through the facility, and the only goal for the staff is to assist these individuals in choosing that one memory to carry forward, with all else to be forgotten.  That one memory is to be staged in a short film, to be shown to the staff and guests, and those completing the process move on at this point.You might imagine a dryly bureaucratic process like this would have a somewhat dreary building and a skillful staff that nevertheless has its own interpersonal dynamics, just like in a real hospital or school.You would be right in this case.\"Lots of mirrors\" would be an easy review, lots to think about in any case.  During the ensuing discussion, Nancy mentioned appreciating the gentleness of the process, whether successful or no.  I had to agree with her there.As a close viewer (like a close reader), I think I followed the director's eye in falling in love with Shiori, a shining gem in a \"man's world\" of yawners.  What appears the great self-discovery of the guy she's tracking, proves somewhat a re-enactment of his earlier mistake I thought, so yeah, like Groundhog Day.\"Kiss the girl dammit\" was all I could think of, from my death bed er chair.The venue was fantastic.  The final meetup after a seven year run, with some [striking Jungian](http://www.flickr.com/photos/17157315@N00/3563214335/) making this her own swan song, leading the discussion.  We met in a branch public library, at no cost, on a Memorial Day weekend.  Some of us had been to cemeteries recently.Nancy and I repaired to the McMenamins on Xavier, to speak more of the living and the dead, enjoying a bright Portland spring, feeling lucky to be here.  I wore my USPO [Marvin the Martian tie](http://mybizmo.blogspot.com/2008/11/smiley-guy.html), seeking to blend with my toontown context.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}