{
  "id": "7725179381794644384",
  "title": "Agile Learning",
  "published": "2017-03-01T11:58:00.002-08:00",
  "updated": "2017-03-15T22:32:17.408-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/32366456593/in/dateposted-public/)\n\nMy students doing real time professional development get a radio-TV show experience, enhanced with live messaging. I've worked in other configurations, including in not real time (asynchronously) with O'Reilly School of Technology (OST), but that meant under three days to respond, with source code to eyeball and make sense of.  My students had my attention in ways the radio-TV does not provide. A combination of the two might be a next step.\n\nHowever, for now I'm content to suggest projects and provide source code that's encouraging exploration in several directions. We go against a movie database, check out the API.  As of last night, I'm able to check Trimet's Trip Planner, thanks to Sheri Dover for sharing this part of the PDX Code Guild curriculum with me.\n\nWhat I suggest to self learners around a Python topic would be this three step workflow:  anchor yourself in the API's documentation to where you're ready for testing it.  Hop over to Youtube and fish up useful movies on exactly what you want to know (good luck).\n\nInch forward, using the Agile test-as-you-go tiny increments approach (heavily ratcheted, for steep learning curves, even vertical climbs if need be, though I'm not into melodrama necessarily).\n\nIn Python we're lucky to inherit Java's JUnit framework, which goes really deep once you add in the mock objects.  At OST, we emphasized TDD as a methodology (write the tests first).\n\nTalking up \"open source\" and really taking that culture seriously, including its internal conflicts and heritage, is something I do as a geek.  If you listen to me, you learn about this or that rift or conflict, but it's not like I'm endlessly grinding a lot of axes.  I've got it down to very few axes at this point.\n\nOne of those cutting edge blades of debate is:  [where do we include Unicode](http://mathforum.org/kb/thread.jspa?threadID=2840336) in K-12 in US public schools?  I'm not saying it's up to me and if I were writing on this topic I'd want to dig down in the curriculum first, not that there's only the one, do some homework.  The US is a diverse territory and there was never a consensus on what to say about Unicode or how long to spend on UTF-8.\n\nNot everyone reading my blogs cares if the US is stuck in the calculator era and not facing the future. Yes, I have a parochial outlook thanks to my geographic location and personal history.  Portland, Oregon was the city of my childhood, which I returned to after many exciting adventures overseas. I've lived here since 1985 and put kids through the school system, volunteered in it, even had some paid work in it.\n\nAs you scan these blog posts, you may see some of the same discussions you've been having, regarding \"i18n\" for example (\"internationalization\" as every geek knows).  However, a lot of what I talk about is pretty esoteric by today's standards, fair warning.  I'm not saying that to be condescending as I'm the first to admit to not being inner circle when it comes to certain parties.  I'm as clueless as they come regarding the secrets of many cults.\n\nTrimet has a great Trip Planner system, multi-modal, and with a public API.  If your city bus system has a public API, then join that inner circle.  Hey, even if you live far away, if what you need is simply practice getting back complicated XML about something so easy to reason about as getting from A to B by public transportation, I'd recommend registering with Trimet and grabbing a developer token.  Get ideas for your own city, don't reinvent the wheel.  Or do.  I'd like to see a JSON output option, bet Metro would too.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}