{
  "id": "5104042492383868719",
  "title": "Alano House",
  "published": "2024-06-27T09:24:00.000-07:00",
  "updated": "2024-06-27T09:25:13.034-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157678724492098)\n\nBrand loyalty is what to encourage between times of buying and/or upgrading. You're just using, and thinking ahead. Advertising to this group involves confirmation and affirmation for making the right choice. You're already the proud owner of brand X and appreciating its benefits. \n\nYour neighbors eye you with jealousy, that productive capitalist form of jealousy that lets you go out and buy, upgrade to keep up, keep up with club membership, where \"club\" is but shorthand for whatever \"inner circle\".\n\nA club I've broken into lately is that of the given up drinking, meaning alcohol of course. A meandering path to this topic, in my living room recently, was via the musician Jimmy Lott, who used to live two doors down from me. He sang at the Alano House that time, and I wanted to know if \"Alano\" was a person or what. Just a lowkey way of referring to Alcoholics Anonymous (AA), an abbreviation one could say, and other towns have 'em.\n\nThe Alano House I was thinking of is a specific mansion, huge, in NW Portland. We got it located on Google Street Views and so on. I could study the website and research my questions, looking for answers.\n\nBack to affirmation as a genre: once you're off the stuff awhile and want free reinforcement, YouTube has any number of motivational tapes (I'll call 'em tapes sometimes, meaning recordings, no tape in sight) outlining the temptations, slippery slopes and so on, regarding life in general.  That's the best time to take in Jordan Peterson, when you've already made your bed so to speak.\n\nPortland's Alano House features in that movie about Callahan by Gus Van Sant and starring Joaquin Phoenix.\n\nMy own path was not through AA, but from throttling back on beer and then seeing the future through medical imaging, long a component in my profession of computer programming around hospitals a lot. I took a look in the mirror and decided I could turn off that spigot. That doesn't make me a drug free specimen however. I'm still pretty heavily into caffeine for example. \n\nI'm not preachy unto others for the most part, as I'm not on the motivational speaker circuit, at least not in that sense. I'm fine with being around drinking and smoking (cigs, pipes, cigars) and still have a partially stocked bar. Help yourself to any cold beers you find. They're all for my guests. I don't regret my past addiction to Oregon IPAs and great Chard and Pinot wines.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}