{
  "id": "8545982031293816181",
  "title": "All Math is Ethnomath",
  "published": "2015-08-10T19:09:00.001-07:00",
  "updated": "2015-08-22T19:09:08.511-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg8yGotsoRn2e-oW0CTu-lOBYwTKAmAyWscrGTF2FzWH45GOWUyQAEgKs7B8XFS-CzdglUlOVU3yzbub8UwbWUV-Sc5c3fByKM-q0muMK0c6-Q5ZngGzSSIDDcIckDgm4WRGbF3/s1600-h/6spokes.gif)\n\nI used the saying \"All math is ethno-math\" almost as a slogan [on math-teach](http://mathforum.org/kb/message.jspa?messageID=9738064), a listserv where I'd posted thousands of entries.\n\nBut what does that mantra even mean?\n\nWell, there's this literary conceit inherited from specific cultures, wherein \"our\" brand of math is \"universal\" and in that sense, culture-free.  \"We're above all that\" is the attitude (snobbish).\n\nPeoples have wanted to get \"above mere culture\" such that, from an Enlightened stance, they could administer justice, lord it over those more mired in their cultural milieus.  Cults assured of their \"above it all\" status will gladly let others know of their relative inferiority.\n\nMathematics, including statistics, invented [by sociologists and statesmen](http://controlroom.blogspot.com/2010/10/casino-math.html) alike (yes, mostly men back then), was to be the tool of Empire and, as such, a product of Reality Itself.\n\nImperial grammars all tend to assume great gravitas and may begin to exude that \"sheen of eternity\" -- a shiny polish or reflective veneer.\n\nThose who speak the mainstream Mandarin will tend to impute \"ethnicity\" to everyone else.  \"Ethnic food\" is \"their food\" -- perhaps delicious, but the point is it belongs to a \"them\", some \"minority\".\n\nA mainstream mathematician is perhaps not in the mood to cop to any brand of close to home math as having any \"ethnic\" flavor.  Babylonians and Macedonians had their quaint ways but by now our math is Universal, has conquered all corners of Planet Earth.  That's an attitude.\n\nHowever, in these days of post postmodernism, I think a far greater number of academics are friendly to the view that yes, all math is indeed of some ethnic flavor.  We may and probably should study math in a cultural matrix, rather than erase or deny these special case roots.\n\nBut lets not confuse \"ethnic\" with \"parochial\" necessarily.  World-traveling pirates who put in to many ports, with crews in turnover and networks of spies and informants across the lands, would have had more opportunity to develop what I'd call \"cosmopolitan\" traits.  They'd be more catholic, more liberal in their outlook, one might surmise, more accepting of the diversity among the many cultures.\n\n\"Ethnicity\" is one of those concepts that slices every which way.  Really one might better say \"cultural currents\" or \"lineages\" or \"traditions\".\n\nOne may talk about \"races\" but also \"genders\" and \"social classes\" and \"the professions\".\n\nThink about it for awhile, and you'll come up with at least a dozen ethnicities you might go by, easily more. \n\nIn light of this backdrop in broad brush stroke, I did some work to brand [specific geometrical artifacts ](http://mybizmo.blogspot.com/2008/02/quaker-geometry.html)as \"Quaker\".  That may seem quite weird.  The justification or thesis had to do with American Transcendentalism, New England's in particular.\n\nThe traditions feeding Quakers include some poetic currents flowing through and around Bear Island, for example.  The World Game idea, so attractive to Medard Gabel, is decidedly pacifist in competing with any War Game for attention.  GENI is about bringing power to the people -- literally, in the form of electrical distribution networks.\n\nOnce a people have banded (or branded) into a \"tribe\" with some currency and reputation, with some semblance of self governance, then perhaps the mathematics they pass along to their progeny, like their myths and bedtime stories, might achieve the coveted \"cultural\" status, i.e. some of the artifacts, the algorithms, become museum quality exhibits, like exquisite baskets or china on display.\n\nCertainly the ethnicity of \"ancient Greek\"--  as in \"Athenian\" -- became a hallmark in the annals of Ethnic Math.  We all learned respect and admiration for those ancient Greeks and many of us gladly lay claim to that lineage.  \"We too are worthy heirs\".\n\nIn any case, you'd be hard pressed today, in 2015, to find many if any Quakers (besides me that is) talking about \"the IVM\" or \"the Jitterbug Transformation\".  You'll find all these terms, along with the associated mathematics,  on the web, and in Wikipedia, but any adoption of such topics by Quakers is hardly on anyone's radar.  \"Not just me, but still just a few\" would be my assessment.\n\nSo consider you may have stumbled upon an esoteric memeplex then, possibly of some potency.  Stay tuned.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgADeEpxSuZpHnXqV3h50lFuieqYLN09zdrIfNKWzDOlN692wqQICQQ9A-yyKf_88KXJ6awY2JU3gzKwWctF_nqMpSTQ4ziwGMram7QLit1FCfjevqYJU8Q7XAv6Okz9dIj-AQ5/s1600-h/4spokes.gif)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}