{
  "id": "114433556841564574",
  "title": "Ambient Video for Airports",
  "published": "2006-04-06T08:00:00.000-07:00",
  "updated": "2006-11-15T11:43:55.182-08:00",
  "content": "I'm listening to Ambient Music for Airports by Brian Eno on iTunes.The hypertoons on my Toshiba form a complementary ambient video, the way I think of them (I get to flip up my screen and watch 'em in the transit lounge).  Just a lot of languidly unfolding geometry, one track dissolving to the next, or through segues that mightn't be dissolves, but key frames.  Some frames are \"grand central stations\" in fact:  many scenarios start or end there, like [train tracks](http://www.grunch.net/synergetics/hypertoon.html) at a terminal, or like at airport hubs.I wrote my hypertoons program in Python using the VPython add-on.  VPython drives a simple animated graphics window.  I repurposed what I'd aimed at POV-Ray, a still life ray tracer, a stash of polyhedra, generated from Pythonic Vector and Polyhedron classes.  Each poly is a list of face-tuples, with vertex labels keyed to the vectors library or dictionary.  For example, face ('A','B','C') would access {'A':Vector((0,0,0)), 'B':Vector((1,1,0)), 'C':Vector((2,0,0))} and like that, where parentheses denote a tuple and curly braces a dictionary (primitive data types in Python).I've implemented an [rbf.py](http://www.4dsolutions.net/cgi-bin/py2html.cgi?script=/ocn/python/hypertoons/rbf.py) through several versions (rbf = r buckminster fuller).  In this module, the volumes have been relativized to the tetrahedron in a particular way, by concentric nesting (an ancient passion of geometers through the ages).  The rhombic dodecahedron (6) gets more air time than in the more purely Platonic environments.  Kepler made studies of this shape, as well as of the more pentagonally informed geometries, per Koski, per Penrose.Related reading:Hypertoons in Python by K. Urner, July 25, 2005 ([10 page PDF](http://www.4dsolutions.net/ocn/python/hypertoons/hypertoonsby4Dstudios.pdf))Urner talk @ London Knowledge Lab ([Math Forum thread](http://mathforum.org/kb/message.jspa?messageID=4620912&tstart=0#reply-tree))",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}