{
  "id": "8127602005003361290",
  "title": "American Literature 101",
  "published": "2019-06-06T00:18:00.001-07:00",
  "updated": "2019-06-06T09:46:00.946-07:00",
  "content": "One of the core subcultures emerging in California was that of retired Theosophists and other fellow travelers.  Some of them gravitated to Ojai, to be closer to Krishnamurti.  Esalen was not directly connected, having strong ties to Stanford University, however there's no getting away from the many Aquarian conspiracies that riddle Cascadia more generally.\n\nPhysics World (the \"new physics\"), [saved by hippies](https://www.hippiessavedphysics.com/), made a big influence in literature through science fiction at first, and then by providing more direct commentary on \"consciousness\".  [Sir Roger Penrose](http://www.grunch.net/synergetics/mathsummit.html) was one of those leading the pack, in picturing the Mind as a quantum device, making use of the quantum effects of Universe to transcend more deterministic forms of logic.\n\nBucky Fuller, connecting to American Transcendentalism by virtue of his ancestral roots on Bear Island, in addition to his Aquarian credentials, preserved a Brain versus Mind distinction, in case we wished to differentiate on the basis of function, between a storage/retrieval reflex machine, and the Zeitgeist, a shared phenomenon.\n\nRemember that Spiritualism achieved a relative apex around the time of Thomas Edison, contemporaneous with the investigation and industrial exploitation of electricity.  That extrasensory abilities, strongly believed in by many Theosophists, might have a physical basis in energetic phenomena is what made \"ESP\" seem scientific, to the Esalen people as well.\n\nOf all the philosophers, Bucky Fuller probably did the most to restore \"metaphysical\" to our vocabulary as a synonym for \"intellectual property\" (so-called).  If we subtract the \"who owns it\" bit and focus on the commons, we see humanity gaining competence over physical phenomena as evidenced by a \"more bang for the buck\" over time.  The military was especially impressed by the \"bang\" it was getting, in the form of weapons of mass suicide.\n\nHowever \"metaphysical\" is more a literary term that goes with the territory in post-911 Cascadia.  We teach Bucky Fuller in the context of American literature, not as physics.  Both literature and physics have permission to discuss \"consciousness\" or the lack thereof.  We're free to bridge to STEM, but we don't come from there, when adding Synergetics to the syllabus.\n\nI mentioned Edison above: \n\nIt was 1884, the year the people of France presented the United States \nwith the Statue of Liberty. Tesla had with him twenty-five cents and a \nletter of recommendation addressed to the American inventor Thomas Alva \nEdison (1847−1931). When the inevitable rift occurred between these two \nPromethean inventors, Tesla began to frequent the fabulous Palm Room at \nthe Waldorf. It was here he would mingle with the giants of American \nindustry in hope of finding the venture capital he needed to launch an \nindependent career. Eventually, he did.  As soon as his personal \nsituation improved, he took up residence at the Waldorf. Of all the \nstrange twists and turns and turns his long career took, Tesla admitted \nat the end of his life that there were only two things that gave him the\n hope he needed to fulfill his dreams, his American citizenship and the \nWaldorf Astoria Hotel. \nThat's from [Paul Laffoley's website](https://paullaffoley.net/writings-2/homage-to-gaudi/).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}