{
  "id": "5469640225914361471",
  "title": "American Dad (plot synopsis)",
  "published": "2006-12-17T23:26:00.000-08:00",
  "updated": "2006-12-29T19:59:45.427-08:00",
  "content": "In tonight's new episode of [American Dad](http://www.imdb.com/title/tt0397306/), our CIA guy protagonist behaves in scroogey fashion, throwing the family Christmas tree out the living room window, in frustration over how shopping mall personnel say \"Happy Holidays\" instead of \"Merry Christmas,\" thereby ruining America.He blames Jane Fonda aka \"[Hanoi Jane](http://mybizmo.blogspot.com/2005/10/hotel-oregon.html)\" for this lefty liberal state of affairs, so when a Ghost of Christmas Past (the Tooth Fairy in a new job) takes him back to his 1970s boyhood, he resolves to shoot Jane, then filming [Klute](http://www.imdb.com/title/tt0067309/) (1971), only to discover that costar [Donald Sutherland](http://www.imdb.com/name/nm0000661/) is the real culprit, having politicized her with a lot of vile [schmooze](http://www.answers.com/schmooze&r=67).The tooth fairy and Mrs. Dad (Francine) intervene before Stan can shoot Sutherland, but upon returning to the present find America is now under the Russian boot, Mondale having caved to the Soviets upon winning against Reagan in 1984, and all because Hinkley failed to see [Taxi Driver](http://www.imdb.com/title/tt0075314/) (1976), develop a crush on [Jodie](http://worldgame.blogspot.com/2006/12/day-at-vla.html), and attempt to assassinate the commander in chief, thereby improving the latter's poll numbers and ensuring his re-election.So why did Hinkley not see Taxi Driver?  Because the American Dad, while stalking Fonda, had talked movie director  [Martin Scorsese](http://www.imdb.com/name/nm0000217/) out of a drug habit during a random men's room encounter, thereby altering Martin's future career, such that this movie never got made.Realizing he has unwittingly destroyed America, our protagonist ventures back into the past to make Taxi Driver himself, this time starring John Wayne. The movie bombs, Hinkley is unimpressed, and so our reluctant American Dad has to wound Reagan himself, to save America. This scheme succeeds, plus he doesn't shoot Brady, so no [Brady Bill](http://en.wikipedia.org/wiki/Brady_Handgun_Violence_Prevention_Act) passes making it so much easier to buy a handgun in the present (our man Stan is exultant).There's also a subplot wherein Roger, the noseless ET and future family member, finds a tape of disco hits (1974-1980) that had fallen from Stan's pocket in 1970, during his first time travel foray. The ET thereby \"invents\" disco and becomes a millionaire, then suffers financial ruin when disco crashes overnight -- which is why he's morose in the final scene, drinking [Jack Daniels](http://worldgame.blogspot.com/2006/03/returning-to-pdx.html).This quick recap of recent American history, piped directly into the brains of impressionable teenagers, helped bring them up to speed on some of the back stories behind [today's shared culture](http://worldgame.blogspot.com/2005/06/fathers-day.html).  Thanks to [creative screenwriters](http://mathforum.org/kb/message.jspa?messageID=5430318&tstart=0) and the Fox Network, more kids now have a stronger grip on what's been going on around here of late.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}