{
  "id": "7985636042626560611",
  "title": "Ammo for Philo",
  "published": "2019-03-06T20:56:00.003-08:00",
  "updated": "2019-03-15T18:14:56.916-07:00",
  "content": "\"Ammo for Philo\" sounds like a contradiction, as \"Philo\" means love and is short also for \"Philosophy\" or \"love of knowledge\".  The \"sophy\" comes from \"sophia\" as does \"sofa\" (I made up \"sofa\" but I'm thinking of a kind of love seat where two are engaged.\n\nThe loner philosopher, perhaps a hermit, is stereotypically (and archetypically) not completely alone, but in a relationship with an otherness we might call Sophia.\n\nThey named an robotic doll \"Sophia\" recently, and made her famous.  The of course there's the movie Her.\n\nHowever, I'm eager to get away from all male or all white when we talk philosophy, though I want to stay inclusive of same.  For starters, Grunch of Giants (important in my syllabus) is dedicated to three women:  \n\n- Marilyn Ferguson, author of The Aquarian Conspiracy; \n- Margaret Fuller, a Transcendentalist and contemporary of Thoreau (and Poe); and \n- Barbara Marx Hubbard, for whom my dad volunteer, briefly, when she ran for the Office of the Vice President (US).\n\nSpeaking of cliches and stereotypes, there's been this common wisdom that the US vice presidency is a mostly ceremonial position, right up there with First Lady.  Would people say First Dude in the case of a married-to-a-man president?\n\nNot that First Guy or Gal is a fluff job either, but it's not constitutionally defined am I right?  A president is not required to have a spouse.\n\nAnyway, in the case of the Veep having a nothing job, that was pure deception:  it's a covert operations gig, most typically.  [Dick Cheney](https://mybizmo.blogspot.com/2019/02/journal-entry-on-racism.html) was not the first to stove pipe or traffic in state secrets.\n\nHubbard was pretty brave in running for that office directly, hoping a wannabe prez would pick her (I think she was hoping for John Glenn as a running mate, based on their mutual love the the space program).\n\nMy [Oregon Curriculum Network](http://4dsolutions.net/ocn) is just a storefront, not even a nonprofit.  It's what I do as a business, with any time/energy I have left over, and then some.  I get no tax breaks for it, as I never tried to make it a standalone nonprofit.  I pay it (in the sense of fund it), not the other way around.\n\nThe OCN has been pumping out these videos, and in the philosophy department the theme is the foundations of mathematics, in connection with what a certain dead poet society considered a breakthrough, a gear shift, and game changer.\n\nProfessional mathematicians were cool to the whole idea and the society went underground, there to be discovered by the Religious Society of Friends, in the person of yours truly.\n\nThe RSoF already looked at [Kenneth Boulding](https://controlroom.blogspot.com/2006/05/general-systems-theory.html) and [Rufus Jones](https://worldgame.blogspot.com/2014/01/rufus-jones-luminious-life-movie-review.html) as heroes (more white guys).  The former was a pioneer of [General Systems Theory](http://www.grunch.net/synergetics/gst1.html) while the later helped get American Friends Service Committee off the ground.\n\nRufus Jones was connected to Haverford, a college founded by Quakers in Pennsylvania (Penn himself being Quaker, and the state named after him at one time envisaged as a kind of Quaker utopia).\n\nAnyway, OCN also brainstormed CSN ([Coffee Shops Network](https://coffeeshopsnet.blogspot.com/)), another \"faux business\" in the sense that it couches its philanthropic model in the form of a science fictional network of coffee shops.\n\nWould I like this network to exist for real?  Of course.\n\nThe CSN is a puzzle piece that helps fund some of the other puzzle pieces.\n\nSo what's the \"ammo\" I'm talking about?\n\nMy hopes for philosophy have to do with its relevance.  In a world where religion proves divisive, might philosophy provide bridges?  We don't have to agree about what or whom is divine before coming to grips with the prospects for humanity (one of Bucky's favorite topics).\n\nWe have colorful polyhedrons, high definition screens, and a wealth of worthy themes.\n\nSynergetics Hypertoons may not be a reality in your zip code just yet, but that can't stop you from sharing in the dream, regardless of gender or genetic profile.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}