{
  "id": "3828392475110598736",
  "title": "An Afternoon with the Architect",
  "published": "2014-06-22T06:47:00.000-07:00",
  "updated": "2014-06-22T07:53:05.460-07:00",
  "content": ":: not my car ::\n\nI had a good afternoon with [the Architect](http://worldgame.blogspot.com/2010/11/visit-with-architect.html) in my story, all this while a student of Systems Science at PSU, an unusually esoteric discipline for a PhD in the US of A, but not unheard of.\n\nWhen my dad was getting his PhD in urban planning, around the late 1950s, only University of Chicago and Harvard offered it, or so I've been told.\n\nNorth Americans are suspicious about planning of any kind, as if you're a big time polluting industrialist, you need your neighbors to see you as part of God's Will.\n\n[Planners](http://mathforum.org/kb/message.jspa?messageID=9490747) with their pesky zoning ordinances and growth boundaries, public land use plans, are the thorn in the side for any would-be land-grabbing developer with nary a need but his or her own in focus.  Elizabeth Furse, an ex Congresswoman who sometimes joins us at the Linus Pauling House, could tell you some stories.\n\nWe sat at this table in the photograph above, outdoors at Angelo's, and if you click through you'll get to more of a timeline, a well known secret if you're a long-time blog reader.  Back up a ways and you'll see slides from our most recent Wanderers talk for example, about projects in Senegal / Guinea / West Africa.\n\nJohn Driscoll is the Architect's name.  He showed up in Portland having ridden across the country on his bicycle, then living in the Netherlands or vice versa.\n\nHe landed in the so-called Voodoo House, so named by Willamette Week in its attack-piece on Santo Damie, must have been pick on some tiny religion week.\n\nAnyway, one of the top dudes in that faith was the property owner.  As renters (John and housemates), myself their visitor, their / my closest contact with actual \"cult practices\" was just to admire the tasteful decor.\n\nJohn was not so pleased with the ending of Her (see movie review), which I thought was brilliant, but then that's a story worth telling in many ways, with many endings.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}