{
  "id": "1880494126895686550",
  "title": "An Inconvenient Truth (movie review)",
  "published": "2007-01-13T18:11:00.000-08:00",
  "updated": "2007-01-15T19:38:52.967-08:00",
  "content": "I hadn't found a convenient time slot for this, but finely got one, though the phones started ringing towards the end.The scientific data was well animated, per the [Bleep](http://worldgame.blogspot.com/2006/02/what-bleep-movie-review.html) movies, although I was disappointed he used an \"iconic\" Mercator Projection (iconic of what? -- of all that \"old thinking\" I'd hazard).Why not show a [Fuller Projection](http://controlroom.blogspot.com/2005/11/memo-re-map.html), at least once?  Too much of a hot potato maybe, although in other respects this movie seemed to take pages from World Game events, even from Werner Erhard events.But front and center in this film is Al Gore the persona, a brooding [Angel](http://www.imdb.com/title/tt0162065/) type, looking pensively out of windows, building up a world picture, combined with a kind of [Mr. Rogers](http://www.imdb.com/name/nm0736872/) character, showing us around his planetary neighborhood (with friends everywhere, lucky guy).Apparently the Gore camp learned at least one lesson from the Bush Jr. camp:  have studio audiences looking attentive and mesmerized, laughing with and not at.  Keep any inconvenient hecklers out of frame, and don't let them stare distractedly into laptops, doing email, like happens during keynotes at [OSCONs](http://mathforum.org/kb/thread.jspa?threadID=1180792&tstart=0) and/or [Pycons](http://mail.geneseo.edu/pipermail/math-thinking-l/2007-January/001087.html) (often much higher bandwidth, though usually minus the fancy stage props, like that power lifter Al uses, in place of a laser pointer).I know a lot of my friends like this film, because they don't want to be blindsided by large scale suffering (me either).  Tara said it seemed somewhat disrespectful to people actually interested in the science, meaning she (like me) found the Gore persona a bit too obtrusive.  I'd have preferred a [Bill Nye the Science Guy](http://www.imdb.com/title/tt0173528/) episode with the same budget.Anyway, I hope Congress starts thinking more deeply about[ OMR](http://controlroom.blogspot.com/2005/09/omr.html) type projects, other \"just add water\" insta-cities from nowhere, just in case some mega pull back from the shorelines becomes necessary (ominous omens abound).The prospect of another ice age, with a CO2 spike as harbinger, shouldn't be dismissed completely either, judging from Gore's data.  Is the old Hamaker- Weaver thesis completely dead?  No need for glacier dust then?  Sorry, not really my field.More experience with [Fly's Eyes](http://worldgame.blogspot.com/2006/01/location-scouting.html) might help as well, to get our populations more nimble, less anchored to grids, with many of said grids broken and/or bursting at the seams to begin with.So, my thanks to Al Gore for helping us connect the dots (albeit... [rather... slowly...](http://controlroom.blogspot.com/2006/02/boosting-bandwidth.html)).  We're way ahead of ya guy -- which doesn't mean you're off target in showing some concern.Thanks for the cool slide shows, thanks for the memories.PS:  I can't figure out how to import a music CD in order to transfer its contents to Dawn's iPod at the moment.  I bet Tara knows how.  I find iTunes somewhat difficult to use -- showing my age perhaps.  (Answer:  Tara popped the CD out, then back in, which got the ball rolling).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}