{
  "id": "5128817139881494838",
  "title": "Another OMSI Pub",
  "published": "2012-06-22T22:41:00.002-07:00",
  "updated": "2012-06-24T14:13:10.687-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/7434991730/)\n\nI joined the OMSI Science Pub impromptu yesterday, knowing nothing \nabout what it would be.  I grabbed a seat, saving the one next to me, \nand was going to Facebook \"come 'n get it\" but then thought to call \nGlenn and text Trevor.\n\nLew Scholl has been to these before and I'd \ntexted him too.  As it turned out, Trevor could join me and our walking \nand meeting afterward was productive as usual.\n\nThis turned out to be one of two OMSI Science Pubs going on.  The subject was [Biomimicry](http://biomimicry.net/).  The speaker, Richard Louv, said he didn't do slides, or had done, but proved inept at using them.  \"[Not HTT material](http://controlroom.blogspot.com/2011/04/roller-coaster-at-reed.html)\" I could hear the generals thinking (big emphasis on PowerPoint in that program) -- more like a late model boy scout.\n\nThey used to make fun of the fat kid at camp, and how everything was so much harder on the obstacle course.  Now we're all that fat kid (obesity rates where front and center in the OMSI slides), so we've toned it down quite a bit, so as not to offend ourselves.  \n\nTeasing is the most politically incorrect thing you can do almost, especially where there might be hurt feelings involved. Unless you're trying to make it funny.  There's some tough screening if so.\n\nRichard Louv sings a lot of the same spirituals we do around Portland, he was clear about that.  He hadn't lectured in quite this setting before:  so much booze (the event is held in a brew pub).  Being not from around here, he's maybe not quite so relaxed.\n\n\"What is nature?\" is actually a good question, as to think vast cities are not natural is to be a little bit crazy, I have to say.  But that's OK.\n\nRichard sounded quite apologetic for his profession's being so invested in pessimism and despair sometimes.  He was speaking of journalism.  The message he wanted to deliver was there's still hope -- something along those lines.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}