{
  "id": "113408269701310643",
  "title": "Another Interesting Day",
  "published": "2005-12-08T22:36:00.000-08:00",
  "updated": "2006-11-15T11:43:48.162-08:00",
  "content": "I started with [housework](http://worldgame.blogspot.com/2005/01/mornings-meditation-energy-slaves.html) (an English translation of economics, a Latin root) expending energy from [Bonneville](http://www.bpa.gov/corporate/) to suck dust into a plastic compartment, for later emptying (electric motor -- called a vacuum, and my name is Kirby, which is also a [brand of vacuum cleaner](http://images.google.com/images?q=kirby+vacuum&hl=en&btnG=Search+Images), and once the Kirby people showed up and ya know, I came that close ([finger gesture](http://photos1.blogger.com/blogger/1134/545/1600/pinch.jpg)) to buying one, probably just cuzza my name).Then I drove Derek and Nick downtown, Dr. Consoletti to leave off at Union Station, enroute to Powell's Technical. I consumed Laszlo's [new book](http://www.amazon.com/gp/product/1594770425/qid=1134093312/) about some A-field, Ervin having been in charge of this Budapest Institute, some think tank Dr. Consoletti attended in his process of earning a PhD certification. Nick's French mom was a pro scuba diver. He also has an American mom. The book is fascinating, especially to me the autobio parts.Derek treated me to lunch at [Sisters of the Road](http://www.sistersoftheroadcafe.org/), which looks like doesn't have working FoxPro right now (ball was in my court, sorry sis). We both got spaghetti with extras, really not bad food. The \"chocolate juice\" (soy product) was a tad on the too sweet side for my taste.In America 2005 (a very old operating system, precursor to USA OS, any version) you had these three categories: people who didn't work and needed to, people who did work very hard, people who didn't work and didn't need to. Those in the third category were considered to \"have made it\", those in the second to be \"just making it\" or maybe \"doing OK\", and those in the first \"not making it\". What all this jargon meant, in practice, is something an historian could tell you. Or watch video.google.com.Don came by, after Derek and I got Frostys™ @ Wendy's. I shared this blog entry and he pointed out another important category:  people who work hard, and don't need to. Went to Oasis.After dark, I wrote an essay on [MER](http://mathforum.org/kb/thread.jspa?threadID=1310716&tstart=0) for our [KBE](http://worldgame.blogspot.com/2005/10/saturday-academy.html), and continued with the housework, having purchased Pine-Sol® at Freddie's. Science fair @ the school, dinner out with family. I should get Mr. Braithwaite and Mr. Bright to meet up; they're both majorly into [Moto Guzzi](http://www.motoguzzi.it/).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}