{
  "id": "2815334555232532812",
  "title": "Another First Day",
  "published": "2017-03-19T11:16:00.004-07:00",
  "updated": "2017-03-19T17:12:37.359-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/21314016669/in/photolist-PBjQf1-PBjMrA-FvF63V-ytrUA2-ahhmM1-7XiXho)\n\n\"First Day\" is Quaker jargon for Sunday. One spin is our Puritan heritage made us shy away from pagan concepts, such as a Sun or a Moon. God's people would just use numbers, goes the theory, and in many a database that's true (the calendrical data gets distilled to an integer).\n\nI'm fully under the impression today is Business Meeting, an open event, though not in the sense of including lengthy recaps of prior episodes. We don't interrupt the meeting to do long retrospectives, though that might really help as a Program Committee project. Studying one's own history (as in medical history) is usually a wise investment, unless maybe hypochondria is your main problem, in which case just let go.\n\nOne of my healthcare stories is dad and I got hepatitis, we think from the corned beef in Ramallah that time, but who knows. We were heading to Florida, having spent the summer in tents, in the outskirts of Rome, and in this small town near Jerusalem, since grown. We banged on rocks with sledgehammers, like in the cartoons, and of our own free will, as peacemakers. AUB students joined us, as did local Boy Scouts (a translation; local adults, mostly men). This was in the early 1970s.\n\nDad's hepatitis got worse and he needed to be quarantined, all while seeking new work in the capital. He'd given several years to the fifty year plans for Libya's development, not that he was the decider or anything as planning is not like that.  It's a process, more like a Quaker business meeting.\n\nI've already missed Meeting for Worship, which is weekly (Business Meeting is monthly). I was up late watching the new Adam Curtis film, HyperNormalisation. I still have time to make business meeting.\n\nLikely I won't have much to say as I'm not currently on any of the several committees. I hopped on a welcoming team recently, got to have lunch with the Abbotts, Betsey Kenworthy, Mike Goren (transferring in) but that's been the extent of it since Peace and Social Concerns.\n\nRegionally, I've been active with IT Committee, both on and off, as clerk and not-clerk.\n\nCurtis did Power of Nightmares, which I've always appreciated for its succinct summary, with talking heads. I started sampling it last night again, using Youtube (an Alphabet company), which is what got me plowing through HyperNormalisation, released prior to the US presidential election in 2016. I'll get back to it later with a more proper review.\n\nI'm still eating the Trader Joe's Pita Pockets I picked up at the Men's Group (Willamette Quarter), having secured a supply of hummus upon returning to Portland.  Great gathering, guys.\n\nAfter Business Meeting I might see if anyone wants to grab a beer at either Horse Brass or Belmont Station, both near to the Stark Street meetinghouse. Our branch of Friends is not out to reimpose Prohibition or anything like that. \n\nCurtailing human freedoms is not at the top of our agenda, or even in the middle.  Quakers formed in many ways as a counter to the overbearing / overwhelming power of faceless institutions, bureaucracies, which in those days was heavily Church of England. \n\nThe UK had the New World as a blank screen on which to project new vistas, new programming. Many Quakers chose to pioneer said New World rather than accept their lot in the homeland. \n\nHow the story goes from there is rather long, safe to say the Quakers went on to pioneer in the midwest and eventually some got all the way to California, our spiritual ancestors among them. \n\nOur Pacific Northwest meeting is pretty cosmopolitan by this point.  We don't have the Unicode name tags yet (for those with names spelled outside of Latin-1) but they're in the works. All contemporary databases support Unicode.\n\nAddendum (email to old friends, from Hop House):\n\nGood to hear from you Rick. I'm sipping an IPA after Quaker business meeting.\n\nI\n left early as they wanted to talk about a members-only HVAC system \nfundraising committee, however I've rescinded the right of these \nparticular Friends to count me as one of their members, for personal \nintegrity reasons (their members are too snooty and spoiled, not my \nfavorite flavor). Best to quit while I'm ahead. I still count myself a \nQuaker.\n\nThat was awhile \nback, that I dropped my membership. I've continued to serve on \ncommittees and even donate money from time to time.\n\nI'm\n pleased to be back in touch with Tom on related topics of Zero, Origin,\n Vortex (one of your favorites), in addition to the caltrop-based (vs \njack-based) XYZ-like coordinate system with origin (0,0,0,0). \n\nHe's the Zero expert. Oregon did sponsor a rock concert named Vortex One long ago. Wikipedia has a write-up I bet.\n\nCome to think of it, this Hop House still gets Vortex magazine.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}