{
  "id": "6765013903397740730",
  "title": "Another TrimTab Meetup (Sept 30, 2023)",
  "published": "2023-09-30T12:17:00.000-07:00",
  "updated": "2023-10-08T13:44:23.256-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/45606874742/in/photolist-NNjSYk-29hYE5w-2cu89WA-2ncPJFj)\n\nZoomers (mostly Boomers in this case) seemed somewhat scandalized by Bucky's polemics versus Bauhaus, circa the early 1960s, by which time his fame had grown. \n\nI remarked that these polemics all sounded professional, in the same sense a movie critic, or literary critic, might be blunt or negative on some points. \n\nThe chapter opens with a question he gets a lot: \"in what way is Bauhaus an influence on your work?\" (paraphrase).\n\nHe replies (paraphrasing again): \"I love these guys, but I came to my position independently and have some criticisms to share of their approach\".  See Ideas and Integrities, A Spontaneous Autobiographical Disclosure (Prentice-Hall, 1963 or later edition).\n\n09:46:53 From Kirby Urner To Everyone:\n\tIn being closer to American factory industrialization, Fuller considered \n    himself upstream from Bauhaus i.e. Europe was getting the new “no nonsense” \n    aesthetics 2nd hand. That’s what I got from the reading.\n...\n09:57:58 From Kirby Urner To Everyone:\n\tThis word “teleological” and how Bucky uses it: Synergetics Dictionary\n    worth a consult. Connects to his Bow-Tie symbol.\n\nThat was TrimTab Book Club. We read books by and about Bucky. Mark Wigley's book.\n\n10:24:26 From Kirby Urner To Everyone:\n\tMark Wigley: Buckminster Fuller Inc. Architecture in the Age of Radio\n10:24:42 From Stephen Bau To Everyone:\n\tReacted to \"Mark Wigley: Buckmin...\" with ❤️\nI think [Lionel](https://flic.kr/p/5B52pT) (today mostly muted and on another phone, conducting business) has been asking an interesting empirical question recently: if we make a Bucky Chatbot, will responses to promptings result in something less enigmatic than his seemingly-exclusionary home-brewed style of quasi-impenetrable prose? Some might say the whole point is his language i.e. a prompting for \"a snippet of a play by Shakespeare but in the style of business English\" might be a recipe for making garbage. \"Why not just run the experiment and wait for results?\" is my attitude. And that seems to be what people (then on the call) are up to doing.Sam has been keen to run similar experiments based on writings by his grandad, F. Scott Fitzgerald. Perhaps test-developing this chatbot, around a challenging American Lit corpus will iron out some kinks in the workflow, paving the way for more author-reflective chatbots down the road, drawn from American Lit and elsewhere.We know people have mixed feelings about AI, given all that's sometimes weirdly hallucinatory and downright uncanny about its performances.  What's the genre? Spoof? Horror? Museum Diorama? 'Certainly there's something oxymoronic about the notion of a \"robot sage\" if ya'll know what I'm sayin'. AI as a discipline inherits the carnival-style tone of illusion-making deceptions (ala the \"magic show\"). I think of Zoltar. I think of [The Turk](https://github.com/4dsolutions/elite_school/blob/master/ADS_intro_1.ipynb).When I say \"chatbot\" I'm referring to an active (attentive) inference engine, meaning one of these generative algorithms that returns polished, structured, grammatically correct text, in the ballpark of some prompt or sequence of prompts, some predictable response thereto, based on maybe billions of use cases. GPTs these were (and are) called: Generative Pretrained Transformers.  Pretraining does not preclude further training on the job. Start with an already vectorized large language model (LLM), but then shape it more.I volunteered during check-in that I was currently in touch with David Koski over the topic of great circles, surface and central angles project. I posted [a link](https://github.com/4dsolutions/m4w/blob/main/great_circles.ipynb).  David (not on the call today) joined us (for the first time) on the most recent Zoom session, two weeks back, when [Victor Acevedo](https://www.laweekly.com/meet-metaphysical-digital-artist-victor-acevedo/) was our guest, talking about his own influences; Bucky for sure, but also the surrealists, while taking advantage of computerization.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}