{
  "id": "8572367508851195997",
  "title": "Another Math Summit",
  "published": "2018-12-29T09:41:00.002-08:00",
  "updated": "2018-12-29T23:26:52.640-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/46310236092/in/dateposted-public/)\n\nThis morning I got to meet [Peter Farrell](https://worldgame.blogspot.com/2016/06/pycon-2016-concludes.html) and his twin brother Steve at the local diner, Tom's, for ongoing discussions about pedagogy (teaching kids) and andragogy (teaching adults).\n\nPeter has just finished Math Adventures with Python through No Starch Press and I've been pouring over an electronic copy. The synergy of coding and doing mathematics is an obvious draw for a lot of us, whereas another school of thought (represented [on Forum 206](http://mathforum.org/kb/forum.jspa?forumID=206&start=0)) says coding and doing math should be kept far apart and tested separately.\n\nThe separatists pretty much won their battle, meaning the coding people have had to wedge their way, hour by hour, into K-16, without math curriculum writers and publishers lifting a finger.\n\nTheir track, the math track, is just fine as is, whereas the coders needed to start over from scratch and often ended up focusing on \"games\" because they're trying to appeal to their new audience.\n\nAgainst that default background, you'll find an assortment of creative teachers, left any freedom to innovate, will keep mixing it up.\n\nMy hybrid blend goes by \"[GNU Math](https://mybizmo.blogspot.com/2006/08/scripting-road-show.html)\" sometimes, deliberately a pun on New Math (we do look at sets, but maybe not as a be all end all ala Bertrand Russell), given Stallman's encouragement of wordplay and cleverness.\n\n\"[Digital Math](http://wikieducator.org/Digital_Math)\" is another name for it.  We've had a lot of discussion of the genre over the years, in Forum 206 and [on edu-sig](https://mail.python.org/pipermail/edu-sig/) (@Python.org).\n\nIn the middle of Digital Math, I draw this arching bridge over the STEM-PATH chasm (cite C.P. Snow), into literature and anthropology.  \"Imagine a tribe\" (as Wittgenstein would say) \"which \"multiplication\" means this different thing\".\n\nWe already have multiple meanings for \"the product of\" in the world of binary operations (two complex numbers, two matrices...), so my injecting some alternative sixty-degree-based geometric model of multiplying, from American literature, scarcely makes a ripple. Said operation (__mul__ in Python) is already over-determined.  What's one more meaning?\n\nHowever, I'm not suggesting every secular (public or charter) and private school needs to include American literature.  That's [a niche](https://medium.com/@kirbyurner/uncommon-core-87a31b7f75b3), and features such expats as Ezra Pound and T.S. Eliot, back to Walt Whitman and before (Coleridge's romanticism informs both pragmatism and transcendentalism, and whatever Poe was into [with Eureka](https://en.wikipedia.org/wiki/Eureka:_A_Prose_Poem) and so on).\n\nWe see [this graph of connecting authors](https://medium.com/@kirbyurner/graphing-the-poets-b600c86d6b9) against a wartime backdrop a lot of the time.\n\nStudying poets, such as Bucky, takes us into History (the H in PATH) pretty quickly.\n\nMath Adventures with Python leverages having powerful CPUs and GPUs at our disposal.  The halcyon days of the scientific calculator are in the recent past.   \n\nMathematica, or Wolfram Language, operates in the same domain as GNU Math a lot, and much of the PR from Wolfram's corner fits with the larger \"learning math through programming\" campaign's.\n\n[](https://www.flickr.com/photos/kirbyurner/32643128658/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}