{
  "id": "6287250292905931983",
  "title": "Another Honorary Wanderer?",
  "published": "2016-10-11T12:33:00.003-07:00",
  "updated": "2016-10-12T11:51:48.397-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgbI44M528YH8gosnR7AO4Uv_0Mkqy2askuhfHPDQVGsuv7Nut7H69M8kZa5_bV9KYoOntPkTlEQwS2I8QXzPWXu34t50ryUM9RvJR_ZKRMTAqawehXlNQ2fvDbKEIKMRz2rHxm/s1600/OR7_WOLF-1_qbrql8.jpg)\n\nRemote camera photo of OR7 captured on May 3, 2014, in eastern Jackson County on USFS land. \n\nCourtesy of USFWS\n\nYep, wolves attack livestock, kind of like hunters attack prey.  They don't have a license.  In Ecuador, a wolf can get a license right? [https://t.co/ABrue0uxxm](https://t.co/ABrue0uxxm)\n— Kirby Urner (@thekirbster) [October 11, 2016](https://twitter.com/thekirbster/status/785839145587449860)\n\nIn addition to proposing Keiko as [an honorary Wanderer](http://mybizmo.blogspot.com/2006/01/recruiting-new-wanderer.html), I'm thinking about this wolf. The ape authorities are thinking about killing him.  We allow animals to join us in death, as well as in life.\n\nWe've had numerous dogs in our midst (some now dead), welcome at the table. Yes, mostly we're comprised of [not naked] apes, par for the course in our zip code.\n\nMy reference to Ecuador in the above tweet has to do with that country encoding some rights for non-humans into law, one of the first groups of sapiens to do so. \n\nYes, it's true, some apes pride themselves on being \"sapiens\" and have invented a whole taxonomy to celebrate their supposedly exceptional superiority.\n\nNever mind they murder one another in droves and are the laughing stock of the galaxy -- just kidding, the galaxy has more important things to think about.\n\nHowever if we're allowed to call North Americans \"Indians\" (even in 2016!) as in \"Indian reservation\" then I think the \"Planet of the Apes\" moniker applies just as well, as a colloquialism.\n\n\"Welcome to the [planet of the apes](http://www.4dsolutions.net/mycartoons/cartoon2.html)!\" I'd say to the ET tourists.  The \"sapien\" stuff is just their vanity talking.\n\nI'm referring to all the branches of hominid species, most of them already killed off by now. The sapiens were apparently the most vicious.\n\nCall them \"mankind\" if you like, or \"humans\". That's the more formal term (not \"vicious monkey\" or simia vitiosus in Latin).\n\nWhen in Rome...",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}