{
  "id": "7836624945049312172",
  "title": "Another Triple-A Adventure",
  "published": "2016-06-10T06:00:00.000-07:00",
  "updated": "2016-06-12T09:08:30.765-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/26965775563/)\n\nFor some reason Carol thought the crew of the Golden Rule was to be at the Unitarian Universalist church last night.  We grabbed a bite at Burgerville on the way (she likes the turkey burger). I'm doing Soylent these days, having received a new shipment, but had a seasonal milk shake with black coffee.\n\nThe original Golden Rule was a ship that sailed into nuclear war zone waters back in the 1950s, when the nuclear assault on the pristine Pacific Islands and their denizens was still in full swing.  Apologists call this form of asymmetric warfare \"testing\" and like to pretend it's legitimate science.\n\nThe aggressors were looking for disposable human subjects for their shocking / awesome experiments and found the people of Bikini, Rongelap, and [other Marshall Islands](http://controlroom.blogspot.com/2013/11/pacific-islanders-meet.html), ill-equipped to resist a mighty military.  The defenseless make convenient targets, for cancer research etc.\n\nWe see this pattern throughout history:  new weapons get developed and guinea pigs are sought.  The people of Vietnam were tested with defoliants and early \"precision\" weapons.  For Apache helicopter weapons testing, the Panamanians were targeted.  The Apaches proved quite effective.\n\nThe people of Iraq were used to guinea pig various bunker busters and cruise missiles.  Libya and Syria were soon to follow.  The Nazis had a field day with Jewish folks.  Whoever has the upper hand likes to take advantage of a ready gene pool; Social Darwinism in action.\n\nHistorian Edwin Black has documented some of the thinking in his [War Against the Weak](http://www.waragainsttheweak.com/).  Although the Nazis ostensibly lost WW2, their belief in Social Darwinism was shared by many in North America.\n\nNothing Golden Rule related was happening at that venue though -- a crossed wire.  However, by the time we got there I notice my left front tire was completely flat.  I pulled into a parking lot and phoned AAA, continuing with my tweeting.\n\nI'd discovered some days earlier that the mere fact of vacuuming a little with the electric dust buster had completely [depleted the car battery](http://mybizmo.blogspot.com/2015/09/car-karma.html) to where it would no longer start the car.  I applied a trickle charger, but Patrick wisely warned me this was the sign of [a dying battery](http://controlroom.blogspot.com/2013/10/winter-repairs.html).\n\nSure enough, just keeping my cell phone charged off the cigarette lighter, without the motor running, proved too much, and the starter would no longer turn over after a short time.  By the time AAA arrived, two hours later (busy night) I was doubly dead in the water, with flat tire and a dead battery.\n\nI don't think I have a jack in the back, with the donut emergency tire.  I'll double check, but my thought was AAA would do it more professionally, and I was right.  I bought a new battery on the spot, [shades of Winterhaven](http://mybizmo.blogspot.com/2005/12/another-nsr-from-aaa.html).  $131 with warranty.  I'm yet again persuaded it's worth my money to keep my AAA membership up to date.\n\nWhen people try to escape their fate as human subjects, such as in Fallujah or Aleppo, they're often detained or otherwise corralled.   The warmongers need human shields for one thing, not just guinea pigs.  Innocent bystanders add to the excitement of War Theater, feeding the appetites of the viewer-voyeurs.\n\nI suggested Carol take the bus home given we were passed the original expected assist time, and I was losing signal.  She agreed and hopped (with her walker) aboard the Belmont bus, rejoining me back at that very same Burgerville as things turned out, where she got herself a strawberry milk shake (she'd been eyeing mine).\n\nToday I'll go to Les Schwab and see if this tire is reparable.  If not, they'll doubtless sell me two, as symmetry of tread is somewhat a consideration.  Follow-up:  the tire was reparable and fixed at no charge.\n\n[](https://www.flickr.com/photos/kirbyurner/26965772663/in/photostream/)\n\n[](https://www.flickr.com/photos/kirbyurner/27484306862/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}