{
  "id": "4376198354525061078",
  "title": "Another Prince",
  "published": "2016-04-26T16:24:00.003-07:00",
  "updated": "2016-04-26T16:45:35.879-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/26218031100/in/dateposted-public/)\n\nSome will say, at the end of my little story, that something had caught my eye and got filed away unconsciously.  Others may say I'm lying, but then stories of this type are common enough.\n\nI was relaxing on the weekend, plowing through some [stand up comedy](https://youtu.be/1CLSwfh53rs) Youtubes, when I came across one by a semi-famous movie-maker, [recounting his recent interactions](https://youtu.be/8LhcParuzpc) with Prince.\n\nThat tipped me into watching [a documentary on Prince](https://youtu.be/dRNYiFxR2Ps); I let Youtube just keep playing.  I became quite interested and started seeking out specific tracks the talking heads had been raving about.\n\nAs you might gather from the above, I was coming from outside the Prince sphere, peripheral to the scene.\n\nPortland has its [Pedalpalooza Festival](http://pdxpipeline.com/2015/06/02/pedalpalooza-event-schedule-portland/), bicycle-oriented, and one ritual ride has long celebrated both [David Bowie](http://mybizmo.blogspot.com/2016/01/for-david-bowie.html) and Prince as the two major avatars (long story).\n\nLindsey (not in Portland) wondered how that would go this year, I'd expect a large turnout.  So yes, some of my closest friends are Prince fans.  I'd told her my synchronicity story, Deb too.\n\nWhat's outstanding about this story, from my point of view, is only after at least three hours of spinning in the Prince vortex did I finally realize the whole of pop culture had been doing that for some days.\n\nPrince had died [just days before](http://www.bbc.com/news/world-us-canada-36106778).  I hadn't known that.\n\nI just got caught up in the spirit of the times.\n\nHaving watched Ingmar Bergman's movie [The Seventh Seal](http://controlroom.blogspot.com/2016/01/the-seventh-seal-movie-review.html) with Lindsey, I wrote her back that what I'd pieced together is Prince was playing chess against death -- hardly a Sherlock Holmes statement, as we're all doing that (some more consciously than others, at any given time).  \n\nMy friend David Koski expressed the pride Minnesotans take in their Prince, an all around good guy. He was loved by nearly all women it seemed, which made some men jealous -- that was David's take.\n\nHaving just immersed myself in the story, I agreed he was phenomenal.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}