{
  "id": "1285760100023328341",
  "title": "Another Space Case",
  "published": "2011-02-09T21:29:00.000-08:00",
  "updated": "2011-02-12T17:56:02.301-08:00",
  "content": "Although I mess around with [the professor archetype](http://controlroom.blogspot.com/2008/12/nato-professor.html) (senex etc.), I'm averse to falling into that trap of \"absent minded\".  Averse or no, the laptop is probably in a good place, but I won't be sure until tomorrow, so movie night didn't happen.  Long story.Hey, I've been thinking about how to translate \"samsara\", am aiming to consult with Satya on this. This has probably been thought of, but I'm thinking \"sorrow\" as in \"river of sorrow\".  But then, for me, there are connotations, like with Krishnamurti saying as much.  [Hi Nick and Quinn](http://mybizmo.blogspot.com/2011/01/return-to-icu.html).In rough translations, there might be some attempt to link samsara to Hades or even hell as an afterlife, but that's to miss it's one's life today.  This is also our world of joys (nirvana).We'd have these philosophical discussions while in the Kia sometimes, Urners, Dawn Wicca, Tara, our tribe.  Julie had been to Grahamstown as well.  We took the scenic route back to Cape Town.One could also call it one's \"time tunnel\" which has the look and feel of a \"world line\" (but with thickness).  The \"partially overlapping scenarios\" idea was a remark about shared grammar, one might say, whether one uses this remote (esoteric) vocabulary or some other.We had Thai food, per plan.  Only then did I discover I'd probably set her down, movie still in the drive.  I'm back to \"absent minded\" and how it haunts me.  Part of the human condition I realize. Something about [P.D. Ouspensky](http://controlroom.blogspot.com/2009/01/at-work.html).  Hi Gary.Academia should have no problem with \"dharma talks\" as a genre, whether these be about genomics, neuro-science, other hybrid subjects (as if we were somehow done with alchemy). Lining up polyhedrons and \"the elements\" may seem like a strange thing to do, yet we should acknowledge that this was done.  Tracing the history of a meme game doesn't require making it one's own, though one may, on occasion.  I covered some of this during Martian Math, using the free Web to omni-triangulate.I'm drifting in and out of a Python theme.  It's become a kind of calligraphy for me, simple, spare programs [for STEM teachers](http://mail.python.org/pipermail/edu-sig/2011-February/010191.html).  I'm seeing our bridge again, twixt natural numbers, partial sums, partial sums of those sums.Hey, at PPUG last night I was yakking with the gmpy guy again (picking up from work by Alex Martelli).  He said arbitrary precision complex numbers are on the way.  It's not like they've not been implemented in other libraries.  Bringing them into Python is what he's working on doing.My movie-goers were kind and empathized with my loss, did not begrudge me the missing movie.  The disk is Bob Smith's though.  Fingers crossed I get it back.Thinking about relatives and friends in different chapters, moving round the karmic wheel.  Jim Person recently passed away.  The aging process is inevitable.  The impulse to plan for a better world remains though, an indication that we're drawn forward, not just impelled from behind (fear vs. longing: pursued vs. drawn towards).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}