{
  "id": "782264455602729176",
  "title": "Another Day in Rose City",
  "published": "2006-12-09T18:02:00.000-08:00",
  "updated": "2014-03-08T13:54:26.448-08:00",
  "content": "Gene Lehman died last night, peacefully, having come home from the hospital with that purpose in mind.  Don, his long time friend, stopped by earlier for a good visit.  I'd planned to swing by maybe this morning.  I've got some candles going. Gene was a strong writer in the Catholic tradition, self-published a journal called [LUNO](http://worldgame.blogspot.com/2005/05/luno.html).  I offer my condolances and sincere sympathies to his wife and family.\n\nDawn and I went shopping for winter clothing, anticipating it'll be colder in New Mexico than here.  Tara is at an athletic club elsewhere in the city.  Quiet Saturdays are the best.\n\nWe enjoy spotting the new [bubble-like cable cars](http://www.katu.com/news/3910121.html), Made in Switzerland, and still undergoing testing.  I speculated to Tara and Rose that maybe some future James Bond movie'd feature 'em, though we wouldn't really make one fall onto a speeding truck on I-5 -- that'd be one for the special effects department.\n\nAnd speaking of Switzerland, mom reports her [misplaced laptop](http://worldgame.blogspot.com/2006/12/nanotech-talk.html) was located and is presumably in transit.  We shall see.  I'm less skeptical than before. Followup December 12:  she received it by courier to her door at 2:30 AM this morning.  I'm impressed.\n\nThis evening:  fine conversation at the [corner Peet's](http://worldgame.blogspot.com/2006/08/street-corner-tetrahedron.html) with Nancy Scharbach of Mt. Angel, Johnny Stallings [the actor](http://worldgame.blogspot.com/2004/10/king-lear-play-review.html), and Nick Consoletti, world game bard and/or busker.  [Walt Whitman](http://www.adherents.com/people/pw/Walt_Whitman.html) was among those featuring in our chatter.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi2x3ZhLJqhM7ZMalOV_6AIky_Mvze4JJdWjPa-4BpgNESLwlc4sNbu45swxF9-E4Ri30qG0-emf5eviGbWXVkzHYxKLvbFEViRxiEr9j1IdCTr2_5npb79ybwyvE67uj8EhhBu/s1600-h/nancyjohnny.jpg):: johnny & nancy ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}