{
  "id": "3632431704773573970",
  "title": "Anticipatory Design Science",
  "published": "2015-07-25T16:32:00.002-07:00",
  "updated": "2015-07-31T05:43:06.901-07:00",
  "content": ":: a lecture commemorating Fuller's 120th birthday, by Trevor Blake :: \n\nTrevor regales us with stories about Fuller \"dog trotting\" (as he called it) in his underwear (to stay healthy) and obsessively \"keeping a chronofile\".  Today we call that \"jogging\" and \"using Facebook\" (in some domains) and neither habit seems that weird.  Fuller made a career out of being a \"weirdo\" (i.e. \"ahead of his time\" aka \"an early adopter\").\n\nFullers' mind / brain model was server / client, making the metaphor of \"upgrading\" easy to come by even before we had \"the cloud\" (we at least had \"heaven\" i.e. the state of everything working flawlessly, and then the \"afterimage\" i.e. a lagging human understanding).\n\nQuaker's too use \"expectant waiting\" as a term for seeking divine grace i.e. illumination (enlightenment) -- an ongoing process (continuing revelation), not so much a moment of satori as the ongoing possibility of satori.  Referring to this extra-human (super-human) source as Mind simply tinges the discourse with a Gnostic flavor.  Whether one might go on to distinguish Mind from Being in any formal way would of course depend on one's namespace, e.g. which flavor of whatever Transcendentalism.\n\nTo what extent was Fuller's \"walking away\" from the Wichita House enterprise an after-shock associated with the Dymaxion Car's overturn?  Everything looked so hopeful around the car, before it was run off the road in some pissing contest, just before showtime.  Things might go wrong with the house as well:  one might fall off the pole and squish the family pet.  What controls did Fuller have over the quality of assembly and might not a few visible failures set us back?  He was gambling at a high stakes table and did not feel like bluffing, nor did it yet seem a winning hand.  He folded.\n\nTrevor reminds us to what extent \"Dymaxion\" came to mean encampments and camp equipment, refugee camps, people making the most of what little they had.  The Occupy Movement was about instituting insta-government where possible.  City downtowns were not ideal for long term experiments but did serve to (A) recruit large numbers instantly, to the possibility of such communities and to (B) serve as demonstrations of where we're at, in terms of ability to coordinate.  One might focus on disastrous aspects of these scenarios, but as an [OPDX logistics person](http://controlroom.blogspot.com/2011/10/at-ikea.html), I saw a lot to admire in the mechanics as well.\n\nAs I was discussing with Melody this afternoon, I think learning to cook contemporaneously with the task of wrapping one's mind around concurrency patterns in programming, in say Clojure (to pick a language), is a great example of a positive synergy, not least for the cooking skills acquired, let alone programming.  She was over saying good bye to Lindsey, currently packing for Corvallis, where she's a student at Oregon State University.  But then Newar Studies (not an official OSU major, something she's putting together across departments) will be taking her back to her main studio shortly.  I'm on tap to drive her to PDX.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}