{
  "id": "1901105511149676141",
  "title": "Appliance Connection",
  "published": "2021-02-26T01:36:00.002-08:00",
  "updated": "2021-03-12T08:09:13.308-08:00",
  "content": "I've been grateful the appliances have kept working. After the personal bionics, the avatar, and those around us, we want our machines to work, especially the life sustaining ones, like the furnace, air conditioner, for many a car. I running a two person household yet managing my Oregon Curriculum Network on top of that, pumping memes to the world.  That's thanks to appliances.\n\nSo yeah, the clothes washer went out.  My ex Sandia Labs friend, with the can do attitude, was all ready to buy some parts and dive in.  Bill Shepherd rescued my DVD player by soldering a new capacitor to the circuit board, per online advice.  Perhaps $60 in parts and some hours, would make the Kenmore good as new.\n\nCalling around for a repair person wasn't getting me anywhere.  The web machine is still directing calls, but these go to a black hole. The economy is still in suspension.  The economy would prefer I buy a new washing machine.  That's what the stimulus check, if there is one, could be for.\n\nMy Sandia friend was also ready to solve the BP crisis, when British Petroleum (aka the Pentagon) trashed the Gulf of Mexico. Patrick had his aquarium tank fired up and started prototyping these giant sucking contraptions (giant at scale), designed for ordinary fishing boats to use.  Mobilize the fleet.\n\nHe's taken on other challenges: the python invasion in the Everglades; the need for easy verification of vaccinated status.\n\nMy sense of the problem with the washer is there's no diagnosis by telepathy. One has to take it apart to see what's wrong.  I've had it for more than five years probably, and it's not under any kind of extended protection plan.\n\nBuying a new appliance, and protection plan, in this day and age, is a statement of confidence about our civilization, and even about so-called \"capitalism\" (a word I use for something else, but never mind). I'm expecting Home Depot to be around for another five years, and maybe even expand to other countries.\n\nWe need to get back to tourism, and not tourism in camo.  In exporting its youth in military uniform, instead of as civilians, the Americans wasted a few generations.  People are entitled to UBI as compensation for all this abuse maybe.  Monkey rule of humanity has been a bummer.\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh69zQ1skY62w7az-QtEZ9mBYHbzu46xSBoKPB0HWmNIdrILoVC0HEtUpkF7YoKhcSwhnBlicYlG3FoSCZgrAdu8Gh7xfMq8hUFxXQFxMPMP4D1SFA1Rwk_UU9NSbYsb0cHUQk_/s982/moneky_rule.gif)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}