{
  "id": "5811275256644308378",
  "title": "Arrest of Dora Marsden",
  "published": "2012-11-23T22:04:00.001-08:00",
  "updated": "2013-01-21T19:20:33.884-08:00",
  "content": "[](http://www.flickr.com/photos/kirbyurner/8212240647/)\n[arrest of dora marsden](http://www.flickr.com/photos/kirbyurner/8212240647/) Originally uploaded by [thekirbster](http://www.flickr.com/photos/kirbyurner/).\n\nI'm thinking this is from the time she heckled Winston Churchill by climbing the facade of a building and shouting through the skylight at a men-only event of some kind.  I snapped a picture of Trevor's cell phone, or was it a tablet?  I forget.  Probably a picture of my cell, a Razr / M, using the Nikon Coolpix, after Trevor shared a copy.\n\nYes, I saw those stories about Anonymous versus some foiled voting heist, but I don't tend to take such stories at face value.\n\nLikewise the FBI probing into compromised relationships in and around the security networks.  [Tommy Chong](http://worldgame.blogspot.com/2012/11/plain-speech-meditation.html) touched on the CIA story recently unfolding, playing up its comedy (sitcom) value.\n\nParanoia tends to run high among any who lie and cheat in ways the FBI might find out about (and also care about).  It's not like that whole phenomenon evaporated [after J. Edgar Hoover](http://worldgame.blogspot.com/2011/11/j-edgar-movie-review.html).  Are you a possible target of blackmail, for which you'd trade secrets to keep things quiet?  That's what many worry about: getting caught up in some drag net.  They'd rather just talk about Libya.\n\nTommy also made fun of Oregon, as did the opening comedian (whom I'd seen at The Bagdad).  Oregon is the \"redneck South\" beneath Washington, its relative North.  In microcosm, Oregon is the more racist, the least secure.  Washington is the greater power, Seattle the bigger city.\n\nIn WA, you have a more Canadian approach to marijuana, more likely to diffuse the cartels and their leverage.  OR is closer to Mexico in having a moralistic / paternalistic / semi-Puritanical mental outlook.  Prohibitionist imposers repress and create an underground, are fragile egos living the nightmare, acting out their frustrations.\n\nPortlanders are especially impatient with such a Puritanical mindset, which is more reminiscent of the Feds (knuckle-draggers, ape-like).  But lets remember Portland is not the entire state.  There's a disconnect, about which Salem does too little, politicians being too parochial for the most part.  Satellite TV does more to level the playing field.\n\nDora was a free spoken British Bodhisattva of the early 1900s, intent upon advancing the societal position of women, but a bitter critic of the \"cause oriented\" who'd sacrifice their health by doing hunger strikes (a popular suffragist strategy).  She distrusted \"ideas\" and their hypnotic power, their ability to divert and deceive.\n\nShe counseled gaining property and influence, creating a secure base.  Marriage and its morals were abusive.  Let men and women negotiate as equals and broker their relationships without some societal requirement that they strictly adhere to a certain script.  She was not a \"one size fits all\" kinda gal.\n\nI believe she created many enemies, such that when she proffered her more serious metaphysical works, too many were alienated to give her the time of day.  She couldn't face the disappointment.  That she would have fans in 2012 was neither a certainty nor a consolation for her then.\n\nI'm still a noob when it comes to Dora, so if truly curious, look for better sources.  Feel free to say I sent you.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg6C516EzQCwQRmnv1sOPpM4grYSXN7wAHJ5Mp2_24y6SiYY60Nv3Al8SEa-v0BN1GGwjKaghHEfWJ9129B3JSgB3Jb7a1oDMYw2ABeKjaAhFGpFMum6xVxEZ9OYh8OQYcxforA/s1600/dear_woman.tiff)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}