{
  "id": "7062947771641910229",
  "title": "As the World Turns",
  "published": "2017-05-16T18:54:00.001-07:00",
  "updated": "2017-05-18T23:23:41.513-07:00",
  "content": "Coming back to a certain soap opera, yes, I remember when the president elect said he was completely in support of Flynn talking to Russians. As incoming National Security dude, that was his role, and he was ramping up in a conscientious fashion, as a key player on the transition team.\n\n[Pizzagate](http://worldgame.blogspot.com/2017/03/russiagate.html) got in the way, and Flynn came across as less than fully candid to the Veep, and Trump needed Pence, even more than Flynn, to stay on board. However Trump was forthcoming with the media, which he loathes as we know, that he didn't think Flynn's sin arose from his interaction with Russian counterparts.  That part was just a future National Security advisor doing his job.\n\nNow Trump is accused of being like Flynn, doing what Flynn himself was accused of.  The difference: Trump is president.  He gets to exercise his own judgement, and that's precisely where everyone wants to rein him in.  As president, he gets a national security team to defend the office. Flynn didn't have the home court advantage.\n\nAs the plot continues to thicken, everyone needs to second guess this rich uncle who has stumbled into the White House, to everyone's surprise, and now gets to pull the levers of power. \n\nDemocracy means you get a lot of back seat drivers. \n\nHowever now that we're an oligarchy (according to many studies), mirroring Russia's (kleptocratic), those busybody back seaters may be safely ignored, at least for longer.\n\nSo now, in that light, with [such history now remembered](http://controlroom.blogspot.com/2017/02/rabble-babble.html), we're hearing from the ex FBI Director that Trump really hoped this was not going to be a witch burning of his friend Flynn. \n\nThis was right after the sacking.  Flynn had already paid a high price, and forfeited a job to which he had been much looking forward.  Had he sounded reassuring, even conciliatory on the phone?  We wanted more saber rattling?  And who are the \"we\" in this picture?\n\nEverything had turned to ashes for the guy already, so why make it worse?\n\nA president is allowed to express (confess?) his loyalty and hopeful feelings, as if to a confidant. Maybe Comey would be that?  Too early to know, in those days.  He didn't want to pursue Hillary any further either, despite the large number of jackals in his own camp, happy to do just that.\n\nAnd now, lo these many months later, everyone is looking back at those episodes and thinking, aha, more proof of sneaky connivance, colluding or whatever. \n\nThe media hates Trump for all the insults he's heaped upon them.  He's not at all polite, like Obama was, except we call that being \"politically correct\" i.e. \"civil\" which to many ears sounds too insincere to pass muster. \n\nHence Trump's win in the Electoral College (maybe with a little help from [voter roll purges](http://worldgame.blogspot.com/2017/02/the-best-democracy-money-can-buy-movie.html), the FBI is still looking into that right?).\n\nCNN especially has been the lap dog of [monster GRUNCH](http://mybizmo.blogspot.com/2013/04/girl-rising-movie-review.html), according to these anonymous sources. However we can't blame that on Ted Turner, an American oligarch, as he's a founder, not a daily operations guy by 2017. \n\nNor does it make sense to blame Time-Warner, a literally soulless corporation, even if metaphorically \"a person\" in anthropological literature (aka \"voodoo economics\").\n\nThe soap opera is one of aggrieved parties seeking vengeance, each hoping to do the neighbor in. \n\nThere's a certain awkwardness about fighting dinosaurs.  The ground trembles and it's all very dramatic.  That sells product, especially soap (politics [feels so unclean](http://worldgame.blogspot.com/2017/03/wading-around.html) sometimes). \n\nThe economy cranks ahead, one day at a time, as the world turns.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}