{
  "id": "5902861133077318805",
  "title": "Asylum City",
  "published": "2025-01-25T10:58:00.000-08:00",
  "updated": "2025-01-25T11:12:40.040-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjqoBUhmxoyoXP0gc0EgwsIVsWzv3KP8zot_Pl87ISRLhOJRxum0GYz1K8osvizCwhxZBFIMgkjFT4ggKONkRMiCpOwWz7DqMWLNuNK6x33WXwd7R4YJBNVaSvyy5lJc_pLEW8aybFIT5KOyuWEq-QPxJIESiZRiQ-QMu94FxqesuAemAhidicI/s1244/Screen%20Shot%202025-01-22%20at%209.06.59%20AM.png):: from my dad's archive: layout plan for Hoon, Libya ::When'd I'd tell folks what I was into at Princeton, like if sitting next to a stranger on Amtrak, and getting to talking, they'd say \"what ya gonna do with that?\" meaning my background reading Philosophy. \n\nSometimes the tone was dismissive, other times more pensive, as the culture sends a mixed message. We're told it's (philosophy is) great prep for CS (computer science) and a career in IT (information technology), which is more or less what happened to me, but also for future CEOs and startup founders. \n\nAlthough \"a founder\" (per LinkedIn), I've been in the ball game too long to call my sole proprietorship, previously a partnership, a \"startup\". I've been DBA 4D Solutions and before that InfoTech, for a long time. DIADEM Center for Creative Networking before that (starting in JCNJ -- Jersey City, near where Bruce Wayne's parents got shot), after I quit my fun and challenging high school teaching job (private academy), believing I heard Destiny calling (or Fate as the case may be and depending on the namespace / vocab).\n\nSo what I've discovered, in retrospect, is sticking to a philosophy track, even if a worker bee, entitles one to some Brit aristocracy airs, in the sense that one is allowed, even expected, to be \"eccentric\". That quality flies brilliantly here in Portland, aka Weirdo City. To top it all off, I like in Asylum District, truly named for a mental hospital (pastoral setting) that used to take up quite a bit of space here on the east side.\n\nAs an \"out there\" type person, I'm allowed to be more like those comedians, those jokers, who push the envelope as we say, regarding what's OK to have a sense of humor about, and what's not. Philosophers as a class sometimes go over the line, are beyond the pale, get lost in some twilight zone, and yet society may nevertheless reward them, as this is their role. It all depends. The devil, as they say, is in the details.\n\nIn my case, I look to my American heritage and see refugees as far as the eye can see, coming from all manner of other places, but mainly from the Atlantic side, only to meet up with the peoples already here and to close circuits with Asia. \n\nMy dad was a city planner, with many branching specialties. Had he stayed in Portland, he'd probably have ended up with Metro, as he had a more regional perspective. Reading over his shoulder, I encountered Doxiadis (Ekistics), Solari (Arcosanti),  and other luminaries. On my out, out of Princeton, I dove into the Buckminster Fuller corpus, fresh from reading Nietzsche under Walter Kaufmann, Wittgenstein under Richard Rorty.\n\nDad didn't stay in Portland though, as his dream since boyhood was to see the world and find a line of work, other than military (he decided around college), that would take him places (literally). He might've been a travel agent if people decided they didn't need planners anymore. But it turned out they needed planners, so that's what he did, for several governments and ministries over the decades.\n\nGiven all those data points, you could say it's predictable that I'd take in the stadium shaped city meme and picture it as one of many dotting the globe, forming a high tech, well run Refugee Cities Network. To an extent, it's a juxtaposition over the realities of today. Cities take in refugees a lot. Some cities were built pretty much entirely by immigrants, new to the New World.  Old Man River City, for Bucky, was for East Saint Louis. But he wasn't about to waste his career on it, meaning he knew he was working for future generations and needed to time capsule as much as possible.\n\nAs a philosophy track choo choo, I'm allowed to chugga chugga through this science fiction vista, visiting these giant stadium cities of the mind, picturing the movies, the backdrops, the decades that might fly by as humans contemplated their various options. Decades have already flown by. The passage of time is not \"theoretical\". \"Time is the only dimension\" says Synergetics, I forget where. We meet up with counterweights on that word (\"dimension\") given Synergetics is richly textured with the \"4D\" meme. That's where my 4D Solutions is coming from, in my own mind.\n\nAlso predictable was I'd be enamored with One Laptop Per Child and the XO line of computers stemming from that project. The internet more generally was a big source of hope, especially with open source, and the police agreed with me. I'm referring to that Hillsboro West Precinct story. The cops were tired of being used by schools to scare the kids about \"software piracy\" (music and games mostly) whereas here was this free and open world, with copyleft and unbridled sharing, that the schools were refusing to teach about, given corporate capture. West Precinct even set up a Linux school at the station, which me and another guy staffed that one summer.\n\nMy activism in the area of education reform matched Guido's to some level (Python's inventor) and I was recruited to join that Mark Shuttleworth summit in Kensington, Greater London. Seymour Papert had sent his regrets, but Alan Kay, a friend of Seymour's, made the meeting. We're talking about Logo and Smalltalk respectively. The Scheme community was represented. \n\nHow could South Africa leverage open source to better serve its schools? How might students of all ethnic backgrounds avail of these metaphysical (informational) goodies? Mark set up his Freedom Toasters, these kiosks that burned CDs on demand, complete with Linux, Python, and whatever else (music and games) of the copyleft variety.\n\nHaving retired from applications development, mostly for nonprofits, including some big ones (especially if governments count), I'm devoting a lot of hours to curriculum development and teaching gigs, while also doing various kinds of homework, availing myself of all that hypertext I used to pray for, in the lineage of Vannevar Bush (MEMEX) and Ted Nelson (Project Xanadu). The World Wide Web came along, thanks to Tim at CERN, and the global U has taken off. U as in University.\n\nSpeaking of hypertext, I'm still focused on hypertoons, doing keyframing, imagining the inbetweening a lot of the time. My topics: the scenarios in Synergetics involving polyhedrons and their transformations, but not only those. I'm seeing hypertoons, the concept, as informing my YouTube channel and how I weave YouTube scenarios together, about Couplers, about BASKET, about Asylum City, and so on.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}