{
  "id": "6342774531769797973",
  "title": "Attending Esozone",
  "published": "2008-10-12T20:06:00.000-07:00",
  "updated": "2008-10-13T10:21:29.294-07:00",
  "content": "I'll be getting back to more writing about [these talks](http://controlroom.blogspot.com/2008/10/esozone-2008.html), didn't make it to all of them, having a lot on my plate.  However I wanted to register my gratitude to both [Paul Laffoley](http://controlroom.blogspot.com/2007/08/esozone.html) and the [Angel Tech](http://www.originalfalcon.com/b-angel_tech.php) guy, for feeding me lots of intelligible and useful information about many topics of mutual interest.  You guys rock.D.W. Jacobs invited me to the rehearsal tonight, and I'm grateful for that.  Sorry to be missing Allegra this time.  We're moving right along here in Portland, looking to have a say in the future, along with sister cities around the globe, other networks.I was just repeating to mom, Paul's story about Lovecraft, seeking out this painter and following him back to his digs, the velvet curtained tableau he made to memorialize this story.  And of course we got the [Gaudi tower](http://wirednewyork.com/forum/showthread.php?t=3507) at ground zero NYC, reminiscent of Fuller's Geoscope in the East River, near the UN, in the sense that even just the idea has healing potential.I finished my evening back [at Mother Ship](http://controlroom.blogspot.com/2008/01/launching-mother-ship.html) (what I'm somewhat jokingly calling our UFO on Stark Street), joining teens in viewing a DVD using mom's Vaio laptop hooked up to the Meeting's  projector, Andy's speakers.I was glad Glenn Stockton could join me for the Laffoley talk.  Having another witness helps me sound like less of a liar when I tell the truth about this guy, a great artist.Thank you [DemocracyLab](http://www.democracylab.org/) for mailing the requested merchandise, I will be gladly paying that invoice shortly.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}