{
  "id": "3420570507236403430",
  "title": "Autoimmune Disease?",
  "published": "2016-07-02T11:43:00.003-07:00",
  "updated": "2016-07-03T10:17:29.281-07:00",
  "content": "The waves of refugees escaping the breakup of the nation-states [in large regions](http://www.salon.com/2016/06/29/iraq_taught_us_nothing_neoliberalism_interventionism_and_americas_crumbling_empire_partner/) is a crisis greater than the South Asian tsunami, in terms of total numbers affected, and number perishing. \n\nHowever, because the viewer-voyeurs see this as \"war theater\" [that's all background](http://controlroom.blogspot.com/2006/06/spaceship-earth-911.html) for the violent foreground proxies, the gladiators if you will, the bleeder / leaders who aim to settle old scores in bitter feuds.\n\nThe line between natural disaster and a human-induced one is blurry.  The weather changes and lowering water table contributed to the unsustainability of entire lifestyles.  Many geolocated in the Americas remember dust bowls and droughts, or are experiencing those today.\n\nIf the same billions in energy expenditure currently pumped into killingry, were pumped into livingry instead, we could use our ingenuity and new designs to solve lots of problems and alleviate suffering. Such behavior would make sense, against the backdrop of world history.  We'd be in less of a slum, [a ghetto](http://controlroom.blogspot.com/2005/12/thinking-globally.html), and our children would thank us instead of curse us.\n\nHowever, our conditioned reflexes are such that self organization of that kind seems somewhat out of reach.  We're collectively \"addicted to war\" as some say, even though it's obsolete ([as others aver](http://www.brainyquote.com/quotes/quotes/r/rbuckmins169521.html)), and therefore behave somewhat like fire ants allergic to their own colony, a pathology I doubt ants have.\n\nHumanity seems to be collectively suffering from an autoimmune disorder that causes it to attack itself, a kind of planetary Lupus.  I like calling it Lupus because of the wolf imagery which connects us to howling at the full moon.  Lupus rhymes with Lunacy.\n\nThe way I see it, our global civilization oscillates between two archetypes:  [Global University](http://worldgame.blogspot.com/2007/06/our-global-u-advertisement.html) and [Lunatic Asylum](http://controlroom.blogspot.com/2015/07/out-of-mind-sight.html).  There's no escaping either aspect; it's not a matter of either side of the same coin always winning the toss.  You'll wake up on [the Asylum side](http://mybizmo.blogspot.com/2015/10/gold-door-2015.html) of the bed some mornings.\n\nGiven how humans are a vector for mental illnesses (meme viruses) that cause humanity to attack itself, our main recourse is a better immune system that's better able to distinguish self destructive behavior from viable and sustainable growth.  Movement in [a healing direction](http://controlroom.blogspot.com/2009/12/disaster-relief.html) is what the many religions, great and small, are meant to provide.  I suggest we harness them for that purpose.\n\nBy \"religions\" I don't mean to circle any particular beliefs about deities or demons or whatever.  The word \"ideologies\" might work as well.  Actually \"medical science\" would be the most apropos, given the namespace.  What God commands is to \"heal thyself\" with a little help from \"divine grace\" or \"dumb luck\" as the case may be (superstitious and/or ritualized behaviors pertain in either case).\n\n[](http://s426.photobucket.com/user/bokalindrona/media/figures/wolf-moon-tattoo.jpg.html)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}