{
  "id": "5782696759937880864",
  "title": "Avatar 2 (movie review)",
  "published": "2022-12-28T08:44:00.011-08:00",
  "updated": "2022-12-28T18:07:46.313-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/3773478351/in/photolist-wGiKZb-QHZSHL-Surfvj-VGJT71-7rM19m-2dfwRjZ-2jD8BCL-2jY3yrP-2o8p3Q4-9EQgiS-ah9iqm-axmKBd-azRZ9u-bwVuKq-bDLGJv-bGH9H4-bKQdbV-ccPN8d-ck1haY-cZpcTG-fxi1Ru-81tpTE-95uMMM-95uN48-95xQL5-6CCVc9-5r4ez5-5shrrT-5smNfC-5u8MwA-5B524e-5GBYVM-6cWsX2-6smLEE-6smNUw-6Ks4Dz-6WgwAE)\nBagdad Theater, 2009\n\nThe rumor I heard, on the lengthy delay between movies, is the director, James Cameron, was waiting for technology to catch up.  The first movie, a 3D as well as 2D work, constructed a state of the art, highly intricate world that would have to be topped.\n\nAs a visual feast (I saw it in 2D this time), Avatar 2 certainly delivers.  I hadn't gone back to watch the earlier one, so was maybe a little confused on who'd descended from whom, but blue people hybridized with sky people have only four fingers and a thumb, which singles them out for ridicule by kids in the other tribe (the water people, more green than blue).\n\nThe main plot element to get is: the main villain (a sky person, white) has arranged to reincarnate, and/or have his memories transferred, to one of \"them\" (a blue) if his current avatar (piece on the board, US Marine type) gets destroyed, and that apparently happened, as he wakes up in a blue body, but with the same gung-ho personality.  \n\nThe bad guy's white son, in the meantime, left behind because they can't freeze babies for cryogenic travel, grew up native, as a blue.  The blues are the Native Americans if you haven't figured it out yet, albeit mythically portrayed through Hollywood movie tropes.  They're also all-American and highly relatable.\n\nThe film is a lot about the \"strong father\" archetype.  The dads keep expressing disappointment in their kids, especially the boys, for their foolish misjudgements, and the boys hate being dissed by the man they most admire and aspire to be like.  They just want to be brave. The greens have a strong father chief too, with offspring.  The whites have their reincarnated guy with his left-behind \"monkey boy\" son.\n\nThe blue family seems very like The Incredibles family (also Disney), especially the teen girl, who feels marginalized as a four finger, and who is developing psychic powers beyond her peers (see Beetlejuice for another take on this character).  She saves the day on numerous occasions.  The younger boy does too, in bonding with the four eyed whale, the outcast one who had tried to fight the sky people earlier.\n\nThe plot is complicated but basically goes like this:  the bad guy Marine and his ilk (the sky people) have returned in their spaceships (buckyballs!) with a special grudge against the blue family dad.  \n\nThe blue family, to protect their own people, decide to hide out amongst the greens, which is controversial as the blues are forest people with underdeveloped lung power for undersea activities.  The greens agree to take in these Incredibles and teach them their watery ways, but it isn't long before the whites figure out where they are, and a fight ensues.\n\nCameron did both Aliens and Titanic and really knows how to put together a believable Machine World, an extrapolation of our own.  He also knows how to tilt the decks, as the ship is sinking, making the  passengers slide and/or climb what had been horizontal surfaces.  \n\nSigourney Weaver plays her cameo role, as the human mother of the blue teen with psychic abilities.  This mother and daughter don't meet directly in person, but on a psychic plane, in a dream state.\n\nOn the whole, I was glad to revisit this world and continue processing the machine versus natural technology rift.  The technology of the Native Americans is higher in many ways, if we include nature herself as a kind of Mech 'n Tech (which she is).  Whales are higher tech than any aircraft carrier, and so on.  \n\nThe brutish sky people are the Euro whites, the neo-Romans, the US Army more specifically.  A lot of what this subculture is most proud of comes in for criticism, in part simply for being so hackneyed, but also in the tradition of great westerns such as Little Big Man, and Dances with Wolves.  Europe is the dying world.  America, already inhabited, is the new world.\n\nI saw the film by myself at The Bagdad and although the film was long, I didn't take any pee breaks.  Nor did I have my customary IPA or other drink (which probably helped) as I've given up beer (but not wine or gin).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}