{
  "id": "110740760138830434",
  "title": "Ayatollah of the Tetrahedron",
  "published": "2005-02-03T08:42:00.000-08:00",
  "updated": "2016-08-10T19:37:58.850-07:00",
  "content": "[](http://photos1.blogger.com/img/254/1836/640/edapple2.jpg)\nE.J. Applewhite\n\nSome big name [crystallographer](http://www.4dsolutions.net/synergetica/synergetica4.html) in the UK (A.L. Mackay right?) bestowed upon Ed this \"Ayatollah of the Tetrahedron\" moniker.\n\nI took this picture about a year ago, at a Bucky Symposium at George Washington University, where I appeared with Ed and others on a panel. He was our guest of honor, the paradigm scholar and collaborator.\n\nIn his keynote presentation, we learned of Edgar Allan Poe's [Eureka](http://xroads.virginia.edu/~HYPER/poe/eureka.html), a metaphysical prose poem which connects to Synergetics on many levels. Ergo, said [Ed](http://www.washingtonpost.com/wp-dyn/articles/A24912-2005Feb14.html), lets keep alive this great American literature of ours and pass it on to future generations. And that we shall do.\n\nIn the foreground is his four volume Synergetics Dictionary, a painstakingly and meticulously undertaken enterprise aimed at documenting Fuller's use of key terms. Teleology, for example -- Bucky had his own way of using it, in connection with the idea of voltage pressure (humans push to realize their destiny in Universe). When I first met Ed in Washington DC many years earlier, he gifted me with a copy. Matt and I drove it across country. I've [treasured](http://worldgame.blogspot.com/2005/01/national-treasure-movie-review.html) it (used it) ever since.\n\nWe have lots of opportunities to synergize with cultures in those parts of the world where bona fide Ayatollahs grace the hallways. Islamic art is sometimes about tiling a surface with polygons, and in space, with polyhedra. Engineering and architecture are similarly about shapes, as is sacred geometry, which dates back to the pyramids and before.\n\nHigh level cultural exchanges, including of open source software (like [SpringDance](http://worldgame.blogspot.com/2004/11/canadian-tech-springdance.html) for example), and hardware (like big plasma screens), would show the world that [geekdom](http://vw.indiana.edu/envision05/), at least, is gaining a brain in the new Iran. Let the politicos rattle their sabers and say menacing things. [We technogeeks](http://www.4dsolutions.net/mycartoons/cartoon2.html) already know the score, and want to get on with living our lives.\n\nI think Iraq's neighbors might want to help a friend by furnishing some of the props, skills and backing, as well as the subsequent television coverage. I'd love to see our geek counterparts, getting up to speed on these tools and infrastructure. If the [USIA](http://dosfan.lib.uic.edu/usia/) makes overtures, sensing a pro-democracy angle, well fine. But if it doesn't (because it's clueless -- or defunct), that's fine too.\n\nThere's no reason to wait for a green light. This is about being free and independent. Want to map [electrical grids](http://www.geni.org/globalenergy/library/buckminster_fuller/index.shtml) on a Fuller Projection, and show it off in control rooms on TV? Go for it, why not? No one is stopping you (or me).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}