{
  "id": "1147364663479791150",
  "title": "Ayn Rand: A Sense of Life (movie review)",
  "published": "2011-11-29T13:11:00.000-08:00",
  "updated": "2015-07-09T13:55:32.888-07:00",
  "content": "Not to worry: just because I've seen one semi-hagiographic DVD made by some of her best friends, am I now suddenly some authority on Objectivism or what have you.  This will not be a boring lecture decrying (or embracing) her metaphysics (if that's an appropriate word).\n\n\"Awww, what a sweetheart\" was my more up front reaction, along with \"so is this what the fuss was about?\"  I'd checked out The Fountainhead in like 8th grade, noticing its push-button value in adult faces.  Like anyone that age (and younger) I wanted to be a part of the conversation, and this looked like a ticket.  But then I lost the thread, and hey, who gets to live near a Movie Madness well stocked with well made documentaries? Certainly not me, until my middle years, when I had the good fortune to occupy a space in 97214 (actually, [a few spaces](http://www.flickr.com/photos/17157315@N00/6427671763/)).\n\nWhat I guess people don't get, quite, is how [the USSR](http://worldgame.blogspot.com/2006/07/back-in-ussa.html) of the day was a convenient backdrop against which to play out big labor disputes (many still ongoing).  The reality of the Russian experience was going to take much longer to get through, given the Doppler Effect of human affairs and osmosis.  Ayn was first wave messenger from a world deep in dire straits, a hell for so many.  New York had its own Broadway version of Russia going, more romantic, more a projection.  Rather than fault that, just accept it, and read Hugh Kenner in The Pound Era about the invention of China (while we're at it).  So yeah, she was out of tempo with the drama so many were on about, but hey, she'd trained with the best, in Hollywood, and knew how to hold her own.  Good for her.  I admire her gumption, her complete commitment to her dreams.\n\nBut then I'm hopelessly lost in some other dimension, is the other shoe maybe.  [My meaning of \"capitalism\" for example](http://coffeeshopsnet.blogspot.com/2011/10/letter-to-allen-wanderers-list.html):  I play cities against cities, like we do in sports, talking about London and Hanoi as my \"capitals\".  These days I'm severely [dissing WDC](http://worldgame.blogspot.com/2011/11/city-as-campus.html) and [boosting Portland](http://worldgame.blogspot.com/2009/02/shovel-ready.html).  That's me being a capitalist, using my head in a sensible way.  Ayn Rand did the same, boosting New York, loving those skyscrapers.  Hey, go for it girl.\n\nWe watched in my living room, Tara, Steve Holden and I all on our lap tops, doing our work.  Tara found Phil Donahue amusing and I found myself explaining about the invention of [the TV talk show](http://worldgame.blogspot.com/2015/07/late-night-tv.html) and the pioneers of the genre, Oprah in the same lineage.  Ninja David showed up on my porch during intermission asking to borrow my cell phone, sucking me back into my own Food Not Bombs soap opera (David \"give me a hug...\" fade out, cue laugh track, see ya next week).\n\nThe funniest part of the Ayn Rand story (at her expense, but she could laugh about it later):  she's like totally gung ho to sail into New York Harbor past the Statue of Liberty, seeing the skyline, has dreamed for this day all her life, and she sleeps through it or something (I was glancing at my laptop when they said what the problem was).  Never mind.  She had her tears of joy later.  So many of her dreams came true.\n\nSpeaking of which, the other irony or poetic twist if you prefer, was that this ardent atheist would have so many miraculous experiences, such as finding herself a handsome / dashing Roman soldier right off the set of King of Kings, with Cecil B. DeMille himself taking her under his wing. \"You can't make this stuff up.\"  Which leaves open to question, \"so who does?\"  Ayn (I'm guessing): \"you don't need a who ([no agency](http://mybizmo.blogspot.com/2005/11/physics-emergent-isepp-lecture.html)).\"  God:  \"look ma, no hands!\"",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}