{
  "id": "9001408057294434956",
  "title": "B2 Party",
  "published": "2018-07-24T06:41:00.001-07:00",
  "updated": "2018-07-24T06:41:10.765-07:00",
  "content": "Atlantic Monthly not long ago shared an argument that the DC idea of a \"president\" is broken.  The same magazine likes to share PR for what I call the \"B2 Party\", which is behind the B2 bomber and its forays.  Atlantic Monthly likes to shill for the B2 Party sometimes.\n\nAm I saying every major weapons system deserves its own party?  Something like that.  The names \"Democrat\" and \"Republican\" have outlived their usefulness.  We have Beltway Bandits and... ?  Oh yeah, Wall Street.  Political discourse would make so much more sense if we could get our analysis more in those terms, versus always reading about zombies (DNC and GOP).\n\nA lot of Americans are really into war porn and crave it.  Stroking the weapons, making them shiny, glistening, on camera is a part of it.  We're taught this is an OK perversion, and indeed we're encouraged, as viewer voyeurs, to get sick in the head in this way, between shopping trips.  Shop, then go home and bliss out on B2s, is the reduced instruction set.  Many of us comply.\n\nLets combine the fact that the presidency is a joke (an undoable job, mostly a scapegoat position, designed for soaking up blame), with the fact that the war porn is a kind of mental illness (DSM anyone?).  No wonder a lot of folks are casting about for a more meaningful discourse.  Intuitively, they understand the political diet they're being fed is pretty hopeless.\n\nHowever, getting a weak ghost of a government to do the bidding of war profiteers is pretty easy.  Just harness its lingering claims to legitimacy and piggy-back on its PR values, and you have a decent chance of getting a war going.  That's the big payoff and many are working overtime on it, doing their best to build tensions with \"America's enemies\" (not seeing themselves as the ultimate killers of a once proud sovereign state).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}