{
  "id": "112974850589922791",
  "title": "Back to Work",
  "published": "2005-10-19T00:16:00.000-07:00",
  "updated": "2006-11-15T11:43:46.793-08:00",
  "content": "Following that fun vacation to McMinnville and environs, I needed to get back to various projects simmering on my metaphorical stove (my real electric one has 4 burners, only 3 usable, plus a working oven).Front burner: Sam Lanahan would like to meet Ken Snelson, given Flextegrity is entering the patent literature in close proximity to Ken's and Bucky's work As a software engineer, I'm suspicious patent abuse will gum up the works, but that doesn't mean I don't recognize good literature. [Patent libraries](http://www.python-in-business.org/ep2005/talk.chtml?talk=5769&track=653) are goldmines for historians of engineering.[Ken](http://www.grunch.net/snelson/) phoned me re my recent email proposing Sam and I fly out for a visit, just as I was going into a meeting on another high priority project: keeping the flow of clinical data to my health mission client uninterrupted, as we transition from vendor A to vendor B in the cath labs over the next few months.Project 3: [the RBF-LW bridge](http://groups.yahoo.com/group/wittgenstein-dialognet/message/5442), a work in progress in philosophy world (I'm a critical path manager on this one).Project 4: wiring more synergetics into K-12 [CS-informed math](http://mathforum.org/kb/thread.jspa?threadID=1268070&tstart=0) (CS = computer science). I need more help from television on this front. Geometry lends itself to communication by that medium -- looking forward to more in high def TV and DVD. My work with Russ (he just sent some new EIG files) comes under this heading.And last but not least, Project 5:  [preparing to teach](http://mail.python.org/pipermail/edu-sig/2005-October/005413.html) Python in a Portland Public School (a 9 week stint, not counting school holidays and vacations).... other projects, too numerous to mention, will need to go unlisted at this juncture (I read a lot of blogs, journalism and stuff, watch some TV, but that's more play than work, plus doesn't pay the bills).Precessionally (tangentially, thinking more in terms of side effects), the above projects are also about putting 4D Solutions on wheels, in a bizmo, e.g. when I go on the road more, I'll still need to VPN into client networks, do source code editing and such (which reminds me, I need to stop writing in my blog and do some more POV-Ray renderings for Sam 'n LaJean).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}