{
  "id": "4252111009792188416",
  "title": "Back Stage",
  "published": "2009-12-30T13:03:00.000-08:00",
  "updated": "2010-01-07T00:20:07.727-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjC0sy7pknyp-_XjABqCj2ci3yYROHzKereUILv_pOfiXJWYEX3ujGnIAWa_-fjXeW17Usq8eeOVMqGSQqFVNbaHd_oYr42FXNUoTHE9uNXQ6Vcn4V5noXDZFVPfCSXrI_u4f3e/s1600-h/lws.jpg)I'm both juggling clients and hammering on my resume.  I get comfortable in my ways then tap into a c.v. like [this guy's](http://members.peak.org/%7Egcon/bcvor.htm) -- when doing a [search on Flextegrity](http://mail.python.org/pipermail/edu-sig/2009-December/009710.html) through [bingapi](http://uswaretech.com/blog/2009/06/bing-python-api/), a clever piece of Python, with matching [bossapi](http://uswaretech.com/blog/2009/06/yahoo-boss-python-api/) -- what a gem.  Sam knows him.  I've not met him (yet).Sometimes I sound kind of churchy, I realize that, almost pastoral.  Like the other night I was looking at the above poster, understanding about the frat house connotations (college letters), yet wanting to give a lightning talk on [Pierre Teilhard de Chardin](http://controlroom.blogspot.com/2009/08/on-break.html) in well under five minutes.  He postulated a God drawing us into the future, a new kind of gravity (or not).  Omega was the symbol he branded with, a good choice given it's the last letter of the Greek alphabet, Alpha being the first.People are being kind to me.  Sam responded positively to my Quakerly notions about [philanthropic gaming](http://coffeeshopsnet.blogspot.com/2009/12/quaker-view.html).  My casinos energize worthy causes, letting consumers channel a vendor payload, that [good will](http://coffeeshopsnet.blogspot.com/2009/12/economic-theory.html) piece of the profit, above and beyond shareholder reward.  Patrick said my Python was zen like, which cheers me up with [thoughts of sushi](http://mybizmo.blogspot.com/2005/12/sushi-for-xmas.html), other Japanese goods.  That's my Pacific Rim heritage showing through.  Outside, a blanket of snow.[Avatar](http://mybizmo.blogspot.com/2009/12/avatar-movie-review.html) is more under discussion.  Combine that with [Wall-e](http://worldgame.blogspot.com/2008/06/wall-e-movie-review.html) and you've got some great social commentary.  Add [Idiocracy](http://worldgame.blogspot.com/2007/04/idiocracy-movie-review.html) and [Over the Hedge](http://mybizmo.blogspot.com/2006/05/over-hedge-movie-review.html), with a dash of [Team America](http://worldgame.blogspot.com/2004/12/team-america-world-police-movie-review_04.html), and you're probably a Professor Noosphere already, with a diploma in [Gaian affairs](http://en.wikipedia.org/wiki/Technogaianism) (don't forget to write your own movie reviews, why not).  Then add [American Pop](http://controlroom.blogspot.com/2006/10/american-pop-movie-review.html) and [American Dad](http://worldgame.blogspot.com/2005/06/fathers-day.html).Of course not every film nut craves the strictly commercial route.  Documentaries and talking heads are more the diet around here (mostly vegan as well), ever since we killed our television (or went asynchronous, as they say).We killed the land line (POTS), though we're keeping a ghostly DSL going, would bump it up were the stars to align.  I moved grunch.net as a consequence, also have wwwanderers.org to my name, but with no keys to the castle (locked out of the content).  We'll repoint maybe, or recruit a buyer.  I started a thread on the Wanderers list so we might share some groupthink about it.As we're a fairly gray group, aging boomers and beyond, we'd likely be in torch passing mode on this one.   That's an impetus behind these musical events in support of worthy causes.  People are more likely to turn out if they know their donation is toward some greater good, with measurable and verifiable positive consequences presented in an organized manner.Anyway, per whois, I'm the technical contact, registered through Godaddy.  Get in touch if you have questions about wwwanderers.org (the website is frozen in time, scrolls some fun pictures if your browser is up to it).The Internet gives musicians different ways to do outreach and take in.  This Liberty Hall production will span quite a few hours, and so, like Burn Out, will have a word of mouth window.  The real time aspects of social networking kick in when you have enough time to think and make some kind of plan.  A lot of Portlanders have never heard of this place, not far from Way Post.Speaking of local area musicians, I'm thinking about The Good Bye Party.  The last time I saw [Laura Cooper](http://www.myspace.com/bunnylucooper) was [at Hungry Tiger Too](http://blogs.myspace.com/index.cfm?fuseaction=blog.viewcustom&friendId=480007428&blogId=523581959&swapped=true).  Trailblazers were on TV in the other room.  Even [Pete Seeger](http://www.youtube.com/watch?v=pZ5gIhSIcMU) mighta just had [Joan Baez](http://www.youtube.com/watch?v=Pih1hVdflnQ) for a listener.But Lindsey Walker Productions is doing open source music, so the venue becomes a recording studio, sometimes a good one, as the sound effects are not faked.  That's the real ambient sound, coffee shop hubbub, candid banter and dialog.  [Even Quakers](http://blogs.myspace.com/index.cfm?fuseaction=blog.viewcustom&friendId=480007428&blogId=512760471&swapped=true) make noise.Nick Consoletti wanted me to consider [this article](http://raypeat.com/articles/articles/intelligence.shtml) relating stress, metabolism and IQ.  Buckminster Fuller goes by as a reader of W. J. Sidi's writings.David Koski was stressing out about some apparently badly rendered amino acids, then stumbled upon [zwitterions](http://chemistry.about.com/library/weekly/aa080801a.htm), a different way of doing the hydrogen...  anyway, I'm struggling to keep up.[Sam](http://worldgame.blogspot.com/2009/12/math-teaching-in-portland.html) is into amino acids as well, likes this [spherical encoding of information](http://www.codefun.com/index.html).  Maybe David will explain it to me?I'll end with a listing of my speaking engagements, as I think they're worth sharing.  Here I'm cutting and pasting from Microsoft Word into IDLE, just to be arty (and not always churchy).[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh4tqjIlWlhysOD9MVr_1fPN5Re85xE818vOOW4mtENsDD5e2oRtipj-fF6sfXyab-9gqjwb3-mjnVFnN5UhzLNDQLYGHhy6CvfZKle7pdj4_OT8aqBYSvKK5m1-WcvF4wMpJ4L/s1600-h/resume.png)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}