{
  "id": "4584737841600751739",
  "title": "Back on Belmont",
  "published": "2006-12-03T22:22:00.000-08:00",
  "updated": "2006-12-09T15:16:31.583-08:00",
  "content": "Trevor and I stumbled into this new kind of coffee shop on Belmont this afternoon.  No cream or sugar, each cup ground separately, with a lot of attention to precisely which bean.  I mentioned liking a Trader Joe's brand from Yemen.The proprietor said some infrastructure failure, more so than bad weather, argued against importing from Yemen this year, but he often featured African and [Mesopotamian](http://ancienthistory.about.com/library/weekly/aa031903a.htm) samples.  I didn't see Celebes Indonesian either, but I can get that from Coffee Merchant on Hawthorne.Anyway, the point is to have a few good ones, not to try being some [Small World After All](http://www.niehs.nih.gov/kids/lyrics/smworld.htm) everyone to everybody.Then I spilled an OSCON bag load of MITEs (x2 quantity [Cube-Its!](http://worldgame.blogspot.com/2006/11/journey-home.html)), and we played around with 'em, while discussing various subjects.I mentioned working on a Math Wars editorial ([now finished](http://www.4dsolutions.net/ocn/editorial.html)), other projects.Trevor'd been reading up on parasites, told the story of this village of die-hards in Africa, determined to protect their sacred lake from the toxins that'd wipe out last vestiges of [Guinea Worm disease](http://www.google.com/search?hl=en&lr=&q=%22guinea+worm%22+more:for_health_professionals&cx=disease_for_health_professionals&sa=N&oi=coopctx&resnum=0&ct=col3&cd=2).  It's a tough call, prime directive wise, whether to interfere over ethnic resistence from elders.  I suggested a long-running quarantine and/or a mandatory border health screening might've been the way to go, as in \"OK, keep your stupid lake infestation, but don't venture to spread your disease beyond your own local neighborhood\" (shades of [Invasion](http://www.imdb.com/title/tt0460651/)).My policy might not 've been practical though.  I know better than to take my armchair generalizing too seriously.  I have to respect what people on the ground think.  Trevor thought maybe just telling 'em about a dead dog, versus actually using one, woulda been a better way.The stranger to my right, working a laptop, was only half listening, talking to his chum, but chimed in now and then with allusions and references, including this blogged picture of [Pecan Pie](http://www.makezine.com/blog/archive/2006/11/piecosahedron_h.html) from Make:.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}