{
  "id": "114088390455096473",
  "title": "Back in Portland",
  "published": "2006-02-25T09:21:00.000-08:00",
  "updated": "2006-11-15T11:43:53.911-08:00",
  "content": "I had lunch with Dave at the [Bagdad](http://www.mcmenamins.com/index.php?loc=9&id=176) yesterday.  I brought the laptop (Toshiba) and we watched a few minutes of Ryan while waiting for our calzones.  [Ryan](http://humaninbox.blogspot.com/2005/08/ryan.html) is an animated short, an interview with Ryan Larkin, an influential cartoonist who now begs for coins.I also have [Michael Kessler's promo](http://video.google.com/videoplay?docid=491843388827305538) to watch, a DVD.  He's looking for investors on his Common Sense II [project](http://www.mkess.com/csp.shtml).  He's got an uphill battle with his \"eracism\" meme, as that's already used in New Orleans to mean \"erase racism\" (another of [Fuller's goals](http://www.grunch.net/synergetics/terms.html#race)).  For [Michael](http://www.cdbaby.com/cd/mkess), it means \"loyalty to the earth\" (sure, these ideas relate).Also, the \"one world nation\" idea seems too contrived.  As an operational metaphor, I prefer our  \"[giant university](http://worldgame.blogspot.com/2006/02/econ-101.html)\" meme -- a way of looking that works even today, even if our Food Services is somewhat broken (too many starving students).That being said, colorful characters like Kessler are what make our global university vibrant and fun. His example is encouraging, inspiring (Larkin's too). More power to him.Addendum:Well, I had the volume settings up high from our family viewing of two episodes of  [Firefly](http://www.imdb.com/title/tt0303461/) last night, so when I popped in Michael's DVD, the explosion of sound woke Tara and Dawn [outstairs](http://pacificaradioarchives.org/programs/recording.php?recid=7&catid=9). Tara came instairs to watch it with me and we agreed it was pretty well done. Michael is a talented musician. His title is an allusion to [Tom Paine's](http://www.ushistory.org/paine/commonsense/).Speaking of [instairs / outstairs](http://home.earthlink.net/%7Eacorioso/bfi.htm), I also [ordered CDs](http://www.juice-press.com/poetry/AudioBrochure.htm) of [Gene Fowler](http://home.earthlink.net/%7Eacorioso/) reading his own poems. Gene and I have had quite a lot of correspondence over the years. I'm looking forward to listening to these.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}