{
  "id": "2287416309619198261",
  "title": "Back At Work",
  "published": "2015-04-30T22:41:00.001-07:00",
  "updated": "2015-05-01T08:34:07.942-07:00",
  "content": "I had full queues during the conference and the week prior, yet it felt a lot like a vacation, in the sense of so many experiences per minute, a kind of time dilation.  We got a lot done.  Having MySQL move to INNODB as the default engine is not a bad move, but the ripple effects were boat rocking in our little world.  ENGINE = MYISAM solves the problem.  The DBA track uses INNODB anyway.\n\nMy vector today was through Salt Lake City back to PDX.  I dined at Beaches, choosing a Cesar Salad (small) and seafood chowder, both good.  And IPA for a beverage, my standard.\n\nThe TSA folks were really professional in St. Louis.  I had a badass knife in my satchel which I thought was maybe OK, given my ethnic craziness, black Stetson hat (\"gun club\"), Fettuccini Alfredo colored coat.  The TSA pros are thinking WTF and offer I can check the knife instead.  She escorts me out, but first I express regret at tossing the after shave (bought for $1) and they fish that out too.  So polite and well trained.  I checked the knife and came through again, a sweaty mess by this time, so I bought a T-shirt on sale at a concession and voila, good to go.\n\nOn board Delta, I finally discovered the WiFi had free stuff and started watching Maze Runner, but my battery ran out before we did much.  Some poor dude got driven off, then Samsung tablet said good night.  Great machine, no complaints.\n\nHilton was fantastic as well.  Good job St. Louis with that white elephant post Train Age station, Union Station.  Portland has a tiny one, still functional.  Yours was a goliath.  So why not turn it into a destination in its own right, with a DoubleTree by Hilton?  Not a bad idea.  Hard Rock Cafe and everything.  I salute the city planners on this one.  Bold.\n\nSpeaking of bold, City Museum is truly pioneering and I stand in awestruck silence, before diving back in.  I made it down the multi-story slide (from 10th floor the 4th?) only once, whereas my co-workers, young and slim, scampered around the circuit at least thrice.  I squeezed through one of the airplanes and went down a couple other slides, including that \"Monster\" one to the foyer.\n\nCities want to be proud and it hurts when the world sees one as off course.  Baltimore is hurting.  Her Mayor was on CBS this morning and spoke directly and with heart, in my view.  I respect these great cities and what they're trying to do.  Portland is one of them.\n\nI used TriMet back from the airport, the corollary of Metrolink in St. Louis.  Both are highly professional operations.  That doesn't mean I don't have critical thoughts from time to time.  Being a fan of an institution doesn't mean being a mindless zombie.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}