{
  "id": "1971528823326882519",
  "title": "Back to the Races",
  "published": "2022-06-21T17:50:00.000-07:00",
  "updated": "2022-06-23T12:56:48.239-07:00",
  "content": "We were talking in my backyard about curriculum matters, once again.  I'm against making authoritative textbooks be of paper, i.e. I'm publishing in electronic formats that store as energy, but not as wood or as heavy objects in need of boxing and trucking.  \n\nThat doesn't mean I disrespect the collectibles, the classics, in their original non-electronic form.  It's just that textbooks in particular need to be current in their fields and some fields (more than others) are especially volatile.\n\nWhat to include about \"races\"?  The dice get loaded as soon as I substitute \"pseudo genetics\" as that's a finger on the scales, a put down.  \n\nLets establish there's no need for any \"color blindness\" in terms of peoples' skins having literal RGB values, a range of tones.  The technicalities of screen rendering, as with POV-Ray (a ray tracing program) mean attention to detail is rewarded, when it comes to designing screen avatars.\n\nA lot of Sunday School posters go with a Genesis version wherein God is looking for ways to guide His humans in a less punishing, more effective manner.  There's a learning curve, a feedback loop.  Lizard brain acquiring knowledge of good and evil was a real curve ball but the fun and games hadn't ended.  Noah and family took the signs seriously and made the necessary investments in a great ark, leading to their making it through a bottleneck almost as strict as in the Garden of Eden.  Creation Part 2, we could call it.\n\nThe issue, God learned, is groupthink.  Small numbers (say a couple or more) all thinking the same way aren't necessarily sufficiently balanced by those with different experience.  The average of all experiences would be great, but too strong a bias makes for groupthink, a whole school gone down some rabbit hole, a cult, a quagmire (negative terminology).  Who sees all that from the inside though?  Usually it takes the benefit of hindsight to see the dead end, and by then it's too late.\n\nYou see where this is going:  the Tower of Babel.  \n\nThanks to humans starting over with a very low diversity quotient, they immediately started off on a wrongheaded track again:  building some tower to the sky to be closer to God.  \n\nWhat could be more insane, right?\n\nThis time God came back with a far less punishing solution than in earlier testimony, and applied a psychologically healing technique (we can see it this way in retrospect, along with the other course corrections, such as expulsion from the Garden in the first place).  \n\nWhat we call \"the confusion of tongues\" was more like \"putting tongues in their place\" i.e. a demotion of so-called \"rational thought\" (everyone assumes they're rationality personified).  Shoptalk alone, bureaucratese of any flavor, was not going to cut the mustard.  \n\nThe Tower of Babel was having funding problems as the engineers increasingly realized the limitations of physics. How that translated was as increasing entropy in the bureaucracy.  The impossible doesn't happen just because the memos will that it must.\n\nWhy have I digressed into that whole Babel story again?  \n\nBecause this is when the so-called \"races\" dispersed around the globe, no longer held, spellbound, by their glorious plan of action.  That all seemed so meaningless in the rear view mirror.  \n\nHowever, what replaced that doomed project was the growing realization of something rather more miraculous:  that the spaceship was already built and we were already its not so passive passengers (ecosystem co-designers -- with physics still a limitation).  \n\nOur perspective is now more like God needs it to be, for our own sakes.  It's not just \"thinking globally\" but \"thinking cosmically\" (we've long heard from universalists and universities) that's expected of us.\n\nExpected of us by whom though?  Exactly.  No other human that any of us knows.  \n\nThe democratizing aspect of thanking God for one's assets, including one's intelligence, is that one is not thereby compelled to accredit to some human authority or bureaucracy as the source of all one's wealth.  \n\n\"Not of human origin\" is what's written invisibly all over nature, meaning we're free to enjoy it without necessarily giving our peers all the credit.  To some extent, the world happens without the benefit of human management, at least at the superficial level.  Praise Allah.\n\nYou will notice I did not go down the rabbit hole of what exactly are those \"races\" that Noah's family (i.e. wife) begat. \n\nThat whole family tree and the book containing it need not be the anchor for our story, if what we're doing is genetic science.  Humans have not been animal husbanded into certified breeds except by the self appointed.  We're free to ignore their taxonomy.  But that doesn't mean dropping skin color as an adjective.  Pronouns may continue as before.  \n\nMy point is more anthropological:  if you sincerely wish to know where many Texans and/or Floridians got their ideas about race, don't look to anything in the public school curriculum.  \n\nThe private religious academies have been telling the most compelling myths in that department for centuries.  \n\nThe \"races\" are more likely courtesy of your neighborhood religion.  We call that folklore, with no disrespect. The race of giants accepts the right of hobbits to think as they do about supposed subspecies. I'll hazard geeks are less likely than nerds to indulge their concerns about racial taxonomy (as if the patriarchy's latest taxonomy were of great interest).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}