{
  "id": "1148951429855252571",
  "title": "Ban Liposuction?",
  "published": "2009-08-01T19:33:00.000-07:00",
  "updated": "2009-08-07T07:19:14.427-07:00",
  "content": "Some of [us geeks](http://www.flickr.com/photos/17157315@N00/3774309036/) have been thinking it'd make sense for Americans to tighten their belts and forgo any elective  [cosmetic surgeries](http://mybizmo.blogspot.com/2007/11/gym-meditation.html) in a time of war.  Our more ethical ancestors of WW2 vintage would not have disgraced themselves by spending money on vanity, when our brave men and women were being stop lossed overseas, warehoused in high heat, with sand storms, nothing to do except [waste their young lives](http://worldgame.blogspot.com/2005/11/jarhead-movie-review.html).  It's a national tragedy, these occupational forces, far from home and with no obvious mission.  If 100K troops in Iraq is really necessary, then we really shouldn't be all frivolous and [party minded](http://worldgame.blogspot.com/2009/07/toga-party.html) while they're out there.  That's just ugly.  Geeks seem in agreement.People who know how to do nose jobs should be volunteering their services, as many are coming home with broken faces, having been sent there by [power mad neocons](http://worldgame.blogspot.com/2009/07/wanderers-2009729.html) with no relevant training and [no coherent plan](http://controlroom.blogspot.com/2007/02/surge.html) (Wolfowitz for example: not really a \"soldier\" by any stretch of the imagination, nor really all that skilled as a civilian either).Where I ended up on Facebook:  \"I'm thinking of a harmless videogame for soldiers where they watch liposuction candidates float in this lava lamp, get to pop 'em. High desert entertainment. They think maybe this is nixing cosmetic surgeries but there's actually no link.\"Plus maybe call it a \"larva lamp\" instead of a \"lava lamp\"?  Reminds me of [Wall-e](http://worldgame.blogspot.com/2008/06/wall-e-movie-review.html).And from Synergeo:  Troops will like this idea: you get a big fat-ass USAer rotating on your screen, an image of some slob wanting to be less fat, and you \"pop\" her or him, meaning the procedure won't get done, not as long as you're sitting in the desert under the thumb of has-beens with no brains or balls.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}