{
  "id": "6413246058486307477",
  "title": "Barbie (movie review)",
  "published": "2023-07-26T08:10:00.014-07:00",
  "updated": "2023-07-26T12:17:58.402-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53072973249/in/datetaken/)\n\nI at first had problems relating to the target tween, the reputedly sharp-witted and worldly young woman whom I also consider the movie's core target demographic.  \n\nI also saw Hollywood (a proxy funhouse mirror reflection of Corporate America aka USSA) turning itself inside out to meet this protagonist half way. \n\n\"Young LA woman of hispanic heritage (meaning native American, Spanish-colonized) we love you and want to reach out to you, let us be your mother / father / friend\" (big brother).\n\nThen it turned out the Boomer dad in me was supposed to find the young woman's mom more relatable, as she is (a) closer in age and (b) more likely to have played with Barbie in the golden age of same.  \n\nIt turns out the mom has been playing with stereotypical Barbie while having dark thoughts, not the least of which stem from having an ostensibly unloving daughter (the one I started out having problems with).\n\nI realized part of my issue with the daughter tween was she had the reputation among her peers for being the razor sharp class forensics champion i.e. she was the leader of the debating team, so to speak, and Barbie didn't have a chance against her. \n\nShe was competition in other words. I wanted her to debate me. I'd show her I wasn't defenseless.\n\nBarbie, on the other hand, walked right into a knife fight not knowing she was in way over her head, and was emotionally injured. The tween was able to identify her target complex and aim directly, by calling Barbie a fascist. That really hurt, causing ripples in the space-time continuum.  Even Mattel could feel it, like a punch in the gut.\n\nKen, in the meantime, has been deprived of fatherhood opportunities all this time. What critics don't remark on much is that Barbie World is devoid of children and babies, and of grandparents. That would entail a Pregnant Barbie, pointedly discontinued. \n\nBarbie Land is a world wherein inter-generational communication no longer has to take place.  Shades of Logan's Run. \n\nStereotypical Barbie starts to get more of the culture's oral tradition at least, when encountering Weird Barbie. Her immersion in the real world is getting more edgy, more adult.\n\nKen discovers patriarchy in LA, which in this day and age is likewise gay culture, with what looks like a lot of Village People singing macho, macho man. Around the ticklish conundrum \"it's gay to be manly\" is where this movie most enjoys goofing off.\n\nThe movie is satirizing the glamorized Chippendales male figure that women might hope to find in strip clubs. Except these Barbies are not into that. Their lust switch is turned off (by design). \n\nThey're into power and administration (ironically) and, up to the end of the film, we see Barbie has yet to be a fully adequate partner for Ken. She doesn't find Ken attractive hormonally. \n\nWhat's a guy to do, when the babes don't wanna be wowed or wooed?  \n\nThe all-Ken Kendom is still pent-up and gay, without a mature connection with the Barbies. She's not yet a real mom either. Barbie is a puppet Pinocchio at first, lying if she says she's fully human. She's a bot, a phony.\n\nLater, a wiser Barbie gets a talking to by the Ruth Bader Ginsberg like character, but somewhat off camera.  From a spectator angle, we're not privy to any complete \"working out\" of life. There's no grand resolution, more just a framing of the problems (which is half the battle).\n\nWe learn more respect for elders, meaning empathy for them as earlier versions of ourselves. The daughter realizes her mother is on the same side, fighting the same fight, against the unrealistic expectations and demands associated with stereotypical beauty and unattainable cultural idealizations.  \n\nAn everyday human, trying too hard to be a perfect Barbie and/or Ken doll, might do some ego-damage, thereby subverting the very self-esteem objectives this product line seeks to achieve.  \n\nWhy not just do an \"ordinary girl\" Barbie, less statuesque? The movie plays with these options, reflecting its audience more directly, giving glimpses.\n\nI know working class hero Krystal Ball hated this film (Saager found it more entertaining) for being little kid inappropriate. Maybe so. However tweens are very worldly these days, watching the adults fight over whether they should get to be around adult fairies (mostly harmless) or whatever. \n\nIf Freud taught us anything, it's that children self-sexualize without much need of adult help i.e. the idea that adults are in charge of some on and off button is a bit self aggrandizing. \n\nMany children develop an early aversion to being \"treated like children\" whereas others adore such treatment and hope it continues indefinitely. Our target tween is in the former category. She sees her mom as babying her, being condescending, versus having an adult need for friendship and affection.\n\nBarbie is for mature PG-13 year olds in the same way the Joss Whedon stuff is, with Buffy the Vampire Slayer and even more appropriately, Dollhouse on the family television.\n\nI found Ken's journey into patriarchy (\"I wasn't so into it once I found out it wasn't really about horses\") truly hilarious. I had a good time with this film. I don't usually go for musicals, but I'll make this an exception.\n\nThe mother-daughter tension in this movie reminded me of what was going on in Everything Everywhere All at Once (EEAO).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}