{
  "id": "1615826232623964325",
  "title": "BarCamp 4",
  "published": "2010-10-24T16:33:00.000-07:00",
  "updated": "2014-06-05T00:01:33.770-07:00",
  "content": ":: barcamp 4 @ eliot center ::\n\nI woke up with the sense of gentle tendrils pulling me downtown.  I'd need to go on my bicycle, in the rain, to keep it a pure experience.  I blundered about the house, scarcely believing I was going to an event I'd only just tuned in the night before.  What better time though?  Better than staying home and being sick.\n\nThe registrars and Eliot Center management were most gracious in allowing me to wheel the bicycle into an unused classroom.  I'd forgotten my keys at the house, so couldn't lock it to a post. Bicycles do get stolen around here.\n\nNot everyone is interested in stratifying by age, drawing attention to the obvious demographic pyramid, with a broad base of young geeks in their 20s and 30s, with a dwindling number towards the peak.  Ward Cunningham wanted to explicitly address the span of generations and have us interact cross-generationally.  We were \"young\" if we considered HTML a first language, \"old\" if we'd ever programmed an Apple 2e. \n\nA lot of us were a lot older than that.  When we got a show of hands as to who'd ever used punch cards, not only did several go up (including mine), but a gent in the corner actually produced one, passed it around for show & tell purposes.  For the most part, Ward got us to sit facing one another in two groups, the so-called old and the so-called young.  Some oldsters preferred to mingle with the more youthful however, but no one really cared.\n\nKeith Lofstram's ServerSky talk has progressed since I first tuned it in at Wanderers (at the Pauling House). He imagines relieving Earthian power grids from needing to fuel data centers, by moving this capability into orbit. His brand of science fiction features solar panels thinner than paper and steerable by light pressure alone. He's pretty \"out there\" and BarCamp is the perfect place for such speculation. Just working through some numbers on power demands, energy sources, in big picture terms, is plenty edifying. The basic thermodynamics of the solar system come across as more intelligible if cast in terms of a long term story wherein humanity plays a role.\n\nOn my lunch break I headed over to the library and read some collected essays by Richard Stallman.  If there's an elder statesman for Geek Nation, he'd be the guy.  Without free software and a willingness to question the ethics of those who make helping one's neighbor illegal, we would have no assets to boast of.\n\nAfter lunch, I sat in on a discussion of Haiku, a reincarnation of BeOS.  Is it going anywhere. Having diverse operating systems represents a well spring of ideas and feeds those hungry to do original, ground-breaking work.\n\nThe workshop on Brain Meds was interesting, mostly a litany of warnings to just stay away from most modern \"crazy meds\", especially the anti-psychotics.  However, the discussion was nuanced and delved into related medical topics such as sexual dysfunctions, insurance, generic versus brand name.  The two girls leading the talk had medical diagnoses that were covered by insurance.  One researches and writes for a blog on this very topic.  \n\nFree beer followed, courtesy of Widmer.\n\nDid you know that generics can be plus or minus 20% the dosage of a name brand and that's OK with the FDA?  The advice was to stick with a known manufacturer, once you found a right dosage, or you could be in for a nasty surprise when switched by insurance to a supposed equivalent.  \n\nI was glad to see geeks taking responsibility for sharing about such personal matters in a frank, no nonsense style.  Most television and politicians are relatively gutless.  There might have been some extra nervousness in the room as a result of taking on these topics, however Portland BarCamps are nothing if not experimental and cutting edge.\n\nIgal's Train Porn was one of the most interesting.  I'd been fascinated by trains as a kid.  Dad and I had an HO scale train set when I was still in the single digits.  I'd also had the good fortune to ride many a funicular and even a few cog railways in Europe.  North America has fewer of these. I'd never seen that wild 1950s way people got to Timberline Lodge before the newer highway was built.  A bus suspended from tension lines and using its on-board power to \"fly\" over the snow, ascending 2100 feet in 10 minutes.\n\nSpeaking of the Pauling House (where Wanderers meet), my science fiction about bringing it into the Unilever fold have so far proved unsuccessful, were never on Terry's radar to begin with I don't think.  Besides, what would an Anglo-Dutch conglomerate want with such an asset?  The company is already holding other property just a few blocks away, so why be redundant?\n\nWhich reminds me... one of the young geeks had a \"Silicon Forest\" tag on his BarCamp badge.  He spoke knowledgeably of the history, shared the lore.  He knew quite a bit about Doug Strain, but hadn't connected him to Linus Pauling.  I filled in some of those details for him.\n\nI also met another rad math teacher type, Tom Henderson, espousing [Punk Mathematics](http://punkmathematics.com/). Perhaps we'll collaborate as time goes by (as the world turns).  InshaAllah.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}