{
  "id": "4346472978502355126",
  "title": "Beating the Heat",
  "published": "2009-07-28T20:47:00.000-07:00",
  "updated": "2009-07-28T22:32:54.276-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/3766532841/)Those of you following PNW weather (means you probably live here; PNW = Pacific Northwest), know we're experiencing some record highs.  Like tonight will supposedly be the hottest on record, in failing to fall below 75 degrees Fahrenheit.  What makes Portland bearable in summer are the really cool evenings, so these ultra dog days have a way of sapping our will to live.For my part, I finally got that haircut, from a new establishment on Hawthorne recommended by Glenn.  I'd let it puff out, getting into wolverine territory (in my own mind anyway), a somewhat idiotic doo for triple digit heat (note that I'm not using Celcius here).  Real dogs shed, or their owners give 'em buzz cuts.  Being my own owner in this case, I thought it was time.Another strategy was to swap in Pauling House in place of Cubespace, as a co-working zone.  Of course this is less than ideal, as it takes keys to get in, but I'm a sucker for air conditioning... and coworkers.Dr. DiNucci was already there when I arrived.  We gabbed about \"[passing the torch](http://controlroom.blogspot.com/2009/07/passing-torch.html)\" issues, much on my mind.  He's had experience running groups, had dharmas to share.  Not long after he left, our president Terry Bristol showed up, eager to test the new little external hard drive he'd ordered.  He's working with Jeff on some projects, filled me in on some grand schemes.In addition to his \"booze 'n schmooze\" programming (a kind of Wanderers writ large), Terry is developing some ideas around conferences, all with a focus of building Portland's reputation as a City that Works (civic pride runs high around ISEPP, as we know we've got talented people, and that's really what one needs).Fred Meyer, on the other hand (see below), works pretty well for public coworking.  Show up with your laptops and start making those plans, cast your \"away teams\", spin off your committees.  If you're used to hanging out around Quakers, you've already got 350 years worth of templates and processes (no, not \"[Robert's rules](http://www.robertsrules.com/)\"), so might as well use 'em.So what was I coworking on, between conversations?  I'm focusing on [the Wittrs group](http://groups.google.com/group/Wittrs) a lot, connecting dots for the Wittgenstein people, also [on math-teach](http://mathforum.org/kb/message.jspa?messageID=6797080&tstart=0), a standard stop on my beat.  The Free Skool meeting I'd planned to attend had to go on the back burner.  I met [with Trevor](http://www.flickr.com/photos/17157315@N00/3767629224/) instead, about some new finds, [another talent](http://www.flickr.com/photos/17157315@N00/3767629618/in/photostream/).  He told me about a new Bucky book, some anthology with stories culled from the archive.  He liked the posting about the nuts and bolts of the archive itself, but found the rest of low caliber, [his own scholarship](http://www.synchronofile.com/) far better.  Based on his review, I'll likely shelve reading it for awhile, maybe wait for an airplane trip.  One thing he did like learning:  the name of he who'd invented \"Dymaxion\" for Bucky, a detail he'd long wondered after.I've also been in this Jungian meditation about egos, what goes on when they have an encounter.  An ego is like an API to much deeper complexes (saying \"complex\" with no hint of \"dysfunctional\" -- some are just what the doctor ordered).  Artists tend to be more aware of this and are able to amp up the bandwidth, intuit APIs like Spock does on Star Trek.  He always seems to know what buttons to press, even when the instruction book is in Klingon (the universal translator is never explained, but that alone would explain the high living standards on that show, humans mostly at peace among themselves, just fighting for their lives against Martians, or whatever ETs).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}