{
  "id": "6793119141931752197",
  "title": "Beer Note",
  "published": "2008-02-10T12:04:00.000-08:00",
  "updated": "2009-02-23T04:49:10.247-08:00",
  "content": "I'll cop to sipping a beer yesterday, I believe my first since [Vilnius](http://controlroom.blogspot.com/2007/12/weight-loss.html), where I took some vows (which I didn't exactly break, but one could see a slippery slope here).  Hey, the bottle had Frank Zappa on it, whose music I'll write some more about below.Yes, I think [Valley Girl](http://history.sandiego.edu/GEN/snd/valleygirl.html) is somewhat mean spirited, but then note he recruited a real pro VG speaker (his 14 year old, Moon), to give it some punch, which is what makes it art more than infantile dissing.  He's part of a conspiracy to help kids keep from turning out empty-headed, always distressing when it happens, especially to one's self.  In other words, one sister to another, read a few books (like [Idiocracy](http://www.imdb.com/title/tt0387808/) in that way).On the car trip to/from [LA](http://mybizmo.blogspot.com/2007/12/whittier-usa.html), Tara and I mostly didn't overlap on Zappa.  We blared through the car speakers, using that [Belkin gizmo](http://worldgame.blogspot.com/2007/04/taxes.html), so mutual agreement was important, and turns out there was plenty we could both enjoy, like that [Hate Me guy](http://en.wikipedia.org/wiki/Blue_October), and Sheryl Crow.  She finds some of my  Laurie Anderson stuff somewhat terrifying, but not unlistenable.  I've got two from [Britney](http://video.aol.com/video-detail/britney-spears-piece-of-me/3812747185) she's OK with, if not my [raving](http://worldgame.blogspot.com/2006/01/more-music-millenium-notes.html) about (don't get me started).Anyway, it was pretty good beer, I forget the brand, will maybe ask [Stacy](http://www.brewedgirl.com/) if she knows.  Heading out for [Lipton](http://worldgame.blogspot.com/2006/11/artifact.html) ice tea next, because \"good for your karma\" according to the beneficiary (and she's right).  Then it's time to stalk the lonely Tinkerbell (I left her for fixin', but that was awhile back).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}