{
  "id": "7475085080271575314",
  "title": "Bible Stories",
  "published": "2017-01-20T21:10:00.000-08:00",
  "updated": "2017-02-05T13:20:47.508-08:00",
  "content": "[ originally [a comment](http://www.quakerquaker.org/forum/topics/do-quakers-believe-in-continuing-revelation?commentId=2360685%3AComment%3A150463) on QuakerQuaker, new improved ]\n\nThank you Paul.\n\nThe story of Noah feeds into the Tower of \nBabel story, as the uniformity / conformity of thought enjoyed by the \nGreat Flood survivors was a consequence of their starting over with a \nblank slate so to speak. Noah and Mrs. Noah were the new Adam & Eve.\n\nWhat humans did not understand owing to their lack of diversity in \nthought, was that their Promised Land is a ball, a sphere, a planet. A \nlot of them still have some trouble with that concept in 2017. It's not a\n closed system in any thermodynamic sense. A star (the campus fusion \nfurnace) feeds us energy for free, the basis for ongoing cell division \nand our daily bread.\n\nNoah's descendants were at first under the misapprehension that they \nlived on some horizontal XY plane to infinity, with \"God above\" in the \nperpendicular Z direction (Z is for Zeus?). What better way to reach God and make a name \nfor themselves as a superpower than through the construction of some \nhumongous, homogenous skyscraper?\n\nThis seemed like normal thinking to them, so great was their confusion already (Babel and babble connect in Hebrew as well [1]).\n\nGod knew that a single culture with a single-minded approach would \nthink nothing impossible or unrealistic about their foolish skyscraper \nplan. No \"new Noah\" would arise to prophesy this was madness, because \nthey all thought the same way. Besides, had God resorted to another \nflood (having promised not to do so) He'd be facing this same \npredicament in a few generations.\n\nGod understood that diversity in thought patterns would guarantee that\n people spread out and around, and come to terms with their being on a \nspherical spaceship (an Ark, likewise once our Eden).\n\nIn his mercy He gave us the humanity we have today: diverse, spread \naround, and not organized under one uni-polar pyramid hierarchy. No \nsuperpowers here folks, just a lot of feedback mechanisms connecting \nhominids by means of various networks, religious, political, economic. \nDon't think of your skyscrapers as containing some single-minded \nilluminati caste that all speaks the same language.  There is no \"global\n civilization\" that traces back to some singular inner circle, much as \nsome cabals would love you to think so.\n\n[1] [http://www.christianbiblereference.org/story_TowerOfBabel.htm](http://www.christianbiblereference.org/story_TowerOfBabel.htm)\n\n[](https://www.flickr.com/photos/kirbyurner/3483595185/in/photolist-6iQktX)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}