{
  "id": "70435612428677509",
  "title": "Bicameral Mind (Wanderers Presentation)",
  "published": "2017-03-21T19:34:00.001-07:00",
  "updated": "2017-03-22T12:15:30.834-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/33582843665/in/dateposted-public/)\n\nKarja has put together a complex theory on the rise of order, fitting right in to Wanderers as an \"out there\" coven of space case cosmologists. Can you say \"multi-dimensional\"?\n\nWe have a packed house. Lake Coffee developed in micro-time. I recognize Karja as a non-linearist (we've met before) so didn't mind cleaning it up, using a forest of paper towels. Paul Bunyan R Us.\n\nThat Lake Coffee was in the tiny kitchen with no cooking surfaces (microwave).  I'm told the original design featured a dumb waiter (like an elevator) to the larger kitchen in the basement.\n\nThe Steve Crouch coffee maker is a really good one, maybe the best we've had (grinds its own) but has more moving parts than we're used to, plus other idiosyncrasies.  A learning curve. \n\nAfter dealing with coffee station cleanup, I took a far back chair, to blog in real time on my Android. I added polishing touches from the home office later on.\n\nI spoke with Patrick about my [Code School the New High School](https://medium.com/@kirbyurner/is-code-school-the-new-high-school-30a8874170b) posting, a sleeper for now. I was at PDX Code Guild again last night, for Flying Circus.\n\nKarja's theory is strongly into a vocabulary around gender, and how that maps to brain wiring in the human form. That's where the bicameral mind fits in, per Julian Jaynes -- saw him at Princeton -- which I take more as a generic acknowledgement of plasticity in brain wiring over geological time. The details may never be known.\n\nCertainly the software changes a lot, and now is abetted by literal software, which I meant metaphorically in the first clause.\n\nRhett Savage is here. That's exotic.  Great to have all these engaged \"sovereign individuals\" (another theme of the talk).\n\nBattery is getting low on the cell phone, as I blog the talk live.\n\nDon is talking about keyboards, echoing some code school themes. Karja is refocusing on the bigger picture.\n\nNew people keep arriving.\n\nShe's pretty cogent I think in her critique of Borg Planet. Wanderers are not polite necessarily, rude Americans. On the other hand we're here to discuss. She handles herself well in shark-infested waters, so I wasn't in cringe mode watching some ego get eaten.\n\nMasculinity is the ordering principle... sounds like Apollo (or was it Mars?).\n\nI won't be doing full justice to Karja's theory here. Maybe a studio around town will make us a Youtube.\n\nShe has an interesting take on Instagram; I'm tempted to add it to my inventory of active apps.\n\nI'd say she's in the same \"final exam\" ballpark as R. B. Fuller, and likewise looks to \"the computer\" with hope more than dread.\n\nShe has an interesting take on corporate personhood, if we wanna call it that. #piyemor. Karja sees evidence of active sentience in the cell-silicon whole, distinct from humans. New pattern integrities, more like angels. Digital sentiences. Very Kurzweil in some ways.\n\nWe're all thinking about Buzz a lot.  We miss his soothing radio voice.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}