{
  "id": "8879050616663661488",
  "title": "Big Sur (movie review)",
  "published": "2018-03-05T23:09:00.000-08:00",
  "updated": "2018-03-05T23:09:22.309-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/26774097688/in/dateposted-public/)\n\nGlenn rented this one from Multnomah Public Library. He'd read some Kerouac novels and grew up in the same generation, more or less.  Jack was a pack leader, of the Beat Generation, but feels ambivalent in his role.\n\nGlenn recognized City Lights Books as iconic and said the real one was bigger than the one in the movie.  He pulled out a book he'd procured there.\n\nMostly it's a movie about alcohol and its potentially devastating impact on many lives, extending well beyond the drinker's. The movie is also about truth-telling and keeping it real.  The characters care about one another, they're just not sure how to express it.\n\nHere's poor old Jack in what we might call a utopia, a cozy cabin at Big Sur, friendly supporters, and with a dream girl and her beautiful son. She's eager to be his life-long companion, and yet he's suicidal and in hell.\n\nViewer jealousy may be forgiven, but must Jack really suffer that much?  What were his sins that he cannot enjoy his own fame and fortune?\n\nThese beatniks were too undisciplined, drinking while driving, forgetting to make plans.\n\nI understand they needed to escape an overly constraining, fiercely racist environment, and that the psychological cost of alienation was an occupational hazard.  Wavey Gravy, another beat poet, did a better job transitioning.\n\nThe youthful rebellion gathered momentum, and by the hippie days was more self-defining.  Or was it?  Jack Kerouac transitions to Ken Kesey and the Grateful Dead.\n\nThe hippie era was somewhat less blighted by alcohol perhaps, in that the hip cool thing was to explore psychedelics, which have different side effects. This movie doesn't need to tackle the subject of entheogens.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}