{
  "id": "5503175225812346987",
  "title": "Big Picture",
  "published": "2013-03-02T13:16:00.003-08:00",
  "updated": "2013-03-02T13:51:18.667-08:00",
  "content": "I devoted some time at the AFSC meeting to catch up on some pieces of the Wikileaks story.  Truthout had [the translated interview](http://www.truth-out.org/news/item/14835-resistance-from-a-cage-julian-assange-speaks-to-norwegian-journalist-eirik-vold) from a Norwegian source, while The Guardian had something [like a transcript](http://www.guardian.co.uk/world/2013/mar/01/bradley-manning-wikileaks-statement-full-text) of Bradley Manning's testimony.\n\nEarlier, after lunch, we met the assistant director of the Western Region (the director is in Spain) to go over some programs.  Many of the region's executive committee were present as well.  Cruel and inhumane practices by the prisons (e.g. solitary confinement), for-profit prisons, and immigration reform topped the agenda.\n\nPer the Christian Doctrine of Discovery, the practice of simply \"declaring\" lands to be \"US\" by \"[annexation](http://mybizmo.blogspot.com/2006/07/deq.html)\" and/or by \"buying\" such lands (Manhattan, Louisiana Purchase) has created a sense of entitlement over all of North America, by those ethnic groups most benefiting from these narratives.\n\nThe seasonal migration of peoples, a pattern for millennia, was interrupted by the imposition of \"states\" and/or \"territories\" as institutional jurisdictions.  [Cultural genocide](http://worldgame.blogspot.com/2013/03/from-afsc-corporation-meeting.html) ensued.  The US Army was a leading exponent of this land grab during the so-called Indian Wars.  A bounty was placed on \"red skins\" (hides, scalps).  Extermination was encouraged.\n\nThe UK-based idea of \"countries\" (the districts of its empire), inheriting from the idea of \"[sovereignties](http://grunch.net/archives/64)\" (a civilizational pattern) helped solidify a sense of \"ours\" among those inheriting this namespace or ideology (a brand of science fiction).\n\nFences went up everywhere, as in Europe.  The land was carved into \"properties\".\n\nA sense of \"manifest destiny\" continues to inform various ethnic groups, many of whom see the entire globe (and beyond) as theirs to rule and administer.  As controllers of \"documents\" they brand fellow humans \"undocumented\" and forcibly incarcerate and deport them.  Religion is often used as a justification.  According to many belief systems, someone called \"the Lord\" (a kind of superman landlord) has authorized / ordained that those faithful to Him should lord it over (have \"dominion\" over) others.\n\nThe labor intensive nature of colonizing North, Central and South America by the Euros fed the infamous [slave trade](http://worldgame.blogspot.com/2012/10/revisiting-slavery.html).  Various doctrines were advanced to justify this practice among those who professed faithfulness to their Lord.  Some were unconvinced by these doctrines however and ideological schisms appeared.  This led to [the US Civil War](http://worldgame.blogspot.com/2012/11/lincoln-movie-review.html) which continues to have repercussions.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}