{
  "id": "2152434853162793207",
  "title": "Bizmos Meet T4P",
  "published": "2018-09-28T14:09:00.000-07:00",
  "updated": "2018-09-28T14:22:05.351-07:00",
  "content": "Some of you may have realized that a fleet of bizmos (business mobiles) and a fleet of trucks, might serve in complementary capacities.  The bizmos need to pave the way for our citizen diplomats by visiting truck stops and talking up the program.\n\nSoon:  drivers and their apprentices will be coming through here, from faraway lands.  Some will be homesick.  We're not trying to make them suffer unnecessarily.  Perhaps we have movies in their native language?\n\nRemember, the standard bizmo comes with an ability to download an image from the cloud, your image, such that, as a driver or crew, you get to pick up where you left off, with customization.  Your favorite music, language tapes, even screen savers, are all on tap.  A lot of trucks work the same way.\n\nSometimes we'll be using bizmos to transport drivers from one route to another.  You've finished your segment from that Chinese city to Pakistan.  Now we'll let your relax and talk with others while we take you to a next assignment.  Yes, like a taxi, but sometimes we need more bells and whistles.\n\nAs a bizmo fleet training supervisor, I might help orient new crews to their vehicles, in the process of sketching the program.  We could train up and down I-5, or I-95, before sending more seasoned crews to more challenging assignments in Asia or Africa.  Likewise, we're receiving drivers from those faraway locations and want to show them the lay of the land.\n\nOrientation is the name of the game in a lot of contexts.  Do that right, and you have happy campers, up to the challenge.  Skip that step, or do it incorrectly, and you're inviting a lot of frustration, on the part of the insufficiently oriented.\n\nI've enjoyed committing to the \"boot track\" for this program i.e. crafting some blueprints.\n\n[T4P == Truckers for Peace](http://worldgame.blogspot.com/2018/05/truckers-for-peace.html).  You can read more about that in my blogs and on Medium.  Or visit a truck stop near you.  Look for us.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}