{
  "id": "5043519765896654898",
  "title": "BizMotica",
  "published": "2011-07-30T18:11:00.001-07:00",
  "updated": "2022-12-29T18:42:36.340-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157627320573000)\n\n:: hb2u lw ::\n\nOne of our staffers left her computer / bag aboard the Max from the airport (Red Line).  Honest Oregonians disturbed it not, and it joined a gated community facility, a forlorn kind of Toy Story place where many lonely toys are not found.  This bag was though:  I retrieved it in the \"escape pod\" Lindsey used to eject from the State of Georgia (her birthday today, having a small dinner party, Melody our cook).  \n\nMy route was from [the marina](http://dir.groups.yahoo.com/group/WittrsEX/message/4576) adjacent PDX down Columbia Blvd to Lombard, into St. John's, over to Hwy. 30 past Sauvie Island to Cornelius Pass, up into Jenkins/158th area, near the Costco. Same way back.  Quite a good drive.  The Nissan Maxima, performed well.  Lots of building going on.  Intel expanding etc.  Yet lots of rolling countryside, lots of farms.\n\nWe saw them all off at the Max again this morning, bound for divergent destinations.  Staff is spread out.  Sebastopol was like a northern border with Russia in the early days, with Hispanic mission based culture coming up from the south.  The Bay Area was a center of contention.  Fun history to know, if you think of that Russian Imperial Museum in Minneapolis, housed in a mission-style building.  What does it all mean?\n\nI shared some some history too, learned from Les ([CIO](http://coffeeshopsnet.blogspot.com/2010/11/happy-thanksgiving.html)) about those bad ass Haida, and the Hudson Bay Company's response:  to import lots of Hawaiian muscle to keep pushing a lucrative fur trade.  \n\nThose Euros couldn't get enough furs, having already managed their property unsustainably.  The [Doctrine of Discovery](http://controlroom.blogspot.com/2010/03/wanderers-2010316.html) allowed for title transfer into church holdings, of vast tracts of valuable land.  Much of this was protected by a lay populace of faithful, willing to champion their ethnicity in a kind of zero sum game. \n\nAnyway, Hawaiian names decorate the coastal areas, [Camano Island](http://controlroom.blogspot.com/2008/07/touring-facilities.html) for example.\n\nDignity Village was on the itinerary again, this time from the marina, not the airport. I refer to it as \"[Epcot West](http://worldgame.blogspot.com/2009/01/metropolitan-talk.html)\", America's best futuristic thinking on display.\n\nLater, I played some [Idiocracy again](http://worldgame.blogspot.com/2007/04/idiocracy-movie-review.html), while picking up the living room, dusting and so forth.  I even changed where I hung some of the pictures.  OSCON has clearly changed my mind in some ways.  That's what circuses do sometimes:  they expand one's idea of what's possible, by showing one freaks and geeks of various types, in a fun house of [crazy-making mirrors](http://mail.python.org/pipermail/edu-sig/2011-August/010410.html).\n\n[](http://www.flickr.com/photos/61451741@N02/6149070419/)\nclick for author's photostream",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}