{
  "id": "8938375206216043312",
  "title": "Black Mirror Episode?",
  "published": "2019-04-27T10:57:00.002-07:00",
  "updated": "2019-04-27T10:57:57.297-07:00",
  "content": "Magnitsky died in a\n Russian prison being held on charges relating to working for this UK \noligarch who was originally Putin's fan but later claims to be his \ngreatest enemy. We all heard a lot about Magnitsky when that famous \nTrump Tower meeting with the Russian \nlobbyist occurred. She was not there to talk dirt on Hillary and \neveryone got super bored, as oligarch squabbles over big money and \nreputation backstabbing are too ordinary in those circles, where \nsyndicates demonize one another incessantly (Hollywood is more friendly?\n  Maybe all that Scientology is working for some?).Browder\n says his lawyer was clubbed to death while chained to his death bed in \nprison, by the very people Magnitsky was accusing of financial fraud, as\n Browder's legal representative, or lawyer.  But then there's a \ncounter-narrative which is what makes this a rabbit hole, somewhat by \ndefinition (a vortex of contesting stories converging towards the same \ntruths).We heard about Browder again when Putin and\n Trump met in privacy in Helsinki and Putin offered to help out with the\n Mueller indictment of the GRU guys, in exchange for some interviews \nwith Browder.  No one would be in custody or under immediate threat of \nextradition.  Maybe I'm wrong about the details of Putin's \nstatesman-like offer (there's a treaty about nations giving each other \nmutual support in criminal investigations), as I was not privy to the \nmeeting and back then had not yet connected the dots between Browder and\n Magnitsky.  Trump comes out of the meeting saying this could work, \nprobably knowing less about Browder (or Magnitsky) than I do at this \npoint.  Too boring.  But he's soon told that Browder is Putin's number \none foe and it all clicks into place.  Who knows.Anyway,\n fascinating stuff.  The Magnitsky Act sails through Congress on the \nbasis of this compelling testimony from Browder, and becomes the \nconvenient hammer, the justification needed, to turn the screws \neverywhere on the Axis of Evil, always shifting (remember BRIC?), based \non whatever the public will believe. The public is infinitely gullible \nand has rarely applied the brakes.  Now that more of the public is being\n coerced into homelessness and unforgiving debt, the political model is \nto drop them from the unemployment roles and make counting their votes \nharder, as your tent on the sidewalk is not a registered voter address, \nby definition.  Problem solved re that democracy business, a pipe dream.\n  Back to the oligarch infighting channel, the one we most love to \nsponsor.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}