{
  "id": "5074408299715976788",
  "title": "Bleepography",
  "published": "2008-02-24T18:38:00.000-08:00",
  "updated": "2008-02-26T06:09:19.970-08:00",
  "content": "Bleepography is that branch of ethnography in which we study one culture's ability to and/or criteria for censoring or otherwise denying self expression to another.I'm not saying such dominance is always bad.For example, older adults do tend to direct (control) youthful behavior, and there's often a protective, survival instinct at work, on behalf of the youth.Protective parenting is not an \"anything goes\" standard in most ethnicities, at least not those in at-all challenging circumstances (which'd be most of 'em).What's especially difficult is sudden translation, through immigration, to new sets of circumstances.Such transplants may leave families way overprotective in some dimensions, insufficiently defensive in others, setting up intergenerational tensions as a next generation adapts in ways not always so available, or even comprehensible, to the one previous.Anyway, just to take an example of an investigation in bleepography, I was recently watching some [Katt Williams](http://www.kattwilliams.com/), a standup comic, in performances recorded to DVR.Lo and behold, somewhere along the way, some dominant culture control freak had managed to go crazy with the bleeping.  In some passages, almost every third word was occluded by this highly obnoxious audio blocking technique (the counterpart to \"blacking out\" in print media).I was so grateful to not have to put up with this kind of dumbing down for long, thanks to easily rented copies not subject to the same rules of censorship.If freedom means anything, it means the freedom to not have one's tastes dictated by some anonymous bleeper, some privileged adult in some other space and time, with the power to enforce whatever screwball ethnic standards.Another story I heard recently:  a teacher reprimanded by school authorities for assigning Ray Bradbury's Fahrenheit 451 in English class -- not an approved reading.  Plus note many public schools are blocking YouTube, denying access even to teachers wishing to project during class.Leaving home, going to school, represents a big downward step to a lower level of information access in so many cases, given the Internet.  School becomes a sanitized playpen, a sandbox, prefiguring future corporate big brother [cube farms](http://controlroom.blogspot.com/2007/06/personal-workspace.html) (not all of which are equally [illiberal](http://mybizmo.blogspot.com/2007/10/social-hour.html), praise Allah).In the old days, parents kept junior home for fear of exposing her or him to too many [alien notions](http://www.4dsolutions.net/ocn/alien.html).  These days, maybe it's because junior has done nothing to deserve prison, at so young and tender an age.Curiosity deserves to be [rewarded](http://controlroom.blogspot.com/2006/07/math-makeover-ad.html), not treated as a threat by insecure powers that be.  Cultures that can't deal with curious humans are among those least likely to succeed over the long haul.History is chock-o-block with anomalous cultures to which, happily, my family has never been overly subjected.  I give the USA's secularism a lot of credit for this, as religions, left to their own devices, tend to lapse into bitter warfare, try to shut each other down willy nilly.[Secularism](http://mybizmo.blogspot.com/2006/11/about-secularism.html) means keeping the public ways open to the public, not siding with any one faction in some effort to take over and put down, and not depending on enlightened ecumenists for what should be one of our government's built-in defensive functions, per founding designs.Anyway, let's hope it stays this way -- [InshaAllah](http://en.wikipedia.org/wiki/Insha%27Allah) as we say in [Liberal Islamic](http://controlroom.blogspot.com/2007/08/liberal-islam.html) (note [CamelCase](http://en.wikipedia.org/wiki/Camelcase)).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}