{
  "id": "5351768408659181191",
  "title": "Bookkeeping",
  "published": "2016-09-27T12:34:00.001-07:00",
  "updated": "2016-09-28T23:35:12.276-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/29820847352/in/dateposted-public/)\n\nI can't make a ton of money without being a hypocrite. However I can commit the back office, the Centurylink / Prism room, to serving nonprofits, as a nonprofit that pays its share of expenses, especially telecomm.  That I make a meager income is tolerated, actually welcomed, as that keeps it simple.\n\nAs a trainer, I pop up, all paid for, and deliver the Python3 or whatever.  Python3 is more an ecosystem than just the one language, what with JavaScript, SQL, noSQL and all the rest of it.  Not that everyone is into web dev.  We've got Jupyter Notebooks, we've got SciPy.\n\nI'm a big believer in institutional wealth.  I feel pampered on a big Boeing, or an Airbus, without owning stock in the company, let alone a slice of the jet.  Sailors on big Navy ships are proud of what they pilot, but it's not like any might claim title in the purely landlordist sense, not even an Admiral.  That's why I go with \"military socialism\" as an apropos model, of what the \"bases economy\" (a kind of \"centers network\") portends.\n\nThat's how I got my trips to Lithuania and Gothenberg:  they were paid for by sponsors, not as income to me but as an expense of doing business on their part.  My flying on an airplane somewhere is not necessarily \"income\" any more than shipping a book.  I'm an office supply.  Don't even send me the transaction, as it doesn't have to go through my bookkeeping at all.  Or send me some record if you like, it's not like I don't like to scrap book.\n\nI'm happy here in Portland for the time being however, though close family stay high on my list and I'm not bed-bound or anything.  I have a current passport.  This is \"back to school\" season and I'm on the hook to deliver, lets put it that way.  Carol is here.  I'm her driver.  Lots of good reasons to stay put in this chapter.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}