{
  "id": "7953618532869399462",
  "title": "Brinkmanship",
  "published": "2023-09-04T08:33:00.000-07:00",
  "updated": "2023-10-29T12:50:22.893-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhtHJ5VJ8UJJjfq4ucBEMy4XbXA_0w7L1bHWq8DObX8-dTyLPmdW-bDX03bAr28wjxKhhZ0KfBHTBTm_swHBdeHU9dKro6R9UepeQHxhRE6-_2IlM3PiPy_ZSQUTPR0L5Vx9AP8cgI_6xGFUsW065_YSeKZbn7BNHZb5hFq4YEtZxzm6ZJfLb-S/s1034/Screen%20Shot%202023-09-04%20at%208.27.00%20AM.png)brinkmanshipbrĭngk′mən-shĭp″nounThe practice, especially in international politics, of seeking advantage by creating the impression that one is willing and able to push a highly dangerous situation to the limit rather than concede.-- Wordnik \n\nWe're seeing a lot of talking heads suggesting that a psychotic breakdown leading to a nuclear exchange is looking ever more likely, as mostly old people in various social circles start to throw up their hands regarding the current situation.\n\nIn my counter narrative, citizen diplomacy is in high voltage mode and has lots of bandwidth. The younger crowd is engaged in mutual study and is not finding those irreconcilable differences the old farts insist on preserving. We're not seeing any impasses, in Europe, Asia or anywhere else.\n\nHowever, the veteran pundits don't want to pass the torch to a happier generation that's less likely to destroy civilization. They cling to power, despite their obsolete educations.\n\nMeaning the young will have to pry the torch away from them? \n\nOne way to do that is to let them keep their torch while lighting another one. Let them think they're still the torch bearers.\n\nAlong similar lines, I've got an alternative to that infamous clock put out by the Bulletin of Atomic Scientists. What do they know right? Are they aware of and/or working on a Trucker Exchange? Asylum Cities? Martian Math? \n\nWe shouldn't allow their laziness to govern our perceptions. Let them keep to their clock, but when it comes to asking the time of day, we have other sources, such as our Clock of the Long Now.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}