{
  "id": "2555870983265833059",
  "title": "BuckyBalls:  Consumer Ban",
  "published": "2012-07-27T10:24:00.002-07:00",
  "updated": "2012-07-28T01:59:41.069-07:00",
  "content": "Consumers have been banned from buying Bucky Balls on the open market.  No, this does not refer to C60, the molecule, or its family, but to a toy that had made an earlier appearance under a different brand but was then marketed as \"Bucky Balls\".  These small, powerful, spherical magnets are a subject of study in STEM, or have uses as a lab / studio supply.  STEM labs often work with controlled substances, including live animals that might kill you if let out of their cages ([Cabin in the Woods](http://controlroom.blogspot.com/2012/06/more-movies-mcmenamins.html) type places (Joss Whedon)).\n\nOregon is home to some companies that make very dangerous chemicals, whereas other extremely dangerous chemicals (EDCs) are just stored here.  You've heard of the NIMBY syndrome (\"not in my back yard\") -- well, Oregon is \"someone else's back yard\" to a lot of people.  Externalizing waste i.e. the true costs of doing business, is a way to avoid having an ecosystem come together, i.e. it's more a wealth prevention strategy (masked in short term profits).\n\nInstead of \"Oregon\" (named for smelt?), I should speak of Cascadia more regionally, as Hanford, a major seepage site, detritus of the Manhattan Project ([Ellsberg's Manhattan 2](http://worldgame.blogspot.com/2006/06/fathers-day-weekend.html)), [has vented chem trails as well](http://controlroom.blogspot.com/2010/05/wanderers-2010511.html). \n\nVital research up close to nuke plants is a biomedical activity that only risk takers engage in, like Navy SEALs.  That tick of the Geiger counter may be your best signal to back away.  Or call it \"eco-tourism\" of as an extreme sport perhaps.  Like Mt. Everest, the study of externalized waste streams, as a field, a discipline, is riddled with the corpses of dedicated scientists.  Fukushima has contributed exponentially to the supply of recruits, many of them unwitting, feeling committed by fate.\n\nOne of the weak boundaries in STEM is between climatology, CDC style epidemiology, and EPA style [studies of toxic waste](http://mybizmo.blogspot.com/2012/07/big-fix-movie-review.html) (radiotoxins included). EDCs certainly alter the economy in a big way, as civilizations cope to prevent and/or deal with a major disaster, and/or many scattered deaths in the case of swallowed Bucky Balls (the magnets).  How does one avert one's eyes from these climatological effects and only focus on CO2 levels?  Aren't Hanford's and Johnston Atoll's chemtrails a fact of geological history?  I studied the latter when editing Asian-Pacific Issues News  (APIN).\n\nResponsible management of controlled substances remains an elusive goal as organized crime typically competes with governments with investments in selling arms.  Escalation or continuous low grade warfare lines the pockets of various stakeholders, who also profit from the \"illicit\" (full of loopholes) trade.  The medical profession is traditionally overruled by the legal profession in this area, except in some categories.  With the right medical documents, one is entitled to STEM inventory, not unlike the governmental classification system for secret document librarians (a set of circuits sometimes short circuited, per Ellsberg and the Pentagon Papers or as a result of blackmail, strategic leaks, inadvertent misplacement).\n\nIn the end, it's all well and good to ban \"mindless consumers\" from various forms of access.  Of you have a clear research need or medical requirement, that puts you in a different category.  Where small magnets are concerned, other toys have them and Bucky Balls circulate aplenty in the after market (not always by that brand), one more hazardous material that could endanger others or oneself if used irresponsibly, another poison.  Mindless consumers didn't know how privileged they were, until they lost that freedom.  Mindfulness is forged in relative bondage sometimes where those \"bonds\" may be relationships, commitments, obligations.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}