{
  "id": "181782409879506200",
  "title": "Buckaroo Bizmo",
  "published": "2022-04-27T12:58:00.005-07:00",
  "updated": "2022-04-27T14:35:10.725-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/51985421471/in/dateposted-public/)\n\nThe meme of \"truck stop\" figures in these writings with strong echoes of \"oasis\" including a surround \"oasis community\". I'm thinking of Hoon and environs, where I've never been.  I have some maps from dads old shelves, as a regional planner.\n\nI think of truckers as \"citizen diplomats\" with a polymath's skill set, on top of driving, involving algorithms and data structures one could call it.  Like airplane pilots, they follow a rule book in order to safely share the public skies and public roads.  You don't want your pilots or drivers asleep at the wheel, either figuratively or literally.\n\nI've been test piloting a kind of truck or van, a somewhat Buckaroo Banzai bizmo, that gathers intelligence about a route for the benefit of trucker simulators, kind of a Google Street View.  However the anthropology trained personnel are scoping out more than road conditions and bottlenecks.  They're more like Michelin, in the sense of tour guides.  Their product tends to be software delivered and runs inside other trucks.\n\nSince \"man is the measure of all things\" i.e. since we empathize with our own engineering, I'm fine with pretending to be my own bizmo, puttering about.  Bucky played similar mind games, being the phantom captain of his own meat puppet ship.  Through the power of metaphor and analogy, I'm able to combine my being human with other experiences to make some pretty detailed mind's eye science fiction about Trucker World of the future. Pause to make truck noise and operate my ghost steering wheel.\n\nWhat's a \"bizmo\"?  Business Mobile, duh.  No one calls them that.  They could be double deckers, sure, but might only stay within North and South Dakota, per terms of the contract  You might have several workstations.  You might have a caravan, with sleeping quarter bizmos a different type.  Traveling circus.  We're talking gypsies here.  As always.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}