{
  "id": "5440213449128400746",
  "title": "Bumpy Ride",
  "published": "2018-10-19T00:31:00.002-07:00",
  "updated": "2018-11-24T14:25:34.675-08:00",
  "content": "Carol's leg gave way as we were standing there in the kitchen.  I turned to grab some grapes off the counter and boom, she went down.\n\nAt first I thought the grape I'd dropped on the floor had scared her.  Was it a mouse?  It moved quickly.  But no, I don't think she even saw the grape.  When I turned back, she was on the floor.  She had hit her head on the doorjamb, or at least I think that's where she hit.\n\nShe squawked as she went down.\n\nSince she was fully conscious and there was no bleeding, I urged her to scooch towards the basement steps, which is where she manages to stand, on the landing.  She's fallen before, but not because her leg gave way, nor had she hit her head like that.\n\nAs for me, the clock was ticking, as this was a lab period wherein students look at projects, do their own thing, for a specific amount of time.  I'm to resume the \"broadcast\" but here I am supervising Carol's attempt to get upright.  The timing was to the minute.\n\nThe next lab came soon, so I could resume assisting her more.  Indeed, she had a bump on her head, like in the cartoons.  She'll need to call the clinic tomorrow, standard procedure in case of a head bumping fall.  I found an ice pack in the freezer once class was finally over.\n\nCarol and I went to Multnomah County Elections office several weeks ago to make sure her ballot came to her address here in Portland, not the one in California.  Today, I got ballots for myself, and for Tara (who has moved away), but nothing for Carol.\n\nI'll call the elections office tomorrow if nothing shows up in tomorrow's post.  We vote by mail here in Oregon.  Before then, I plan to drive downtown for my colonoscopy kit, fun fun.  I might get to have breakfast with Alexia.\n\nThese were not the only bumps in the road today.  The assignment I'd been given said I'd have eight students and I went to all the work to create eight login envelopes.  However I only had three.  I found out later that the office had messed up and confused my class roster with another in Seattle.\n\nHowever I'm saving the \"best\" for last.  Tonight was session ten of ten for my Introduction to Python class, and my usual practice is to reward those making it to the very end (we lose some along the way) with a camera view of the pet python sliding around on my arm and so on.\n\nThe python's name is Barry and he's well behaved, never gives me problems.  It wasn't his fault I left the lid off his aquarium (terrarium?) when I put him back.  After class was over, I watched a couple Youtubes, about the 3D CAD stuff I'm teaching, and when I looked up, he was gone.\n\nI immediately closed the door to the room, hoping he hadn't made it out yet, and began a thorough search.  Fortunately, he was under the second chair I checked.  Good outcome.  He's safely back in his habitat.  Tomorrow I'll buy him his meal.\n\nI've been under the weather myself.  I feel I'm back to 90%, but not 100%.  The head cold went to my lungs.  I don't think it's pneumonia this time, but I'll closely monitor (I have no choice).  Fortunately, I have no more classes for at least a week.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}