{
  "id": "4441675574397670360",
  "title": "Burger Week",
  "published": "2022-08-14T10:16:00.002-07:00",
  "updated": "2022-08-14T10:16:44.247-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52284167355/in/dateposted-public/)\n\nI haven't been that big of a meat eater, by western standards.  Yes I eat meat, including bison or buffalo on occasion, but I'm not like a steak every month or week guy.  My diet isn't paleo.\n\nI've spent probably thousands on McMenamins Dungeon Burgers over the years.  That's the one with mushrooms and Swiss cheese.  I wonder if their database would show that.  \n\nselect count(item), sum(item_price) where customer = [me] and item = \"dungeon_burger\";\n\nThose would be aggregating columns. That's in pseudo-sql against a database I've never met in person. A mind game.\n\nOriginally I'd titled this post \"Summer BBQ\" because I had this metaphor in mind:  I've stoked the briquettes with all the newspaper needed, and lit the pyre (if I might call it that); lets see if the briquettes catch, which means they'll generate their own heat, long after all the newspaper is consumed.\n\n[](https://www.flickr.com/photos/kirbyurner/52283684666/in/dateposted-public/)\n\nThat metaphor in turn was about my approach to andragogy.  If I keep fawning over the flames, fanning them, I won't know if they would go out without me.  Given I could use such feedback, I'll aim to stand back.  I've worked on the ignition phase plenty, it seems to me.\n\nI'm still being rather abstract, but that's OK.  Lets get back to burgers.  Portland has a whole week celebrating the genre and recommends retailers offer an $8 burger week special, their choice of what to try.  At least that's my understanding of the challenge.  I don't know what syndicate is behind it exactly, only that this is not a new institution.\n\nAlmost in anticipation of said burger week, Glenn and I sampled the offerings at the Yes Please Smashburger shack, a certified food cart right across from the Linus Pauling House.  I took quite a few pictures and have left them interspersed.\n\n[](https://www.flickr.com/photos/kirbyurner/52282704052/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}