{
  "id": "5891314803726997050",
  "title": "Business Meeting",
  "published": "2016-12-21T12:58:00.002-08:00",
  "updated": "2016-12-21T13:00:28.132-08:00",
  "content": "A lot of non-profits will put in the small print that they're committed to leaving a public record of their doings, however nothing could be further from the truth.  There's no turnout for their meetings, no public passed the guards at the skyscraper door.  Nonprofits become accomplished at staying beneath the radar of the public, even if they remain sharply visible on the dashboards of their sponsors and funders.\n\nQuakers have taken a different tack in building attendance at Business Meeting, making it more than a religious duty, but a hobby, like keeping a sophisticated model train in working order in the basement.  Attendance by a critical mass is a practical necessity when the Meeting's continued existence is what's at stake or up for grabs.\n\nA Meeting has lots of moving parts, from physical property to the design of its workflows.  Some positions may be paid, however the most important decision-making happens through consensus, which means gathering for business once a month (if a Monthly Meeting).\n\nFor example, at Multnomah's most recent business meeting, we probably had upwards of thirty people.  Hobbyists come from far away just for this event i.e. it's the weekly Meeting for Worship they don't attend.  Sometimes there's a worship group (without the overhead of a monthly business meeting) closer by.  Between Worship Group and Monthly Meeting is another phase:  Preparative Meeting.\n\nThe Treasurer gave a full report, including our current position, income versus expenses, along with a budget for the future.  This was just one item on the agenda.  You might think there'd be exponential inefficiencies in involving \"people off the street\" into such proceedings, but that's not the flavor of a business meeting.  Close attenders get the benefit of the bigger picture and so reach consensus more easily.  The greater the transparency, the less maneuvering about, the shorter the discovery process.\n\nI'd not been to Business Meeting in quite awhile.  Per past blog posts, I'd been doing my part more regionally, as Clerk of IT Committee.  When October rolled around, two years into my three year term, I decided to relinquish my hold on that title and share the glory with someone more in agreement with the new policy, to outsource the website rather than keep it in-house and unpaid.\n\nThe Multnomah Meeting website has its own trajectory, which comes under the purview of the Communications Committee.  As I stated during introductions (we go around and say names, maybe mentioning any official roles), I'm not currently on any of the Multnomah Meeting committees. \n\nMy listowner roles in Cyberia, mostly through Yahoo! and Google, don't extend to the Monthly level, not currently.  I'd started a P&SC listserv but rendered it inactive pending more evidence one was needed by those actually on the committee (I'd been on at as AFSC Liaison, first locally, then West Region, but gave that up with the AFSC's closing down of our Peace Program).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}