{
  "id": "3459903894680004470",
  "title": "Camera Story",
  "published": "2022-10-29T15:18:00.003-07:00",
  "updated": "2023-01-30T22:21:10.386-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52466464639/in/dateposted-public/)\n\nI've been hobbling around a bit, and actually took a cane, no, almost did, to that comedy show at The Aladdin.  The reason is I swerved out into the street, as a pedestrian, out of social distancing habits, but forgot, when re-merging with the sidewalk, that I'd be walking over rough terrain, some decorative boulders.  I went sprawling, but was proud how I landed and didn't bang my head or anything.\n\nThe upshot of all that, was I immediately forgot about it and continued onward to the supermarket, getting some provisions for a friend.  Only later, walking home, did I pat myself, my hoodie pouch especially, and realize I was cameraless.  Walking out the door, I was sure I'd had it.\n\nTo make a long story short, I woke up at 5 AM the next morning with lots of leg pains, which jogged my memory, and I thought \"Ah, I bet the camera fell out when I took a spill\".  It had been getting dark, which is partly why I'd missed seeing the boulders I now believe.  I hobbled out into the darkness of the early morning, iPhone flashlight in hand, to look for it.  I'd been to the supermarket Lost & Found the night before.\n\nGiven how much I loved that Lumix L-7, a point and shooter that starts to crossover into higher end, very fast, very trusty, I went on the internet and used all my skills to find a good deal on a used one.  I could afford it.  I took the plunge.  We're talking $250.  That includes a spiffy case, another charger plus battery, and a protective pouch, along with the second camera.\n\nYes, second camera, because in the meantime, I found the first, not smashed on the sidewalk, but safely next to my hat and McMenamins face mask (which I consider stylish, pandemic or no pandemic), at my friends house.  Starting with the fall itself, and on through some hours after, I was at a low point in my awareness of my devices and peripherals (accessories).  I get this way sometimes.\n\nI'm glad to have two copies of the same camera and do not regret the purchase.  The main consequence of all this action is I'm still working on renormalizing around that knee.  The day after, I'd gone on a test walk with Dr. D., to make sure I could still do a few miles.  That was probably not the best therapy however, and I've been paying the price ever since.  Derek has confirmed my propensity to keep stretching and claiming my range of motion.\n\nSpeaking of claiming, I claimed by first Urbit planet today.  You might have thought, judging from writings, that I'd already invested in such a ship, but in fact, I've been practicing on comets and more recently a moon.  Stepping up to a real planet is somewhat a rite of passage in this universe (semantic space) and I was sure to mark it accordingly, both privately and publicly.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}