{
  "id": "3665842629529883482",
  "title": "Campus Recruiting and Logistics",
  "published": "2022-07-22T20:49:00.000-07:00",
  "updated": "2022-07-26T22:17:10.333-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52234356720/in/dateposted-public/)\n\nI've got my fishing pole in this lake, but don't expect many nibbles.  I consider it free advertising for my company, which has a footprint in education.  What about American Transcendentalism as a literary tradition?  How about as a philosophical one?  \n\nTranscendentalism is not usually acknowledged within any taxonomy of philosophies, although some of its leading lights get a tacit nod, in the case of Emerson, from Nietzsche.  As a literary phase, it fits between Romantic / Dark Romantic (Gothic) and Realistic, on the way to Modernist and Postmodernist.\n\nI'm looking to do business with education institutions.  \n\nPerhaps we'll devise a standard practice, based around bizmo fleets, where they travel from campus to campus, because they're outfitted to perform scholarly research. \n\nSome do bug counts (insect populations), some focus on testing soils.  The universities and other bases need both the data, and the science trained personnel.  \n\nAn active bizmo fleet keeps ideas in circulation, literally.\n\nFor those just joining us, I've been planning around truck stops and the lifestyle of truckers, both long and short distance haulers.  I'm not an expert.  I'm not a trucker.  \n\nI'm interested in these truck stop hubs for various reasons.  I have prototype dwelling machine villages in mind, designed for transport by shipping container, meaning trucks along the way, trains also.  \n\nSome truckers are in like PhD programs where they stay awhile in these remote lands, allowing the payloads to go on without them.  Learn the history, some of the language, become more familiar with the local ways.  \n\nLive in some yurt-like pod on a utility pole, surrounded by yak herds or peacocks.  Then move on.  In this global university model, students and faculty are not necessarily shy about operating heavy equipment, including long haul rigs.\n\nA bizmo (business mobile) is a smaller more agile vehicle that scouts the routes and tends to business, without hauling a big load.  \n\nOne might say these bizmos gather and relay intelligence about an area, but that sounds like a suspect activity, unwelcome spying perhaps.  However your average bizmo is most welcome in most cases, wherever it goes, because there's nothing especially clandestine about how or why it operates.  \n\nThere's nothing necessarily wrong with monitoring local conditions, especially by locals themselves, perhaps as mentors with apprentices, themselves on tour.  Keep the databases up to date.  Think of Google Street View or one of those.\n\nThink of tour guides too.  We want and expect them to guide us through, especially in tricky situations. \n\nThe work comes under the heading of citizen diplomacy in many ways.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}