{
  "id": "7252036174596363237",
  "title": "Campus News",
  "published": "2020-07-07T11:17:00.001-07:00",
  "updated": "2020-07-07T12:19:27.667-07:00",
  "content": "Hey there patrons, investors, alums, future students, faculty...\n\nI'm sure you're all eager beavers (Oregonian expression?) and want to learn everything about the roof of my house.  \n\nThat's been the order of business this morning, as in:  why doesn't it leak?  The High Powered Homes says it's three tab, common in the 1990s.  Not what's called \"architectural\" which is more the standard today.\n\nUnderneath though, is an older higher grade shaker.  Like they don't make anymore.  That accounts for why I've gotten away without re-roofing for this long.\n\nThe remodel to make this more like a Linus Pauling House, non-profit owned and operated, open to sojourning faculty, students, would include a new roof with more ventilation, other interior changes. \n\nThe old metal and vinyl kitchen is still fully operational. What would the 2 Dickinson people do?  \n\nI learned some of my adult livings skills at 2D.  The group home scene.  At Princeton University.  Lets do that again. \n\nSo the estimator is sitting out in his truck.  We've been through the different grades of roofing, economy, performance, and high performance. \n\nThe Owens Corning solution, backed by a transferable warranty, is an entire construction system. Their platinum installers get high marks for durable solutions.  High Performance Homes is one of those platinum installers.\n\nI'm saying: hey, where's the university in this picture?  \n\nHousing Services kinda sucks when you add all the solutions and divide by eight billion.  Let's talk about Food Services.  Welcome to the Global U, right?\n\nSo at the other end of Blue House would be these (sometimes remote) learning center experimental communities of tomorrow, that work with future prototype high tech and invite tourists, inspectors, auditors, critics.  \n\nWe're not trying to disappear behind some occult fog here.  The goal is transparency, more than you're used to perhaps.\n\nThe job would be in the ballpark of $20K < re-roof < $30K.  However, before tackling the roof, I need to get the trees and shrubbery cut back from the house.  Another stimulus might be needed.\n\nMe on Facebook:\n\nI had the roof looked at today. It's not leaking, just I lucked out that it has a good cedar shake roof under the 1990s 3-tab (I learned some new jargon). Just collecting numbers. I'm jealous of the Pauling House being owned by a nonprofit. How do I get to be a nonprofit too?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}