{
  "id": "5610821541169779040",
  "title": "Captain America: The Winter Soldier (movie review)",
  "published": "2014-04-06T10:33:00.000-07:00",
  "updated": "2014-04-09T22:44:55.733-07:00",
  "content": "Ever since [Lego World](http://worldgame.blogspot.com/2014/02/the-lego-movie-movie-review.html), I've been mentally inserting the outtakes of the child in whose fevered imagination we're having [this fantasy](http://controlroom.blogspot.com/2014/03/divergent-movie-review.html).   Cut to Tommy in his Captain America pajamas, jumping on his bed, cogitating on the themes of our day.\n\nTransliterating to a more boring set of newspapers and mags, Tommy is worried the CIA and its drone program might just be [a lot of Nazi stuff](http://controlroom.blogspot.com/2009/06/killing-field.html) percolating through DC by osmosis or, in the myth, taking form under the Potomac in the form of Nazi aircraft carrier flying submarines.  These must be stopped or Robert Redford's diabolical realization of Totalitarian America (safety in fewer numbers, with culling by algorithm) will come true.\n\nNewcomers to Marvel Comics, now Studios, may find such worldly questioning to be precociously bold to the point of subversive, but us geezers who've lived with comics forever know these superheroes typically ruminate on ethics, duty, loyalties, in ways that may go against authoritarian views.  Captain America's moral qualms are entirely faithful to the genre in other words.\n\nI enjoy Natasha the most in these Avenger movies, but she didn't seem as slippery and psychological in this one, more just a martial arts doll, though clearly friendly to Captain America, whom we can't help but like, plus to her credit she did get passed security using deception.\n\nI'm not a huge comics reader, compared to some, and am not highly versed in the time capsule nature of the Captain America trajectory.  I do see how it serves the plot though:  a 1950s innocence, a clear head about right and wrong, suddenly transported to Orwellian America (our day).\n\nSo yeah, I was kind of lost some of the time, as in bright lights flashing, she got away, good, but what just happened really?  I have no idea.  I was way up in the back of a packed Bagdad.  They're pouring in in response to the first run titles and McMenamins is raking it in.  They're deserving, as I always thought Disney was, but I do not begrudge competition nor inward dissent.  I hope we get back to the OMSI Science Pubs and such like -- just make 'em \"first run\" in another sense (subversive distro networks), take advantage of that equipment, pack 'em in.\n\nRedford has been in the CIA before and knows the Cold War.  He's in [the Cult of Milk](http://mathforum.org/kb/thread.jspa?threadID=2626833#reply-tree) (see below) you can see clearly, like Tom Cruise no doubt.  These are the studly males who get up in the middle of the night for a late slurp straight from the carton.  Cold lactose, yum.  [Been there done that](http://mathforum.org/kb/message.jspa?messageID=9430921). Like all CIA directors he has a big Buddha head or something tastefully oriental, proving he's a brain of some kind, however diabolical and Nazified.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}