{
  "id": "8497177572306010966",
  "title": "Car Talk",
  "published": "2022-03-08T07:25:00.001-08:00",
  "updated": "2022-03-08T07:34:16.334-08:00",
  "content": "I did manage to make TrimTabbers, after Bonnie's great talk, because FSI has a hard stop at a certain time. I joined the Zome workshop only a few minutes late.  My head was next to David Koski's in my Zoom mosaic.\n\nThen later that day, Uncle Bill was to arrive at Union Station for one of his two-hour \"bend the elbow\" visits. We usually go to Ringler's on Burnside, just close enough to the station to allow a quick lunch. If Coast Starlight is a bit late, so much the better.  RingSide is up the street (further west), a steakhouse where Ed treated me to a great dinner that time.\n\nHowever, en route to the station (Go By Train) by car, my car, I noticed the orange check engine light all of a sudden. A few moments later, the dashboard thermometer caught my attention.  It was going sky high. I reached the station, coasting when I could, but met Uncle Bill with the news:  driving anywhere would be problematic.\n\nCoast Starlight had been early, by about 30 minutes. Bill, age 96, pushed his walker out to my parking space under the viaduct onto the Broadway bridge. I'd been in touch with AAA about whether I was up to date with my membership. I was. However it was too early to request a tow truck without at least checking the radiator's water level, being careful to let it cool first.\n\nAll the water had boiled away I believe, and now in retrospect I know a large crack was permitting quick escape. Jiffy Lube checked it out the next day, and suggested I get a new radiator on the spot, which I did, after checking their price with my usual mechanic.  The check engine light is still on.  Jiffy Lube suggested that had been about something else.  Mind blowing.  Dr. D. says Auto Zone will give me a readout for free.\n\nSo thanks to the water I bought at Union Station, three large bottles of the kind meant to be consumed by train passengers, and quite expensive for water (it pays for marketing and fast cars), I was able to fill the radiator after Uncle Bill and I had determined the station's swank restaurant was closed until evening. An onlooker reported no great leak at the bottom (the crack is near the top) as I poured in bottle after bottle.\n\nSo we went to Ringler's after all, for our brew pub style lunch. Bill had a Terminator (their signature stout) while I stuck to Hammerhead.  He shared his pizza with me, on top of the burger, so I must have consumed a good 3000 calories, and I wasn't done yet for the day.  I should blog about that stuff more, as it's customary when journaling to note facts about diet and health.\n\nFortunately, Coast Starlight was running 20 minutes late.  I had Uncle Bill back by about 3:30, but it was nice to have that cushion. I called him later, when he was already almost to Olympia. \n\nOn that topic of personal health,  I'll just add that Dr. D. and I strode about on Mt. Tabor yesterday, including ascending the west stairs to mid-reservoir.  I call them \"the calculus stairs\" because of the changing first derivative, and maybe 2nd and 3rd for all I know.  They get steeper towards the top.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}