{
  "id": "5078816878730551739",
  "title": "Car Czar",
  "published": "2008-12-09T08:02:00.000-08:00",
  "updated": "2008-12-11T15:58:47.463-08:00",
  "content": "Now there's a fun concept.  You can see Detroit already starting to relish the prospect of some poor slob bureaucrat they can kick around, now that they're getting this bridge loan to a next administration, which will cave to further demands.  When you own such a huge chunk of the family wage jobs market, it's easy to exert leverage.A fun response would be to reassure the American auto workers that the Car Czar will indeed be an office in the Kremlin, and that our goal is to ensure their well being, get these crappy \"CEOs\" off their backs (glorified lobbyists, [whiners](http://worldgame.blogspot.com/2008/07/more-geek-anthro.html), entitlement freaks) and provide [a safety net](http://controlroom.blogspot.com/2008/12/iron-mountain-revisted.html).  Whether we can rescue ugly models of car no one cares about is another matter.  Probably not.The capitulation of capitalism to some new world order, is that what we're seeing?  In that case, let's dust off our science fiction writing skills and start brainstorming what's next.  What shall we do with reality television, now that it's a genre?  How will Alaska figure into it?  Are we building a bridge to nowhere or not, I forget?  And what about that energy grid?  At least let's find out what's going on with superconductivity -- lot's of good journalism on that already.As [BizMo Czar](http://mybizmo.blogspot.com/2007/10/designing-engineers.html), I'd like to meet with the Car Czar and compare notes.  I want a lot of recyclable parts in my fleets, have them be green in the sense of enviro-friendly, downright tree huggy, in comparison to Detroit's little monsters.In the meantime, I've been brainstorming with friends about my upcoming Chicago talk, plus some fun skits / cartoons in the tradition of Monty Python (Python's namesake).  There's this \"guards at the gate\" motif we might go with, to help explain what goes on when we pass variables to functions or methods in computer algebra, a kind of \"entrance interview\".From an email with collaborators:Guard:  Hello then, you an Integer?Unknown:  No, I'm a Duck.Guard:  A Duck!?Unknown:  Also a Snake.Guard:  A wot?Unknown:  I'm in Python, everything is a snake in Python.Guard:  Want some coffee mate?  I think you must've been drinkin' a bit eh?Unknown (to the Python-aware audience):  See what I mean?What the geek audience realizes is this must be a Java guard (note his obsession with coffee), ergo he's somewhat unfamiliar with [the concept of duck typing](http://worldgame.blogspot.com/2008/10/duck-typing.html), hence his obvious confusion.Kids will do these on YouTube, share with their peers, another way of spreading computer savvy without bothering those poor overworked math teachers, already weighed down by their parabolas, other heavy responsibilities.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}