{
  "id": "115058595951567204",
  "title": "Cars (movie review)",
  "published": "2006-06-17T20:42:00.000-07:00",
  "updated": "2008-04-12T13:47:44.933-07:00",
  "content": "The plot (which shares elements with [Over the Hedge](http://mybizmo.blogspot.com/2006/05/over-hedge-movie-review.html))  involves a self-assured, vain No. 1 who feels isolated and friendless, takes a detour in life, and discovers family and friends, including a possible No. 2.Then there's always some initial destiny to fulfill, an heroic gesture for an appreciative other.  She gets it:  he's good hearted after all.  A good story, and sometimes a good movie.  In this case:  definitely a good movie.I love sampling such pure Americana (Route 66 through nowhere), and consider this an homage to cartoons set amidst desert mesas and cactus, a backdrop for some of our favorite animated friends (meeb meep).  I appreciate this wide open desolation, find it in Sims 2, and in [Bagdad Cafe](http://www.imdb.com/title/tt0098746/).The time-frozen village, bypassed by I-40, showcases some interesting hippie-vet dynamics around flag time in the morning.  Ferrari-worshipping Italians bow down before family icons.  And everyone's into neon.The love story was cool (Dawn loved the Porsche), and I appreciated the lesson in regional planning (how not to -- although in this case of Radiator Springs, it all came out for the best).Lucky cars!  Their civilization took my mind off ours.Back in my real world...I still futz with this crippled Windows computer, still unable to update itself and get cured.Notice how a perfectly good machine world goes bad once those nasty humans show up.  I could see where the Ice Queen 'd be suspicious and cold, and attempt to slow their advance (their king is a four-legged, she's noticed -- and perhaps that's to their credit (she's got her dogs)).Like in [Robots](http://worldgame.blogspot.com/2005/04/robots-movie-review.html), Car World is not competing with another intelligent observer species, except maybe that guy Frank, the combine -- easily stopped by fences, though he may get through in dreams.And speaking of competing intelligent life, Cars included a spoof outtake from War of the Worlds didn't it, with the jets fighting spark plugs or something like that.  Or was that in a preview?I hope to see Cars again someday, maybe on some Airbus with Dawn and Tara.  Maybe I'll write another less quirky review.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}