{
  "id": "6802219485076815812",
  "title": "Catching Up",
  "published": "2017-10-22T18:29:00.002-07:00",
  "updated": "2017-10-26T11:11:04.004-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/37160167834/in/dateposted-public/)\n\nI claim to enjoy browsing a lot, since well before web browsers, but when do I get the time?  Well, today for example, I left my Stetson at Hop House and used that as an excuse to wander on to Common Ground, the coffee shop with the most magazines on upper Hawthorne.\n\nI ordered a whole pot of coffee, to counteract the beers, and read up on Sleep Science, VP Pence, and former US president Hoover, not necessarily in that order.  This was all in the one issue of New Yorker, October 23, 2017.\n\nAt the Hop House, with Glenn, I picked up a pamphlet on Falun Dafa. I've been looking at this practice through a framework of comparisons with Hizmet.\n\nBoth religious movements were at first embraced by their respective governments, Turk and Chinese, then demonized.  Turkey holds US citizens hostage hoping to extradite Gulen in exchange.\n\nI was unaware that Hoover had been a mining engineer.  His determination to feed Belgium at the height of the blockade jibed with Human Smoke and his Quaker values.  He seemed happiest and/or most fulfilled when serving as some kind of chief of logistics.\n\nI'll need to cycle back through his bio again soon.\n\nMike Pence, per this New Yorker analysis, has always been interested in serving as a US president.  He's a heartbeat away at this moment, but at a time when said high office is waning in power?  The west coast has escaped Prohibition (the later chapter) and no longer supports the Drug Wars unless that means against McKesson etc.\n\nI don't just browse print media however.  Last night I was half comatose letting Youtube keep picking the next one.  I'd surface from my somnolent state from time to time, curious what I'd been brainwashing myself with.  Louis Farrakhan?  Just his fans?  Back to dream land.\n\nI have a big screen facing me, while I recline on the futon couch.\n\nI'm also active on my Kindle these days reading a Hoover Institution fellow's book from the 1990s, Inside American Education by [Thomas Sowell](http://www.tsowell.com/).\n\nHe seems respectful of Bayard Rustin, who had Freedom House connections.  Freedom House is quoted in that Falun Gong brochure, attesting to the reality of organ harvesting.  That calls to mind [another Youtube](https://youtu.be/a6-eo6bh87g).\n\nI visited Indiana around the time Pence made himself more enemies in the alt-gender community.  I guess it's OK with him to do that.  He defines himself as rigidly parochial Christian, not a cosmopolitan.\n\nGlenn and I watched Portland Timbers win the Cascadia Cup from Back Stage / Bagdad.\n\nDinner with mom at Thanh Thao.  Need sleep.\n\n[](https://www.flickr.com/photos/kirbyurner/37870183541/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}