{
  "id": "6778399913887123114",
  "title": "Central Oregon",
  "published": "2018-08-03T22:09:00.002-07:00",
  "updated": "2018-08-08T11:06:01.586-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/29984025608/in/dateposted-public/)\n\nThanks to my having family in this neck of the woods, I get one of those inside track experiences where I don't have to spend a lot to enjoy a wealth of experiences.\n\nEagle Crossing on the Warms Springs reservation is a great intersection of cultures.  The TV is tuned to news and the CBS morning show, with the N8V cook owner the main audience. His wife took our order and their daughter cashed us out.\n\nToday we visited the place where the Metolius river emerges from underground.  No one really knows its route under the Cascades.  Once it emerges, it runs for about twelve miles to a lake, through forest populated by camp grounds and \"summer cabins\" (many have been turned into more than just cabins).  We picnicked along the shore, then drove into Sisters for music by Tony Lompa, who remembered me from last time.\n\nTomorrow we'll be listening to Steve's radio show on KPOV, and probably talking to Steve himself.  \n\nI drove the girls to the alpaca farm just a mile down the road on highway 97.  Then we visited Smith Rock.  These are ritual stops for us.\n\nI'll be adding pictures when home in Portland.\n\nI'm meditating on how people seem to want it both ways:  we acknowledge a deeply non-rational side the motivates human affairs, and then try to give a role to rationality.\n\nClearly engineering based on awareness of generalized principles gives us more ways to act out our collective craziness, for better and/or for worse.\n\nIn the media, crazy meets crazy and tries to sort itself out.  That's called history or culture or something along those lines. \n\n[](https://www.flickr.com/photos/kirbyurner/42949796155/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}