{
  "id": "48689108637855929",
  "title": "Cerebral Sunday",
  "published": "2018-04-23T13:44:00.000-07:00",
  "updated": "2018-04-23T17:32:53.105-07:00",
  "content": "Our breakfast meeting was about GST, in particular the question of how best to teach thermodynamics in conjunction with [the global economy](https://youtu.be/E3GBC4e5yFY).\n\nNow, I'm not talking about global warming or climate change, so much as what we call the Earth's energy budget.  How much energy comes in, and how much goes out?  Terry emphasizes that it's close to net zero, otherwise the global temperature would be increasing or cooling much faster than it is.\n\nOK, I take it back, there's a global warming aspect to the equations.  Just to be clear though, we're looking at how hydrocarbons impound solar energy to create vegetation, forests and so on.  Then there's the rain cycle:  evaporation feeds rivers and an endless supply of water flowing downhill.\n\nHumans stick their water wheels into these rivers and thereby get more horsepower than ever.  The same strategy gets us hydroelectric power today.\n\nMalthus appreciated that life increased at geometric rates (exponentially) in the right conditions. That includes vegetation, however since surface area is a constraint on arable land, he forecast a human population outstripping food supplies in the near future.\n\nTerry, whom I was meeting with, also Glenn, went to the same London School of Economics, ages later.  The population was pushing towards ten billion but growth rates were slowing according to some metrics.  He's interested in the history of thermodynamics going back especially to French language thinkers [Pierre-Louis de Maupertuis](https://youtu.be/AfsZiHEcoxk) and the Carnots (Lazare and Sadi).\n\nGST does factor in solar power as the major ecosystem driver of life on Earth, but of course it takes more than power to make a system go.  One needs components, complexity, organisms.\n\nHow the build-up in complexity affects any global entropy measure, if that makes any sense, is still an open question in my book.  I'm looking for more authors to address it.\n\nAfter breakfast, Glenn and I walked to the Friends Meeting on Stark, by way of Movie Madness, and met with several Friends.  We were heading up Mt. Tabor.\n\nThen I had a 2 PM appointment with an earnest student of what I might call psychological physics, also known by the label Deep Democracy as championed by Arnold Mindell and associates based here in Portland.  I've been to a few of Arnie's workshops and studied his writings.\n\nPhysics, in proposing to offer \"theories of everything\" tends to get drawn in to talking about such memes as \"consciousness\" which of course connects them to what \"unconscious\" might mean.  Typically, an \"unconscious being\" is simply unaware of some otherness, insofar as it has any awareness.  I realize that's a circular definition.\n\nI took a lot of pictures of book covers and book contents throughout the day, given the veritable blizzard of information coming at me.  What better way to make a record?\n\nHowever, I went through my camera battery doing that, such that when it came time to attend my friend Matthew's sixtieth birthday (we're about the same age), I had to grab a backup camera, the one that was starting to jam (it gets paralyzed). The backup camera jammed every time this time, so I feel back on my Android for any pictures.  This was out in Tualitin-Sherwood, at the Century Hotel.\n\nD'Arcy Thompson was a main figure in the morning meeting, so when I got back I started reading his On Growth and Form again.  I've never read it cover to cover.  Then I found some Youtubes about the guy, including the one linked above. D'Arcy was a big inspiration behind this new book Scale by Geoffrey West which I've been reading, and recommending.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}