{
  "id": "1076124720594370507",
  "title": "Changing Weather",
  "published": "2014-07-13T10:39:00.001-07:00",
  "updated": "2014-07-16T09:44:45.809-07:00",
  "content": "Wow, downpour! \n\nGood thing Lindsey didn't leave early this morning, on that multi-day trek, though sooner or later the rains will probably catch up with her.  Or not.  It's summer after all.  We don't have torrential monsoons like Manila does... usually.\n\nI got Carol to Quaker Meeting before the rain, just thunder and lightning at 10 AM.  By now it's 10:30 AM and the lawns are getting watered.\n\nI've been playing with \"Quasi Quakers\" or \"Kwazis\" for short.  The Kwazis on Stark Street [don't have a Peace and Social Concerns Committee](http://controlroom.blogspot.com/2014/06/end-of-era.html) and have more of a tendency to flocking behavior (pastoral) than true Liberal Friends.  Not a big deal.  Quakers have forked before, many times.\n\nWalker is cycling to Witch Camp somewhere further south, still in Oregon.  Country Fair, more established and commercial, will just be winding down around now.  I know some staff but haven't been myself in some years.  I'll know more about Witch Camp when Walker gets back.\n\nEnglish hosts many slang or coined neologism for what we might call \"hybrid religions\" (as if anything were purebred):  Jew-Bu (Jewish Buddhist), Quagan (Quaker-Pagan)... these exist, and in multiple incarnations.  The true complexity of on the ground inter-mixing of ethnicities belies the over-reaching simplifications of any computer model I've seen, not that I've seen them all (many are protected / proprietary).\n\nKwazis would be a mix of Liberal Quakerism inter-twined with other strands of neo-liberalism, some radicalisms.  This may not be a stable form in any case as nothing is stopping us from snapping back into shape at some point, as ye olde Liberal Friends, some plain vanilla generic version, less this exotic potentially unstable isotope (radioactive).\n\nTransformations are like that: sudden, like changes in the weather sometimes.\n\nPunctuated equilibrium means something in anthropology regardless of what evolutionary biologists do with the concept. \n\nMemetic evolution happens so much faster than mere genetic evolution, and ethnicity is primarily memetic.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}