{
  "id": "8986882225266474613",
  "title": "Channel Surfing",
  "published": "2008-09-17T14:40:00.000-07:00",
  "updated": "2008-09-17T14:44:22.809-07:00",
  "content": "My gym has these in your face LCDs on its newest stationary pedal machines, which you don't have to turn on, each with its own headphone jack and controls.  I might go for an hour, surfing through shows.  The bigger public screens hanging from the ceiling give a sense of what's on, although we have more channels than might show on ten or so panels.The History Channel has stories about the recent past sometimes, including from [the Vietnam war](http://controlroom.blogspot.com/2008/09/paved-over-past.html) and more recent drug wars in the Americas.  The financial shows are these days looking at the bumpy ride the stock market is having, which they say [is chaordic](http://www.chaordic.org/), like fractals, part of a self-organizing system.  As I posted to a physics list the other day:So physics has some airtime, through information theory etc. (signal /noise, entropy gradient, [book Into the Cool](http://www.amazon.com/Into-Cool-Thermodynamics-Heritage-Sociology/dp/0226739376) by Sagan et al). We model each region as a source and/or sink for various positives (e.g. cures) and negatives (e.g. sicknesses), talk about world trade as a self-organizing system.Per our entropy thread earlier, keep in mind that Earth is an open system with a daily solar input, so an overall drop in entropy in biological time is not \"against thermodynamics\" or anything close (some older books tended to imply \"entropy\" was to blame for the still prevalent \"white mans burden\" psychological complex (talking about that famous poem by Kipling [**](http://controlroom.blogspot.com/2008/05/wmbs-satire.html))).Tinkerbell, [my bicycle](http://mybizmo.blogspot.com/2007/09/tinkering-with-tink.html), suffered a front tire aneurysm plus the back brakes were seated too high, wearing the fabric thin on the tire wall.  I left it at the repair shop, as I'm not the best wheel tuner, don't have the right tools in my garage, although this place does let people work on their own cycles with the shop's gear, if you book the time.Glenn is on business in Canada, I'm staying in Portland thanks to ongoing commitments.Follow-up:  Tink needed more than a new wind bladder (inner tube); she needed a new rear metal wheel, owing to the earlier one's numerous cracks, inferior spoke quality (seeing is believing in this case).  Parts and labor:  $104 on Visa (Visa being the paradigm chaordic enterprise the way [Dee Hock tells it](http://www.amazon.com/Birth-Chaordic-Age-Dee-Hock/dp/1576750744)).  I'm also ordering more [DemocracyLab](http://www.democracylab.org/) T-shirts.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}