{
  "id": "2769709021250071778",
  "title": "Checking Avatars",
  "published": "2022-05-02T19:48:00.004-07:00",
  "updated": "2022-05-07T23:06:13.538-07:00",
  "content": "Episode 1730 Scott Adams: The Golden Age Is Upon Us, Trump Was Right Per Chomsky. Wow. What A Show\n\nI don't think Scott will mind if I refer to his Youtube screen image as an avatar.  I'll be my own avatar too, on your screen.  That's not the Hollywood TV studio vocab exactly, as we're admittedly a different ethnicity here in Weird City (or Crow City), but a neighboring one.\n\nAs Scott lets us know, he has a war chest thanks to his Dilbert characters, who charmed our lives for decades in comic strips, and will continue to do so.  More avatars, but subsidiaries of Scott's psyche, insofar as office archetypes are anyone's personal property.  Scott applies the final spin, Homer Davenport style (but with a different type of penmanship).\n\nI know from Dr. Potkin that Scott Adams likes to play for the Righties, the ones with a home advantage in English, as Leftie sounds more sinister right out of the gate.  That gives Lefties their own kind of edge, and opposites attract, and in this vid Adams is up to singing Chomsky's praises, because the latter has the intellectual honesty to point to Donald Trump as a voice of relative rationality, when it comes to taking sides, or not, in the Game of Global Gangland.  \n\nScott reveals some of his intellectual honesty too, in crowning Chomsky his King of the Lefties.\n\nThen he serves to clarify the \"by mistake on purpose\" rhetoric of the Democrats.  Joe Biden was excoriated for letting slip those various signals that the deployment NATO forces was in the cards. He was seen as senile and divulging his fantasy life.  The spin doctors learned their lesson, and commentary on Nancy Pelosi's \"slips\" were more deviously circumspect.  We'll be eating ice cream in the Kremlin soon, right?  Nod nod wink wink.\n\nScott is clearly a mainstream establishmentarian in holding up DC's celebs as high ranking.  Many of us in the frontier lands grew up distancing ourselves from the Hunger Games capital, so to speak, seeking our own destiny, more like citizens in Alaska or even Texas, potential \"seed states\" for tomorrow's version of Global Gangland.\n\nScott's notion of \"affordable speech\" is enlightening and spelled out clearly, but are we all in agreement it's somehow preferable to our \"free\" ideal?  \"Affordable speech\" sounds more like \"affordable air\" with only a minority able to buy enough oxygen.\n\nTo my ears he's asking us to drastically lower expectations if we're neither rich nor geezers, by becoming minions for the privileged oligarchs we best like.  Play on Browder's team or Putin's, for example (not an example he gives).  The two are supposedly at loggerheads, but also have enough in the bank, respectively, to engage in risky speech, not to mention other undertakings, in which speech plays a vital role.\n\nI guess I shouldn't worry though, as he clearly sides with \"smart people\" in wanting the censorious \"we know best\" folks to dissipate back into the woodwork or wherever they came from.  That's typical of how elitists with considered opinions see the lower half of the bell curve, and those who get by with cookie cutter beliefs they want universalized, or at least seconded by a mainstream.  \n\nMost main streamers by definition hate finding themselves holding esoteric views that put them in the spotlight as unique individuals, or worse.  \n\nBetter to say best what everyone else is already saying.  \n\nShow them how it's done.  Win the beauty contest, be a star.  Stand with Ukraine.\n\nSpeaking of Ukedom, and warring oligarchs (remember CrowdStrike?) and their proxies, Scott goes into the question of Putin's sanity etc. perhaps expressing a peculiarity of his ethnicity.  The same question came up in the car today, me driving.  Did I imagine Putin was crazy?  So far she couldn't see that he was.  \n\nMy focus is more the masses, one could say the movements, catalyzed by PR and advertising, with lots of think tanks just beneath the surface.  I'm more into Cambridge Analytica style collective psychology than any kind of Freudian style psychoanalysis of lone individuals, although I did go through a phase (around 8th grade) wherein the latter would have interested me a lot more.\n\nBut hey, this is a blog post about Scott and his views.  We can talk about me some other time, like when and if I make another Youtube.  I have some hundreds of hours of those on file already, an acquired taste I'd imagine, but great for those enjoying my style of \"spherical pinball machine\" didactic discourse.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}