{
  "id": "6937852650940348563",
  "title": "Checking In",
  "published": "2011-07-15T19:22:00.000-07:00",
  "updated": "2012-06-03T14:19:05.857-07:00",
  "content": "Once again from your business crew, [some Bizmotica](http://mybizmo.blogspot.com/2011/07/bizmotica.html)...\n\nQuakers convene for business yearly, in what's called [Annual Session](http://controlroom.blogspot.com/2011/07/this-ones-for-you.html), to have these plenary sessions.  There's an esoteric inner faction among Friends that's saying plenary, rhyming with canary, which of course is the wrong emphasis.  Fabik and Scholl went at it, first Lew with the Droid, then Dave with the iPhone, to find other rhymers, such as Harry.\n\nGood segue:  in some Xtian sects, that [Harry Potter stuff](http://controlroom.blogspot.com/2008/12/winter-traditions.html) is too distracting or \"of the devil\" or whatever, to be permitted a core focus of any official religious event.  Not so at Annual Session this year.  [Joe Snyder](http://mybizmo.blogspot.com/2007/12/driving-to-la.html) took a posse of some 39 ticket holders to opening night of Part 2 of the latest, with the whole group watching Part 1 in the lounge at Pacific Lutheran University (PLU), where we stayed (wandering gypsies that we be).\n\nAnother highlight for me was watching that satirical look at the emerging Facebook culture through the eyes of [South Park Studios](http://worldgame.blogspot.com/2004/12/team-america-world-police-movie-review_04.html).  We watched on his iPhone.  Google+ has just launched, around the time of this writing, so throwing people into circles (e.g. \"to the lions\") has become a big part of the buzz.\n\nThe PSF snake, Ms. Naga, was a stowaway with the 3.1 computer speakers (with woofer).  She's the stuffed totem we cart around as another \"cult symbol\" (hacker speak) in Python World. In the comix, she's a good natured, adventuresome type.\n\nDuring Quaker Fair, when organizations paraded their stuff, like so many stationary floats, the anti cruelty to animals guy discovered he'd forgotten the power cable for his speakers.  I was sitting right there, doing my day job [teaching Python](http://controlroom.blogspot.com/2011/06/back-office.html) over wifi, and quickly volunteered that I had some back in the room.  Timothy Travis returned me by golf cart, forthwith.\n\nOf course Naga came along in the bag and curled up at the exhibit, where the movie kept playing.  I got the soundtrack over and over as I continued my grading, hearing about the terrible things humans do to other animals.  This was a good position for [a Quaker animist](http://controlroom.blogspot.com/2008/05/animal-rights.html) to take, and another score for FnB style cooking.\n\nThe two booths I spent most of my time at during this Fair:  AFSC and Western Friend.  [Susan](http://worldgame.blogspot.com/2010/10/school-spirit-hillsboro-story.html) was showing some [poster art](http://controlroom.blogspot.com/2009/04/future-of-image.html) reminiscent of Shepard Fairey's, prompting a quick visit to the [Obey Giant website](http://www.obeygiant.com/).  Hyzy, WF editor in chief, was [like Lucy in her booth](http://www.flickr.com/photos/17157315@N00/7200673656/in/photostream/) in Peanuts.  Thinking of Linus, I remembered my security blanket (blue).\n\nI've also been reading and writing about [Wittgensteinian philo](http://groups.yahoo.com/group/WittrsEX/message/4541), chatting with Nick, DK, wondering about my peeps, so spread out and around.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}