{
  "id": "743384402317754773",
  "title": "Choreography and Computer Science",
  "published": "2018-07-06T18:25:00.001-07:00",
  "updated": "2018-07-06T18:49:58.218-07:00",
  "content": "In some documentary I'm forgetting the title of at the moment, a solar dish technology, maybe just a solar oven, gets introduced not as a finished good, but as a manufacturing process.  The female choreographers take it on and make up a song with a rhythm that helps govern an efficient concurrent process.  Solar ovens roll off the \"assembly line\".\n\nOperations research goes back to complicated manufacturing and PERT analysis, finding the critical path.  Shorten this process, and the overall rate of submarine production holds constant, whereas if these two threads join perfectly, as when a body lowers down over a chassis, there's less waiting along an eigen-process and submarines appear more quickly.  Or Teslas.  Or...\n\nAlong came concurrency in computer programming, which by now needs attention from the get go. The question is will mathematicians deign to wade into the seas of time and join the engineers in spatial-temporal considerations. Of course they will, or at least the polymaths will. STEAM is STEAM.\n\nHowever, lets not pretend parallel processing was just invented in the 1900s, as Universe has been running in parallel all along.  The human body is a miracle of process management, replacing blood, skin, muscle and nerve cells from cannibalizing chemistry labs (the body's internals).  I'm not saying humans eat humans (a few do, according to anthropologists), just that chemicals self-harvest along many simultaneous supply chains in the human body.  Octopus bodies do this do.  Life processes embody concurrency, even as they spawn progeny.\n\nLikewise, ordinary living requires engaging in many tasks, some of which need to run in parallel.  \"A watched pot never boils\" was a reminder to kitchen amateurs to not block on a process when there's so much work to be done.  Efficient choreography is a highlight of cooking shows, especially where teams are involved.  The clock is ticking.  Submarine sandwiches head out to the crew.\n\nThe all this time pressure, the response being organizational skills (scheduling, prioritizing), we see where schools miss being efficiently parallel themselves, if looking solely at computer science and not understanding the need for practice in team playing.  Links to sports and dance are not just \"nice to have\" as the skills we're talking about are essential in later life.\n\n\"Math is an Outdoor Sport\" is one of my old slogans.  The idea was to get outdoors, perhaps with GPS, doing geocaching like activities, exploring a terrain, graphing a topology, making maps of many kinds.  Scoring well on a test might involve exerting oneself physically.  Of course that's nothing like the rows and columns math class of today.  However now that computer science is becoming involved...\n[](https://www.sciencedaily.com/releases/2014/11/141103114236.htm)\n[Theater and Choreography](https://www.sciencedaily.com/releases/2014/11/141103114236.htm) go together here.  Think of a Broadway musical and all the singers needing to change costumes backstage as the show continues center stage.  The exits and entrances, the meetups, the duets, the solos... the cuckoo clock of computer science, Newtonian and later quantum mechanics.  Life is a turning of gears, even if these be only metaphorical and therefore \"softer\" (more \"nerf\") than real gears in some way.  Real gears play too.  Life encompasses mechanical processes, even if we sometimes use dance to rebel against too much predictability.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}