{
  "id": "9142840168315219671",
  "title": "Chronofiles",
  "published": "2017-01-18T20:23:00.004-08:00",
  "updated": "2017-01-19T00:47:02.674-08:00",
  "content": "I've been chronicling a lot of my homework topics in my Facebook scroll.  [Potorando](https://flic.kr/p/PY4FmF) (Portland, PDX) has been under a blanket of snow for the last week, which has been stressful in some ways but also a welcome vacation from daily toil to catch up on world events. There's so much to catch up on.\n\nI study dance and music more than you might expect, in addition to movies.  Some \"AI films\" I've been listing: [Ex Machina](http://mybizmo.blogspot.com/2015/06/ex-machina-movie-review.html), [Her](http://mybizmo.blogspot.com/2014/01/her-movie-review.html), [Chappie](http://worldgame.blogspot.com/2015/03/chappie-movie-review.html), and of course Artificial Intelligence itself (Spielberg, Kubrick). In connection with Chappie, I segue to [Die Antwoord](https://youtu.be/uIrqK4NoZpg).\n\nAnother thread cites Tame Impala for its retro-psychedelic [Feels Like We Only Go Backwards](https://youtu.be/wycjnCCgUes) (very Yellow Submarine).\n\nI'm accepting there's no point assuming some uni-polar world wherein the USA has the luxury of infinite time to process future shock, while this rest of the world has to rocket through the experience.\n\nNo inner circle controls spacetime to that level if human, and if not, then which science fiction have we switched to?  No, future shock is not shielded against by lead or glass, let alone legislation.\n\nAnyway, back to my studies: I'm ironically not the bold futurist of the Hyperloop experiment, and instead suggest more Eisenhower-style freeways, twixt Iran and the Stans, over to Istanbul and so on, more of an EU like arrangement or like [what Africa is aiming for](https://youtu.be/CfPhgUul4v0).  You don't have to show your papers just because you're moving from state to state.  That's an experience of interstate travel people really appreciate about the USA and want to emulate.  I don't blame them.\n\nSo whereas Youtubes are showing these sprawling Hyperloop networks, I'm talking about trucking lanes. The trucks might not even be autonomous. So backwoods Oregon, right?  So not Silicon Valley.  However the Hyperloop vision takes somewhat for granted what we learn at airports:  the countries you fly over don't need to bother you with paperwork.\n\nLets remember El Camino though, I know that sounds somewhat out of the blue, and that has not been a recent Facebook topic.  I'm just thinking about how trucking is in other ways thoroughly regulated, with weigh stations and rules about getting enough sleep.  Drivers do worry about sharing the road with other judgement-impaired drivers.  We all do.\n\n[El Camino](http://mybizmo.blogspot.com/2014/12/wild-movie-review.html) is for pedestrians, however they'll show paperwork when staying at various hotels along the way.  Use of a credit card also marks a trajectory.  I'm not saying the traffic along these roads will be unmonitored.  On the contrary, it's so monitored that stopping at boarder crossings is almost a moot point.  Information technology is what's rendering those obsolete, not some sudden outbreak of trust between nations.\n\nAlso, I'm quite accepting of the ODNI's observation that [RT is influential](https://youtu.be/SQQwBfux9i0).  I've watched enough of these old Yuri Bezmenov tapes on Youtube to agree on his major point:  a huge percentage of what spies do has little to do with picking locks, tapping phones, or sneaking around in illegal ways.  So much of what we call \"intelligence work\" is what Yuri calls \"active measures\" and that includes spreading everyday propaganda or PR (PЯ).\n\nBut what's propaganda then?  Lets just agree, for the sake of discussion, that it's an important factor, and accept that the Kremlin was likely more afraid of Hillary's harshness than of Donald's trademark blend of buffoonery. That's not even scandalous if so. We all have our preferences and, if we're powerful nation states, we have our spies to carry out their active measures, often fully legal.\n\nHey great if hyperloop technology works, as it's not either / or with trucking. Cargo travels at different rates. A \"fifth mode\" of transportation implies four others, not going anywhere. Of course I do pay attention to skeptics who say controlling the seals will be difficult but we learn from experiment more than from arguing sometimes. I'm happy to see bold experiments with new civilian technologies. More giant domes might be nice.\n\nI connected the Manning case to Leonard Peltier's. I got to be at an event with the latter's son in 2016, another Oregonian. The media were mostly linking to Snowden and Assange, more recent cases, higher profile in recent times (and admittedly more directly connected story-wise, given how Manning went to Wikileaks directly, helping it become what it is today).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}