{
  "id": "1282399331646573393",
  "title": "Church and State",
  "published": "2024-11-20T12:47:00.000-08:00",
  "updated": "2024-11-27T13:52:44.825-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/54154430878/in/dateposted/):: six fingers jammin Sam ::\n\nYou may have seen in the movies where certain underground cults have gone ga ga for an iconography, such as that of a nation. In torch-lit ceremonies, whatever logo gets used, some motivational symbol, such as the Olympic Games deploys, or Nike. Not that either of these are “cults” in popular parlance. The spin on key terms here is colored by its ballpark.\n\nMy own bias is to think of n8v tribes that went bigly for the Stars and Stripes as a motif in their beadwork. I also think of Grateful Dead, the band, on the road, and its merging with Uncle Sam imagery. That’s a goldmine we’ve been mining to this day, exploring what the new AI dream machines might do.\n\nFrom a more legal code angle, the picture is not one of a government foisting itself upon others, so much as a subculture partaking of the same mythic sources. The same George Washington under the same elm tree waves the new flag, but some of the troops complain about the miniature Union Jack in the upper left, and Betsy Ross makes sure it’s replaced. That’s straight outta Critical Path (St. Martins Press) check archive dot org.\n\nSo say a subculture, like the Masons, is into a lot of the same pyramid eye stuff as the Union of States, the Federation. Good icons are hard to find, let alone great ones. Some of these cults predate the USA obviously. So it’s not so much like government encroaching on the church as the church asserting its intellectual property rights in the realm of the Zeitgeist.\n\nThe story need not be adversarial at all, as in the case of George Washington, who had no problem with Masonic rituals. The Quakers might be cast as synergyzing with n8vs per the early days in Sylvania (William Penn’s), comparing notes on governance and community building, only to bring their newly won insights to their new circuit designs, the ones that started up in Philadelphia but eventually moved to that former swamp called DC (District of Columbia).\n\nI live in “DC West” meaning the Columbia River has its watershed, a district. I’m in that district, near the confluence of said great river and one of its tribs, known as the Willamette.\n\nSo lets say here in DC West, a tribe of Quakers get very into Uncle Sam iconography, along with some brewpub already promoting the Grateful Dead. Would George Washington seem out of place? Certainly the Masons have been embraced (by the McMenamins brewpubs, talking about Oregon and Washington). I’d say “Deja vu”.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}