{
  "id": "108982004582905208",
  "title": "Churning",
  "published": "2022-01-28T06:30:00.002-08:00",
  "updated": "2022-01-28T06:30:54.106-08:00",
  "content": "For every thing there is a season, churn churn...\n\nI'm pretty much in agreement with Glenn Greenwald regarding the neocons having conned the liberals into being neoliberals, or something along those lines. \n\nThe more vocal pro-war pundits of the recent past, have been elevated on defense contractor TV, and made to sing those pro-war songs even louder, as folk music for liberals driving to work, listening to NPR.\n\nHowever there's a two-way disconnect between the political grid of mayors and governors, and the Wall Street casino with arms bazaar roots.  The mayors create sister city relationships and compare notes on street camping, while the District of Columbia goes off the deep end into fighting a Qanon interpretation of world events.  \n\nI'm not saying Qanon is winning (or whatever big lie theory), only that the general public has long since ceased to follow.  There's no real logic to it, so change channels.  Leave DC to fight its own inner demons.\n\nThen what happened was: oligarchies like in the soap opera Dallas, continued their battles over tax havens and business jurisdictions. \n\nEurope is somewhat afraid to compete with Russian capitalism and is using a protectionist NATO to keep the old dead horse narratives alive.  \n\nIs it working?  Will the people believe? So far it is not.  \n\nThe fear drums over Eurasia and the rush of action, merely advertises the willingness of these people to lavish money on their own melodramas, and neglect our more serious concerns.\n\nThe disconnect seems to be permanent, which doesn't preclude a somewhat business as usual attitude on the part of city governments.  \n\nWork with the truckers and universities to make life more livable for people on the city campus.  \n\nReach out to rural areas for local supply agreements.  \n\nPass the torch to a next generation, regarding agriculture, mass production, and life long learning.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}