{
  "id": "6191719897304922447",
  "title": "Citizen Diplomacy",
  "published": "2015-09-13T19:46:00.005-07:00",
  "updated": "2015-09-14T11:30:54.142-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/20776835164/in/dateposted-public/)\n\nThe Eliot Center is well-known to those of us working alongside Unitarian Universalists, an active and populous church in Portland's downtown.\n\nThe Unitarians' Mark Slegers is a strong choral director who gets a lot of eager participation from the congregation, as Curt confirmed this evening.  He married my supervisor at CUE (Carol Slaughter, coincidentally with same last name in a different language) way back in the 1980s when I was still fairly new in Portland.\n\nAnyway, tonight we attended (my mom and I) a celebration of the Jewish New Year (it's 5776), with citizen diplomats from Portland's Jewish and Iranian communities, with a smattering of Unitarians present.  This was not an evening for speeches, just people sitting around big tables and yakking.\n\nTwo floors down from here, Carol (mom) received a Congressional [lifetime achievement award](http://worldgame.blogspot.com/2014/06/lifetime-achievement.html) from Congressman Earl Blumenaur in recognition for her work on disarmament.\n\nThe [Pacific Northwest Social Form](http://mybizmo.blogspot.com/2014/09/pacific-northwest-social-forum.html), [Econovergence](http://mybizmo.blogspot.com/2009/10/econovergence.html)... plus some [Barcamps](http://mybizmo.blogspot.com/2010/10/barcamp-4.html), all staged in this building.  Lots of memories...  [Johnny Stallings](http://worldgame.blogspot.com/2014/02/the-lego-movie-movie-review.html)...\n\nAll this talk of peoples needing homelands got me thinking that Quakers should talk about wanting Pennsylvania to really be a Quaker State.  What would that even mean? Quakers have a history of continuing to move west, or to Costa Rica, to escape the slave-owning militaristic yahoos that have dogged the Americas since its inception.  The Quaker utopia envisioned for Pennsylvania never materialized.\n\nI think \"demanding\" a Quaker homeland is more a jokey way of saying we have a sense of independence and sovereignty too, as a Quaker Nation, and don't plan to always run or move away just because newcomer neighbors plan on being thoughtless blockheads in some way.\n\nWe look on the legacy left by the perpetrators of the Indian Wars (Andrew Jackson et al) with some skepticism.  Louisiana Purchase?  Yeah right.  From Napoleon?  Uh huh, sure.\n\nLets just say the United States is not entirely believable as an entity, despite all the theater, the role playing, given all the contradictions and how much we're asked to take on faith.  As science fiction, however, it has ongoing potential as a plot driver.  I've introduced [USA OS](http://grunch.net/synergetics/usaos.html) (operating system) as a meme in my writings.\n\nMom and I were yakking about the Scottish Nationalist Party (SNP) in the car on the way over, having picked up olives on the way.  There's a lot of anti-colonialist sentiment in Scotland as well.\n\nIt's just uncool to be tainted by the WMD brush and most nations would rather not sully their image by hosting such retro barbarisms.   The nuke nations form the Nuke Nation Ghetto of less morally developed, more delinquent nations.  Scottish have national pride and want out of the ghetto.  Who can blame them?\n\nScots provide safe harbor to WMDs (Trident submarines) because the UK / WDC / NATO forces them to do so, not because they think it's smart or the right thing to do.\n\nHearts and minds have been lost, leaving hollow institutions to strut and puff on the world stage, looking foolish, clown-like, but in an ugly, not-so-funny way.  A farce in other words, neither persuasive nor convincing.\n\nThe people in the room tonight are all eager for humans to get to a next level in their evolution wherein their suicidal tendencies are less salient.  Why tempt fate with such hubris?  We've seen so many accidents already.  Why is our drive for self preservation so disengaged?\n\nCurt, a retired neurosurgeon who worked with fish in a hospital setting, didn't have time to tell me if fish get as suicidal as humans do.  I doubt it.  The latter seem to specialize in taking stupid risks with the ecosystem and then paying for it later.  Fish seem less maladapted no?\n\nSpeaking of maladapted, I came back to a $39 ticket on my windshield, because I simply forgot the City of Portland changed its policies awhile back and now runs parking meters on Sundays.  It didn't used to be that way.\n\nI don't know why I slipped back in time like that.  I need to get back to the future.  I'll consider it a payment to city coffers earmarked for more refugee resettlement programs ([CUE used to help](http://controlroom.blogspot.com/2012/03/afsc-and-ethnic-phobias.html) manage those contracts).\n\nThe Jewish story of evolution gives humanity a direction towards what's better:  the Promised Land.  The past, in contrast to the future, is a relative nightmare, a state of enslavement (metaphorically Pharaoh's Egypt, no disrespect to the Misr of today).\n\nIn heading towards the Light, towards Freedom (Liberty and Justice for all), towards a Peaceable Kingdom -- and away from the darkness of the 1900s -- Judaism and Quakerism steer together in positive synergy.\n\n[](https://www.flickr.com/photos/kirbyurner/20778477673/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}