{
  "id": "6625915930513056356",
  "title": "City of Transients",
  "published": "2021-10-09T09:33:00.003-07:00",
  "updated": "2021-10-09T10:21:56.997-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/51513793233/in/album-72157719899262313/)\n\nIn the ordinary English I inherited from birth, a \"transient\" is someone who hangs out around the Greyhound bus station, not really from around here, and soon to move on (with our encouragement, \"we\" being the people who live here).  You could use \"transient\" interchangeably with \"undesirable\".\n\nThe revenge of the \"transients\" came with \"tourists\" who would come through laden with the gift of a hard currency. One's role in life was now to be authentic, loyal to one's traditions, so the outsiders could gawk at one's behaving so quaintly. The Amish could set up a roadside gift shop, and get the hard cash needed to procure from \"the grid\" (or \"the English\" in their jargon).\n\n\"Transient City\" is more fun than just a giant dreary Greyhound bus station, however I admire the Greyhound brand and so wouldn't mind working it in.  \"Disneyland for Bums\" doesn't get it right either, because a Wanderer is possibly a college professor, someone else skilled, serious, hard working.  Among the bums be anti-bums. The quantum physics of \"particles in transit\" includes a representative percentage of every human variety (even the rare types).\n\nI'm fine with working backward from the scandalized of the future.  Artificial Intelligence (Spielberg) does this with the anti-AI circus, wherein the anti-AI bash the AIs (the robots). My time-tunnel scenario was through the 1960s and Woodstock. Harlem had a blow-out around the same time (a giant party). \n\nMusic is core to Asylum City, as is the willing participation of government agencies ala Oregon's Vortex 1 festival, brought to my attention by Alan Potkin and tracked by me ever since.  \n\nThe Oregon Country Fair in Eugene, Oregon is another model.  Expand that to include a whole suburb of a larger City, with sound stages and FM radio bubbles, and lots of internet with storefront gamer shops.  Wait, didn't I just describe the 1990s?  \n\nWhere are the sports stadia and intramural events?  At the schools of course.  Scholars and athletes are encouraged to cavort, and even be the same persons if possible (a Greek ideal).\n\nThe transient nature of tourists coming here, to live awhile, then move on, based on new connections and situations, leads to a camaraderie one finds among tourists.  Some are too full of stories to ever shut up about and are hard to be with, especially if one is bursting with stories as well.  Others have an endless supply of travel tips and whet the appetite of Asylum seekers to get out, to see the world, to quit the venue of Wanderers, Flaneurs, Tourists and rejoin a more static community, a Terminus (station, placement).\n\nNot all my visions of Asylum City are this sprawling.  As I write, I find myself picturing current situations, the shanty towns, the refugee camps, stretching for miles.  How do we shape these into more festival centric \"tourist traps\" destined to drain, eventually, of those truly wishing to move away for awhile (they deserve a vacation), while serving as strange attractors for others.  \n\nThose who leave, may return (e.g. to Gaza), to see how a steady flow of tourism may shape a place that's ideal for transients.  Airport transit lounges provide a clay for our imaginative play.  Ambient Music for Airports.  Hello Brian Eno.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}