{
  "id": "66697063429903074",
  "title": "Civil Rights",
  "published": "2007-10-27T23:57:00.000-07:00",
  "updated": "2007-10-28T14:34:33.143-07:00",
  "content": "Saturday was inwardly stormier than Friday, though I discovered a [peaceful bus scene](http://worldgame.blogspot.com/2007/10/circus-bus.html) on my bike loop through North Portland.Sometimes [bats hit obstacles](http://books.google.com/books?id=4mWDC-WecfgC&pg=PA11&lpg=PA11&dq=bats+collide&source=web&ots=KUEBEbM0do&sig=23zukCvwN-hx-crMXrW9Bonsdak) (splat!) despite echolocation. Omnitriangulating takes time, whereas that \"left behind\" feeling may be somewhat immediate, requiring a kind of compassionate attention that some [tortuously rational process](http://www.grunch.net/synergetics/aphiloview2.html) may not provide.And so one prays for healing insights (sometimes mythical in nature), trusting one's little ego/cogito to catch up eventually (self reflection is critical).On a more extroverted note,  I've been working with [Wayne Yarnall](http://mybizmo.blogspot.com/2006/07/more-brainstorming-about-ecovillages.html) on [ADA issues](http://www.govtrack.us/congress/billtext.xpd?bill=h110-3195), in concert with [this new movie](http://www.musicwithinmovie.com/) that's coming out.  He'd make a good Wanderer, but our [Linus Pauling House](http://mybizmo.blogspot.com/2006/08/linus-pauling-house.html) headquarters is not wheel chair accessible.I think those candidates and incumbents with the guts to champion the rights of the disabled will consequently benefit so many wounded war vets, so often marginalized once sacrificed (an old, [sad story](http://worldgame.blogspot.com/2006/10/flags-of-our-fathers-movie-review.html)).Non-war-related disabilities needn't take a back seat though, nor am I arguing against the right to refuse service, just on what basis and why?Are we seeing some positive developments [in Darfur](http://www.kansascity.com/news/world/story/336162.html) of late?  Too early to know? Of course I'm still tracking [OLPC](http://lists.laptop.org/listinfo/), although I'm way behind in my readings.  Google News alerts remain helpful.  My thanks to [Ken Brown](http://worldgame.blogspot.com/2007/02/meeting-on-hawthorne.html) for staying in touch on this project.Are any candidates interested in our new global literacy campaigns? I call mine [P4E](http://controlroom.blogspot.com/2007/08/darfur.html) but no one else has to. The composition,  editing, and publishing, of sound, pictures, words and video, so frequently involves a computer these days.  Passing on a culture means passing on [its skills](http://notes.nassmc2.org/NBSfile07.nsf/38d46bf5e8f08834852564b500129b2c/d14ec4b6150098448525737f006ea65b?OpenDocument).  Geeks R Us, in so many dimensions.  [Accessibility issues](http://worldgame.blogspot.com/2007/10/ppug-cubespace.html) likewise apply.The role of technology in education:  it's not just about whether or not to use calculators -- a very dumbed down way to frame the debate in my view (ever hear of [programming](http://mybizmo.blogspot.com/2007/07/sa-8144-day-one.html) real computers), yet ongoing for over 30 years by this time (frustrating), with the digital divide growing ever so much wider in the interim (doesn't mean we can't bridge it, using open source techniques).Tara went to both birthday and Halloween parties today.  I too went to a 50th birthday party for [Art Kohn](http://mybizmo.blogspot.com/2006/01/what-shall-i-do.html) (a wanderer), with lots of people I didn't know, leading to random encounters. I wore my [Bodies T-shirt](http://mybizmo.blogspot.com/2007/03/human-subjects.html).  Two trains passing in the night near [OMSI](http://controlroom.blogspot.com/2005/12/presents-for-iraq.html) delayed my getting home, but only by a few minutes.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgm8sBF842n5ZR9m0sQ2xl4Icn8kN-ijc8ka8IVWwrdjn6uVIw3O955JFVSo6wolIv_qErHCttIBcdJ3X7oQAqRah1IaPV3NxMM4tBNAQzmOJH1nZxCoPO7rb-UuxSlqal-f3-J/s1600-h/small_art.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}