{
  "id": "5996373090874590240",
  "title": "Codes of Conduct (again)",
  "published": "2018-01-10T13:49:00.002-08:00",
  "updated": "2018-01-10T14:02:55.152-08:00",
  "content": "The memo put out by Liberals to wear black at the Golden Globes to protest sexual misconduct seems to have gotten lost in Liberal Logicville. They are soo clueless. [#tcot](https://twitter.com/hashtag/tcot?src=hash&ref_src=twsrc%5Etfw) [#ccot](https://twitter.com/hashtag/ccot?src=hash&ref_src=twsrc%5Etfw) [#gop](https://twitter.com/hashtag/gop?src=hash&ref_src=twsrc%5Etfw) [#maga](https://twitter.com/hashtag/maga?src=hash&ref_src=twsrc%5Etfw) [pic.twitter.com/nJjYgz9kSA](https://t.co/nJjYgz9kSA)\n— John K Stahl (@JohnKStahlUSA) [January 10, 2018](https://twitter.com/JohnKStahlUSA/status/951099289387716608?ref_src=twsrc%5Etfw)\n\nA lot of cultural misunderstanding persists, or shall we say culture clashes?\n\nHow could these women be against sexual harassment when dressing in a \"provocative\" fashion, the skeptics want to know.\n\nThe Pycon [Code of Conduct](http://mybizmo.blogspot.com/2017/12/codes-of-conduct.html) is specific about discouraging \"booth babes\" (of whatever gender) from mixing technology with erotica.  One is expected to dress in a more demure manner, which is what makes a Pycon not a Comicon, wherein cosplay is encouraged.\n\nThe same conversation goes on at work.  What dress style is appropriate?  Most of us have never really lived in a democracy as that question was never put to a vote.  We're told, not asked.  The job comes with a uniform.\n\nCollege students may perceive an ideal world wherein dressing is not a \"code\" such that what one wears may not be construed as \"signalling\" or \"suggesting\" anything in particular.  Garb is not for signifying.  The Portland State campus has been [a site for Slutwalk](http://mybizmo.blogspot.com/2014/09/slutwalk-2014.html), wherein speakers eloquently sketch their utopia, then parade in costume.\n\nA lot of the misunderstanding traces to English and the locution \"she made me feel...\" meaning we're able to use the \"victim tense\" rather easily.  If a guy feels consumed by lust, it's her fault.  We call it the blame game.  \"She made me do it\".  [Projection](http://controlroom.blogspot.com/2017/05/on-projection.html).\n\nAs a student of Peter Sloterdijk, I feel like saying the most we might hope for are spheres of agreement.  We'll give up on Pycon being like Comicon as we're free as individuals to attend one or the other, both or neither.  Not every domain need abide by the same rules.\n\nHumans hunger to establish villages, manageable communities, wherein their sense of taste gets expressed.  Vindication and satisfaction is in the realization, or at least it was a worthy experiment.\n\nThe Design Science Revolution was about lowering barriers to entry such that more might afford their brand of theater.  Find your like-minded and try it out.  The technology is within range, even if the ideals turn out not to be.  Find that out.  Live your dream.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}