{
  "id": "2845604163309428711",
  "title": "Code for America Projects?",
  "published": "2013-08-29T19:41:00.004-07:00",
  "updated": "2013-08-29T20:08:23.735-07:00",
  "content": "I have two new areas for Code for America to consider, or maybe not new as I've not been privy to C4A's meetings.\n\nMy only real contact was with their CTO at the last OSCON, [at the chairman's party](http://controlroom.blogspot.com/2013/07/oscon-orm.html) (we were saying good bye to Edd Dumbhill in that role, a team effort, with [Simon St. Laurent](http://www.oscon.com/oscon2013/public/schedule/speaker/3476) rotating in).\n\n(1)  get enough volunteer parents who speak Laotian, Vietnamese, Russian or whatever, all the languages of ESL kids, and help them learn Python.  In teaching ESL with Python, we're focusing on a technical subject, requiring technical English, yet there's room to better their skills typing in their native languages.  There's a lot to work out and I'm not saying only Python should get to play.\n\n(2) get enough traveling troupes together to help make the Internet come alive, as a culture and play space, for institutionalized or incarcerated individuals who might benefit.  This is a huge job and working with nursing homes is probably easier than working with prisons.  You want a population that's well briefed enough to stay safe enough to have the experience be rewarding.  Like when learning to scuba dive or roller blade, both potentially dangerous.  The Internet is not necessarily physically dangerous but it could do damage to your bank account.\nNeither of these may seem sexy enough, but the anthropologists tell us that closing the grandparent / grandkid loop is one of the great secrets of a healthy culture.  There's no reason grandpa shouldn't continue to poke around in C or C# with those fifty years his junior.  Nor should a teen shy away from having some grandmas in the queue wanting questions answered about HTML.\n\nI'm not saying anyone has to go to anyone else's house to make this happen, though I do have the CareWheels model ever at my fingertips.  That was [Ron Braithwaite's program](http://worldgame.blogspot.com/2005/07/wanderers-meeting-200575.html), a collaborative effort, to have non-invasive people monitoring services that kept older and frailer people safely in their homes for longer.  In that model, dispatching would be notified if Mildred needed a home visit.  My work [with Clackamas County](http://mybizmo.blogspot.com/2006/07/deq.html) helped me envision the dispatching side of the business.\n\nImagine going to school and having a parent-engineer (doesn't have to be your parent) speaking Vietnamese while also teaching you English, with \"learning Python\" a conversation piece.\n\nYou don't feel \"held back\" as learning Python is learning a STEM-relevant skill, plus you're addressing the topics of internationalization, world languages, Unicode, head on.   Here's a safe spac to [yak about culture](http://worldgame.blogspot.com/2011/01/economics-of-happiness-movie-review.html) and what it's like when they [encounter one another](http://worldgame.blogspot.com/2011/04/richard-stallman-at-psu.html).\n\nThe engineer might be there as an aide, along with two or three more aides, all of whom speak different languages.  They help students at their terminals, giving them suggestions.  They go back and forth between English and whatever else.\n\nThe main thing we're all watching might just be cartoons.\n\nThere's a way to rewind and pause.\n\nBut then you can watch them again at home (on Youtube?).  Each one comes in multiple languages but in ESL there's an emphasis on learning English (of course).  Keep going back and forth, learning Python and Unicode in between.  That's an ESL course many EFLers could benefit from.  Sign me up.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}