{
  "id": "5929745875337882490",
  "title": "CodeCastle Exhibit Space",
  "published": "2016-06-17T21:41:00.002-07:00",
  "updated": "2016-06-19T23:45:02.881-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/27123406994/in/dateposted-public/)\n\nI joined Patrick today on another expedition to an electronics store.  Last time, [we went to Fry's](http://mybizmo.blogspot.com/2016/06/stem-blends.html) in Wilsonville, a Kroger property.  Today we visited SurplusGizmos.\n\nWhen I was but a young lad here in Portland, before moving to Italy, I was most taken with OMSI and made it a centerpiece in my \"religion\".  I loved the interactivity of the exhibits.\n\nOne exhibit made me feel especially special:  I could hear frequencies up into the higher reaches, like Lassie (a dog on TV) whereas the adults around me said the tone of rising pitch had faded out for them.\n\nOMSI has since shifted [its location](http://worldgame.blogspot.com/2006/01/location-scouting.html) from near the Oregon Zoo to the east bank of the Willamette River, opposite the cable car station serving OHSU (our health sciences university).  The west bank has been completely redone, a new bridge added (Tillikum Crossing).\n\nMy fascination with interactive exhibits [has not waned](http://controlroom.blogspot.com/2007/05/omsi.html), and in exploring the stepping motors, small voltage pumps, hackable GPS devices and so on, I found myself wishing for exhibits that showed these machines actually doing something.  What better way to demonstrate the utility of some device?\n\nToy stores know the score, when it comes to model trains at least.  What gets the kids drooling is a fully developed layout with all the bells and whistles so to speak.\n\nThe electronics store did have some stuff switched on and running, however my imagination was in overdrive.\n\nSince [the ghost church](http://worldgame.blogspot.com/2016/06/ghost-church.html) has yet to become something mundane and unexciting, like more condos, I've taken the liberty of using Twitter to tweet it up as almost like another OMSI in some ways, themed around software meeting hardware and needing to control it (what software does) while passing the torch of knowledge and mastery to coming generations.\n\nWhen you're down to talking to chips over pins, looking at instruction sets, thinking about hexcodes, you're in the realm of the Silicon Forest, in terms of its expertise.  Many companies came to settle here and make hardware and software, including the testing and measuring devices essential to creating these products.\n\nHowever, the silos have gotten extremely deep to where worries about protecting intellectual property have pushed many to paranoia.  Open hardware and software is the reality check in some ways as it provides a set of benchmarks, serves as a barometer for the shared public space.\n\nJudging from what's open and \"already out there\", the investors speculate regarding what they might invest in that's more proprietary.\n\nI've been thinking the #CodeCastle, as I call it, could stay a nonprofit and not become too exclusively the tool of any one company and its technology stack.\n\nThat being said, companies would be eager to showcase their products in a workspace / playstation setting, in the form of interactive teaching exhibits that inspire corollary workbench activities.\n\nIn my dreams, we use the CodeCastle as a space to actually build some exhibits, out of both hardware and software.  Some exhibits go on the road.\n\nI'm always looking for the colored fluids and volumes demo, which might use various actuators and pumps, controlled by the operator.  Drain the rhombic dodecahedron into six tetrahedrons.  Or into one octahedron and two tetrahedrons.  Two cubes.  We could have a 24-volumed Cube get the balls rolling (the \"fluid\" might be little balls in some editions).\n\nWe'll have exhibits about the cloud, showing how playstations may be provisioned from containerized microservices on a VM.  Going in, many will not know what that means.  They'll come away with new insights and a broader knowledge base.\n\n[](https://www.flickr.com/photos/kirbyurner/27125270963/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}