{
  "id": "5344923343046238174",
  "title": "Coffee Break",
  "published": "2015-11-18T10:10:00.001-08:00",
  "updated": "2015-11-20T01:20:33.691-08:00",
  "content": "The term \"coffee break\" is a bit of a misnomer when applied to my doings, given I work and drink coffee simultaneously.  I don't \"break\" for coffee, usually.  I have it sitting here next to me.\n\nI think a lot of overweight and even ideal weight individuals would appreciate the privilege and opportunity I have to generate a modest income and pay bills, by sitting in an easy chair, somewhat kicked back.  I call this the Steve Holden Chair of Computer Science, as I inherited it from him when he moved back to the UK [from Portland](http://worldgame.blogspot.com/2011/02/open-secrets.html).\n\nTurn this coffee to beer and put some ball game on the screen across the room, and I'm in the archetypal posture of the relaxing sports event viewer.  People work so they can afford to relax like that.\n\nThat I can get paid work done in the same posture is a sign I've been lucky, by some cultural standards.  However I'm not sailing the Mediterranean in command of my ship, with a crew of Sea Org interns at my beck and call.  By other cultural criteria, Hubbard (I call him \"Elron\") was more \"living the dream\" in his later years.\n\nThe fact is, my home is permeated with invisible frequencies that my screen and keyboard tune in, to carry my keystrokes, sometimes voice, images, out to the cloud, where my doings make a difference, however small, in the lives of other people, as do their doings in mine.\n\nOf course I do other work too, such as housework.  I'm the chief domestic, no servants.  One of my primary responsibilities is looking after a no-longer-ambulatory dog.  I'm not sure what she weighs, lets say thirty pounds.  I'm strong enough to lift her up and, cradling her in my arms, get her down to the driveway level, so she doesn't pee on her bed or my rug.  I get her to poo on a newspaper usually.\n\nLately, circumstances have been less pleasant in that I've had a cough and sore throat, yet I'm on the hook to be like a radio host for a call in show about Python, a computer language.  My listeners also see my screen (not my face).  I've told them about the cough and for the most part am able to mute the microphone before I have a coughing fit.\n\nAnother thing I've been doing is watching rented documentary films, standard practice for me.  The TV across the room, not an HDTV flat screen but an older Sony Trinitron (still pretty flat), is not hooked up for broadcast channels, nor cable.  I use it strictly for recorded media.  Mostly I use the radio receiver under the TV, when not watching DVDs or listening to CDs (there's even a tape cassette deck).  For example, a couple nights ago I watched [Going Clear](http://www.imdb.com/title/tt4257858/), about the Church of Scientology.  \n\nUpstairs, I receive broadcast TV and in the back office, I get the minimum set of TV channels to get Internet via optical fiber, and all those house-permeating frequencies.\n\nShifting gears, I recall a time wandering through the lobby of the World Trade Center (not sure which of the twin towers) and seeing lots of exhibits on organization management, i.e. running a business.  I remember being impressed at the level of abstraction sometimes required, to impart these [various management theories](https://mail.python.org/pipermail/edu-sig/2015-November/011337.html).  Theology is no more intricate.  I was still pretty young at the time and had yet to have much experience in business myself.\n\nExploring further, I browsed over to Werner Erhard's site and caught up on some of his doings, in particular watching the [business management presentation](http://www.wernererhard.com/work.html) at the Simon School of Business in Rochester, New York.  Erhard is not someone I've met in person, but I did participate as a volunteer in his organization, in addition to paying for its trainings and seminars.  I've had hours and hours in large hotel ballrooms (as they're called) listening to people talk about their lives through microphones and amplification systems.\n\nLets contrast such a for profit or nonprofit business and all that \"metaphysics\" they get into, with \"church\", a way of mingling and perhaps benefiting by sharing benefits.  If you're looking to rub shoulders with or otherwise get in contact with interesting viewpoints and individuals, a religious establishment may be just the ticket.  Better than radio, or at least as good.  A religious establishment is also a business.  In fact, [if you're a Quaker](http://controlroom.blogspot.com/2015/07/annual-session-day-one.html), you're used to such terms as Meeting for Worship for Business.  Quaker Meetings have stuff to manage.\n\nI've also been in touch with a [Quaker friend](http://worldgame.blogspot.com/2006/09/more-about-quakers.html) about Landmark.  Sara has invited me to [Landmark events](http://controlroom.blogspot.com/2015/08/at-landmark-event.html) a number of times, [Landmark being a business](http://www.landmarkworldwide.com/who-we-are/company-overview).  I don't hear from her often (we are geographically far apart).  Here's what I wrote back just yesterday (one typo fixed):\n\nI just saw the new documentary on Church of Scientology, Going Clear, last night.  I wrote this review:\n\n[http://worldgame.blogspot.com/2015/11/going-clear-movie-review.html](http://worldgame.blogspot.com/2015/11/going-clear-movie-review.html)\n\nHistory\n is interesting to me.  In researching my blog post I got to the long \narticle about Werner Erhard linked to in the last paragraph (\"fair \ngame\") -- an article at the Erhard website.  I didn't realize how well \nhe was getting along with Christians, especially in Ireland.  What about\n Quakers and Centering Prayer then?\n\nFood for thought.\n\nI\n don't know when I'll review Landmark.  It remains a definite \npossibility.  In the meantime, I'm working on other ways to \"shape \nhistory\" (aka \"steer\") in ways that might be beneficial.\n\nErhard's relationship with R. Buckminster Fuller is what proved pivotal in my life in that after my years at Princeton (Class of 1980) I was casting about for new stuff to get into, and was receiving the est Graduate Review at the time (I had moved to Jersey City with college housemates).   I read about Fuller and Werner co-appearing at Madison Square Garden.  I did not attend that event, but felt prompted to start reading [more of Bucky's books](http://www.quakerquaker.org/profiles/blog/show?id=2360685%3ABlogPost%3A139355&commentId=2360685%3AComment%3A139622&xg_source=activity).  I was also participating in Centers Network at the time (the organization est had become before Landmark).\n\nThe sore throat, which was pretty severe, seems to be abating, almost gone.  There's still some coughing but not as much.  I have another Python radio show tomorrow night, as I do this gig two nights a week.\n\nLast night my mom Carol attended Wanderers at the Linus Pauling House to hear about Dick Pugh's work in the world of nuclear weapons back in the 1960s.  He's been reading the same book she did:  [Command and Control by Eric Schlosser](http://www.amazon.com/Command-Control-Damascus-Accident-Illusion-ebook/dp/B00C5R7F8G), about all the accidents and unanticipated turns of events in that line of work.\n\nI couldn't make it unfortunately but I'm glad she could go.  I'll be returning these documentaries to Movie Madness today.  The other was [an interview with Steve Jobs](http://controlroom.blogspot.com/2015/11/steve-jobs-lost-interview-movie-review.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}