{
  "id": "3519879865644238892",
  "title": "Coffee Shop Networking",
  "published": "2017-05-13T17:46:00.001-07:00",
  "updated": "2017-05-13T18:29:55.784-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/34256068420/in/dateposted-public/)\n\nThe clouds really let loose while I sat looking out the window of Common Grounds, here on Hawthorne Boulevard, Asylum District, Portland, Oregon.\n\nLightning flashed, and the power went out, twice. Thanks to some electrical issue in my Mac Air — not the battery — a power out entails a reboot.\n\nI was productive anyway though: I plowed through several lectures on Arduino programming, continuing with the MOOC I'm taking through Coursera; submitted an invoice for recent work; edited Wikipedia, adding how Python implements [partial application of arguments](https://en.wikipedia.org/wiki/Partial_application#Implementations) to functions, resulting in new functions.\n\n[Fellow Wanderer Dr. DiNucci](http://worldgame.blogspot.com/2015/08/concurrency-again.html) is here. I invited him to dinner at Szechuan Chef, I'm hoping with Alex.  We're always looking for excuses for Szechuan cuisine, and miss Lucky Strike being so close by.\n\nAlex confirms that was Yangsi Rinpoche I got to meet at Dwaraka briefly, back in April.  He's like the headmaster at Maitripa College, which I visited [a week ago](http://worldgame.blogspot.com/2017/05/buddhist-ghetto.html) tomorrow.\n\nWhat I need to get clearer on is how the Arduino IDE uses something like Processing to end up with C.  We tend to call Arduino programs \"sketches\", the same word Shiffman uses when teaching about vectors, acceleration and forces in his [Coding Train videos](https://youtu.be/s6b1_3bNCxk).\n\nI've been sharing my enthusiasm for the Shiffman syllabus [on math-teach](http://mathforum.org/kb/message.jspa?messageID=10148751), and also on The Physics Learning Research List.  He's one of several Youtube math teachers I consider talented. [Eugene Khutoryansky](http://controlroom.blogspot.com/2016/10/surveying-pedagogy.html) is another.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}