{
  "id": "5002617518243768084",
  "title": "Cold War Operations",
  "published": "2010-05-15T13:31:00.000-07:00",
  "updated": "2013-06-02T21:29:58.305-07:00",
  "content": "Last night we screened a bunch of videos.  I came in late from my [meeting with Patrick](http://coffeeshopsnet.blogspot.com/2010/05/buzz-about-shops.html).\n\nI saw one on UFOs / Area 51 (the usual aggrandizement of the Air Force, which gets to network with aliens [pre ](http://mybizmo.blogspot.com/2006/12/american-dad-plot-synopsis.html)[American Dad](http://mybizmo.blogspot.com/2006/12/american-dad-plot-synopsis.html)), and another on the Federal Reserve.  In between we screened [The Men Who Killed Kennedy:  The Truth Shall Set You Free](http://www.imdb.com/title/tt0270506/), apparently recorded off The History Channel.\n\nI'd seen this very same JFK video years ago, having rented it from Movie Madness.  I thought it was one of the more cogent in this genre.  There's an interview with the special forces guy, the guy who studies gray scale photography, the retired FBI guy... Lee Harvey Oswald's wife Marina.\n\nCoincidentally, I was revisiting the Prouty web site at the time, maybe tracking down some UFO reference.  Or was it the U2?  Yeah, I was [revisiting the U2 again](http://worldgame.blogspot.com/2009/02/u2.html).\n\nWatching conspiratorial videos while having a searchable Internet handy is a different kind of experience.\n\nAllen Dulles wanted to bully the Russians with the U2 right up to the summit with Eisenhower, even though the USA prez had [requested a halt](http://www.prouty.org/letter1.html) to those overflights.\n\nProuty is consistently adamant that Gary Powers was not \"shot down\" and even suggests that the plane, previously damaged, had belly-landed (again) safely, with a payload of non-regulation incriminating evidence.  Allen Dulles agreed the U2 could not have survived a direct hit (was he talking to Prouty?).\n\nCertainly [Gary himself](http://books.google.com/books?id=N6Rxh5ghpkEC&printsec=frontcover#v=onepage&q&f=false) survived, although the Eisenhower administration didn't know this at first, and so was caught red handed telling a number of bald face lies.  [These embarrassing developments](http://qwstnevrythg.com/2009/11/the-u2-files-mayday-1960/) derailed the summit, with Khrushchev coming across as anything but compliant following this (24th?) flagrant violation of Soviet airspace.  [This U2 incident](http://commons.wikimedia.org/wiki/File:Francis_Gary_Powers_U2_at_Moscow.jpg) had perhaps sabotaged early plans to \"win\" the Cold War.  Theories abound, [questions remain](http://hackslanderson.blogspot.com/2009/11/u2-to-jfk-myths-and-mysteries-of-cold.html).\n\nWhat's poignant about [this 1995 JFK movie](http://www.imdb.com/title/tt0270506/) is how the interviewees feel they're finally going public with some deep secrets, perhaps at some peril to themselves -- but does anyone really notice or care anymore?  Here we are in 2010, with a gaping hole in the history, a seemingly indecipherable knot it's perhaps easier to just walk away from.\n\nPeople are used to the idea of an official story of what happened, surrounded by a plethora of wacko theories.  End of story.  There's a three story geodesic ball to look out through (Reunion Tower, rotating restaurant), if you want to study Dealey Plaza as a casual tourist.\n\nI fall into the tourist category myself, as I don't boast any special credentials as a student of this event. Thom Hartmann, interviewed for this film, is way ahead of me.  I was but a few years old, living in Portland, when this event occurred.  I've studied the Prouty materials in some depth though, in part because of my interest in Asia (I grew up in the Philippines for most of my high school years).\n\nIndications at Col. Fletcher Prouty's web site are that neither President Lyndon Johnson (part of the motorcade) nor Bobby Kennedy saw the assassination as the deranged actions of a crazy loner.  Prouty never implicated Johnson in the assassination in any way, which I gather a subsequent episode of this documentary film series eventually did (I've not seen that episode).\n\nSubsequent to the Bay of Pigs fiasco, [attempts against Castro's life](http://mybizmo.blogspot.com/2006/08/blaming-castro.html) were ongoing out of the Attorney General's office, despite an agreement with Khrushchev to stop acting like the Mafia.\n\nDiem, a fellow Catholic, was still alive at this time.  JFK wanted to get all USA personnel out of Vietnam by 1965, which might've sounded like an admission of defeat unless some other shoe was to drop. Ed Lansdale, the original quiet American, wanted to return there, though not in the capacity of assassin ([McNamara](http://controlroom.blogspot.com/2009/07/slowing-down.html), then defense secretary, considered him willfully insubordinate in that respect, per [A.J. Langguth's](http://books.google.com/books?id=vQorBRYyu_gC&pg=PA245&lpg=PA245#v=onepage&q&f=false) book Our Vietnam: The War 1954-1975).\n\nGiven these behind-the-scenes machinations, blowback of some kind was anticipated, though perhaps not at this high of a level, and contingency plans had already been drawn up to prevent the spread of panic, in the event of retaliation.\n\nThe cover-up described in the film has to do with the size and nature of the wound, and of course where the bullets might have come from (the under street drainage system provides a new angle).  Someone else who saw the original autopsy photos confirms the gaping hole etc.  These images were then doctored to match the official story (analysis from the gray scale guy).  Divulging this information at the time was strictly verboten (special forces guy).\n\nThat Prouty was at the South Pole during the assassination suggests he could be the innocent insider (the tour guide) who would gradually help us understand what had really happened.  He points to his friend Ed Lansdale, with a corroborating second opinion, as presumably present on the scene.  [He writes to Jim Garrison](http://www.prouty.org/letter.html), appears with Oliver Stone, and tries to make himself understood as the real \"Man X\"  -- played by Donald Sutherland in [the Oliver Stone film ](http://www.imdb.com/title/tt0102138/)[JFK](http://www.imdb.com/title/tt0102138/), with Kevin Costner as Jim Garrison.\n\nProuty fingers Social Darwinism ([aka Malthusianism](http://controlroom.blogspot.com/2008/05/wmbs-satire.html)) as driving the \"make-war\" policies of [the post WW2 military-industrial complex](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html).  He quotes Bucky Fuller in this regard (in JFK).  This was also the Nazi ideology (eugenics), which not surprisingly had (has) many adherents among the moneyed, per War Against the Weak by Edwin Black.\n\nThese \"not enough to go around\" philosophies are self-fulfilling prophecies in that way, as squandering resources on killingry is a sure fire way to assure that there isn't enough livingry.  [GST takes a look](http://www.grunch.net/synergetics/gst2.html) at this trade-off, known to classical economists as \"guns versus butter.\"\n\nFollowup:  Trevor reminded me that he has some archived correspondence with Lee Oswald's ex-Marine friend Kerry Thornley, hauled before the Warren Commission because of their earlier association in the military.  This encounter left lasting scars, as Kerry concluded he was \"the next patsy in line\" if the LHO story fell through.  Trevor, fine with believing the lone gunman theory, hosts [Kerry's The Dreadlock Recollections](http://technoccult.net/archives/2007/01/25/the-dreadlock-recollections-the-last-journals-of-kerry-thornley/) online.  Trevor also showed me a copy of Drawing Down the Moon at Powell's, wherein Thornley gets credit for The Discordia papers, prototypical of Subgenius writings in some dimensions.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}