{
  "id": "7978635448637809147",
  "title": "Coming of Age",
  "published": "2007-06-13T20:10:00.000-07:00",
  "updated": "2007-06-13T20:10:49.628-07:00",
  "content": "Dawn believed in providing guidance and helpful reminders through ritual, and at a higher level used ritual to gain mindfulness on her path towards enlightenment.  She was also especially fond of coming of age books for or about young teenagers making that transition to adulthood, or about preteens becoming teens.Bringing these two together, and as a part of her legacy, our community is exploring ways to more consciously celebrate and acknowledge these transitions and those in the midst of them.  We're planning an event sometime in mid-July, before [NPYM's](http://www.npym.org/) Annual Session (at Reed College this year).  This event will include specific activities around Tara, Dawn's second daughter to cross over one of these thresholds.Planning for said event was a theme of our meeting at my house last night, along with another, that of death.  We talked about Dawn, greatly missed, and about a young boy, snatched away from this life by leukemia, and accompanied on this final stage by some in our midst, including Tara's friend Luci.Speaking of Dawn's daughters, I've added a link to Alexia's new blog in the right margin of this one.Some surprising good news:  my proposal to give a talk at [OSCON](http://conferences.oreillynet.com/os2007/) again this year was accepted.  I'd long ago [assumed not](http://worldgame.blogspot.com/2007/04/declassified-letter.html), but I was being too preemptive in my thinking.  That plus the trip to Vilnius for [Europython](http://www.europython.org/), still in the cards as of this writing, would make this a banner year, both for me and for CP4E.[Friend Gayle](http://controlroom.blogspot.com/2006/09/friends.html) is back from Greece where she and [Tom](http://controlroom.blogspot.com/2006/03/back-wired.html) shared a wonderful vacation.  She and Elizabeth were Dawn's dear friends and traveling companions on that trip to the holy wells in Ireland.  Laurie, another of Dawn's dearest, is looking forward to getting some of Tara's assistance running her high quality early childhood development program this summer of 2007.Mom, who was at this Coming of Age meeting last night, is now in Philadelphia for meetings.Also tonight: Glenn Baker's grand opening, at the AFI/Silverdocs Film Festival, of [Stand Up: Muslim American Comics Come of Age](http://silverdocs.com/festival/films/stand-up-muslim-american-comics-come-age/), his newest film.  Look for it on PBS someday.  Glenn and I were high school buddies in the Philippines, later house mates in Jersey City.  We've stayed in touch over the years.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}