{
  "id": "6842478597397387498",
  "title": "Common Grounds",
  "published": "2015-03-03T15:56:00.002-08:00",
  "updated": "2015-03-03T17:12:27.647-08:00",
  "content": "I'm hanging out with my coven mates, at the local Coffee Shop.\n\nWe're enjoying [Cyriak videos](https://www.youtube.com/user/cyriak) and talking about [Hortonian Networks](http://en.wikipedia.org/wiki/Strahler_number), Horton having invented hydrology, after Leonardo maybe (who was a Jack of All Trades).\n\n[Yarrow's birthday](http://worldgame.blogspot.com/2015/03/yarrows-birthday.html) yesterday was really fun.  He's just turned one.  The first nine months is year 0 (starting from glimmer in someone's eye), then as a terrestrial one starts counting through consecutive integers.\n\nOver on math-teach I'm boosting a kind of \"Gnu Math\" that draws on New Math but is not just a boring repeat of the 1960s and its Cold War.  The globe is not polarized in quite that way anymore.\n\nFor those just joining us, the associations between the Cold War and [New Math](http://mathforum.org/kb/message.jspa?messageID=9711501) were myriad.  As I was writing to a Friend recently:\n\nTalking briefly [about Vietnam](http://controlroom.blogspot.com/2008/09/paved-over-past.html), our friend under Ho during\n the push-back against the Japs (just evoking the lingo of the day, not \nattempting to be racist).\n\nHo was our friend.[[1](http://www.amazon.com/Our-Ho-Alan-Trustman/dp/0966182901/)]   The a \nhuge flip happened after WW2 and the fascists (Japs Germans Italians) \nwere our friends (Marshall Plan) and Russia and Vietnam were now the \nenemies (it would take awhile for Vietnam to become that way, but Russia\n was bad overnight, behind an \"Iron Curtain\" of Churchill's invention --\n Reagan's invention to tell them to take it down).\n\nVery \nintelligent people in the OSS were a lot like \"[Hanoi Jane](http://mybizmo.blogspot.com/2005/10/hotel-oregon.html)\" a generation \nlater (I've read her autobiography, Jane Fonda's, ex of CNN's Ted \nTurner).\n\nDid you know some Americans fought on the side of \nthe North in the Vietnam War?  That's a little known story.  Who can \nblame 'em, given their OSS history (the CIA would come later -- having \nlived in DC I would come to know [some of them](http://www.4dsolutions.net/synergetica/eja1.html) personally, another story,\n six degrees of separation, Kevin Bacon and all that).\nI've been making some travel plans today, work related.\n\nAnyway, when the Iron Curtain descended across Europe, it became important that the USA kids get up to speed on the kinds of maths that won the war, Turing's stuff in other words.  The University of Chicago started cracking the whip, getting us to turn into Bertrand Russells at a young age if we could.  Problem:  Bertie was actually a pacifist.  Einstein too. And Linus Pauling.\n\nOne of our number at been at the [Economics of Happiness](http://worldgame.blogspot.com/2011/01/economics-of-happiness-movie-review.html) conference recently, where a fair amount of technology bashing occurred, making the Internet be the problem.  At least it's something people can gang up and gripe about.  What's more cathartic than a good gripe session?  We're thinking to have one at Annual Session this year, though the proposal is not finalized. Friends get phished a lot.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}