{
  "id": "5900296781927931300",
  "title": "Considering Diversity",
  "published": "2013-03-01T07:31:00.001-08:00",
  "updated": "2013-03-14T21:31:23.778-07:00",
  "content": "The term \"diversity\" has become code within various subcultures.  Many related memes help form the complex, chief among them being \"race\", [an inherited corrupt idea](http://mybizmo.blogspot.com/2012/10/omsi-science-on-race.html) still entrenched among Anglophones especially.  North Americans are historically obsessed with \"race\", a kind of religion for them.\n\nHowever \"diversity\" may also refer to \"gender\" as in the Python world I frequent.  The outreach efforts of the PSF have had everything to do with attracting more women to Pycons, nothing much to do with racial categories.  My focus on Diversity (an e-list) has been recruiting non-Anglophones, given the Unicode capabilities of Python source code.\n\n\"Diversity\" may also refer to age.   \"Sexual orientation\" is a related meme.\n\nWhen the American Friends Service Committee talks about diversity, they tend not to collect birth dates.  Corporation members and board members tend to be \"grays\".  More, they want to know about my \"race\", and I'm not supposed to say \"[Asian](http://mybizmo.blogspot.com/2005/02/hotel-rwanda-movie-review.html)\" as that's not how racists would identify me.  My Swedish heritage etc. gets in the way and I admittedly haven't learned enough Kanji.\n\nThe AFSC Nominating Committee is delivering a report emphasizing that ethnicity, age, and sexual orientation are indeed on the radar.\n\nLooking out over a sea of white-faced (pale-faced) people and complaining of \"no diversity\" is of course a kind of selective blindness (could be called bigotry), a variety of \"all Xs look the same\" (and therefore are).\n\nEven genetically, you'll have lots of diversity among whites, blacks, yellows, reds etc.  However, it's \"ethnicity\" that introduces more metaphysical forms of diversity.  Ideology makes a difference.\n\nA book called The End of Racism by Dinesh D'Souza is [an interesting contribution](http://www.washingtonpost.com/wp-srv/style/longterm/books/chap1/endofrac.htm) to this literature.\n\nI'd say the membership is maybe disproportionately academic.  Lots of teachers / professors and retired teachers / professors.  That's an ethnicity (subculture).  Maybe we should add a check box for that, when measuring our characteristic mix?\n\nI do find it a quaint practice among Anglophones that speaking of \"colored people\" is considered a somewhat racist practice whereas speaking of \"people of color\" is a more accepted idiom.  English is a bit of train wreck eh?\n[](http://libreplanet.org/wiki/Group:Empowermentors)\n[More open source geeks](http://libreplanet.org/wiki/Group:Empowermentors) involved in AFSC work might be nice.  The central office has standardized on [Microsoft Sharepoint](http://stackoverflow.com/questions/247959/open-source-sharepoint) for its internals. [The ideology](http://xkcd.com/225/) of sharing source code around the world, as a form of activism, is not well established in this organization.\n\nI don't think we have any tribal members as AFSC corporation members (speaking of \"Indians\" as ignorant Anglophones called them).  That's ironic given Quaker history.  USA maps that don't color code the \"reservations\" (also \"military bases\") are withholding some important information.  When it comes to data overlays, ala ESRI, I favor displaying this layer more frequently.  Show us the prisons too.  [Elizabeth Furse](http://worldgame.blogspot.com/2012/11/wanderers-20121128.html) would be of help to us I'm sure.\n\n\"Changing the narrative\" is the title of one of the slides we're watching (I'm in the corporation meeting as I write).  That sounds like [CIA talk](http://controlroom.blogspot.com/2013/02/zero-dark-thirty-movie-review.html).  Should we recruit more spooks / ex-spooks?  [Valerie Plame](http://worldgame.blogspot.com/2010/07/countdown-to-zero-movie-review.html) maybe?  A lot of exCIA people have taken [strong positions](http://mybizmo.blogspot.com/2009/03/uncovered-movie-review.html) many Quakers could agree with.  Stansfield Turner?  If the goal is diversity...  Of course Friends tend to demonize the CIA as a proponent of outward violence; all the more reason for more outreach then.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}