{
  "id": "720313132964371028",
  "title": "Contra Opinionism",
  "published": "2021-02-08T12:24:00.002-08:00",
  "updated": "2021-02-08T12:25:24.990-08:00",
  "content": "I was grousing the other day about what Individualism (individuation) is not, actually reiterating a pet peeve of mine, first consciously formulated around high school.  \n\nNow these were good schools mind you, as the parents were already at the top of their games usually, living a high life of some kind. \n\nWhat they all said they wanted you to learn was \"critical thinking\" which means how to think critically, but what does that in fact mean, let us pause.\n\nWhat \"critical thinking\" doesn't mean, yet what comes across as a poor substitute, is being strongly opinionated on a wide variety of topics. This gets confused with \"building character\" i.e. someone with character is known to kvetch and moan, or praise and promote, about a very long list of notions.\n\nWhat seemed to be happening is my classmates and I were being encouraged to express strong opinions about matters we'd barely considered.  The way to acknowledge learning about something, was to pass judgement thereon.  \"Knowing about\" meant \"having formed opinions about\".  Therefore, strong opinions could be taken as knowing.\n\nI suppose a \"knowing person\" is what the schools coach us to become.  But how much of being \"knowing\" is pure affectation?  \n\nWhat I came to was a disparaging opinion of \"know it alls\".  A \"know it all\" isn't just good at regurgitation information, which can be an impressive skill, but someone who invariably accompanies that information with some kind of judgement or spin.\n\nObviously I'm being opinionated and judgemental right here, so am I not hypocritical?  I may well be hypocritical on occasion but I don't see any logical contradiction in questioning an ethic, and an esthetic, which is itself about \"being critical\".\n\nA reason distopians might give for the ultimate untenability of utopian communities with libertarian and democratic ideals, is that once you have a bunch of know-it-alls in the room, collaboration quickly becomes impossible.  The principals become too interested in jamming one another's plans.\n\nHowever, if a primary reflex of most of the denizens is \"not necessarily my business\" or \"I'm not prepared to venture an opinion\" we could have a lot smoother functioning.  People are happy to stay on the sidelines and not feel aggrieved at every turn, because their opinion was not sought.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}