{
  "id": "115761629016383405",
  "title": "Cooling My Heels",
  "published": "2015-07-21T12:02:00.006-07:00",
  "updated": "2023-09-28T12:32:12.474-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157653861631353)\n\nI'd never thought to take that phrase suddenly:  \"cooling my heels\" -- what does it mean?  Deke, a long distance runner in his college years, a \"track star\" as we say, recommends submerging said heels in a bath of ice cold water.  I've been trying that, with just the one heel.\n\nAlso in the leg department:  Sarah the dog's have gotten rickety to where she can barely walk.  I have to help her up on her haunches, at which point she's able to teeter around.  She has an appetite.  Given I'm at home a lot, working, it's feasible to keep watch and monitor.\n\nI'm due to see a certified M.D. in the near future, having heard [Louis C.K.'s doc's prognosis](https://www.youtube.com/user/louisck/featured) already (a comedian, lots of Youtubes).\n\nI've learned the \"embed\" tag's API allows for start and stop times i.e. one may excerpt using HTML.  My thanks to John Denker on PHYSLRNR (a listserv) for digging that up for me.  We'd been talking about how one \"quotes\" video (off-list).\n\nI'm cooling my heels in another sense:  just hanging out \"on the hallway track\" as we call it, sitting quietly with other geeks, each submerged in a laptop.  Conversations carry on quietly around me.\n\nMost geeks are in their tutorials, but given dog care duties and yakking with Carol and Lindsey, I opted to join the hallway track on the ramp up to lunch, blogging and managing my queues.  I'm wearing my O'Reilly School of Technology T-shirt, bright red, with name badge to match, with the black Stetson, just to add a touch of West Region (or West Zone or whatever it is).\n\nHaving my Fujifilm XQ-1 back is fun, as I zip around snapping some great angles in a quiet period, the lull before the storm.  A large influx occurs on Wednesday after the optional two days of tutorials on Monday and Tuesday.  These tutorials are a professional investment for many present i.e. [that Docker tutorial I attended yesterday](http://controlroom.blogspot.com/2015/07/oscon-2015-begins.html) will for some be a springboard to future professional development work.\n\nThoughts of professional development bring me back to Quaker business, and the conference I just came from in Spokane (at Whitworth University), and the emerging possibilities for some positive synergy twixt the Friends and geekdom.\n\nEarlham College is already a recognized center of excellence in computer science, for undergrads and eclectic types especially (the emphasis is undergraduate education at that school, similar to Princeton in that respect).  A dockerized Python + Neo4j core designed to help a Monthly Meeting self-manage its affairs might be a fun pilot project, already embarked upon for all I know (my stirring the pot does not amount to a \"project\" yet, minus any shared repository).\n\nThe thing about Quakerism as a worthy target for textbook CS projects is they have so many moving parts yet a logical order, amenable to both SQL and no-SQL based treatments.\n\nFor example, every Monthly Meeting has its Standing and Ad Hoc Committees of rotating membership, often with staggered (partially overlapping) terms, each with clerks and recording clerks, cross-enrollment ex oficio and so on, with regional structures to boot.\n\nThat's a lot to graph, beyond a mere flat file listing filtered on tags.\n\nI've been emphasizing Unicode aspects of the design on our NPYM IT discussion list (a Google Group).  A visiting delegation sporting name badges outside of Latin-1 could have phoneticized English for local consumption.  The badge wearer may choose double-sided, just Cyrillic, or whatever. \n\nI updated Sam Lanahan by email this morning, about David Koski's finally finding another explorer showing up in the same ballpark of phi-scaled tetrahedrons and their many assemblies, including with details of Holding It Together (a tension-compression sculpture). \n\nI've pointed the Coffee Shops Network blog in that direction, linking to both the [Grayham Forscutt video](http://coffeeshopsnet.blogspot.com/2015/07/inhabitable-membranes.html) and a [recent summary of explorations](http://coffeeshopsnet.blogspot.com/2015/07/mind-gap.html) within the Concentric Hierarchy of Synergetics fame.\n\n[Once again](http://worldgame.blogspot.com/2012/07/oscon-2012-tutorials.html) I found myself at a Pythonista lunch table reminiscing with an old hand about the heady days of Zope and Plone. Both these open source projects have served as valuable opportunities for talented coders to evolve the technology of the Object Database as a breed.\n\n[](https://www.flickr.com/photos/kirbyurner/16140315443/in/photolist-rBueeZ-qAgksK-pgpCsf-8EDKQK-8teDJ4-7HuR6q-7jQ3cJ-5YaqXF-5DoFbK-5f542z)\n\nДержись!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}