{
  "id": "7180616733441149944",
  "title": "Core STEM Topic:  Cardio",
  "published": "2015-08-09T17:31:00.002-07:00",
  "updated": "2015-08-09T18:35:06.676-07:00",
  "content": "The audience for Websites does not have to be \"the public\" \ni.e. a tool used inhouse to do an existing job is more our focus.  \nMy background is in medical research, heart stuff in particular.  \nWhy not start with the heart as a STEM topic?   \n\n--  [me on edu-sig@python.org](https://mail.python.org/pipermail/edu-sig/2015-August/011292.html)\n\nIn learning to program a website, we might focus on anatomy more generally, but how about we start with this amazing pumping device and the service it provides:  sharing oxygen gas as well as metabolized food, to hungry cells throughout the body.\n\nThe beating heart is a very physics-oriented topic, ala First Person Physics ([FPP](http://mybizmo.blogspot.com/2006/04/more-first-person-physics.html)), in that it's bio-electrical and has specific throughput to maintain, at a set pressure.   The alimentary canal aka digestive tract would be a next system to explore, with musculature and skeletal framework providing the means for motion, including within an environment.\n\nElastic Interval Geometry ([EIG](http://worldgame.blogspot.com/2004/11/canadian-tech-springdance.html)), somewhat obscure but well-developed in software [by Gerald de Jong](https://www.youtube.com/user/geralddejong) and some others, provides a bridge topic twixt ordinary vector mathematics, developed in our  [{ Python ↣ Java ↣ Clojure } spiral](http://controlroom.blogspot.com/2015/08/asynchronous-learning-engine-ale.html), and muscle-bound creatures with traction, on a planetary surface.  Gerald invented Fluidiom to model a kind of genetic algorithm whereby those elastic geometries with the most ability to \"get somewhere\" rose to the top.\n\nEIG simply applies tension and compression values to Edges, where any Edge is defined by two Vectors.  The vector tips or Points do not really exist in a sense, in that all the math happens in the connecting intervals, the \"I\" in \"EIG\".\n\nStretched to longer than equanimity, the Edges pull, work to contract, whereas those compressed beyond equanimity press to elongate.  The vector sum of all these tendencies takes us to a next iteration in some smooth animation.\n\nGoing from all [\"resting\" Edges](http://mybizmo.blogspot.com/2015/08/stem-carbon-as-theme.html) (no forces) to a regime of pushing and pulling, ala the Tensegrity or \"floating compression\" concept by which EIG is inspired, takes us from a Platonic Realm into something more energetic and unsettled, capable of far-from-equilibrium dynamism.\n\nBut those Fluidiom creatures are still purely mathematical and don't need a beating heart to \"get somewhere\", which brings us to the cardiovascular system as a place to anchor fluid dynamics in a different sense.\n\nIn FPP, we're keen to generalize around the concepts of Energy and Energy per Time i.e. Power.  Metabolites, impounding solar energy in the form of hydrocarbons e.g. sugars, power [the ATP cycle](http://mybizmo.blogspot.com/2015/07/what-is-work.html) whereby the \"bio-batteries\" continuously charge and discharge.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}