{
  "id": "8136883074691913872",
  "title": "Corporation Meeting",
  "published": "2011-03-04T08:11:00.001-08:00",
  "updated": "2021-05-31T12:33:39.368-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157626076057099)\n\n:: AFSC Corporation Meeting ::\n\nQuakers have this business-oriented vocabulary stretching back to the early days.  They (we) actually have \"Meeting for Worship for Business\" which to skeptical ears could sound like we worship the almighty dollar or some cash cow (golden calf).  \n\nAre Quakers the moneychangers in the temple?  At one time maybe.  I had [a recent thread with Ed Cherlin](http://controlroom.blogspot.com/2011/01/2011-day-one.html) about all that, on mathfuture of all places.\n\nSo I'm at the annual meeting of \"the corporation\" i.e. the American Friends Service Committee. I'm at Friends Center, affectionately known as \"the Quaker Vatican\".  My role is \"Yearly Meeting Appointee\".  North Pacific Yearly Meeting being the region I'm representing, along with my peers.\n\nHugh Thomforde is here, whom I haven't seen since around 1970 in Rome.  We used to go to his family home for Quaker meeting on Sundays.  Great family!  His dad worked for FAO (Food and Agricultural Organization).  \n\nHugh, these days based in Arkansas, is savvy about fish farming, other things aquatic. Based on his experiences in the Philippines, he helped establish a pearl farming industry in the Cook Islands, working for USAID.  That project had Cold War origins and at first encountered much skepticism as the \"nuclei\" needed to start pearls sounded too much like the \"nuclei\" associated with nearby nuclear testing by [organized criminal syndicates](http://controlroom.blogspot.com/2010/12/countdown-to-zero-game.html) (highly unpopular with the locals). We might call this a \"name collision\".\n\nMy mom (Carol Urner) is here too, flying in from Whittier, and [Tom Head](http://controlroom.blogspot.com/2006/03/back-wired.html).\n\nThe clerk is using a Tibetan \"singing bowl\" to anchor her introductory talk.  She's about to introduce our new [General Secretary, Shan Cretin](http://afriendlyletter.com/index.php/hard-core-quaker/flash-afsc-picks-shan-cretin-as-new-gen-secty/).\n\nMy work with AFSC in Portland was youth-focused.  I helped launch a new chapter, as volunteer clerk, after my internship as contributing editor of Asian-Pacific Issues News, [apprenticing under Paulette Wittwer](http://mybizmo.blogspot.com/2009/06/prisoners-for-pelau.html).\n\n[AFSC has been influential](http://controlroom.blogspot.com/2010/02/notes-from-lunch.html) on my thinking in that it tends to focus on [various media campaigns](http://mybizmo.blogspot.com/2010/07/marketing-campaigns.html) which often go against the grain of contemporary popular opinion.\n\nQuakers, especially our branch (so-called \"unprogrammed\"), are pretty tiny and esoteric. Getting anything done requires making strategic alliances, sometimes with unexpected collaborators.  Somewhat in jest (and to raise eyebrows), I've been known to refer to the AFSC as \"the Quakers' Machiavellian agency\".  If you know your history, that's somewhat apropos.\n\nOne focus of AFSC these days is the exploitation of workers, modern forms of slavery.  We probably need to give up the popular conceit that slavery has been \"abolished\" (according to whom?).  Many businesses are slave drivers and participate in human trafficking.  Exploitation of the undocumented (so-called \"illegals\") is another way a [broken and decrepit nation-state system](http://worldgame.blogspot.com/2006/07/pr-for-pl.html) has been corrupted to feed the rapacious maw of [unethical moneymakers](http://www.grunch.net/synergetics/grunch.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}