{
  "id": "3043767328623398797",
  "title": "Data Science",
  "published": "2018-05-07T23:00:00.000-07:00",
  "updated": "2018-05-07T23:06:59.049-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/40127075692/in/album-72157693427665102/)\n\nI get these analysts hinting I should see them as part of Capitalism's Invisible Army, but then I have my own litmus tests.  \"Are you familiar with Grunch of Giants?\"  Thom Hartmann uses an epigram from that book in his Unequal Protection.  He's had a show on RT off and on, lives in Portland.\n\nAlso \"do you know how to use Jupyter Notebooks?\"  As an analyst, I'd expect at least that much literacy.  Especially among the new hires.\n\nWe've got a lot of old farts running around pretending to be \"intelligence professionals\" but in many cases I see no tell tale sign this is the case.  I point out to my peers what to look for.\n\nFrom Facebook:\n\nWe might come away with different conclusions based on whether we watch RT or MSNBC, but a chemical weapons attack on civilians in Douma in April either happened or it didn't right? That can't be left as open ended. What I've seen, based on several sources, is that it didn't. We see the video showing where and when the victims were supposedly treated, then go back to the exact same location, same room, same hoses, and interview some of the very same people we saw in the original video. They're fine. They say the White Helmet people were shouting \"chemical attack\" and spraying cold water on people. I'm not so relativistic about reality as to think \"it happened\" and \"it didn't happen\" at the same time, as if we were talking about Schrödinger's Cat.\n\nWhere I come down in my investigation of the concept of \"gaslighting\" is it's important that a \"perpetrator\" has to be knowingly deceiving e.g. if RT hired crisis actors and meticulously recreated the original scene, all to give us these fake interviews that made us question our reality, doubt our sanity, that would be gaslighting. Those who believe the Moon Landings were a hoax think that some core people, such as Stanley Kubrick, were gaslighting, i.e. knowingly participating in a ruse. On the other hand, someone who naively believes in the hoax (a whole-hearted dupe, such as myself), is not gaslighting. If you sincerely believe X and seek to persuade others of X, that's by definition NOT gaslighting. You have to know that you're lying and deceiving. Like if you've committed murder and want to hide your crime.I've been watching postmortems of the invasion of Iraq trying to figure out if Dick Cheney was gaslighting or if he was simply inexperienced in intelligence matters and couldn't fathom that documents such as the yellow cake from Niger memo might be forged, or that exile expats might lie. My current hypothesis is he was dangerously naive and inexperienced and actually believed the misinformation he was being fed. I think most analysts believe he was knowingly lying i.e. gaslighting. Either way, the lesson learned, it seems, by those eager to prosecute their war, was that pausing to discover the real facts of the case are an impediment and could end up derailing the war plan, so the new technique is to respond without pause, because waiting to discover facts is considered weak. To me, that sounds like a form of insanity and/or like a case of gaslighting (intentional deception).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}