{
  "id": "3206728360142777613",
  "title": "Data Science and Statistics: different worlds?",
  "published": "2020-04-23T23:30:00.000-07:00",
  "updated": "2020-04-23T23:35:44.063-07:00",
  "content": "How do we share data science in place of any high school stats course?\n\nAddendum (follow-up thoughts), copied from Facebook:\n\nKirby to CJ:\n\nI think Polya's point, that inductive reasoning is no less prevalent in pure mathematics than anywhere, applies in the case of many of these Ramanujan formulae. They work out to some arbitrary precision negating any likelihood they could be wrong, and yet... the absence of proofs in some cases may be inevitable, according to Godel right? But if you manage a proof, so much the better. That's what mathematicians strive for, over conjectures (though even the latter may be plenty valuable).\nCJ to Kirby:\n\nI think Pólya's point is deeper: if we want to learn from experience we need induction. To get to any mathematical truth (whether one that is new or a rediscovery), we need to inductively explore the situation before we can find a proof. Indeed our inductive work frequently may suggest a proof, if we are attentive. Even if we cannot devise a proof, we may find good evidence for the conjecture. We can keep searching for more evidence or a proof as we have free time and interest to explore one question or another.\n\n[Chapter I in the book](https://archive.org/stream/Induction_And_Analogy_In_Mathematics_1_#page/n21/mode/2up) is excellent.\nKirby to CJ:\n\nI agree he's making that broader point, and may not even reference Ramanujan, I haven't found yet where he does if so. That mathematics is replete with inductive structures, unproved conjectures, is definitely worth pointing out. Would these be synthetic judgements a priori ala Kant? We don't really know they're a priori unless proved, but the question remains where or how intuitions might give rise to such equations (as Ramanujan's). What muse \"induces\" such insights? Thanks for supplying that link, and the other to the video of Polya.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}