{
  "id": "8654873122107233109",
  "title": "DC Withdraws from Governance",
  "published": "2013-10-03T11:27:00.001-07:00",
  "updated": "2013-10-06T00:07:52.558-07:00",
  "content": "DC appears to be bowing out.\n\nThey call it a \"government shutdown\" meaning when I went to a Library of Congress website, I got this message:\n\n[](http://www.loc.gov/)\n\n# \nDue to the temporary shutdown of the federal government,the Library of Congress is closed to the public and researchers beginning October 1, 2013 until further notice.\n\n# \nAll public events are cancelled and web sites are inaccessibleexcept the legislative information sites THOMAS.gov and beta.congress.gov.\n\nSo does this mean the Pentagon is no longer refilling its aircraft carriers [with BP](http://mybizmo.blogspot.com/2012/07/big-fix-movie-review.html)?  No, of course not.\n\nThe Pentagon runs with or without the Feds as it's controlled by the private sector which uses DC as a sham, to give people the illusion of a Federal democracy among some 48 states in North America.\n\nWhen democracy shuts down, the occupations (e.g. of Hawaii, Okinawa... [Afghanistan](http://mybizmo.blogspot.com/2013/10/afghanistan-again.html)) and permanent base construction proceeds apace.  Mostly just civilians are affected.\n\nDC is telling the world it no longer needs or wants to be taken seriously as a center of governance.\n\nWe get it.  That's been obvious for some time.\n\nWashington DC has been in the process of de-legitimizing itself for quite awhile, starting aggressively with the Nixon Administration.\n\nThe question is:  when DC starts up its sorry show again, will anyone care?   Sure, many will.  It takes awhile to lower expectations so completely.\n\nSwitching medical services to other circuits would seem to be in order.  The MD community, doctors without borders, must be in high gear.  Shall we appeal to the UN for disaster relief?\n\nThe rumor is whole departments are soon to disappear, FEMA among them -- or am I reading the wrong sources?  We'll need more foreign aid and care packages than we're already getting.\n\nEver since the end of WW2 there's been a lot of cannibalization going on, as tax-funded research and development was privatized and spun off.\n\nAt some point, you go below critical mass and the whole thing just dies.  There've been lots of rehearsals. \n\nHow about the US Post Office, who or what will replace that?  We may not be able to take junk mail for granted anymore.  But what about pay checks?  Electronic transfers?\n\nDo we need to designate a new capital city?  How about LA?\n\nWhen they turn the ignition key will it start up again?  Under new management maybe.  These clowns can't be trusted with the Library of Congress, that much is obvious.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}