{
  "id": "7072629795894950461",
  "title": "Debating Race on Q2",
  "published": "2020-05-26T11:38:00.000-07:00",
  "updated": "2020-05-26T11:38:39.392-07:00",
  "content": "Thank you for your contribution to this discussion Aaron. I still brave coming here even though Chrome insists I'm at risk (some certificate configuration thingy). The red exclamation point next to the URI reminds me I'm here against Chrome's better judgement.\n\nAnyway, I understand how human languages branch and fork into family trees.  Computer languages do that too (branch and fork, have ancestor influences and descendents). much as rivers do, and the notion that Semitic languages form one such family, on purely philological grounds, seems pretty plausible, if not outright indubitable. Sanskrit fits into this puzzle too.Then you get a rather different concept, of Semite as \"a race\". That's crossing a threshold into new territory in my book, as we're no longer discussing communication codes.  Now we're talking animal husbandry, and family planning.  The stakes seem higher and the danger of animosity greater.  I'm heeding Ashley Montagu's warnings, about \"race\" as man's most dangerous myth, a myth going way back to before genetic science, or Ancestry.com. I've remarked earlier in this discussion how these racial undertones give off a vibe or smell that reminds me of Aryan supremacist ideology, so vested in notions of \"super-race\" (an ideology requiring of the concept of \"race\" in the first place, and therefore \"pure\" versus \"hybrid\" strains or classes, i.e \"mixed race\" or \"mongrel\" versus \"pureblood\"). Semite in the sense of \"race\" gets traced back to scripture (to Genesis) by many scholars, religious and not, who point to the descendents of Noah as the begetters of N races where N = Number of Noah's sons (a patriarchal reckoning is taken for granted). Bible School websites teach the story of Noah in the same breath as they plant the seeds of racism.Then, after the Flood, in a following chapter came the Tower of Babel debacle, which ended up in these Races dispersing around the world (a first diaspora).  And so, children, this is how the Races of Man came to be.  I don't believe contemporary genetic science has any corresponding theory of such a severe, near-extinction level cataclysmic event for all humans, let alone all species, although bottlenecks there may have been according to the mitochondrial record etc. Our species has certainly enjoyed its share of disasters (more to come), with many of them self inflicted, or so it seems to appear in some god's eye view, to which we are mysteriously privy (something about a shared \"image\"); certainly the Babel debacle was one of those. The disaster was our wasting time on single-mindedly building that silly tower, not the liberating solution that God devised for us.Genesis gets to stay meaningful as a profound myth: the Tower of Babel story is quite powerful in my book.[ I've seen the Youtube channel Genesis Apologetics, which seems to want to re-literalize those Bible stories. There's always the temptation to saddle the ancestors with our contemporary cosmology, seems comforting.  Manifestly, the \"curse of many tongues\" was never lifted (pssst: because it's not really a curse, praise Allah for our biodiversity and freedom from groupthink) ]What I sense within some branches of Judaism is a strong interest in Ancestry.com type concerns i.e. genetic heritage and lineage, which is something we can trace in geographic terms (genetic markers moving around on a globe). When you get to the age of jet air travel, the record gets more confused. Christianity, as a latter day state organized and supported religion (historically speaking) of monarchs and emperors, satellite nobles, is of course all caught up in pedigree and distinguishing royalty from the unwashed masses etc., the animal husbandry derived genetic science of selective breeding, originally based in theories about \"blood\" (a lazy pseudo-scientific language perpetuated to this day among the common folk (smile)).[ Christians who think Jesus survived the crucifixion to have children tend to have more focussed genetic obsessions, however said \"Da Vinci Code\" minority may be branded heretical. Likewise are Quakers (the sect) so branded by many a shocked flock. ]\n\nI'm a fan of Isaac Asimov for his three rules of robotics, a way of talking and thinking about ethics, human to human as well.Gene Roddenberry's Star Trek introduced the Prime Directive (a doctrine of non-interference), so much the opposite of colonizing or beaming down missionaries. Star Trek communicated a more secular / catholic / universalist / liberal (\"live and let live\") code of conduct. Mark Twain and Thomas Paine are in the background (more influences).Given such hallmarks of Americana inform my thinking, I say \"far be it from me to try deprogramming every cultish devotee I come across\".  Like if you choose to believe in \"races\" (what I'd call a \"whiteman concept\" in my homebrewed vernacular given its Social Darwinist roots) go right ahead, free country.  Your bag of beliefs (worldview) is your cross to bear (karma).  Debate me if you want to.However, even as I leave people to their bags of belief, I make room within Quakerism for a Planet Earth = Promised Land revelation (ongoing). We've been chosen by God to cherish or trash it, make it our heaven or our hell. A big responsibility, especially with free will. Lucifer's angels are betting we fail, and torture us with our own shortcomings.Given the confusion of tongues (a gift!), we maybe thought (or at least some of us did), that some patch of land in the Middle East is what a few tribes of humans were destined to inherit, to be given the gift of, by our Lord. That was the whole point of those stories, those myths. However, in hindsight, some of us see it was more than that. We now have a more clear-eyed view of the species predicament, and we're are grateful for this opportunity to prove ourselves worthy.  Amen. Some of us might confess our convincement as Jewish, others not (without being anti-Jewish about it, in contradiction of what's been revealed).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}