{
  "id": "3173715518435130344",
  "title": "Debates",
  "published": "2023-09-20T16:06:00.013-07:00",
  "updated": "2023-09-26T07:28:04.198-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/7370586902/in/album-72157630164246500/)\n:: National Forensic League ::\n\nPresumably the model NATO debaters will be well prepped when we have Gen Alpha growing old enough to debate itself regarding whether Russia's absorption of Ukrainian oblasts was undertaken in an effective manner. \n\nThe key point in determining whether territory A was invaded and occupied by B is the degree to which the denizens of A requested and welcomed B's presence.  Those arguing for the resolution (that the absorption was effective) will say the Donbass was like Crimea in officially requesting annexation. Those arguing against will say the requests were from illegitimate non-representative factions with no authority to speak for Ukrainians.\n\nI've seen model NATO booths at the national debate clubs festivals. Probably these debates are already going on at the high school level, in elite private schools at least.  \n\nThose above a certain threshold of political awareness have realized these debates are inevitable going forward, so it's best to rehearse now, and with fresh minds who don't depend on parroting over the hill people who got their PhDs decades ago. A lot of Cold Warriors spout illogical sounding arguments and don't stand much of a chance without more coaching about present realities.\n\nWhat are those present realities?  \n\nAll those decades investing in shared infrastructure have resulted in European ports accepting Russian LNG in place of piped supplies, at higher per unit costs. There was never a good case for going cold turkey vs a vs Russian oil. Tankers also switched crude through the Greek shipping networks. \"Oil laundering\" became the name of the game (not unlike circumventing Prohibition). \n\nLots of books are in the pipeline, about the effect of sanctions on countering global energy interdependence.\n\nSome of the more advanced planners, in China especially, grew up reading such tomes as Operating Manual for Spaceship Earth (popular in China) and understood about the option to grow electrical grids thanks to improving technology. Their integration in connection with the One Band One Road project, at least in storyboard, continues to get attention. \n\nThe more esoteric Bering Strait linkup, inter-hemispheric, described in Critical Path, has worked its way into the imaginations of these more apolitical IEEE types.  The detour into a proxy war at the Boomer level may not change the thinking even of Gen Z all that much.  On the contrary, the Boomers are inviting backlash by delaying torch passing.\n\nFrom my angle, as a curriculum developer, I measure the delay in torch passing by sampling the curricula of various high schools at the current archeological level. Do we see a lot of crackling and crumbling?  For sure we do. The institution we call \"public school\" is especially in a shambles. \n\nThe idea that a central government has responsibilities to citizens, in terms of education and health care, may be fading at least where the District is concerned.  As some city on a hill, WDC is a fading beacon, no longer a source of much hope for future Americans.  Individual states have some ability to set their own track records.\n\nI'm a product of the international schools curriculum, meaning that as a young Boomer, I learned what elite Americans, living as expats, were supposed to learn, in tandem with an international cohort i.e. we were raised in a kind of model UN setting.  \n\nI'll be curious whether the model UN or the model NATO students will fare better as global issue debaters.  It's not really an either/or proposition as some schools host both clubs.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}