{
  "id": "4411714337437884125",
  "title": "Debunking Conspiracy Theories",
  "published": "2023-06-15T03:50:00.012-07:00",
  "updated": "2023-06-15T06:04:48.895-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52917893801/in/datetaken/)\n\nI am aware of the theory that the Biden administration is in cahoots with the Russians in seeking the demilitarization of Ukraine.  \n\nDangling the mirage of a military victory against Russia, by feeding Ukrainian fantasies of military superiority, is what it took to inspire an all out assault with lots of junk weapons and no air support.  \n\nUkraine, left to its own devices, would not have undertaken its own self destruction without being egged on by the White House and its cabal of irresponsible so-called pro-Ukrainians.\n\nI understand why many Ukrainians have doubted the proxy war was ever architected with their best interests in mind.  These qualms were present from the beginning.  Nobody thinks a tank war in Europe is appropriate in the 21st Century. \n\nThe sense that the bottom of the bell curve, intelligence-wise, has way too much decision-making authority, runs strong.  If we have any smart folks in the room, why don't they end this madness?  Because they're so vastly outnumbered?  Isn't the Bell Curve semi-symmetrical?  Why does the Planet of the Apes contingent seem to have the upper hand?\n\nI think many in The District are sincere in thinking they're in some kind of historic showdown, and they are. I empathize with diplomatic types who sense a lot of the investment banking discussions are no longer accessible to them.  When it comes to planning future infrastructure, you don't want juvenile bomb-happy types in the room.  They're too anti-social.\n\nDC has opted out of the civilian control structure, having militarized its foreign policy to the point of having no friends in high places anymore.  This probably accounts for the specter of Papa Biden being cheered on by a tiny cabal of unilateralist ideologues with a track record of being wrong about everything. The dummies have been isolated to a set of swank addresses.\n\nMulti-polarity was an inevitable result, with business relationships forming around the ongoing task of subverting and circumventing all the dark ages sanctions being imposed by the lower half (the anti-intelligentsia).  Europe has been buying gas from Russia, piped through Ukraine, throughout the entire misguided campaign.\n\nClaiming it's a terrible thing for Americans, that China and Russia are sorting out their differences, is highly short-sighted, and is mostly a mantra among the low-brows on cable.  Americans have a role to play as well, when it comes to cracking down on unbridled, uncontrolled militarism.\n\nRegarding UAPs, we all know the adage that strong claims require exceptionally strong evidence, and what does not count as \"strong evidence\" is first person testimony from the security clearance crowd.  We already have mountains of that fluff.\n\nHaving a top secret clearance is a bureaucratic rank, and does not automatically confer evidentiary weight.  In practice, having clearances relates to sharing database logins, rumors, gossip.  Claiming the super-secret nature of UAPs is what adds to their believability seems a kind of circular logical fallacy, an appeal to an evanescent type of authority.\n\nThe higher the security clearance, the more far-fetched the narrative, and the blurrier and less satisfying the actual evidence.  That seems to be the pattern anyway.  Stay tuned.\n\nSpeaking of the lower half of the Bell Curve (a snobbish tendency of Ivy Leaguers), I disagree that we’re not having a pre primaries debating round. True, there’s no League of Woman Voters staging an event on cable, and the corporate media aren’t interested in democracy, but we have our new internet-based news services and the debates are happening daily, albeit asynchronously, with interviewers we already know.\n\nI've been tuning in RFK, Dr. Cornel West, and Marianne Williamson.  Only Biden seems uninterested in the political process, suggesting he's not a serious candidate this time around.\n\nThe older more synchronous debating format was made for cable TV viewers, a demographic that no longer subscribes to real news.  The corporate TV folks have opted out of democracy and want spoon-fed pabulum and rubber stamp candidates.  Politics is a spectator sport for them.  A debate would be somewhat pointless in that medium.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}