{
  "id": "772754138776185567",
  "title": "Delayed Reactions",
  "published": "2012-10-22T19:40:00.000-07:00",
  "updated": "2013-01-09T16:27:48.633-08:00",
  "content": "The title is a bit of a joke, as all reactions are delayed, though \"instant reflexes\" have the connotation of both spontaneous and robotic, another irony.\n\nWasn't Romney promising a buck a gallon again, like a roll back in prices?  A truck just unloaded 300 gallons in my under-the-driveway tank, technology from another era, when that would have been $300.  \"Everyone's tank is bigger than their checking account these days\" quipped the driver.  No kidding.\n\nIn my world view of the New World Order or [Novus Ordo Seclorum](http://mybizmo.blogspot.com/2006/11/about-secularism.html) or whatever we call it, USA presidents don't get to set oil prices.  That's just not in the cards.  And I'm wondering, seriously, what the world would have to look like, for Romney to be setting them.  I think his view is isolationist:  America will fuel itself, and as King of North America, I'll dole it out at a buck a gallon.  Put me down as a skeptic.\n\nSo I sampled semi-mainstream TV last night.  I no longer subscribe to TV, but Bagdad was showing AMC's Walking Dead off the cable (Xfinity I think it was), no charge, just serving beer etc.  I got to sample the latest commercials, for iPhone 5, Droid, Windows 8, and Surface.  My new Droid went by twice, the Razr / M.  Windows 8 is designed with Surface (a tablet) in mind.  There's much controversy in the blogosphere, as to whether MSFT has gone overboard pandering to tablets when desktops, including laptops, still reign supreme.  Time will tell.\n\nToday I met with John Wish, esteemed member of the meeting.  He was somewhat pissed that I'd used the word \"cabal\" with reference to his subcommittee.  Here's a writing sample (something I shared recently, with a non-member): \n\nOversight is... party to a\n hostile takeover of MMM by a clique of members who think the Beanite / \nCollege Park Association style of Quaker, which honors non-members and \ngives them a lot of equality, should be squashed.  \n\nThis cabal has hijacked our process with vague reasoning and \nallusions to anonymous members who refuse to come forward and let their \nidentities be known.\nJohn at 78 is not shy, no wall flower, so I can't count him among \"members who refuse to come forward and let their identities be known.\"  No way.  He's forthright and speaks his mind.  That's what Quakers value:  plain speech.  We don't have time for a lot of BS euphemisms, because we're trying to keep up with the \"mind of God\" (zeitgeist, Holy Ghost or whatever) and that doesn't always give us the luxury of mincing words. \"Beating around the bush\" sometimes just means you're being too time-consuming for your own good (and ours).\n\nWhat's the College Park Association anyway, and what the heck is a Beanite?\n\nI'm alluding to esoteric Quaker history here.  Chuck Fager has [an entertaining piece of writing](http://www.quaker.org/liberal-history/bean.html) on this history, if you want to know more.\n\nTonight's debate deliberately mixes military and civilian meanings of \"nuclear program\". Remember the UK's position:  Farsi speaking Persians and their friends have a natural right to use science in ways that don't hurt the world.\n\nDoes nuclear energy hurt the world?  Some would say so, yes.  In that case, the push against nuclear programs is tighter here too.  Note to Romney:  we / they have a right under the NPT to enrich uranium, you know that yes?  I'm against the weapons too.  [Countdown to Zero](http://controlroom.blogspot.com/2008/07/psy-war-whos-losing.html) is a campaign I respect.  Nuke weapons destabilize us guys, and take [the \"fun\"](http://mybizmo.blogspot.com/2009/12/freeman-dyson-in-portland.html) out of military service. These weapons just aren't helping us [stay human](http://controlroom.blogspot.com/2006/02/jihad.html) and we have limited experience as demons.\n\nFunny chat about Pakistan.  Are you going to say \"drone\"?  Yes.  What about sovereignty then sir?  Either sir.  Why is Pakistan sounding angry sometimes, \"not like any ally\".  Where are the bombs going off, in Afghanistan or Ohio?  Well OK, some in Oklahoma.\n\nLets remember how deeply concerned the Southern whites were, white Americans in general, that the oppressed, the slaves, would rise up in revenge, if liberated, and if allowed to own guns.  There really hasn't been a race war (though it got ugly), and there's not likely to be one.  Many ethnicities share this area and aren't interested in Mad Max Roadwarrior futures, post apocalyptic but without the apocalypse.  Who needs it?\n\n\"Currency manipulator... hacking into our computer, counterfeiting our goods\" sheesh.  This guy is too afraid of everything, scary scary.  [That's like whites](http://youtu.be/lGYFRzf2Xww), acting scared, making everyone else pay for their \"security\".  OK, not just whites.  The privileged.  They're so upset about their insecurity aren't they?\n\nNo, I'm not worried about any \"cabal\" among Quakers.  Lots of partially overlapping cliques, in scenario Universe, nothing new there (except always new).  Chuck Fager is somewhat a role model in using high amps, but mine is [techno-invective](http://www.grunch.net/synergetics/technoinvective.html), not sure they're the same (like a difference in musical style).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}