{
  "id": "332497421095602620",
  "title": "Delta versus Lambda Calc: Weighing Options",
  "published": "2018-08-12T08:37:00.001-07:00",
  "updated": "2018-08-12T08:47:52.791-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/15152020989/)\n\nI stumbled on this old fragment of storyboard this morning and decided to explain it again, adding a link to a related Youtube (8 mins). The picture corresponds to a high school student looking at the math tracks branching out ahead of her or him, and wondering whether to slant to the delta side, or to the lambda side.\n\nThe delta side stands for Calculus and is the only pre-college track as far as many are concerned.  You may have some stubs, like statistics and business math, that point in some other direction, but the college admin folks are pre-geared to like calculus.  Professors don't want to do all the heavy lifting and you need calculus to prove yourself educated, further up the line.  I have another calculus book on order from Amazon as we speak. I used to teach it myself, at the high school level.\n\nThe lambda side stands for Functional Programming (Scheme, Clojure...) but underneath that, for Lambda Calc in particular, as distinct from Delta Calc i.e. delta calculus (the one we learn in high school).  Lambda Calc, one might say, is the basis of computer science. We have instructions, or functions, and inputs, or arguments.  We think a lot about getting our syntax fine-tuned to actually \"run\" (execute operationally).  Lambda Calc is pretty much synonymous with Computer Science.\n\nWhat happened in the late 1900s, after the rise of computing and computer power, kicked off by Alan Turing and others, was a greater need for Lambda Calculus and a requirement that Delta Calculus share the road more.  That's why high schoolers would later have more choices, as to how to proceed with their math education.  They could choose to emphasize computer science over delta calc, and still get a lot of delta calc in the process.  Operational mathematics is not devoid of Newton's Method for example.  Computers do calculus all the time, even as discrete math devices.\n\nIn some ways, the whole dichotomy is an illusion, much like wave versus particle.  You have different tools for different needs.  It's not either / or.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}