{
  "id": "115414343551935080",
  "title": "DEQ",
  "published": "2006-07-28T22:45:00.000-07:00",
  "updated": "2006-11-15T11:43:59.391-08:00",
  "content": "This Wednesday, Razz was refused a clean bill of health by DEQ because her onboard computer was reporting a faulty knock sensor.  Result:  I couldn't collect the colorful license plate tags proving I have my act together as a driver.Well today, I got that silly knock sensor replaced, by Mountain Tech in historic Oregon City, a city started by Hudson's Bay Company well before Oregon herself became a Union republic (when she joined, Oregon City became her first capital -- a privilege since ceded).While waiting for the necessary repairs, I toured the newest county Public Service Building.  Tom's Transportation Reaching People ([TRP](http://mybizmo.blogspot.com/2006/01/fragment-of-day.html)), which I used to write code for, occupies space on the ground floor.[1]  I was glad to see Tina again.Alice, sometimes a volunteer driver, swung by and drove me back to my car, after which we caught up over lunch (Mexican), with Tom joining us later from work.Alice's family visited ours in Rome, back when her dad was on sabbatical in then Yugoslavia.  Our families (Pinneys, Martins, Jumps, Hazel Hemphill...) were among the original founders of the Multnomah Quakers, when they inherited the building on Stark Street from [Electro-Measurements Inc](http://mybizmo.blogspot.com/2005/09/planting-seeds-in-silicon-forest.html).I updated Alice some about [my Qv2 work](http://worldgame.blogspot.com/2004/11/quaker-politics_110167340290091180.html), while Tom and I talked about [NavAm](http://mybizmo.blogspot.com/2006/07/more-bizmology.html), a dream for a new airline.  And of course we reminisced about driving [Gutless](http://worldgame.blogspot.com/2006/06/machine-world.html) to Montana that time.  We also talked about Ron Braithwaite's dream to help pioneer [Carewheels Canada](http://worldgame.blogspot.com/2005/07/wanderers-meeting-200575.html) (a misnomer I think, as \"wheels\" is not meant to connote driving).Razz's repaired computer needed to go through a full drive cycle before trying again through DEQ, so I drove her all the way to Washington State, then back over the I-205 bridge to PDX (the airport), along the Columbia Slough past the Air National Guard and FedEx, ending up at the DEQ just north of Columbia Blvd. on NE 33rd.To celebrate passing my test (yay), I joined Don on the Columbia River.  We moored on the Washington side and discussed Wanderers (a favorite pass time), plus I handled family business on my cell.  From that vantage point, Mts. Tabor and Scott, and Rocky Butte, are all easily visible.[](http://photos1.blogger.com/blogger/1134/545/1600/tomoftrp.jpg)Tom[1] I wrote the early dBase application, while my successor, Ness Mountain and company, rewrote it in Microsoft Access as a colorful GUI app.  Now the county itself maintains the code.  My, how the years fly by.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}