{
  "id": "1340548114347954666",
  "title": "Design Science (again)",
  "published": "2014-02-16T20:58:00.002-08:00",
  "updated": "2014-02-18T18:05:01.955-08:00",
  "content": "So what was design science again?  My school of thought puts a premium on artifacts as the precursors of social change, recognizing the feedback loop i.e. necessity as a mother of invention (but perhaps not the only parent).\n\nWe have a rooted middle class apartment or home based lifestyle, a more mobile on the road style, or styles, depending on the media of conveyance.  The trucker sleeps at rest stops some nights, or at a motel depending on size of parking lot accommodations.  A Best Western right off the freeway...\n\nThen we have outright camping, which borders on abject poverty on the one hand, and recreational hobby on the other.  In between, there's living in your RV, a motorized lifestyle the North Americans enjoy, but has some appeal to gypsies and traveling circuses, as a technology.  The hippie school bus was a local variant.\n\nDesign science is about lowering the barriers to entry, for those idealistic groups that aren't just escapist cults, though maybe some are.  To publish a catalog of livingry solutions is not to pass judgement on every lifestyle experiment people come up with.  The \"army surplus\" store takes the same angle:  the gear here could save your life or fail to, if not used wisely or pushed beyond its means.  Is that sleeping bag really warm enough for what you have in mind?  Too heavy?\n\nFuller especially was concerned about weight.  He wanted portability and easy deliverability, a solution you could trust and forget about in most circumstances.  That thing about \"but how would we survive in this wilderness a 100 miles from any supplies\" starts to have an answer.  He imagined helicopters doing a lot, but that's really just one option.  You'll need some power, some 3D printers, bandwidth, LCDs...  the global average \"university dorm\" is none too shabby.  [Aerospace tech](http://mybizmo.blogspot.com/2009/01/about-habitats.html).  But not unaffordable as in \"only for the super rich\".\n\nIn other words, how might one facilitate peoples producing those experimental communities they always dream about.  Get the paperwork done ahead of time, let local communities screen applications, if locals pertain.  We could be attempting a true wilderness community, for science in some way.  The beauty of lightweight and portable is you have the capability to leave no trace, once the experiments have run their course.\n\nOne of the more dreamed-about models was [the Fly's Eye Dome](http://mybizmo.blogspot.com/2008/08/affordable-utopias.html), I think because of its tri-pod foundation, that of a landed spaceship.  They idea would be these things could be lowered and/or assembled just about anywhere and not require extensive pouring of concrete.  That was my fantasy at any rate.  I feasible these things would be in practice we may not learn in my time slice / generation.  Some of this research into livingry options is currently on hold, as we continue to contemplate our weapons of mass suicide.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}