{
  "id": "119570204455402271",
  "title": "Desovereignization?",
  "published": "2023-12-20T17:13:00.000-08:00",
  "updated": "2023-12-21T17:25:55.665-08:00",
  "content": "At what point do we acknowledge we might be living in a post nation-state world? \n\nThere is no such point, no magical moment, nor would history predict any such broad agreement. \n\nWhen did the Roman Empire end? Historians do not require a specific date. The empire forked and dissipated over centuries. Charlamagne (circa 800 AD) considered himself a Roman emperor.\n\nOne story is we evolved to a next level of consciousness when we started getting whole Earth pictures in the 1960s. The Spaceship Earth metaphor took over, psychologically. The nations lost their almost-mystical luster and became features on a spherical game board, more like holding pens.\n\nWe have no obvious ways to measure the collective \"level of consciousness\" concretely. Retrospectively, we might comb the literature for telltale memes (e.g. nationless world maps), however there's no reason to hope or expect we'd all be on the same page.\n\nMany cultures had no strongly developed sense of \"states\" to begin with, except maybe in the form of interlopers bringing their legal briefs, claiming title to ancestral lands. They had the guns, and claimed God was on their side.\n\nThe telling in Grunch of Giants, by RBF, resonates with contemporary rhetoric: the principles enshrined in the USA's founding documents require that we acknowledge how far we've deviated from those ideals -- assuming we still share those commitments and honor truth. \n\"There is nothing in the words or spirit of the U.S. Declaration of Independence or U.S. Constitution which states or suggests the U.S.A. is committed exclusively to the success of the rich. The U.S.A. we have known is now bankrupt and extinct\" writes our Medal of Freedom winner in 1983. RIP Uncle Sam. Yet we've had many an [impotus](https://worldgame.blogspot.com/2022/10/comedy-and-social-commentary.html) since then.\nWith such a gaping hole in the old semantic space, what survives beyond outmoded habits of thought?\n\nPolitical parties and PACs, gangs and factions. \n\nMercenaries and military bases, with personnel still largely controlled by nationalistic shibboleths and iconography.\n\nSupranational institutions of various types: religious, commercial, educational... the many brands and blends.\n\nThink tanks. Foundations. Institutes. Professional societies. \n\nPrisons. Refugee camps. These latter two may be indistinguishable in many contexts.\n\nPledging allegiance to the USA might mean telling the truth about its demise, and holding it blameless for what's done its name. Uncle Sam is not on a genocidal rampage against stateless refugees. Uncle Sam has exited the world stage.\n\nSo we raise our flag proudly in some mythical underworld, independently of the rogue city-state we call Washington, DC (aka \"the District\"). Our American democratic ideals live on in our hearts and minds.\n\nLet freedom ring.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}