{
  "id": "5909722433337416182",
  "title": "Device Stories",
  "published": "2023-07-17T21:01:00.009-07:00",
  "updated": "2023-07-18T06:15:54.604-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53052923915/)\n\nSpeaking of personal devices, e.g. guns, I think the qualities of high desert water, mineral rich, shampoo conditioner and whatever, conspired to send my Apple Watch to the graveyard this morning. It put up a good fight, sputtering on, showing logos, but ultimately the casement disengaged, revealing guts.\n\nWhat guns come with apps I wonder?  I’m not even gonna bother to check right now. Telescopes and cameras do. Anywhere precision aiming, and recording, comes in…\n\nToday Judy upgraded her phone, from an ancient flip model, to an entry level Samsung that’s none too shabby. They shrink the price of the phone while piling on with necessary add-ons, like a charger, technically not needed if you have USB in your power strip. The shock case. We opted for not using protective glass. They were out of the low end version. Maybe later?\n\nWill I purchase and AW replacement, now that I’m accustomed to “closing my rings” (or not), or using the heartbeat app to track my bradycardia? My heart thumps along at a low rate but I’ve been adapting, and so present as asymptomatic for the most part. The blood thinner I get after the pulmonary embolism episode some years back, is also the accepted remedy for my kind of heart beat (with flutter not fib).\n\nProbably I’ll get one, costing some weeks at work (part time gig), but counting as a health expense for my one employee, me. If you wanna find new ways to do tax cuts, get more people seeing professional development, including tourism through conferences etc., as business expenses. Everyone is by default a sole proprietor of whatever they own, starting with a body (check) and a few devices (check). Capitalize on that!\n\nI’ve tended to crack jokes about butt cheeks containing ample room for implanted devices, provided they’re properly encased in squishy bio-safe materials. You’d have apps on your watch and phone for these butt apps, some of which could be health monitors. I leave it to science fiction writers with medical and/or bioengineering degrees to let their imaginations run wild. A bun-based Theranos…\n\nSydney the dog has been a pleasure to work with.  Another business expense if you ask me, if not a full partner and/or sidekick proprietor. Tomorrow we’ll take our business over the Cascades in the company car.\n\nThe AW was a family hand-me-down from my youngest, Dawn’s last, a Christmas present some years back. She’d already learned the lifestyle so coached me expertly in how to integrate it into my routines.  Judy, a musician, agrees learning to use her new smartphone has “learning an instrument” similarities (muscle memory plays a role).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}