{
  "id": "3284905167117552118",
  "title": "Dialing In More Indiana Jones",
  "published": "2023-07-04T07:29:00.007-07:00",
  "updated": "2023-07-05T08:28:56.185-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53021616162/in/datetaken/)\n\nLeela liked this one, Dial of Destiny, a lot.  We'd done our homework, catching up by watching the Crystal Skull prequel the previous night.\n\nShe arrived by bicycle around 6 PM PDT, ate some of my Trucks Not Bombs inventory, and then we walked up to The Bagdad, getting to our seats before 7 PM and in time for the McMenamins history slides.  I'm a fan.  \n\nI returned to Portland in 1985 as an adult, and grew up in parallel with this brewpub business, starting up around the same time, weaving it together with so many memories.  \n\nThen came previews e.g. of Mission Impossible on IMAX -- although The Bagdad ain't IMAX.\n\nI felt like a smarty pants (somewhat Wombat like -- what he calls her) because I'd included the Antikythera in a \"history of math\" timeline I did for McGraw-Hill in the 1980s (Rockefeller Center, 28th floor, Nola Hague my super).  \n\nGood luck finding it. Big publishers do low circulation prototype textbooks kind of like big car companies make concept cars, ones that are drivable and everything.  I'm forgetting the title, but did at one time have a copy.  That's when I worked with Ray Simon, having met Ray and Bonnie in my Jersey City chapter.\n\nAnyway, big deal right?  Of course that device should and would be included in any such timeline.  In the real world, the Antikythera has been X-rayed and recreated.  The movie may have embellished here and there, but didn't make up everything.\n\nI've read or watched lot of the criticism of this movie, and know how some take exception to its way of taking the bull by the horns, the bull being aging.  \n\nUnlike some of these god-like superheros, which get passed generation to generation (e.g. The Flash), Indiana Jones is an ordinary mortal and mortality is inevitably a theme.  He won't live much beyond the 1960s.  The Bond franchise went there too, with lots of overlap in the action between these two (jumping from a bridge etc.).\n\nPeople take exception to the grandfatherly wisdom versus upstart young woman dynamic, even though she wises up, and he gets to meet Archimedes.  Of course he wanted to study the past up close, that was his profession after all.  Just getting to visit was certainly a privilege, though the circumstances were chaotic. However Wombat needed a more stable family matrix in the present.  Archimedes got to keep the watch and have airplanes remembered on his sarcophagus.\n\nI'd recently been immersed in Phoenician studies i.e. watching a long documentary reviewing what we know about the rise and fall of Carthage in particular.  I felt like a smarty pants again, in recognizing the phenomenon of naval warfare, as Romans waged it, well before the Christian Era.\n\nLeela liked it because she's pried open the lid on Astrology, not surprising given her background in religious studies (OSU), and base of operations in Nepal.  Ancient cultures up to almost the present time are somewhat impenetrable if you can't decode what they believed about stars and planets, which doesn't mean believing it all yourself. But you sort of have to half belief it just to get into it enough to see how it all works.  The anthropologist in me, such as I have one, has a well-developed sense of make-believe.\n\nThe real Antikythera is of course not a time machine so much as a predictive pocket astrolabe.  Its geared mechanism, oft attributed to Archimedes himself, replicates the movements of the heavenly bodies relative to one another.  \n\nI'm not such a smarty pants when it comes to the details.  You wouldn't want to hire me as your Antikythera reader.  I confess I'm no Indiana Jones, fluent in several tongues.  My Stetson is way more beat up than his hat is.  I should get mine to the shop.\n\nThe Bagdad proved a rich atmosphere for an Indiana Jones film, given its What the Bleep decor. \n\n[](https://www.flickr.com/photos/kirbyurner/53022682608/in/datetaken/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}