{
  "id": "836085762109929102",
  "title": "Dick (movie review)",
  "published": "2014-05-01T07:07:00.002-07:00",
  "updated": "2023-04-07T19:53:15.586-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiekzThHMIjyFHCbfLBoTNDY2vk-lE5bDWHPVFQ9dBr516zJje2_IIGczhMb3wXlN9BNoSJQ7My3Eo7xVYt95otWtImPg0Piy5yWFIlcaFr_BTOJjoe3bFZYiKKxgfz_e6CO0z4/s1600/dick.jpg)\n\nI confess this one cracked me up a lot.  I was LOL-ing about in my living room, appreciating [this 1999 take ](http://www.imdb.com/title/tt0144168)on the Watergate scandal.\n\nTwo teenage girls stumble into getting to walk Checkers, the president's dog, but are also witnessing G. Gordon Liddy sneaking around.\n\nWoodword ([Will Ferrell](http://www.imdb.com/name/nm0002071/?ref_=tt_cl_t4)) and Bernstein ([Bruce McCulloch](http://www.imdb.com/name/nm0567126/?ref_=tt_cl_t5)) learn of their \"secret youth adviser\" information once the one girl's crush on Tricky \"not a crook\" Dick is replaced with loathing when he turns out to be a potty mouth (mirroring a demographic's reaction).\n\nThey meet in an underground parking lot.\n\nThe girls have just learned the title of a porno film their brother gets busted for watching, by the angry nuclear family dad, so tell the journalists they're \"Deep Throat\".  And thereby hangs a tale.\n\nOh, and lets not forget the Hello Dollies, cookies unintentially spiked with the brother's stash, that get served around the White House, prompting peace talks with Breshniev to go unexpectedly well.\n\nIf you lived through the original events, as I did, as not much older than a teen myself, all this may seem especially hilarious, did to me.  Kissinger, Haldeman, Dean (no [Ellsberg](http://worldgame.blogspot.com/2014/01/the-bellman-equation-movie-review.html) yet)... they're all there, chewed up and spit out by the zeitgeist, enshrined in our memories [as clowns](http://worldgame.blogspot.com/2007/07/family-guy.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}