{
  "id": "6116409464746772983",
  "title": "Digital Scanning",
  "published": "2017-04-02T22:55:00.001-07:00",
  "updated": "2017-04-03T14:23:22.377-07:00",
  "content": "Gus's workshop in Silverton this Saturday, on digital scanning, got me thinking more about the Business Mobile (\"biz-mo\"), and what might be its business. We already own a cultural stereotype, of nondescript vans used for spying and monitoring. Why not mark them?  To chronicle and curate, to survey, is hardly in and of itself evil.  On the contrary, that's what National Geographic does. We get great pictures, intelligent writing.\n\nGus showed us how objects of some thickness, thicker than paper or film, might to effectively scanned. He brought his Mao watch. When it worked, the Chinese leader waved his hand, against a colorful backdrop. The watch scanned at 4800 dpi no problem, with adequate depth of field. Applying some adjustment layers in Photoshop, leaving the original untouched, reduced some of the glints, where red, green and blue had separated on a shiny surface.\n\nMy bizmo could have a scanner. Pulling into a place, say near Fossil, Oregon, or somewhere in Utah, means getting ready to curate and chronicle. Why? That depends on the business. This isn't the FBI looking for criminals, yet representatives in any form of representative government need to study and investigate their own districts, any Chinese emperor could tell you that.  Perhaps the bizmo is connected to someone in Congress, and it says so right on the vehicle.  That doesn't mean that someone is piloting the vehicle.  [FEMA](http://controlroom.blogspot.com/2017/03/fema-loves-you.html) needs bizmos to coordinate and communicate, [no doubt has them](https://www.fema.gov/media-library/assets/images/69376).\n\nGus talked about the invention of scanning devices, which grew up alongside photography. Until recently \"to scan\" meant something we did with poetry, an a par with \"to parse\". Some of the earliest scanners placed their target document on a drum, a cylinder, still a favored design.  Digitizing fragile documents, as a way of preserving them, is an integral part of preservation and scholarship these days. The technology has only gotten better.\n\nA high point of Gus's workshop was when he unveiled [a Homer Davenport original](http://worldgame.blogspot.com/2016/12/toontown-revisited.html), purchased on eBay. The paper was way to big for his flatbed scanner, so his solution was to protect the original with clear plastic and then use a hand scanner to digitize in swaths.  Satellites in orbit around planets or moons used exactly the same technique, gradually building a complete picture of the target surface through stitching algorithms.\n\nWhen it comes to stitching though, lets not neglect the skills of a human operator.  Gus adjusted the swaths expertly, applying minute adjustments, such as rotation, as necessary. The result was a very high resolution digitization of the original.  Sometimes bringing the equipment to the site, be it contemporary or archeological, is the most practical approach to intelligence gathering.  Hand scanners can be a lot less hard on books, then pressing them on the flatbeds when at the library.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}