{
  "id": "1430362487942871170",
  "title": "Diplomacy R Us",
  "published": "2008-10-23T19:22:00.000-07:00",
  "updated": "2008-10-25T20:56:39.582-07:00",
  "content": "After an enjoyable session with Patrick @ Angelo's on Hawthorne, I meandered back on Lincoln, crossing 39th by Fine Grind, to continue telecommunications with Ian.Earlier, walking Sarah with Glenn, I noticed Madeline Albright's name on [the Bagdad marquee](http://www.flickr.com/photos/17157315@N00/2968669450/) and resolved to attend.  For those who don't know everything, she was [Secretary of State](http://www.dkosopedia.com/wiki/United_States_Secretaries_of_State) pre Colin Powell who was pre Condaleeza Rice.Well, what I didn't know was this event had been sold out for two weeks, at $25 or so per ticket.  That explains the well-dressed crowd, [probably Methodists ](http://worldgame.blogspot.com/2005/02/methodist-morning.html)from like Lake Oswego, some of them, [liberal](http://controlroom.blogspot.com/2005/01/why-civilizations-fail.html) in that well-to-do sense.The talent hadn't arrived yet as I wandered back to the ranch, somewhat disappointed.  I'd read some of Madeline's thinking in an airline mag, good analogies with billiards, proves she knows at least something about world game playing.  Both Glenn and Patrick had good things to say about her.The police, with bicycles, were awaiting the motorcade or SUV or whatever, making sure theater goers obeyed, as in \"too bad if that seemed like a lucky parking spot, you're facing the wrong way lady.\"Hey, there's an Airship Ventures zeppelin [on CBS News](http://www.cbsnews.com/stories/2008/10/23/eveningnews/main4542196.shtml) just now ([Trevor](http://www.synchronofile.com/) would like that)!It's seventy years later and these still look like a promising technology.Maybe we'll deliver some [4D Towers](http://worldgame.blogspot.com/2007/09/futurism-revisited.html) with 'em, just for grins.G'night Katie (I'm a Facebook fan).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}