{
  "id": "1992043652629699752",
  "title": "Dirty Tricks",
  "published": "2007-10-28T19:21:00.000-07:00",
  "updated": "2007-10-28T20:14:50.525-07:00",
  "content": "So the political campaigns are heating up again, meaning it's time for low level wannabes, amateurs, hacks, to imagine what a grand master like Karl Rove would do, or someone equally sinister, to spin webs of deceit, play games with smoke and mirrors or whatever.In practice, most such schemes backfire or at best produce no intelligible result.  Just focusing on real leadership skills tends to win every time in the long run, though it never hurts to have a good defense against cheap negative campaigners.Spies inform on enemy camps (like at Project VOTE! in the 1980s -- we had infiltrators), those unflattering candidate photos appear from nowhere, rumors circulate, the vaguer the better sometimes.Now, with the Internet, we have many more creative outlets for these games, including  social networking software and YouTube.The latter has proved itself relevant in just in the last few debates, whereas Howard Dean proved the relevance of social networking to netting political donations in the last presidential race.As I [mentioned to Wanderers](http://worldgame.blogspot.com/2007/10/letter-to-terry-wanderers-business.html), my flight plan is to stay above the fray as much as possible, working with my usual esoterica, plus a few issues I most care about (I'm an incumbent in [my own office](http://controlroom.blogspot.com/2007/02/synergetics-storyboard.html), is how I look at it).  Plus I'm starting some new teaching jobs, getting ready for Pycon, maybe EuroPython (in Vilnius again).Speaking of social networking software, I didn't know about vampires on Facebook until bitten, then followed Jerritt's example and joined a group called \"fuck off... I don't want to be a pirate / vampire / werewolf / zombie.\"   But then I resigned almost immediately, because I felt uncomfortable with the word \"fuck\" on my austere business page.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhbnj0Ou4rB6ncLQVcoyz6_54SG0aBvbiS6zzSIjfbH9tkrkadQIIx0Sg2HmIxCSjP-iqxwPfOyMf4sGI0RCNQeeMVmyJr8xLEPmykyu0xRIqAmsiHpU4pj7Of5hA26gOZKsVIT/s1600-h/n10117075246_3685.jpg)from FaceBook",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}