{
  "id": "3741757002293017104",
  "title": "Disarmament Degree Program?",
  "published": "2015-10-22T22:23:00.001-07:00",
  "updated": "2015-10-24T16:47:26.324-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/21799638493/in/dateposted-public/)\n\n[Having toured](http://worldgame.blogspot.com/2015/10/in-corvallis.html) the Linus and Ava Helen Pauling Special Collection, then regrouped to discuss strategy towards creating a less morbid culture, our grand finale for the evening was to hear Hideko Tamura Snider talking about what it takes to overcome being atom bombed.  She was ten years old, in Hiroshima, on [August 6, 1945](http://controlroom.blogspot.com/2013/08/a-bomb-day.html).\n\nOSU has no special track for [Disarmament Specialists](http://worldgame.blogspot.com/2015/10/reciprocal-bases.html) that I know about, however the auditorium at La Salle, was filled to capacity (this was the smaller auditorium, seating 200-250).  Some of us stood around the edges or sat on the floor (that's what I did, having gotten there a bit late with Carol -- who got close to the front row, but sans hearing device).\n\nHideko's slant was to encourage her fellow humans with assurances that each one of us is endowed with the capacity to overcome extreme discouragement and disappointment of the type she endured.  She's concerned that postmortems of atomic warfare neglect the psychological aspects in favor of the easier to understand physical aspects.\n\nWitnessing the intense suffering of others without being able to assist is one of those traumatizing experiences.  Her own sense of abandonment was intense, as an only child who had lost her mother as the world turned nightmarish.\n\nHer father, also a survivor, and in the Japanese military at the time, was placed on cleanup duty (she found out later).  Whereas they piled the bodies high along the river for cremation, her dad was sensitive to Western culture, specifically impressionist painting (soldiering was never his preference, only his duty), so he insisted the charred remains of US POWs killed by the bomb be buried instead.\n\nIn Hideko's case, her resilience traces to deep curiosity, a desire to fit the puzzle pieces together and figure out what happened.  She would read incessantly, including existentialist authors, i.e. those who deal with the human condition in some profound way.  This ability to deeply process is, in Hideko's view, part of the human design, which is both flawed and wonderful.\n\nThe mostly college age audience was quite engaged.  Her delivery, though going over stories she'd told in public a thousand times (figuratively), was full of spontaneity and wisdom.  She alluded to drugs and drug taking, suicidal ideation, the importance of friends.  These were themes to which many in her audience could easily relate.\n\n[](https://www.flickr.com/photos/kirbyurner/22232805000/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}