{
  "id": "256644651549521451",
  "title": "Disconnecting the Dots",
  "published": "2010-02-09T17:24:00.000-08:00",
  "updated": "2010-02-25T17:25:03.295-08:00",
  "content": "I believe I have found [the one lesson plan](http://illuminations.nctm.org/LessonDetail.aspx?ID=L639), in all the math-related lesson plans officially blessed by the National Council of Teachers of Mathematics (NCTM), which introduces measuring volume with a unit tetrahedron.The author of this lesson plan is following a template, considered illustrative of best practices, so my remarks below should not be construed as a critique of one writer.  Rather, I am pointing out what I think is broken about math teaching:  it is deliberately bereft of an historical dimension, is divorced from any storytelling, any lore.  As such, the math is missing a Z axis, a depth dimension.  The math is flat (as in beer).There's a stated goal of studying the relationship between edges, surface area and volume, when the angles remain constant (when the shapes grow and shrink while remaining self similar).A tetrahedron is constructed, then doubled in length along each edge through a process of stacking four of them corner-to-corner, leaving the octahedral void of [the octet truss](http://worldgame.blogspot.com/2006/02/octet-truss.html) at the center.  Welcome to the CCP (IVM, FCC).This octahedral void is then made into a shape (not illustrated) and dissected into pieces according to the sequence below, to show that its volume is 4x that of any of the original tetrahedra.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg3pGB_uvDpxdjr-MlTBiYxlPXm14mYNimHsUU-zLUvlQjTU1-d5Dsdbx0L8Wfc2cnkaHE26BFl_XJG18_l3sc8OS5qqjAuhUhy5KpEslUxoA6PYEKkRQDnk_XfsvTk-66A15es/s1600-h/portfolio.png)from Synergetics FolioThe volume 8, 2-frequency tetrahedron assembled from 1 + 1 + 1 + 1 + 4 is called a Kite for some reason, perhaps because kite string is used (or crotchet thread).  Those familiar with the lore know that Alexander Graham Bell created kites of this nature, but his name is not mentioned.  The teacher may know.  The storytelling is left to the teacher.So now you have some story.  Discover more.  Encourage your students to do likewise.  Lots to learn.  And the math topics will keep weaving in.Once you learn about hexadecimals and Unicode, you will be ready to think about bracelets, like you might receive upon check in to a Club Med resort.  Do these show your name in your [native Chinese](http://mybizmo.blogspot.com/2008/05/chinese-names-in-python.html) or Thai, or do they just show bar codes or what?  Likewise in hospital work:  how much of your own language will you get to see on the monitors?  Unicode helps, but the mathematics is complicated, lots of trade offs to consider (like why retire perfectly good equipment even if the newer stuff has more bells and whistles?).LW was on KBOO (FM radio) tonight briefly, [abiding by all the rules](http://www.flickr.com/photos/17157315@N00/4388077219/) (Portland's left is highly professional).  I was getting my shoes on for PPUG when she came on.  Then I decided I needed to blog about this lesson plan, and how difficult it is for storytellers to make up for all the missing storytelling.Having more literate well-read mathematics-aware students and teachers is always a godsend.  That's why we form schools, user groups, collectives, clubs.  We look for good company.Anyway, not to pick on the NCTM too much, but I do find it ironic that they're building their old logo here, the one their lawyers told them to back away from.  There's a story there too.Just call me old skool.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjUwALbxmXk68L2HgehJGAtYgjtND9tcrWkssU8iglGf1xIYn-_Y_cbCjRA0OUJWtSDT0AyhyphenhyphensRTPqwJ8t2onv7m-u_k8WNghbIrlnHcwXNLr_CpRfX_8GiT0QsiklIZ4J3t_YT/s1600-h/nctm_logo.gif)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}