{
  "id": "8974136383450512067",
  "title": "Discussing a Documentary",
  "published": "2018-08-27T00:26:00.001-07:00",
  "updated": "2018-08-27T14:06:00.843-07:00",
  "content": "In case you don't have time to watch the movie, or can't get your hands on a copy, the National Geographic documentary about the Gospel of Judas is pretty interesting.\n\nYes, National Geographic was a sponsor of the project, as if it turned out this was an authentic document, then kudos would accrue to the documentary makers.  For sure this whole operation would need to be memorialized using state of the art film techniques.  One doesn't mess with such heritage without making highly detailed records of the enterprise or project.\n\nThe two main puzzles were:  to decipher the badly decayed content of the recovered papyrus book, written in Coptic; to figure out where it came from exactly and how old it was.  Carbon dating was applied and an expedition to Egypt ended in caves with many traces of Coptic culture.  The dating put it [around 280 A.D.](https://en.wikipedia.org/wiki/Gospel_of_Judas) with some decades plus or minus, suggesting it be treated much as the other so-called \"Gnostic Gospels\".\n\nThe film explains that \"gnostic\" was a put-down, a lot like \"truther\" and not a label self-applied, and that it was already a term of opprobrium by around 200 AD by which time Christianity had started to solidify, after taking many turns.\n\nBishop Irenaeus had railed against some Gospel of Judas way back then, but no one since had been able to snag a copy.  Leave it to some treasure hunter to get it on the black market, where it languished and almost turned to dust.\n\nJudas was thoroughly demonized, yes, but more generally the Bible was being whittled down to Four Gospels with the others best forgotten.  But most especially oxymoronic would be any twisted \"Gospel of Judas\".  Revelation would be less confusing, in terms of making the Bible cohere.\n\nTwo often made points were echoed in this film.  (A) Jesus and his disciples were of course Jews and weren't really into questioning that and likewise (B) the Romans administered \"justice\" in that region so the irony of Rome's Christians later demonizing Jews for being Jesus killers seemed somewhat like a pot calling the kettle black (an English idiom meaning \"who are you to call me that?\").\n\nI'd say \"Mahayana Christianity\" sees that humanity as a whole killed its own God when He came among them, a display of poor judgment which well explains why God, on previous occasions, took some pretty severe actions towards His creation. \n\nGnostics were to be disrespected for teaching the local God had indeed messed up, but that Jesus was pointing back to a greater God away from these unworthy humans, or something along those lines (considered heresy even today).\n\nThe narrower form of Christianity has taken on the mantle of \"Chosen People\" (us versus them) characteristic of those not thinking in terms of \"humans on Planet Earth\" (an Astrological conception).  Jewish shepherds were not schooled in esoterica with its cosmic vocabulary.  The older forms of Christianity also have less Greek metaphysics, or so I've been told.  The Coptic people I've hung out with were in Cairo.  But then Alexandria had the works of Euclid.  I guess my point is it took Christians a few centuries to get super educated, especially in light of their early persecution, by the Romans especially.\n\nThese last two paragraphs were me rambling.  The movie itself doesn't self indulge having bitten off a huge chunk. In addition to piecing the document together and determining its history, the film gets some character actors to tackle some really challenging plot lines that will be heavily scrutinized.  Agreeing to star in these sequences took some courage in case the film attracted the ire of some offended orthodoxy.\n\nFortunately, the seminaries have already done a good job of disseminating the historical and archeological approach.  The Gnostic Gospels had already carved out a space in consciousness, thanks in part to [Carl Jung](https://youtu.be/3dRiEgfjNrQ), who worked on saving this literary heritage.  I'm not a super expert on all the details but have done enough homework to feel some gratitude to all involved in salvaging such remnants from our human past.  So much ransacking goes on, or sometimes deliberate defacing on ideological grounds.  We want to respect new findings and update our narratives as creation continues to reveal itself, a process some might call God while others would prefer not to.\n\nThe two points I mentioned above were to counter the anti-Jew sentiments that were cultivated by those casting themselves as victims of Jewish globalism and/or loyalty to only themselves.  These patterns of thought already had Judas epitomizing Judaism, but in a bad way.  According to this rediscovered gospel, Jesus relied on Judas to turn him in and maybe save the others.  One may debate whether we're talking actual history, but it seems well established that the story of Jesus was taught with this plot twist at least in that one lineage.  Several other gospels were floating about, including those of Timothy, Phillip, Mary Magdalen and so on.  Again, the existence and intelligibility of said texts does not constitute a proof of facts.  These stories don't actually require fact checking to go global, we know that from many other storytelling traditions.\n\nAnyway, I assume a lot of this stuff is old news to the Bible hounds among us, and to the archeologists, some anthropologists.  The literature since this movie must have grown considerably in the meantime.  We have also enjoyed many breakthroughs in getting to know the ancient Mayans.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}