{
  "id": "4678910213609724720",
  "title": "Diversity Training",
  "published": "2009-08-19T19:04:00.000-07:00",
  "updated": "2009-08-20T16:55:48.142-07:00",
  "content": "We've been working on TV show ideas, both the cooking show and the survival show, as components of what I think of as \"digital math\", though many aren't into seeing it that way (and I'm not into forcing 'em to, recognize the value of having diverse heuristics).[Glenn Stockton](http://worldgame.blogspot.com/2006/03/global-matrix-wanderers-meeting.html) is my paradigm \"[neolithic](http://www.flickr.com/photos/17157315@N00/sets/72157612202599023/)\" in that he has lots of survival skills.  He was trained as a spy by the military and sent to Vietnam as a code cracker for NSA, but that's only the beginning of his story.  He developed his crafts, including knife-making, in Arizona.  I took lots of pictures of [his homemade knife](http://www.flickr.com/photos/17157315@N00/3838271013/) this morning, looks very professional.This focus on knives led to the story of Sikhs coming to America, 14 year old boys and above simply expected to carry a dagger around.  In lots of cultures (e.g. Bhutan's), you need those, not for committing atrocities nor even for self defense so much, but as an all purpose tool.  You can open shell fish, cut steak, slice vegetables -- [no cook](http://www.youtube.com/watch?v=BDhLZiHKQi0) would be without her knives, right?  And yet of course the public schools had a problem with this, as one boy's all-purpose tool is another boy's weapon (some bully... unless there's real training in this picture, you can't trust 'em with such implements).[Lindsey](http://controlroom.blogspot.com/2009/08/walking-with-walker.html) has an [all-purpose knife](http://www.flickr.com/photos/17157315@N00/3832025685/) (Austrian) as a part of her costume, not concealed in any way.  She's a kind and thoughtful person, in no way a bully.  As a teacher, I'd be fine with her wearing that thing, Glenn wearing his.  They're out in the wilderness after all, in the wilds of Arizona or New Mexico, or perhaps in Oregon high desert, teaching skills...So you see where we fade over to \"paramilitary\" in this scenario, which sounds odd for [a Quaker ](http://controlroom.blogspot.com/2008/12/nato-professor.html)to be into, but then again, I'm not talking about knives as outward weapons, guns either really.  Target practice is a fun sport.  I enjoyed shooting that sawed-off that time...Back to suburbia, I sketched my vision of this gymnasium with six simulators, like the one at OMSI, inheriting from pilot training.  GM has a logo on 'em, as this is part of a government (public) program to teach driver's ed.  In a simulator, one simulates inertia, acceleration, by tilting the entire platform.  If you slam on the brakes, you literally pitch forward.  The same simulators might run other programs as well, i.e. just because they help us be safer drivers doesn't mean they can't also make some of us more knowledgeable and aware in other knowledge domains.[](http://www.flickr.com/photos/17157315@N00/497128497/)Yes, this all sounds expensive, meaning we're creating jobs.Some of this \"diversity talk\" is spilling into the diversity list within Python Nation.  Our plans to have source code running right to left, would be considered \"pilot project\" at this stage.  It's easy to interleave comments in Arabic or Hebrew, but how do the code editors handle the inherent left-to-right syntax of the Python language?  We need field testing more than butt spinning.The \"[user group in Baghdad](http://wiki.python.org/moin/LocalUserGroups)\" idea might work better as television at first.  I've been networking locally to find sponsors.  Having seen [Mark Shiley's Untold Stories](http://worldgame.blogspot.com/2005/01/inside-iraq-untold-stories-movie.html), I know there's a crying need for more and better hardware over there, more wifi.  The Coffee Shops Network could franchise through Abu Dhabi maybe?  I don't have a real game plan yet, as we still need [more manga code ](http://controlroom.blogspot.com/2009/03/manga-code.html)around the whole idea.Some banks have programmed their ATMs to permit donations to charity, presumably that goes on one's record as a \"tax fact\".  Those of us who live nonprofit lifestyles, perform public service in the private sector, could use audit trails of this kind, but I prefer the social setting of a salon for comparing notes about what's a worthwhile cause (investment).  The average bank ATM is unlikely to have anything close to the esoteric offerings [a true coffee shop](http://coffeeshopsnet.blogspot.com/2009/04/targeting-2012.html) would have, [thanks to Jack Daniels](http://worldgame.blogspot.com/2006/03/returning-to-pdx.html) or whatever sponsor.Speaking of sponsors, I'm continuing to [push Unilever](http://worldgame.blogspot.com/2006/11/artifact.html) as a buyer for Pauling House, up for sale in a discreet setting i.e. hardly advertised.  I only know cuz I'm board.  Unilever is both Liptons and Ben and Jerry's down the street.  As a kind of corporate HQS or back office, any company might benefit, in terms of PR.  But not every company deserves to benefit so greatly.  I've learned enough about the real estate game to know that turning buyers down is as much a part of it as accepting offers.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}