{
  "id": "2664805663562883347",
  "title": "Dog Mountain",
  "published": "2016-05-23T06:36:00.003-07:00",
  "updated": "2016-05-23T09:14:25.170-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/27086261942/in/dateposted-public/)\n\n:: flowers for Algernon ::\n\nI joined a BSA troop, I forget which number, invited by a scout leader to ascend Dog Mountain, a walk-up on the north side of the Columbia Gorge, between the Hood River and Bridge of the Gods bridges, Bonneville Dam in between. \n\nThe trail was well frequented by hikers and is professionally maintained.  The last segment is along a ridge in open flower fields, gorgeous when in bloom. \n\nReturning home, we stopped to purchase some Yakima Nation salmon at $12 per pound.  That may be more per pound than store-bought, but then this is newly-caught never-frozen.\n\nI took a half-gallon plastic jug of Soylent in my backpack, having been advised to pack in all fluid and nutrient needs for a 3.8 mile climb, fairly steep.\n\nAdvice:  wear hiking boots in case of muddy patches along the steeper parts, for traction.  Sneakers are not advised, though that's what I got away with.\n\nIn coming down, I was using large trees to break gathering momentum, but miscalculated the impact I'd have on one of them, with onlookers present.  My glasses came off when I hit the tree, and in fumbling to pick them up and put them back on I backed over a protruding root behind me and fell on the muddy trail in the downhill direction, over backward and onto my pack.  \n\nThe jug of Soylent exploded, but not so much that I didn't get some more mileage out of it.  The cap had come off, emptying much of the content, but once back on, the jug was still usable.\n\nOnlookers wondered at the gray liquid oozing from my backside as I flailed about, and indeed I felt like that android in Aliens who bleeds the white blood.  The BSA kid observing this spectacle later summed it up in a word:  idiot.  Hiking boots next time.\n\nNot being a great expert in these Gorge trails, I was unable to determine, from one data point (in 2016), whether the ratio of dogs to humans was higher on Dog Mountain than average.  Safe to say, I saw quite a few dogs on the route, some on leash and some off.  I'm a dog fan so don't figure this to be some complaint.  Go dogs go.\n\n[](https://www.flickr.com/photos/kirbyurner/27181519275/in/dateposted-public/)\n\nfor sale by Yakima Nation",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}