{
  "id": "114980489329389925",
  "title": "Doing Nothing",
  "published": "2006-06-08T14:48:00.000-07:00",
  "updated": "2007-09-26T14:04:17.796-07:00",
  "content": "Not really of course.  Got Sarah-the-dog's toenails clipped, long overdue.  Took Razz to Jiffy Lube for long-deferred maintenance.  Did my [Edward Scissorhands](http://www.imdb.com/title/tt0099487/) thing on the juniper out front; a fine replica of an exotic bacteriophage, if I do say so myself ([Julian](http://mybizmo.blogspot.com/2005/01/going-down.html) inspires me).I had pleasant dealings with Apria, a medical supply company (like, I needed a new mask -- drove out by the airport).  Visited the Columbia, taped the news.Providence Home Services has also been top notch (great trainings, including pre Tara's birth).  And the Providence cancer support group features American Dream pizza.Studied [Oracle8](http://worldgame.blogspot.com/2006/06/another-shop-talk.html).  Helped Bernie with Python in [Middle Earth](http://worldgame.blogspot.com/2004/12/view-from-middle-earth.html).Talked with [Alexia in Tennessee](http://worldgame.blogspot.com/2006/03/temple-to-athena.html).I ate some leftover birthday cake, from Tara's turning 12 yesterday (Dawn, myself, Tara, Brenna, and Llysa went to the [Old Spaghetti Factory](http://tinyurl.com/pdhx7)).A surprising aspect of this cake, reading Happy Birthday Tara:  although the baker's ticket said 2-layer chocolate, with raspberry filling and a white frosting (as requested over the phone), the actual cake was 3-layer bannana with both filling and frosting creamy white.I'm not complaining, nor did Tara really -- a mistake in our favor, but by a pro baker ([Helen Bernhard](http://www.helenbernhardbakery.com/)) who rarely makes mistakes, and always makes great cakes.Anyway, the Doing Nothing title has more to do with [a posting this morning](http://mail.python.org/pipermail/edu-sig/2006-June/006590.html), to edu-sig, about how I'm nowadays just twiddling my thumbs where Pythonic mathematics is concerned.Blogger is pokey these days; lots of down time and publishing delays.Mowed the lawn, borrowing Jimmy's gas one (my electric one's turned to junk again).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}