{
  "id": "116258849014505695",
  "title": "Domestic Scenes",
  "published": "2006-11-04T21:24:00.000-08:00",
  "updated": "2009-03-22T16:35:05.285-07:00",
  "content": "Tara spends a lot of time plotting to score an [Aibo](http://youtube.com/watch?v=p5VVoUKn2H0) (discontinued collectors' item by Sony), has money saved and keeps watching the boards.She bristles if challenged her robopet fixation entails turning away from [biopets ](http://www.flickr.com/photos/17157315@N00/3376481643/)(Sarah-the-dog looking soulful), pointing out it's an AND not an OR proposition, plus they're really quite different types of object under the hood.She's struggling with self-images about being spoiled (\"Daddy, I want a pony\" syndrome in [Willy Wonka](http://www.imdb.com/title/tt0367594/)), knowing how many kids wake up to a day of scrounging through garbage, looking for a next meal.But we both know appropriate and intelligent use of high tech, including robotic, might help mitigate these breakdowns in our Global U.Dawn's physical issue today was hand pain and numbness stemming from her life extension regimen. We're gonna play around with an over the counter Costco solution, see if that works.More metaphysically, she's whipping through novels at a mile a minute. [This last one](http://www.amazon.com/She-Still-Lives-Bill-Magee/dp/1559392479/sr=8-1/qid=1162609535/) was about some future female DL (Dalai Lama) imprisoned in some tower, but this Shrekie like guy masters the art of mind-body exchange and saves her (I forget what happens to him at this point, plus I'm no doubt garbling it -- some nutty professor of Tibetan Studies came up with this one).Did I mention liking [The Iron Bridge](http://www.amazon.com/Iron-Bridge-David-E-Morse/dp/0151002592/), also science fiction? There're some Quakers in that one.Alexia reports that Motorola Razrs, stylish for sure, suffer among the highest rates of heads breaking off, other annoyances (she's co-managing in a tech support bunker for a variety of cell model customers). Maybe these problems 've been fixed, I dunno (I've got a Motorola, true, but couldn't justify shelling out for such Tom Cruisey glamour (it'd be kinda unQuakerly, what with our [simplicity testimony](http://en.wikipedia.org/wiki/Testimony_of_Simplicity) 'n all (on the other hand, if there were indispensible features...))).I need a haircut myself. I look too much like Jack Nicholson in [Anger Management](http://www.imdb.com/title/tt0305224/) (that look works for him, but I shouldn't be a copycat). Or maybe I'm that Back to the Future guy (no, not the handsome one, the mad hatter).Tara is also ploughing through y'r standard elementary school Western Civ sequence, which lionizes the Greeks for their mental achievements, after which it's pretty much downhill until we get to Machine World and [modern man](http://images.google.com/images?hl=en&q=geico+caveman).Not much about Phoenicians, per usual, an ocean-based Kingdom (these tend to escape focus in landlubber accounts). Yes, the big-I Imperialists wasted Carthage, have been at it ever since pretty much (Bucky's \"horse-mounted bullies\" in Critical Path).Carol is pin-balling around the US, soon to Geneva, having taught a mini-course at Earlham in Indiana (a Quaker hangout) and attended an executive board meeting of AFSC in Philly (she just called me from there).  We'll be shipping some of her worldly goods back to the LA area as a part of her annual winged migration to/from sunnier climes.Today is Saturday, so I'm putting on my [school teacher hat](http://worldgame.blogspot.com/2006/11/more-pythonic-mathematics.html).  Last night I published [another piece of curriculum writing](http://mathforum.org/kb/thread.jspa?threadID=1487686&tstart=0) about the kind of math teaching I'm into c/o math-teach @ Math Forum.  I'm more in a reality TV mode than Numb3rs, which I explained to Tara is highly fictionalized (which is true of most cop shows).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}