{
  "id": "3445258864017946288",
  "title": "Dots of Light",
  "published": "2012-01-22T23:22:00.000-08:00",
  "updated": "2012-01-23T00:10:19.374-08:00",
  "content": "I'm continuing to weave a story wherein two of my favorite philosophers, Bucky Fuller and Ludwig Wittgenstein, get to share top billing as \"transcendentalists\" which, in this case, means both place a high value on intuition, but also on self-discipline.  You get the most out of your inner genius if you train your reflexes, or allow them to be trained, like an athlete, as that-of-God within (or call her Athena) may ask for leaps, as well as bounds.\n\nHaving this world class library of books by and about both of these guys certainly works to my advantage.  But then the trouble with books is when do we have the time to read them?  Mostly we need them assigned, or want to have them read for upcoming discussions.  Having some common currency, some concepts in common, is what culture is all about, popular culture but also high culture if we care to make the distinction.\n\nAs I was explaining to readers [on Sean's list](http://groups.yahoo.com/group/Wittrs/message/7188), in my case it helps to have Alex to report back to.  He has really done his homework pretty well, is someone I have no trouble looking up to when it comes to sharing views, yet he's currently too invested in various self disciplines to have the time to just sit around reading philosophy books, appealing as that may be.  I don't have oodles of time either, but as the books are right here in the Blue House, it's a lot easier for me than it is for him.\n\nMore specifically, both philosophers emphasize that understanding the parts involves having a sense of the whole, and there's a changing sense of the wholeness that has profoundly existential dimensions.  One may speak of a waxing and waning that colors one's whole world, making it more or less nauseating, or enchanting, or what have you.\n\nAlso, both philosophers develop their meanings operationally, meaning through use in context within invented language games and namespaces, with an emphasis on non-linear readings anticipatory of today's \"hypertext\". \n\nBoth philosophers tended to number their paragraphs and write aphoristically, knowing their remarks made sense in many different orders, in what could be called networks.  A sense of nodes and edges pervade the reading, ergo a sense of their topology, identified by Fuller with \"systems\" (as in \"systematic thinking\") with a tetrahedron of six edges and four nodes serving as his \"minimum system\".\n\nFuller developed intelligible meanings for \"brain\" and \"mind\", not wasting them as mere synonyms.  He kept a dramatic tension going between them.  The former might \"disconnect\" from the latter, resulting in what [Otto Weininger](http://www.theabsolute.net/ottow/) might have called \"a criminal state of mind in a dog-eat-dog world\" (a despairing hell of nail biting terror, shall we say).  Reconnecting with one's higher self, or, if connected, staying connected, was the heroic responsibility of a philosopher, or the routine responsibility of a cosmic janitor, depending on one's perspective. \n\nIn either case, a life of the mind was preferable, and Wittgenstein seriously agreed with this judgment.  Salvation / liberation was sought through some eternal eye of the needle.  Logic or grammar, rightly exercised, might help pinpoint it, but you would have to go through it on your own (an act of will, a doing more than a seeing).  The doors to new perceptions keep opening.  The act of eternally passing through them leads away from dead ends.\n\nI've been inspired to get the Blue House added to some circuit of academic value to people, like a school of some kind.  Calling it the Global U is rather vague, while in the meantime I've been dissing some of the better known name brands, [being polemical](http://mybizmo.blogspot.com/2006/10/more-technoinvective.html).  My Global Data Corporation, designed from the ground up to be [Grunch-like](http://grunch.net/), was similarly difficult to instantiate, though as a campus facility, I'd say the Blue House has done a fine job of it. \n\nThe only real company I sometimes work in [is Unilever](http://worldgame.blogspot.com/2010/09/equinox-retreat.html), in connection with the Pauling House Campus, and CBS, in my thoughts about television, along with Python.TV and some other stuff (including Disney).  How does any of this jibe with Rad Math and Martian Math, ostensible products of said residential zone establishment?  That would be the Oregon Curriculum Network and my \"mechanized logic division\" [through work](http://controlroom.blogspot.com/2011/06/back-office.html), and also through Saturday Academy (an occasional gig).  Various Internet groups. Conferences. Nothing especially new.  Same old same old.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}