{
  "id": "6063467440670723876",
  "title": "Double Slit Experiment",
  "published": "2014-02-15T08:38:00.003-08:00",
  "updated": "2014-02-16T19:49:33.102-08:00",
  "content": "The double slit experiment is always animated in depressingly the same way.  Let me offer another viewpoint, not in contradiction with any experiments.\n\nHave the screen at the back where the light \"hits\" be a landscape you're in, which suggests, because of gravity, that your beams are shooting \"down\" (already a change!).  You're in a position to walk around.\n\nYou're like a microscopic bug, or no, wait, human sized is fine, but over your head is this vast firmament, a ceiling, a light blocker, with only one or two slits opening for light.\n\nWhen one slit opens in the Great Vault, your prison under it illuminates with a dull light from the great brightness beyond, a \"cone\" (slit-sourced) of brightness, a single shaft.\n\nWe could go on and on about when you might or might not know about the world outside -- not relevant.\n\nWhen two slits open in the Great Vault, you get a \"bar pattern\" of light and dark on the floor.  You can stand in a shadow.  Looking up, the slits appear darkened.  Shift over, and they're double bright.  As you move, you see waxing and waning in brightness from the slits.\n\nYour eyes are the sensors on the plate, in other words, and the bands of light and shadow have a \"first person\" aspect.  You might say:  \"the bar between the slits casts many shadows as the light is bent around it at various angles\" -- your wave theory is kicking in, as waves are bent by slits in just this way.\n\nThis might be called First Person Physics in the sense that you paint your self in as a sensing observer and imagine  (animate, simulate) yourself in various places, experiencing the phenomena.\n\nBeing aware of an observer is [nothing new](https://groups.yahoo.com/neo/groups/SYNERGEO/conversations/topics/71604) in physics.  One remembers the observer must be likewise accounted for as an energy sink or perhaps source, in any observed scenario.\n\nEnough pretending the cameraman was never there.  To have any information at all about a situation is to feed off it in some way, an energy transaction in the conservation equations.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}