{
  "id": "4177919161052785585",
  "title": "Drug Pushers",
  "published": "2016-08-24T19:08:00.002-07:00",
  "updated": "2016-08-26T22:33:19.492-07:00",
  "content": "Speaking of livable lifestyles, I find American TV somewhat cruel in how it's used to push drugs for \"depression\" ([DSM V](http://dsm.psychiatryonline.org/doi/abs/10.1176/appi.books.9780890425596.dsm04)), an insurable condition for a tiny minority of human guinea pigs, while society's systemic ills are never mentioned as a cause. \n\nBecause for that, no pill is the cure.\n\nI liked it better when advocates for strong drugs, psycho-actives etc. were not allowed to preach on television.  DC is [so hypocritical](http://controlroom.blogspot.com/2016/08/indo-expo.html):  [marijuana is Schedule One](https://en.wikipedia.org/wiki/Removal_of_cannabis_from_Schedule_I_of_the_Controlled_Substances_Act), but we're happy to let drug pushers of stronger, less understood drugs, pay for our news shows.\n\nOf course people get depressed.  The positive futurism of some of America's best thinkers and doers, gets shelved, to ensure we have plenty of folks desperate enough to blindly obey the pyramid schemers.\n\nLAWCAP (see Critical Path by Medal of Freedom winner R. Buckminster Fuller) thrives on scarcity, even if it has to create those conditions artificially.\n\nIf you're uninsured and go for more affordable drugs, you're a criminal.\n\nSo was President Johnson's \"War on Poverty\" literally that, a campaign to criminalize the poor and get them behind bars? I guess it worked.\n— Kirby Urner (@thekirbster) [August 27, 2016](https://twitter.com/thekirbster/status/769405017446952960)\n\nThe commercials tend to show people enjoying upper middle class lifestyles, their depression something brain-related.  Blame the brain.\n\nYour pursuit of happiness is being frustrated by a chemical condition.  Your genes are bad.  Wrong race. Yeah right.\n\nTalk about inferiority conditioning.\n\nI tend to mute the TV and / or walk away when they start hitting me with their drug pushing.\n\nI'll let my doctor tell me what medications make sense, or do some homework.\n\nI won't \"ask my doctor if X is right for me\" because of some Big Pharma drug pusher on TV.\n\nI've been around enough vets to know many have reason to be depressed.  If their mental condition were truly the focus, more research with DMT/MDMA would be permitted. \n\nHowever the focus is not on mental health but on making money.  \"Make sense or make money\" was Fuller's mantra.  We think in terms of money in lieu of doing the harder and realer work.\n\nMore honesty about what the world is really like, and less drug pushing, would sure make for some better television. I'm not some puritanical \"burn the opium fields\" guy saying this.\n\nI'm all for drugs, just not the phony, tacky, smarmy, tasteless commercial messages the sponsors dish out through my airwaves. TV drug ads are just gross in most cases, especially the \"depression\" ones.  I'll bet the billboards are even worse.\n\nMain reason Feds need Prohibition: they don't wanna face how many peeps they've put in jail for not letting Big Pharma do all the pushing\n— Kirby Urner (@thekirbster) [August 27, 2016](https://twitter.com/thekirbster/status/769405742264688640)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}