{
  "id": "3246624357968090627",
  "title": "Drug Policy",
  "published": "2013-09-23T20:50:00.003-07:00",
  "updated": "2013-09-23T21:20:04.974-07:00",
  "content": "One reason I'm skeptical that English may be used to write laws (I'm sure it is, but likely bad ones), is how it has three ways of thinking about drugs:\n\n(a) you abuse them, which includes using them recreationally\n\n(b) you need them for your illness or\n\n(c) you need them but can't get them, for one reason or another (this can make you seem pathetic on fictionalized cop shows on television, where you're another meth junkie / walking dead).\n\nThese categories overlap.  English are moralistic and often see illnesses as morally deserved, so (a) leads to punishable illness (b) for which (c) is the punishment.  Hah hah, funny English.\n\nBut when you say meth do you mean speed?  Lots of business executives, male and female, are chugging through life on speed and I don't just mean caffeine.\n\nSome have ADHD and take Vyvanse, Adderall, Ritalin for a reason, because they're sick.  Others are doing these recreationally, which is illegal, unless an \"unscrupulous\" doctor let them in on a lucrative diagnosis.\n\nI say \"unscrupulous\" in quotes because I resent those who patronize psychiatrists who use their own judgement as to who gets the speed.  Mrs. Jones is slowing down big time and we could go into the reasons, but she really picks up on an ADHD drug, and Mr. Jones likes it better that way too.\n\nYou could do a big favor to that household if you wrote them a prescription.\n\nBut even that whole system is so patronizing.  If people had more freedom to self-medicate, with all the dangers to self and others that implies, then they would need to spend a lot more time learning to think, behave, and have the ethics of medical doctors.\n\nThey would need to be more health-aware and compassionate in general, because compassionate people don't \"drink and drive\" in all the billions of ways that can happen (no alcohol need be involved, where kool-aid is concerned).\n\nIf we had the ID thing down, then if you're the equivalent of an Eagle Scout, then go ahead and customize what's in your own medicine cabinet, you're Tom Cruise or Bruce Wayne and this is the science fiction future already.  The board is waiting.\n\nWrite scholarly journal articles about it and upload your biometrics, participate as a guinea pig in human subjects experiments, openly on the Internet, where lots of people can audit and see you're not mistreated.\n\nYou signed up for this.\n\nA lot of people do drugs in this fashion, but usually only to (b) cure an illness.  If you do it to get better at sports, or at math, you're a criminal (if you think in English).  I mean yes, it is cheating the way some rulebooks are written, but where are the sports for which it's not cheating.  Give us those too.  Tours de Something.\n\nWhat's missing from the English language is the concept of using drugs for work, like Protestant work ethic work, i.e. not because you have an insurable illness but because some medicines are tools of the trade (whatever trade -- jazz musician the stereotype).\n\nPeople who use drugs in religious ceremonies are about the only ones carving a new space in English law, and their progress has been slow, because the cultural IQ is low and rising only slowly (a vicious circle, don't you see).  I used to visit the Voodoo House (a spoofy misnomer), an institution connected to this new space in the law.  Not that I ever got to try their kool-aid, an opportunity missed I guess.\n\nSo yes, I come out in favor of more OTC solutions, perhaps with ID checking and rule-based authentications.  I'm going to watch the NRA closely because they've been all over this territory in trying to persuade people about why a world with guns is a safer place.  Abusing guns is dangerous but guns in their place have their place.  Likewise, I'm saying, with controlled substances:  that you don't have to be sick to wanna use them responsibly (unless English is the box you think in).\n\nDoes this mean I'm for banning \"recreational\" as a category in favor of some new \"professional\" use?  No, I think the recreational category should stay.  But it's usually just lumped with abuse as another illegal activity and in that sense I'm saying [Prohibition](http://worldgame.blogspot.com/2008/12/repeal-day.html) is still wasting too many resources on its hopeless fight against Pandora.\n\nFar less expensive is reinterpreting Pandora.\n\nIt's somewhat overwhelming, yes, how much was in that box, a cornucopia, but it's not just the bad stuff, it's the good stuff.   And it's not always the stuff's fault, but how we're klutzy in using it.  We win a lot of Darwin awards, as humans.\n\nShe's more like a Santa, this Pandora.\n\nUsing Pandora as a scapegoat was what the \"blame religions\" were into, religions that focused \"blame\".  We've all met these religions.  They're a pain aren't they?\n\nWe're even rescuing Medusa with snaky hair from always being so scary-ugly.  Her visage awakened a conscience in Perseus and led him to consult with Wise Athena about matters of the heart.  His \"slaying the gorgon\" was not some triumph over an archetype, an impossibility, but a sign of his own journey in self mastery, a stage along the way in his personal Jihad.\n\nOthers can take it from there, you see where I'm coming from.  Less moralizing would be good.  English moralizing gets in the way of doctors without borders, all too often.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}