{
  "id": "114235834570342838",
  "title": "Early Buffy",
  "published": "2006-03-14T09:53:00.000-08:00",
  "updated": "2006-11-15T11:43:54.611-08:00",
  "content": "Having raced through FireFly (I missed a few), we've turned back to Buffy The Vampire Slayer, Season 1, Disc 1.  The stars are just beginning to feel their way, \"over-acting\" one might say, but the audience needs this too.  There's no short-cutting past the awkward first steps, much of the time.  There's this period of \"tuning in\" (lots of feedback cycles).Hitting the ground running is usually only an option if you've done it before.  A lot of this Buffy stuff was original spin, even if the material was Old Europe and well worn.  California girl as vampire slayer, what a concept (!) -- way too good to just leave alone, that's for sure.  Behind these earnest early performances is a sense of commitment, of wanting to get it right, to get past a pilot phase, when so many shows get yanked (TV can be pretty Darwinian).And a lot is fully functional right out of the gate in this series (the start of what was to become a seven year run):  we're already dealing quite effectively with teen issues, around popularity, the dynamics of study (everyone runs to dear Willow, our future witch), attraction and repulsion, \"raging hormones,\" various [mother-daughter scenarios](http://www.buffyguide.com/episodes/witch.shtml).Charisma Carpenter is brilliant at portraying the \"mean girl\" type in her character Cordellia (see also:  [Mean Girls](http://www.imdb.com/title/tt0377092/)).  She helps anchor the rest of the cast, as her performance is highly polished and credible.I originally dove in at the start of 3rd season when I first encountered Buffy in my late 40s, so going back to this early stuff is an eye opener.  By the time I come in, it's pretty much over with Angel already.  She's ready for Riley and then Spike, who, like Cordellia, really adds to our depth perception (having boyfriends be vampires, with an interlude in the military, was a nice arc).As a storyboard artist of sorts, I appreciate how on-camera talent needs time to grow into a moving picture.  When filming the [Ken Kesey novel](http://www.imdb.com/title/tt0073486/) (highly adapted), the actors got time in a ward of their own, and opportunities to [hobnob](http://www.answers.com/hobnob&r=67) with patients and staff (all this in a real mental hospital, in Salem, Oregon).If the story is gripping and well crafted, artists find it within themselves to take ownership of a role.  This is what happened in the Buffy series -- an inspiration to aspiring writers like me.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}