{
  "id": "927315142318537191",
  "title": "Earmarks",
  "published": "2008-04-19T08:43:00.000-07:00",
  "updated": "2008-04-20T08:40:16.142-07:00",
  "content": "Although it's wise journalism to remain safely cynical in public, when it comes to following the money through Byzantium, I can see why some of these congress folk are so proud of their earmarks. To say they have the ability to dispense funds by some inscrutable process, is just another way of saying they wield power.  What was the USA government apparatus supposed to provide, if not powerful positions, let's be honest about it.So let's take the example of congressman X who gets a lot of money allocated to some grateful campus, which then names a building after the guy.  Happens all the time in the private sector, where we call it philanthropy.  What it comes down to is partly how we feel about taxes, and do we respect the judgment of the people we elect to high office.  I'm thinking the system could work, but has become distorted in some ways we need to fight back against.Sometimes it's convenient to say \"Hollywood\" as if that means something monolithic.  Other times, we remember that individual stars may be as far apart as the universe itself in some dimension, i.e. just because books all look similar, sit next to one another in the library, doesn't mean each shares the same world view.  All of which is a long way of saying that \"Washington D.C.\" is not a mono-culture, never has been, and politicians are not all cut from the same cloth.Part of the political life of our nation is to provide good role models.  The power to earmark doesn't in and of itself erode our ability in this regard, much as we may opt to play with the rule book.  I'm betting tomorrow's high office holders, no matter how ethical, will have what amounts to the same thing:  an ability to get work done behind the scenes that leaves many wondering how it all really works i.e. we'll have \"Washington insiders\" so long as we have politicians in Washington.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}