{
  "id": "6647690810830980087",
  "title": "Earth Day 2009",
  "published": "2009-04-22T10:28:00.000-07:00",
  "updated": "2009-04-22T11:20:29.448-07:00",
  "content": "I did my big carbon footprint yesterday, in [driving to Vancouver](http://worldgame.blogspot.com/2008/05/squanderers.html), so today I'm wearing my halo, being sanctimonious, walking around like a European in a well planned, pedestrian friendly town.Many USAers are afraid to leave their cars with good reason.  My walks to and from the Hyatt in Chicago involved traversing shovel ready dirt sidewalks turning to muck in the snow.The woman with the suitcase had an even harder time, had to pull it in the street.  I'd have offered but she was clearly in self reliant mode so we just chatted instead.Another time, after dark, me trudging from the Blue Line station, a black SUV pulled alongside and suggested I hop in, which I did, given I knew the people.  Not having real sidewalks leads North Americans to waste gas.Dotting the landscape with company towns built to a human scale, self sufficient enough to forgo the \"bedroom community\" fate, would be another way to go.So-called retirement communities would do well to keep some business channels open, as some oldsters have sysadmin skills, want an intranet to keep playing with.  Retiring boomers want access to GNU/Linux, not shuffleboard so much.People learn to live this way (in walkable, golf cartable communities) on small campuses especially, but also in religious establishments set aside for scholarship and contemplative living.The latter often specialize in wine, cheese, chocolate, beer or other agricultural product for barter and/or ecommerce shipment.Today, a given XRL might offer web services, advertising, technical writing, even television production.  Some serve [as call centers](http://mybizmo.blogspot.com/2008/05/groundbreaking-solutions.html).By hearsay, I know of one such remote community that specializes in state liquor laws, getting establishments licensed in whatever county.  They fly around a lot, but have this base to came home to.  That shifts the fuel mix, as cars and jets take from different tanks in the refinery.Some cars and trucks also [run on agricultural products](http://www.grunch.net/annex.html#energy), making them more competitive with bovines in some cases, in terms of driving up the price of grain.  However, not every source of biodiesel is as attractive to farm animals.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}