{
  "id": "1293751022947139103",
  "title": "Echoes",
  "published": "2015-09-11T18:29:00.002-07:00",
  "updated": "2015-09-12T10:07:23.735-07:00",
  "content": "This is my wedding anniversary.  Yes, 9-11.  I'm remembering being in this very room when the planes hit, our living room in Portland, Oregon.\n\nWhat else I remember was on that very day in 2001, TriMet was unveiling its new Max line, the Red line, to the airport.  Max is our light rail system.\n\nNow, on 9-11 in 2015, Tillikum Crossing and the opening of the Orange line, is a top story.  They lit it up last night.  The actual opening is [this weekend](http://www.kptv.com/story/30011395/trimet-preparing-for-grand-opening-of-tilikum-crossing-orange-line-max).\n\nSo far I've noticed no uptick in attention to the concerns of those unhappy with the official explanation of how those WTC buildings were destroyed.\n\nCertainly the airplanes contributed but many architects and engineers see [WTC7](http://controlroom.blogspot.com/2015/03/rethink911-hgp.html) at least (emptied at the time) as otherwise demolished, perhaps because although not hit directly by a plane, it had been totaled nonetheless, in an economic sense?  If not a white elephant before, it was now? \n\nHaving a system already in place to self-destruct is more than a lot of buildings can advertise.  Better to add to the rubble now by self destructing, than later when the rubble is cleared -- is that what WTC7 was thinking?\n\nNPR takes us into an exhibit (some 911 museum), and discusses how people are reluctant to talk about those events, but without talking about what people are most reluctant to talk about.\n\nCBS likewise:  the word \"thermite\" is not welcome anywhere near the Twin Towers story, not this year.\n\nThose new to my blogs will see I'm [echoing previous postings](http://mybizmo.blogspot.com/2014/11/out-of-clear-blue-sky-movie-review.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}