{
  "id": "1969072694672513932",
  "title": "Education Automation",
  "published": "2018-12-31T13:30:00.000-08:00",
  "updated": "2019-01-22T22:48:27.475-08:00",
  "content": "I've chosen the title of [one of Bucky Fuller's books](https://www.brainpickings.org/2014/03/05/buckminster-fuller-education-automation-1962/) for a blog post title.  \"Automation\" sounds cold, minus the warmth of human touch and attention.\n\nFor those who've received a lot of grief from humans, mostly negative feedback, a little automation may be a godsend.  Household appliances have freed up many hours for time with family.  Without a posse of servants, a single human is able to keep up with a lot of tasks, even with one or more dependents.\n\nHowever, I'm getting off topic.  I just saw the documentary Waiting for Superman again and wanted to weigh in with fresh memories, and before I reread [my blogged review](http://controlroom.blogspot.com/2011/01/waiting-for-superman-movie-review.html).\n\nHere's director Guggenheim giving Bill Gates and others a vehicle to express their vision, which is pro school choice, anti teacher union, pro merit pay, anti tenure.\n\nThe myth (which has some truth in it, how much is a key question) that what's between life in poverty and a comfortable place in the professional classes, is \"a good education\" provides much of the premise for this film.\n\nDefine \"good\"?  Is it what rich people got?  Maybe not in all cases?  You can be a rich know-nothing with few skills and no ethical sense.\n\nWhat I'm concerned about is students not having any management responsibilities over accounts and files in cyberspace, because they don't get a safe workplace.  Schools focus on herding from room to room, not scheduling quality time in study quarters. The \"safe study space home base\" (or PWS) become more the reality in college -- but why not before?\n\nAs an after school teacher, I drive around with a phone full of login credentials, sometimes Chromebooks, which I give out to my students.  These are for accessing such cloud-based learning platforms as MIT Scratch, Codesters, Animatron, Clara.io and Codepen.io.\n\nWe're teaching a lot of techie stuff, but a lot of it's arty too.  Arty / techie is what some call \"design\" and with enough science:  \"design science\".  Many generic skills.\n\nBack to Fuller (a master of \"design science\"):  he worked to counter the Protestant myth that we only deserve life support if we agree to do \"jobs\" for the owner classes, and that those without jobs are without merit and unentitled to any life support.\n\nHe supported minimum income philosophies, as a way to help keep us out of trouble.  Engineering could distribute the sun's munificence, according to some Food Not Bombs philosophy.  At least no one would go starving.\n\nIf all you do is work, when do we study, and if study is work, why isn't it paid (compensated)?  Shouldn't civilizations reward behaviors necessary for their own perpetuation?  One might think so.\n\nWhen do parents get to stay home with their kids and learn skills together as a team?\n\nUsing education systems to split parents from children in order to homogenize and dilute ethnic differences is likewise a big use of television.\n\nA mixed use skyscraper or larger building is more like a village in that people get to sleep, eat, study, work, exercise, and so forth, without commuting across town.  Just take an elevator.  More like living on a Starship Enterprise in some popular TV show.\n\nWhen schooling is better integrated into the local economy, with apprenticeships and part time roles, that can help too, in producing well-rounded individuals.\n\nSaying you've \"dropped out\" to serve as a cashier in a small family store (or on a military base), is pretty extreme.  We need systems that let you opt in and out easily over the course of a lifetime.  Some people don't see the value in education until they've had more life experience.\n\nGetting some work experience at a young age need not be some fateful decision that keeps you away from other opportunities forever.\n\nI want kids to have opportunities to read and write programs, manage websites, make movies, tend to databases (not only SQL) starting from whatever age they have the attention for it, a mental age more than a physical one.  But when do they get an opportunity?  I bring them login credentials.\n\nDeveloping these skills usually means tending to a file tree somewhere, a software workbench, and also having a work/study environment relatively free of distractions, like we hope students have when doing homework.\n\nKids need cubicles, study carrels, as much as the adults do.  All some get is a storage locker.\n\nLots of professionals, curriculum developers, engineers, have visions similar to Bucky's:  lets make advancing through a curriculum a paying proposition, even if only in terms of crypto-currencies.\n\nReward the work of study, with greater access to educational resources.  Compensation isn't always in terms of cold cash, much as anonymous currencies have proved, and will continue to prove, useful.\n\nWhat we need to set up are pilot projects, staffed and developed by people willing to \"eat their own dog food\" i.e. those designing the lifestyle also need to enroll in the programs to find out what it's like to experience various brands of \"education automation\" from the inside.\n\nNo one size fits all.\n\nLets see some more sizes.\n\nMine these blogs for ideas.\n\n[](https://www.flickr.com/photos/kirbyurner/31611123817/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}