{
  "id": "140079224011550525",
  "title": "EduSummit Thoughts (rant)",
  "published": "2016-05-29T16:02:00.000-07:00",
  "updated": "2016-06-02T12:37:29.373-07:00",
  "content": "I still harbor skepticism that learning to program has anything to do with becoming a professional computer programmer, necessarily.  Not necessarily.\n\nOperating a scientific calculator does not make one a \"calculator professional\".  Learning to drive does not make one a professional driver.  Learning to program does not mean committing to becoming a programmer.\n\nLearning to program is integral with STEM generally, and with Mathematics (the M) in particular.  Euclid's Method for finding the greatest common divisor is an algorithm, a famous one:\n\n[](https://www.flickr.com/photos/kirbyurner/27304852296/in/dateposted-public/)\n\nTeaching programming as an after school elective, instead of merging it into the curriculum in satisfaction of mathematics requirements, is just dumb.  Too retro.  Too lazy.\n\nWe need math tracks that include programming.  I've been [harping on this for years](http://controlroom.blogspot.com/2016/04/a-pep-talk-of-my-own.html), as a part of some [vocal minority](http://worldgame.blogspot.com/2009/03/pps-has-friends-in-silicon-forest.html) that's becoming more of a majority over time.\n\nYes, schools need to teach typing.  Keyboards are not going away. That's an uber-important skill.  Not just thumbing on a smartphone.\n\n[Providing smartphones](http://worldgame.blogspot.com/2014/12/about-smartphones-again.html) would make sense though.\n\nHey, if your school does not include coding as a part of the regular math curriculum, is that OK with you?  Do students have the right to protest?  How about their guardians, do they have a say?  These questions [have become political](http://bit.ly/1TJXlUD).\n\nYes, parents need a place to look after their kids during working hours.  That's a primary function of the school system.  Providing a safe, [interruption free space](http://worldgame.blogspot.com/2015/07/pws-personal-workspace.html) to focus and concentrate is not necessarily what today's schools are about.  You may just get a locker, and crowded classrooms.\n\nStudying is difficult in such an environment, if not impossible.  Privileged students have their own rooms at home.  On college campuses, one finds study carrels, often in the library building.\n\nIs mathematics education really happening in your district?  Does at least some coding happen? That's a question worth asking.\n\nThis artificial division between \"computer science\" and \"mathematics\" in the lower grades (pre-college) is devastating.  We teach \"function\" and \"variable\" in two separate dialects (in both algebra and computer science) and then leave it to students to connect the dots as they might (or might not).\n\nPython's top-level functions are pure gold to a math curriculum, as writing functions that take other functions as arguments is core in calculus.  D(f), the derivative function, takes a function f as input and returns another function as output.\n\nComputer languages make such ideas accessible, concrete.  So do we use them?\n\nIn an exclusive private school such as Phillips / Andover, those getting a privileged high caliber education might use Mathematics for the Digital Age and Programming in Python ([prototypical](http://www.skylit.com/mathandpython.html)).\n\nAs a society, we're apparently happy to share the new tools with children of the one percent (or less), while leaving the ninety-nine percent to wallow in their intellectual ghetto.  Those seeking greater equality of opportunity might want to pay attention to such inequities?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}