{
  "id": "1774774220110764564",
  "title": "El Topo (movie review)",
  "published": "2014-09-22T13:42:00.001-07:00",
  "updated": "2014-09-25T06:11:50.334-07:00",
  "content": "El Topo (\"The Mole\") incorporates many tropes from the Western, but also the martial arts film.  A story line wherein a wannabe confronts successively higher masters and fights them, perhaps to the death, is taken up [by Bruce Lee](http://en.wikipedia.org/wiki/Game_of_Death), with Kareem Abdul-Jabbar one of the masters he fights.\n\nAs someone well versed in the Buckminster Fuller legacy, I have to comment on Master Two's splendid collection of toothpick vector matrices, including a painstakingly constructed isotropic vector matrix of considerable size, which our anti-hero destroys.  Got me thinking about Russell Chu, a patient toothpick IVM builder.\n\nThe anti-hero goes on to confront his own son, now a grown man, as yet another master he must overcome.  If we take \"killing\" as a metaphor for simply \"comprehending\" then we might restore the gory foreground to the status of tantric dream (cartoon-verse or whatever).\n\nThe anti-hero is driven into the priesthood by [a love triangle](http://mybizmo.blogspot.com/2006/10/terminal-movie-review.html), getting \"crucified\" on a bridge in a scene aptly named Betrayal on the DVD.\n\nYoko and John Lennon appreciated this film and Jodorowsky's talent more generally.  He's both the director and a main actor in this comic book South American western.  I can see why.\n\nAnyway, the son, the mole, is vastly understaffed and underfunded and his alchemy experiment proves a calamity and he experiences game over, probably doomed to replay this level at some level.  Reintegration of \"the other\" into \"polite society\" or whatever the towns people signify, is clearly a dicey game, explosive, and without careful management and supervision, was bound to go awry.\n\nThe DVD itself gets a lot of credits i.e. restoration of the original film to its DVD state, complete with an interview (engaging) with Jodorowsky, which leaves me wondering if the somewhat rough cut editing is an artifact of restoration.  I think more likely it's what I'd call the \"comic book style\" of this kind of movie making.  Things happen abruptly sometimes, just like in real life.\n\nIn trying to turn his rescued significant other into a shaman, like himself, she appears to bifurcate into two people (my reading) at first conflicted, but growing self-assured enough to stand on her own and engage in a separate journey.  On this reading, it's maybe a triangle, but Mara is simply more in touch with herself and doesn't need to piggy back on her man, riding him Lady Macbeth style at first (given what she'd been through, I can't say I blame her).\n\nThe anti-hero, in the meantime, has a lot of father-son issues to work through and so isn't really prepared for a girlfriend.  He needs to deal with not being in control for a change.  Part Two of the film (the film somewhat divides in two) traces the anti-hero's continued maturation, this time against the backdrop of the mole's alchemy project, which he undertook by popular demand in a spirit of public service, a politician of sorts.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}