{
  "id": "9003678473144165001",
  "title": "Election Postmortem",
  "published": "2016-11-09T23:07:00.002-08:00",
  "updated": "2016-11-17T10:46:03.193-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/30571734310/in/dateposted-public/)\n\nI heard the CBS team assert numerous times that voters had made up their minds a month ago, about whether Hillary's emails were important, and so on.  However we're also learning that the polls were way off, so any such specific polling result might get looked at with some skepticism.\n\nAs someone versed in social media, I saw a sudden surge in rumor mongering, with Wikileaks playing a central role in the narrative, lets call it science fiction for now, to avoid having to make too much of a determination.  The scandal factor was high.  Occultism, sex trafficking, everything tabloid and National Enquirer rolled into one orange pill.\n\nIf I were a political scientist, I'd at least entertain the hypothesis this \"shock therapy\" was effective, as enough dots seemed to be connecting to reveal a new paradigm, right on the eve of November 8, with [November 5 the high tide](https://medium.com/@kirbyurner/the-conspiracies-circulated-in-connection-with-wikileaks-were-far-more-sensational-and-tabloid-than-4b2b061d8fd8#.d646didgf).  Having CBS News tell us nothing 9th hour could be a factor seems too much like a cover story, to keep us thinking Weinergate was nothing, a false positive.  Not that CBS would knowingly fabricate, just \"news from nowhere\" gets in sometimes.\n\nPeople don't like to randomly admit to strangers (pollsters) that they just came to a conviction in the last 24 hours, on a topic everyone has been discussing for months.  Reasonable?\n\nThose supporting Hillary are indeed pointing at the FBI for adding a Weinergate wrinkle and reopening the emails issue, but how many of these true blue supporters saw the \"scoops\" being dished out through social media, about \"orgy island\" and \"spirit cooking\"?\n\nPeople who listen to NPR aren't the same ones who ogle the tabloids in checkout lanes, necessarily, though of course there's overlap. People who doubt Barack was born in Hawaii, might also believe Michelle is a man. A little credulity may go a long way, given skilled spin doctoring.\n\nLike I said, even without playing special prosecutor, with respect to some witch hunt, I think we might agree we don't have sophisticated enough models to reach agreement on the true impact of social media, especially of the more sensationalist genre.  We can guess, debate, but only the least of the pundits will definitively assert.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}