{
  "id": "2476587194112421684",
  "title": "Elevator Pitch",
  "published": "2022-11-25T09:00:00.000-08:00",
  "updated": "2023-01-30T22:14:26.220-08:00",
  "content": "The elevator pitch for the giant dome is survivalist, which immediately gets funny, because of Yes Men and their Survivaball.  Not that domes are the equivalent of space suits.  \n\nBut when it comes to heating and cooling a big volume, the logistics of powering a single space comes with an economy of scale, at least in theory.\n\nInside, you have your sound stage and audience,  a perimeter of concessions.  In neighboring domes, people pitch their tents.  \n\nIn some, you stage a quaint village, Medievalish but with amenities, built more with movie set theater prop technology, than with old fashioned brick and mortar, as you're more in a studio than protecting against the elements. \n\nThe dome or other universal studio building is already taking care of wind, rain, cold and heat.\n\nBenefits of rapidly deployed and emergency assembled and disassembled heating and cooling domes include practicing the world game disciplines we've come to take for granted.  People have to choreograph and to some extent improvise.  The moves become smooth to the extent practiced.  \n\nMovie-making comes closest, as a design science, with military logistics providing a complementary theater.  Both center around simulation and planning with models and maps.\n\nThe domes in Cornwall provide a good example of what we all expect from the UK.  If British Aerospace can't deploy emergency heating domes, who can?  Raytheon?  \n\nThe engineering sector is shifting our attention from \"Big Tech\" and/or \"Big Pharma\" in the sense of social media and biochemistry advertisers respectively, as these are small fry compared to the aerospace sector.  We have conventionally allocated aerospace to civilian versus military but there's little to keep this namespace anchored.\n\nBesides, it's not either / or.  Health care is just as big a consumer of computer science warez as the military and weapons vendors.  The arrival of mass casualties during wartime, begot triage and triage tents and all manner of medical practice I know more about from watching movies than from nursing school.  WW1 saw the beginning of many new kinds of war science.\n\nSpeaking of nursing, I do appreciate the cram course YouTubes I've been plowing through.  As we all get older, we encounter more issues in health care, for ourselves and for others.  In my case, I also had a professional track running through heart procedure territory, being a chief data harvester for a research hospital system.  \n\nI was not in patient care, unless we count long term outcomes research, a kind of feedback doctors treasure.  I knew heart anatomy pretty well.  Lately I've focused more on lungs and liver.\n\nCould a giant dome be an emergency hospital, like a MASH unit?  People may spontaneously associate such setups with war zones, but disaster scenes more generally feature both the wounded and the infected.  Lately, the world has been dealing with infection and overdose.  That was until they decided to plug and play this retro Euro-war.  Now war wounds are what's climbing again, along with thermal issues.\n\nSo we're back to MIT having done its homework, and private firms having their catalog of emergency shelters at the ready, whether or not they'e actually free span.  The more likely shape of anything American is a box, with sliding doors, more like a giant garage, farmhouse or big box shopping center store, like a Costco or Home Depot.\n\nThe floor plan of a \"camp in\" dome is more suburban street mode, with curvilinear walkways (synthetic pavements) and marked out camping sites, like when car camping.  A few golf cart type vehicles offer fixed route services whereas delivery forklifts carry palettes to and fro, complete with kitchen units and entertainment (education) modules.  \n\nSome properties have tents, but a lot of those are outside.  Property holders stack the various units, which need not be equipped with individual heating or cooling units, given the context, of a larger system.  You may have personal devices, such as fans or baseboard units.  There might be a sauna and/or hot tub module, depending on amps available.\n\nThe Cornwall Domes use like a Tefzel pillow, I've never toured the place.  J. Baldwin was my source of pillow dome savvy.  I got to interview the guy on camera even, when staying with Rick and company in San Jose.\n\nWhat do the power stations look like?  That's another whole side of the business.  No doubt NATO, like FEMA, has a large number of plans for such units, with other regional bodies likewise sharing blueprints.  Given the dire needs of the populace, and funding already allocated, it's time to spring into action, right?  Right!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}