{
  "id": "1985827625832158048",
  "title": "Email Woes",
  "published": "2015-10-21T12:45:00.002-07:00",
  "updated": "2015-11-07T17:09:45.349-08:00",
  "content": "So far the story about the CIA director John Brennan having his emails hacked reads more like [a tabloid article](http://www.theverge.com/2015/10/21/9583464/wikileaks-cia-email-hack-published-download) than authentic news.  I'd expect such a headline in the supermarket checkout lane.  The details are thin and all the articles simply repeat one another.  I'm fine with writing it off as [a hoax](http://www.theverge.com/2015/10/19/9571141/hackers-john-brennan-aol-email) for now, but a good one for sparking debate, like the face on Mars.\n\nThe timing couldn't have been better in terms of reminding people how easy it is to pretend to having a particular identity.  Faking one's identity is much more common than stealing someone else's.  For one thing, that someone else may still be in the picture, fighting to terminate their credit cards.  Much easier than identity theft is contriving a phony background and getting that to snowball somehow i.e. to enter that hallowed \"realm of believably\" -- a royal realm.\n\nOf course I'm talking about Wayne Simmons, [a loudmouth on Fox](https://youtu.be/U6P1lQOScVQ) with all kinds of opinions, very much a \"white guy know-it-all\" of the kind we have in great overabundance.  Getting him and every guy like him to stop self-promoting with phony CIA affiliations would really help us move faster towards reconciliation on a number of fronts.  Call it a \"truth process\" if you will.\n\n[The timing was ripe](http://worldgame.blogspot.com/2015/10/women-in-combat.html) because the AOL story reminds people that one needs to fill out a lot of paperwork to be in government.  Those claiming CIA affiliations are mostly posers spinning it out of whole cloth, living their fantasy lives, inflicting it on the rest of us.  Simmons lived as a character in a novel of his own making, but then that's what TV is all about in this day and age:  purveying fiction.  Fox News is entertainment.\n\nAs the hacked AOL story reminds us, Brennan had to fill out 47 pages or whatever it was to get his security clearance.  Unless you have a form like that on file, don't try to be a pundit on Fox as some former secret agent.  You need to get your ducks in a row.   I hope Fox doesn't blame people \"right out of college\" for a lack of vetting, [like Joe Concha does](http://www.mediaite.com/online/cavuto-apology-on-discredited-terror-expert-admirable-but-unnecessary/):  \n\nI say this as a host myself who has similar experts (former FBI, CIA) on all the time in a guest/panelist capacity, and it’s not the job of\n a host/anchor to vet every guest that comes on… as that would be a \nfull-time occupation onto itself. Bottom line: most bookers at cable \nnews networks are right out of college and some depend on booking \nagencies, which themselves do little vetting outside of a quick internet\n search. \nKeeping it real goes with the territory.  If you're an \"anchor\" you're responsible for protecting your own gravitas.  Isn't that what's [at issue in Truth](http://www.mediaite.com/online/mary-mapes-strikes-again-conjures-up-fictional-limbaugh-interview-in-promoting-truth/) as well, the movie about the snafu around Dan Rather, one time CBS News anchor?  Why apply a double standard?\n\nOf course this tightening up around vetting leaves a lot of bozos struggling to keep to their narratives.  They've maybe earned some respect in certain circles by talking up those questionable credentials, ala Simmons.  What happens to all those hot air balloons when we start wanting more pinpoint accuracy?\n\nHowever the Brennan story helps here too, as one of the exhibits, a spreadsheet, highlights the volunteer (as in unpaid) nature of many an IC role.  One needn't point to or even hint at a high net worth in order to get noticed as an asset to someone's country, according to criteria that might matter to that someone (e.g. being on the CIA director's short list).  Even if just another tabloid story, it's not without a message [of patriotism](http://worldgame.blogspot.com/2015/10/patriotism-vs-nationalism.html).\n\nHowever, neither of these stories have run their full course yet.  Perhaps the \"white boy stoner\" who is managing to elude the FBI while talking to the New York Post and maybe CNN -- still Time-Warner whereas AOL is now a part of Verizon -- will read a statement from behind an Anonymous mask.  We haven't heard from [that character](http://www.wired.com/2015/11/cia-email-hackers-return-with-major-law-enforcement-breach/) in awhile.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}