{
  "id": "2209020508233403924",
  "title": "Ending Hunger",
  "published": "2012-05-03T22:04:00.001-07:00",
  "updated": "2012-05-03T23:29:24.318-07:00",
  "content": "More different kinds of commercial was what the Hunger Project was about.  We're conditioned to respond within a sphere of [familiar insignia](http://grunch.net/archives/38), from stadiums to airport concourses, but where is the brand about ending hunger?  Are the big religions really leading that charge effectively?  Governments?\n\nEnter Food Not Bombs.  Stop the waste.  Close the loops.\n\nThe FNB event near Oaks Park was not any of my doing.  Lindsey checked it out and I'm not begrudging anyone's participation, just trying to put limits on what Blue House gets credit for.  I've got my curriculum writing, [Lindsey her music](http://worldgame.blogspot.com/2012/04/gotta-have-coffee.html), everyone else has moved digs, except of course family members, soon to increase in number. \n\nCarol is involved in many a global network, including WILPF's, which have proudly included Ava Helen Pauling among others.  Linus Pauling is a local hero, a symbol of so much that is best about people.  Carol has been bearing a pretty bright torch.  I look forward to hearing more about what [Linda Richards](http://controlroom.blogspot.com/2008/09/wanderers-200892.html) has been up to.  Trevor's book on Portland Memorials has the [Walk of the Heroines](http://www.woh.pdx.edu/) at PSU, where mom's name is memorialized, with those of others she knew.\n\nDeath from malnourishment:  a broad spectrum of conditions, including simply a lack of good food, but not limited to that.  Eating to much of the wrong thing will take their toll. \n\nYou may not know how to shop and live affordably, adding unwanted pounds simply for lack of easy-to-acquire skills, but who has the time.  You have your own treadmill.  \"Variations in routine\" sound like a cake walk when you're not stuck in a rut.\n\nIn our [distance education model](http://oreillyschool.com/), you can start and stop at will, with no metronome set by some meeting of \"classes\".  The concept of \"attendance\" is muted.  We inherit from the correspondence schools, but in some sense that's just a mixin parent class, not our root. \n\nAs a metaphor for life we each \"build a portfolio\" and to some extent authentication is of concern i.e. is this really your own work?  The question has to do with expected results, along with unchallenged claims.  \"Any liens on the property?\" the lawyers might ask?  Even easements can be a problem.\n\nAs Chris, one of [our newer Wanderers](http://controlroom.blogspot.com/2010/06/wanderers-summer-retreat.html) points out, so-called successful people are not really \"self made\" so much as produced by others.  This jibes with my own experience of co-dependent origination, the core dharma of many a Buddhist sutra. \n\nYou'll have had your champions and been a champion for others.  In [Homer Davenport's](http://mybizmo.blogspot.com/2012/04/our-hero-mr-ed.html) case, the Arabian horses brought him reflected glory, a two way street.  Your champions aren't always humans.\n\nDavid Koski, myself, George Hart, other members of the Poly list (which I am not on), are all registering respect and positive sentiments towards the late [Mario Marin](http://www.mariomarin-poliedros.com/), a pioneering artist.\n\nIt is with sadness that I also join all other members of our polyhedral list on the death of Mario.  He certainly will be remembered for his profound contributions to the lore and lure of polyhedral creations.\nwrites [Magnus Wenninger](http://worldgame.blogspot.com/2011/06/visiting-geometer-priest.html), another great in that ballpark.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}