{
  "id": "8985660614318729337",
  "title": "Engineering as a Moral Enterprise",
  "published": "2015-05-29T08:12:00.000-07:00",
  "updated": "2015-05-29T11:19:14.310-07:00",
  "content": "As many have already pointed out ([including me](http://worldgame.blogspot.com/2014/02/lifes-beginnings.html)), having these ISEPP lectures in a beautiful old church with stained glass windows is definitely a plus, given how Science now rules the roost when it comes to being taken seriously.\n\nHowever, picking up on STEM, and recounting his early experiences tuning in the E-for-Engineering, Terry manages to nudge out Science in place of Engineering in his insider talk, as the most evolved discourse and practice.\n\nHis theme is perfect for Silicon Forest, i.e. \"[ONAMI country](http://worldgame.blogspot.com/2009/11/onami-tour.html)\" (nano and micro scale work), where people hope we're up to something positive i.e. not just making more WMDs for the world's bonehead military.\n\nCulturally, engineers have tended to have their own schools and then wait for the project to be specified, not entering the process or stoking the pipeline in the early phases, when the jockeying is deemed \"too political\".\n\n\"When you know what design you want for that bridge, come tell us, but don't expect us to decide for you, if it's to be a bridge for cars or just trains -- that's political.\"  Actually that's urban planning, so engineering of another kind.  Portland's new Tillikum Bridge is nearing completion:  trains yes, cars no.\n\nHowever, for engineering to see itself as the pragmatic, moral enterprise that Terry envisions, training for engineers would likely need to change.  More history and philosophy of science, intellectual history in general, would need to be infused, not willy-nilly, but with a punch line:  your conscience, which is likewise your intuition, should be fully informed and engaged.\n\nIn that vein, Terry tours recent 20th century chapters, most notably the foray into quantum mechanics, which ends up in complementarity, the concept which allows alternative and even seemingly contradictory world views to co-exist and even bolster one another for the greater good of all.  We see the electron as a wave and develop technology X, as a particle and get technology Y, with X + Y = the smartphone in your pocket.\n\nSynergy among complements, versus everyone getting on the same page politically is the key:  dynamic tension, not oppression of some minority by a tyrannical majority.  He's not pushing a Technocracy agenda per se, as there's no assumption of uniformity in outlook, only a multiplicity of complementary outlooks that still need Science (aka \"engineering research\") for reality checks.\n\n\"The US Constitution is an engineering document, an experiment answering the perennial question 'how shall we live'\" says Terry.  The very fabric of self government is an engineering enterprise.\n\nPropitiously, the same church was simultaneously serving as a venue for another venerable NGO in Portland:  Sisters of the Road.  The Journeys! Art Festival expresses optimism and the values of community-building.  One of the speakers was Asian Reporter’s columnist and staff member at Portland’s Office of Equity and Human Rights, Ronault L.S. “[Polo](http://worldgame.blogspot.com/2012/10/disarm-day.html)” Catalani, who has also addressed Wanderers (ISEPP's think tank) on matters of conscience and engineering. \n\nDoes all this convergence suggest politicians should be touting their credentials in engineering, including software engineering?  Of course it does.  Stay tuned.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}