{
  "id": "4294785000405221805",
  "title": "Engineering Yammering",
  "published": "2012-03-30T11:33:00.001-07:00",
  "updated": "2012-03-30T14:43:10.915-07:00",
  "content": "Koski had been kicking around the middle states again, Michigan mostly.  There's a routine [the nuke plants ](http://masonrydesign.blogspot.com/2012/03/review-of-fukushima-daiichi-nuclear.html)go through, like what you would do for a car at maybe 60K miles (yes, I used miles).  Maxi Taxi is set to go in, as she'll disintegrate otherwise.  Speaking of which, Glenn's Integral Design is now out of the box.  I helped him send [a mug shut](http://www.flickr.com/photos/17157315@N00/7027309161/in/photostream) to a NavAm conference Milt is involved with, where such knowings are shared.\n\n[I phoned Free Skool](http://controlroom.blogspot.com/2009/07/passing-torch.html) this morning on the Martian Math front, having done [four new sketches](http://groups.google.com/group/mathfuture/browse_thread/thread/94a8482cef9b72ed) for the Scenarios Training (a kind of Esozone workshop).  The content is actually quite easy, a distillation, so it's more about andragogy (where adults are concerned), new pedagogy.  People who think we don't still invent new teaching techniques this late in the game are wrong.  The technology keeps changing.\n\nTara phoned me from Indiana, having a good time.  She relays light switch commands regarding Barry-the-snake.\n\nMelody is feeding Sarah-the-dog.  Someone found it funny recently that we gave our animals people names.  But then we think of people as animals, some of us do, not really a separate category when it comes to their physicality.  When I do object oriented programming, I'll subclass a Human off a Mammal as readily as a Monkey or Pig.  Or Dolphin (thinking of Sean's spanking new Wittgenstein class at the moment).\n\nHow does [Free Skool](http://worldgame.blogspot.com/2010/03/radical-math.html) relate to [OPDX](http://controlroom.blogspot.com/2011/10/domes-future.html) if at all.  Did I mention the call failed to go through?  It's unusual, these days, for a number to just ring and ring.  Before voicemail, which was often a table top box, new life for cassettes, we had more of those \"endless ring\" scenarios.  People harassed each other with those, clever mammals that they be.  A lot of high tech is about restoring privacy, backing off, mainly through the technique of asynchronous routing.  Reflection required.  Text me.\n\nUsing the $ symbol in tandem with kwh is not new -- that's how an electric bill reads.  It's the \"energy has shape\" dictum which takes use to space-filling phenomena, such as photons and protons.  These can be metered and a charge attached to each one.  The idea of a dollar as an energy amount is no stranger to the [General Systems Theory](http://www.grunch.net/synergetics/gst3.html) crowd (smart mob).  The sun floods us with energy, most of which is reflected back into space, luckily for us.\n\n[](http://www.flickr.com/photos/17157315@N00/7028377663/)\n\nI'm with Dr. Nick at the moment, Bagdad Office, pizza on order.  He's showing me A Fuller View, among other things, new book by Lloyd Sieden. Predictably, Frank Z. jumped back in my inbox when I turned another corner on Synergeo.  I can't count how many times I've lapped that guy.\n\nHow to connect Dan Suttin more with Andrius Kulikauskas -- one of the day's conundrums.  I submitted a followup to Pycon for the work blog.  Presumably Ms. Beck is giving it a once over (which I'm glad of, skillful editor).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}