{
  "id": "8972985804455789243",
  "title": "Ergonomics",
  "published": "2016-06-02T07:36:00.002-07:00",
  "updated": "2016-06-03T13:03:56.415-07:00",
  "content": "As Trevor pointed out to me one evening at Greater Trumps, the flood of $15 Androids shows the One Laptop per Child goal has by now been far exceeded, in terms of computing power per price point.  These are Wifi devices sold to boot one onto a cell phone company data plan, but because they have Wifi, talking to a local \"village pillar\" (not a Verizon tower necessarily) is a feasibility.\n\nThese tiny screen devices, however power-saving, do not replace the church organist experience of having lots of manual control over devices that support bright visual displays.  Not everyone has either the manual dexterity or the eyesight for such peripherals.\n\nAccessibility for all remains a primary engineering challenge, but access to what content exactly?  As far as the user experience (Ux) goes, there's no \"making it exactly the same for everyone\", a logical contradiction where accessibility is involved.  This is not about finding a \"lowest common denominator\".  It's about \"switching modes\".\n\nWe're poised to offer more of a hard shell personal workspace where the device / peripheral doubles as one's tent.  The ability to move, pitch a tent, and safely operate devices within that tent, provides at least enough room for a smartphone.  However the nomadic lifestyle is one of encounter.  One arrives at an oasis.  The big screen monitors are already there, as well as projectors and audio equipment.\n\nHowever, big screen monitors out in a common area or pool does not replace the tent when it comes to privacy.  Having a private shelter for workspace equipment, such as monitors and keyboards, is what today we call an \"office\", which may have floor to ceiling walls, or may be a \"cubicle\" as in \"cube farm\".  Many, like me, have \"home offices\" meaning offices literally situated within one's place of residence.\n\nYes, a \"cube farm\" sounds very \"matrix-like\" as in The Matrix.  Every poor slob in some aliens' pod, dreaming of being alive in a cyber-reality, is somewhat a metaphor for Neo's originally drab existence, before it all becomes more horrifying (when he escapes the Matrix and fights the alien intelligence behind it).\n\nThat being said, if you're crowded in with others in bunkers and have no space of your own, a mere cubicle will seem a big step up.  Even one's own standing desk, anything dedicated, is more than a tent.\n\nI think of Blue House as a tent.  A big wooden one, built around 1905 but then modified over the years.\n\nVery typically, a homeowner like me, living in North America, would commute by fossil-fuel-burning vehicle by freeway or other public road, to a secondary living quarters called one's \"office\" (which might be a \"cube\").  In my case, I've done a lot of private consulting which meant driving to the workplace and maybe having a temporary cube or office.\n\nWhat I've been expecting is more of an integrated solution.  The Institute for Integral Design that Glenn talks about could be a source of blueprints, at least in science fiction (consultants assist with prototyping, know some snags to avoid in some cases).  CAD drawings and like that.\n\nYes, we're [talking about \"pods\"](http://coffeeshopsnet.blogspot.com/2011/10/cubbies.html) (very Matrix) that combine both tent and cubicle functions into one domicile that's easily deployable and then movable.   I know what you're all thinking:  trailer, mobile home, RV.  Yes, something like that.  Others are [thinking SurvivaBall](https://youtu.be/H6wWOvU-Mf0), the spoof [PWS suit](http://worldgame.blogspot.com/2015/07/pws-personal-workspace.html) (I've been more into the BizMo nomenclature myself).\n\nI'm thinking Project Earthala again, that \"local village\" (redundant?) wherein people have their dignified dwellings (yes a Dignity Village allusion), which double as work / study spaces.  The come already wired as Wifi clients, ready to talk to towers.\n\nWhether those towers work with this or that Internet service, or are isolated to the local area, perhaps with a link to an Earth station elsewhere, by relay, is configurable.  They come to market as general purpose \"live in\" devices, not any one make or model.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}