{
  "id": "439238095939679826",
  "title": "Erudite Oregonians",
  "published": "2011-12-04T23:25:00.000-08:00",
  "updated": "2024-06-10T11:47:01.748-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157628269796749)\n\n:: Go Cleveland Cannibals, and all you Oregonians ::\n\nIt was [again my distinct privilege](http://worldgame.blogspot.com/2010/12/judging-day.html) to chauffeur and judge at Clackamas High School not far off I-205, Sunnyside exit.  Did I hear 46 schools were represented?  That's mind-boggling if so.  And that's what the event was, for its fearsome complexity and choreography.\n\nGonzo showed me right where he and Tara first met, in the hall in front of the Media Center, she the aspiring debater hoping to get a team going, and he the debate coach transferring to Cleveland High School, where she was.  She made it to nationals, which Gonzo had always been curious about.  He, she and his son Griffith went to Dallas this summer, joining other Oregonians and talent from all over the country.  Tara is 36th in something or other (not to be dismissive, I'm obviously quite proud of her), in some national ranking system of the NFL (National Forensics League).\n\nAnyway, back to yesterday:  I'd judged here a year ago.  This time I got to see lots of LD debates (Lincoln Douglas), the kind Tara specialized in during her high school years.  I also judged poetry, impromptu speaking, prepared speeches.  I came away proud of these young people.  They're quite a diverse body and from all over the map (Tibet, India, Cambodia, Multnomah, Redmond... Guatemala).  Such lovely people.\n\nYes, I took a lot of pictures in that one math classroom, B10, where we did some poetry.  These were intense readings, lots of passion and thought.  They needed a theme, readings from at least three sources to connect the dots, some remarks in between.  \n\nWhat also impressed me as we were gathering were the professional posters the sports teams were getting.  Pretty impressive, to have posters like that.  I snarfed up the girl teams especially, not knowing when my battery might die.  I consider them more exotic, because it's not all that long ago that women didn't get the same privileges as men in sports.  I was feeling proud their posters were so humbling, if that makes any sense.\n\nBack to the events:  Tara was quite appreciative and sportsmanlike (heh) regarding her various opponents.  Those winning this time she may have won against before and vice versa.  The best of the pack are like a club.  This is definitely a variety of para- or pre-legal training, I'd say effective.  Tara is not currently planning to make [a study of law](http://worldgame.blogspot.com/2011/12/protecting-lawyers.html) her focus (thinking more STEM), but that doesn't preclude her from getting a feel for the dynamics of Matt's world, for example (collegial, yet competitive, a willingness to fight hard for your client against people you know you'll likely have lunch with).\n\nThese meetups are excellent demonstrations of inter-generational collaboration.  The adults really want to do their jobs well.  They're all paying it forward, serving their world, putting their shoulder to the cause of civil process, working things out by the athletics of speech and expression, theater, not massacre and mayhem.  Civilization was served, that seemed clear to everyone I thought.\n\nThe resolution for LDers this time:  individuals are morally obligated to assist people in need.  I could write a few reams on how that went down.  Maybe I will.  More of this on TV, with these same youth performing, oldsters too, would make sense to me.  Too geeky?  Hey, give us some channels to be as geeky as we wanna be.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}