{
  "id": "963913410248351775",
  "title": "Ethereum Tutorial",
  "published": "2019-07-15T15:10:00.003-07:00",
  "updated": "2019-07-15T16:28:27.147-07:00",
  "content": "We're deep in the thick of things.  The tutorial leader gave us really quick instructions for grabbing some fake Ethereum after setting up a MetaMask wallet.\n\nI got lost right away.  I was supposed to tweet a request to [Rinkeby](https://faucet.rinkeby.io/).  I used a hex number MetaMask gave me (I thought), but that doesn't appear to be my account.  It's fake money anyway, not real Ethereum.\n\nThe geeks are asking questions about crypto-currency in general.  Bitcoin swings thirteen standard deviations, says the professor, meaning it's considered high risk.  Is it really a store of value?  Ethereum swings by twelve standard deviations.\n\nLibra, Gemini and some others try to limit volatility by pegging their value to something supposedly less volatile, such as a fiat currency.\n\nWe're doing more meta discussion of crypto stuff than coding.  Geth is the golang implementation of the full Ethereum node.  That's not something most people should run.\n\nWe get a lot of science fiction about crypto-currencies these days.  People have a lot of hope in their future.\n\nSmart contracts in Ethereum are written in Solidity.\n\n0xB4824D11AddB0c0a6f63ddb30ff601Fb9AB912b3 appears to be my account.  I sent a tweet with it, requesting fake Ether, but I sent another request earlier.  What was that?  I deleted both tweets.\n\nWant to send me some Ethereum, a few wei?  I named it OSCON 2019.  Then email me maybe?  We're experimenting.\n\nMy ears are perking up as we're doing a marriage contract in Solidity, for a \"decentralized city\".  Asylum City?  That's science fiction I've invested in.  Science fiction is an umbrella term for me, that covers any kind of actual planning for the future.  Investment banking would be a subcategory.\n\nI'm thinking of a currency that is meaningful within a city.  Lots of things won't work unless fueled by city crypto.  Dollar bills don't go in the slots; wallet cards do.\n\nIs this a case of what happens in Vegas stays in Vegas.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgJBQsQrJJPlheXUfw8c0s8QFBqnpydvkj0k0pvLhyphenhyphen2SoF9EW_-sy6k3ePtrrQWHF25gf488l8BPa-KWg62V9HHteDYtpXk67BTAOsRk5ED77LR__VDrwNS-4XfWIhrMOW4O-9N/s1600/marriage.PNG)\n\nTokens cost nothing to create in Ethereum, and mean nothing in particular by default.   Don't confuse them with crypto-currencies.  Tokens are basically keys to a hashmap.\n\nTokens are fungible or non-fungible.  The fungible tokens have \"face value\" we might say.  NFTs include CryptoKitties.  They might represent credentials or merit badges.\n\nCompanies that recorded a lot of video about blockchain might be in trouble right now, because everything is changing so fast.  This ecosystem is very fragile.  I think I'll call it a day.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}