{
  "id": "3709825308973135747",
  "title": "Ethnicity Theory",
  "published": "2022-06-26T15:01:00.004-07:00",
  "updated": "2022-06-26T15:05:49.670-07:00",
  "content": "Since no one is using this (\"Ethnicity Theory\"), I'll just grab it for my necklace next to GST.  Maybe I boarded GST too much in pirate fashion and the others scattered?  General Systems Theory had had a following.\n\nAn Axiom of ET is: we're each, in theory, an Ethnicity of One.  There never was nor will ever again be, the unique ethnicity you embody. But like Wittgenstein's \"private language\" or Bucky Fuller's \"one frequency\", it makes no sense to have but one of something you need at least two of just to have a case for whatever label (\"ethnicity\", \"language\").  One record for training, a next for testing.  I'd be more comfortable with at least four.  Dot dot dot dot.\n\nFor example consider my ethnicity: born in Chicago to university types, transplanted to Portland, then Rome. Bradenton, Florida for a first half of 9th grade (i.e. the start of high school in K-12), then Manila for the balance.  \"But that's just biography not ethnicity\".  Precisely, as \"ethnicity of one\" is too full of contradiction and paradox.  Yet we posit it.\n\nThe child in a nuclear family observing the intra-adult behaviors between adults, is getting a database not of grins and grunts, but an imprint regarding coping strategies.  \"Here are ways those whom you will become have managed to navigate and negotiate, pay attention\"... and the infant does.\n\nThe main thing I want to emphasize about ethnicity is that an individual has a hand in making and defining it over the course of a lifetime.  It's not assigned by the state or even tracked by the state in the sense that ethnographers mean it.  Your psychology, in the sense of personality, has not been nor presently can be, saved, given the state of technology. But isn't that the whole point? To save it?  We have a jumping off point into Christianity at this juncture.\n\nThe anthropologists will not allow an individualized ethnicity (the private language one) to be the sole invention of a single human neurosystem or avatar.  Individuals in that sense do not reinvent entire cultures from scratch in the course of a lifetime. They need to be born into a culture, a going concern, at least a family or a parent, to have a chance.  That's reasonable to claim.  To say one is possessed by one's ethnicity, as if by ghosts, sounds too much like fiction, but by programs (televised, broadcast, retrieved) sure. We're each products of programming, what could be more true?  Sources too.\n\nIn contrast, the old dogma of \"race\" involved assigning some low bit number, like a brand, like a QR code. Admin needed these.  They were not allowed to change.  Immutable tokens.  Based in the Bible. \"Ethnicity\" was a nicer more polite way of talking about it.  There was no way to rescue this system intact.  We wake up in a museum of mementos yet are expected to operate it as a viable business.  The job at hand may seem uncanny.  \"How are we expected to make this work?\" is the complainants cry.  Like Prohibition.  What occurs under those conditions is of course \"corruption\" which tends to be a stop gap word.  \"We won't get into details as then we'd start accusing people, giving examples, and that's not wise in a glass houses village, if you want to have a village\".\n\nClearly I'm exploring the border between within and outside the law, the \"what is legal\" question.  That's a great entry point into the ruled by rules games, and ways of governing.  But then they show you the rule books and they be mountains high.  Abiding by rules is apparently a full time occupation.  Why didn't they say so in the first place?  We're talking about grammar, in the way Wittgenstein meant it, i.e. forms of life.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}