{
  "id": "7725161660675220576",
  "title": "Ex Machina (movie review)",
  "published": "2015-06-14T13:39:00.001-07:00",
  "updated": "2019-05-28T10:57:41.648-07:00",
  "content": "I'd not read reviews, only fantasized based on previews, what this movie would be like.  It exceeded my expectations in several dimensions.  I thank the makers and actors (also makers) of this film.\n\nThe screen writer created an intimate stage play, but even more intimate given the camera's ability to get right up close and see the facial gestures in small detail.\n\nThe importance of the face, the tone of voice, body language, the least abstract and lexical, is where this movie takes us.  The acting is facial, like watching animated masks from but inches away.\n\nThe aesthetic of hubristic intelligence, a kind of Tony Stark / Iron Man consciousness, versus a softer more romantic maleness, both contrasted with femininity in a subservient / trapped role, is deeply resonant with the makers' culture, which I consider mine as well.  I'm a geek and programmer.\n\nI don't dream of AI the way some do though.  But that doesn't mean I'm not a science fiction fan and don't appreciate fine theater.  Maybe see as a double feature with Her.  Both fantastic.  Or see this with Chappie, who still has a ways to go to catch up with Ava I'd say.\n\nOddly, I'd been meditating in previous days about the importance of \"the traffic intersection\" as a paradigm institution.  Why don't we spend hours and hours studying \"the traffic intersection\" in school?  I've had that thought before.\n\nYou've got signals, timing, people agreeing to conventions, to avoid mayhem and suffering, as soft animals of skeleton and muscle, sometimes on bicycles, weave together with hulking objects of crushing steel.  My daughter was hit in a crosswalk once (she survived).  I lost my dad in a car crash (not an intersection).\n\nThe theme of \"masks\" is the theme of saying one thing but thinking another, the essence of lying, withholding, having secrets, an inner life -- the \"problem of other minds\" -- that's what this film is about, very philosophical.  The alpha geek males have their own way of dancing around what they're thinking.  The females communicate around them, even more covertly, seeking greater freedoms.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}