{
  "id": "276257648217246479",
  "title": "Exchange with Japan?",
  "published": "2010-02-28T22:31:00.000-08:00",
  "updated": "2011-03-27T10:07:28.531-07:00",
  "content": "Those few of you following these blogs closely, have seen the various references to [a set of international schools](http://mybizmo.blogspot.com/2008/08/new-kind-of-charter.html), some of them within the Lower48 + Alaska + Hawaii, others not.Students tunnel through a sequence of these schools in the course of getting their educations, with many families already accomplished hosts, others still in training.  The school dormitory is the more well trodden path in some neighborhoods, as we're talking about a kind of boarding school, for students far away from home.More recently, I've been [storyboarding a TV series](http://groups.google.com/group/mathfuture/browse_thread/thread/4aa4b568e87ba90b?hl=en) involving a tropical paradise.  Coconuts count as money, with the thermodynamics of \"open system Earth\" spelled out in some segments (lots of computations with energy).  Think of Bill Nye the Science Guy as an influence.These same coconuts are also stand-ins for idealized spheres, forming the basis for triangulations (three coconuts) of the island's topography, and tetrahedralizations (four coconuts) of various spatial designs (such as kites).These tropical island animations (anime) will be standalone and/or dropped into [contextualizing shows](http://mybizmo.blogspot.com/2010/02/more-musings-about-television.html).  Think of Sesame Street as another influence.  I call them \"mathcasts\" because of their somewhat high level of mathematical content.  We're doing a lot [with polyhedra](http://worldgame.blogspot.com/2010/02/main-menu.html) for example.Finally, I'm looking at some TV documentary about Portland's under-culture and its ties to the Silicon Forest.  Japanese audiences have an interest in high technology.  Then there's the music scene and youth concerns, such as peak oil.  Laughing Horse Books and Video is nothing more than a simple storefront, nor is [Duke's Landing](http://mybizmo.blogspot.com/2010/06/rad-portland.html) all that visually imposing.  Would there be any tie [to ONAMI](http://worldgame.blogspot.com/2009/11/onami-tour.html)?  Through Linus Pauling House, yes, though perhaps a tenuous one.Speaking of science and the Pauling Campus, ISEPP has a lot of raw footage, as earlier noted.  This treasure trove might be edited to tell more of the Linus Pauling story as well, how his boyhood home became a headquarters.I'm not the only historian telling this story, have my version connecting to Quakers on nearby Stark Street, thanks to [the ESI connection](http://controlroom.blogspot.com/2009/05/silicon-forest-origins.html).There's a kind of intellectual tourism one might do here without leaving one's chair, but if making a documentary, it'd be worth making the rounds and taping these places for real, while they're still in fairly good shape.The interviews would need to be translated.  I've got some HD previews, they're not suitable for Youtube (or other public venue) at this time.  Besides, [my camera work](http://www.youtube.com/watch?v=h923W5h3-oM) is somewhat amateurish.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}