{
  "id": "2623477319639564177",
  "title": "Exchange Student",
  "published": "2008-07-31T21:44:00.000-07:00",
  "updated": "2008-08-01T09:25:47.379-07:00",
  "content": "Our household just got assessed for an exchange student, and although I displayed some jerkiness, I think we're still on the books as potentials.  She'd be going to Cleveland, like Tara, but a senior, from China.  We shall see.Anna Roys has been showing a lot of determination in the face of adversity, in trying to perform her duties within the TECC service area, [TECC](http://www.tecc-alaska.org/) being her proposed school, mentioned in [my Chicago talk](http://worldgame.blogspot.com/2008/03/my-talk-in-chicago.html) briefly.As a homeschooling mom, she has the right stuff to make it happen, but it takes more than one principal to make a play.  Gotta have [thespians](http://mybizmo.blogspot.com/2008/05/congratulations.html), co-stars, including in those [nebulous realms](http://grants.gov/).I've been sniping amidst Quakers regarding this \"overpopulation\" meme some still bandy about somewhat unthinkingly, betraying their schooling in [Neo-Malthusianism](http://controlroom.blogspot.com/2008/05/wmbs-satire.html), popular in 1960s text books, in parallel with Marxism in Eastern Bloc countries.Given our reputation for scholarship, these reflexes are subject to extinction over time, per Darwinian [genetic algorithms](http://en.wikipedia.org/wiki/Genetic_algorithm), i.e. we're not built to stay stupid, have practices against that. It's not that overpopulation can't be a problem, with any species, it's the level of malign neglect people use it to justify, as if wasting lives were a solution to anything.As a Wanderer, I'm into protecting the good name of both of these gents (Darwin's too) which means not letting their necessarily time-bound snapshot views get blamed for the cruft of the ages, much as [Nietzsche gets blamed](http://mybizmo.blogspot.com/2008/02/philosophy-101.html) for Nazi propaganda (he had nothing to do with that).That pleasant naturalist and journal keeper who visited [the Galapagos](http://www.darwinsgalapagos.com/Darwin_voyage_beagle/darwin_beagle_title.html) had nothing to do with any [War Against the Weak](http://www.waragainsttheweak.com/) either.But I digress.This isn't a plan to implement immediately, as Tara's room is undergoing remodeling and Carol's office is in business 24/7, like mine down the hall.  No spare digs at the moment, plus we might need to travel more before school starts again.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}