{
  "id": "8428361256406412892",
  "title": "Experience the Music",
  "published": "2010-01-08T02:39:00.001-08:00",
  "updated": "2021-08-14T22:39:06.314-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157619496938336)\n\n:: venues ::\n\nI got caught up in the spirit of Adrenaline Week at Muddy's, which sent out an SOS (again). This was well timed, as Flipside, their new venue, is finally ready for business. Will they succeed in raising the money or get thrown out on the street? I have no idea, too early to say -- count me a skeptic.\n\nIn hopes of going more grunge-punk with some of this Fuller stuff, I even thought we could unveil Tetrascroll there for a few hours, take advantage of foot traffic, sent some encouraging words to the sponsor. But since when does Silicon Forest do SE Portland?\n\nThat's a joke question: [SE Hawthorne](http://controlroom.blogspot.com/2009/05/silicon-forest-origins.html) was where ESI and Tek were born. ESI moved to SE Stark Street, then SW Macadam, then back to SE Stark after the fire. I know less about the history of Tektronix, am not the resident historian. [Doug Strain](http://worldgame.blogspot.com/2005/09/wanderers-200597.html) got his first break from Hewlett-Packard. They liked his super-sensitive ohm-meter, were ready to take orders by the time he got back to his hotel room.\n[Re Muddy's](http://controlroom.blogspot.com/2009/07/experience-music.html), Lindsey did her best to line up some bands on short notice and some radio show is going to help out. I copied [her blurb](http://coffeeshopsnet.blogspot.com/2010/01/adrenaline-week.html) off of Myspace.\n\nMy focus is finding suitable venues, wouldn't have considered Muddy's pre Flipside. Urban Grind? Pauling House? Have camera will travel.\n\nI was thinking a series of \"private parties\" (like art gallery soirees), everything word of mouth (including Twitter). Tetrascroll is like an underground comic book after all, an illustrated cosmic fairy tale.\n[Tetrascroll](http://shelterbookworks.blogspot.com/2008/06/tetrascroll.html) is also pretty big by the way, not just any room can handle it. It's not wall art, takes floor space. They had one in Chicago I'm pretty sure.\n\nIf I sound uncertain about Chicago, that's because we only had about 30 minutes to breeze through the exhibit back in March, trudging through snow to get there on [the subway](http://www.flickr.com/photos/17157315@N00/3398404474/in/set-72157616066135225/). I didn't want to miss my flight at O'Hare. Ian was likewise on a tight schedule, but willing to brave it, if only to get Steve on record saying he'd bring forward some proposal to the PSF board (a promise Steve made good on).\n\nWhen Portland Center Stage was doing the Bucky play, I was thinking Tetrascroll on the mezzanine. Then I was thinking LCDs showing esoteric commercials for futuristic stuff, like newfangled shelter commercials. These could be pure atmospherics, utopian science fiction in support of the Doug Tompos character (Buckminster Fuller) in an already sophisticated multi-media production (by D.W. Jacobs).\n\nTheater goers, milling about before show time, would start getting the bigger picture.\n\nI got as far as delivering [a performance of my own](http://worldgame.blogspot.com/2008/11/ieee-presentation.html), on election night no less (doesn't mean I didn't vote). I projected some video for a backdrop (a Fine Grind Production), had some art pieces in the foreground (including Barrel Tower, a Kenneth Snelson original).\n\nThat was a gratifying experience, although again, I make the same point: I shouldn't be the only one doing this, with the whole number volumes 'n stuff. Trevor did a talk as well.\n\nIn earlier chapters in Jersey City, where I used to teach high school, the politics were all about competing with Manhattan across the way, and where the railroads decided to go. We watched Jersey City Soft Focus, a documentary, and learned about this history.\n\nI was [wearing my developer hat](http://coffeeshopsnet.blogspot.com/2009/02/in-news.html) even then, looking to get some Fuller Projection on the back of Loew's.\n\nThey weren't printing [billboards on polyethylene](http://worldgame.blogspot.com/2010/01/pacific-rim-economics.html) back then, and besides, who would sponsor such a thing? I suggested an airline, like Pan Am, with strands of neon to show routes. Too surreal? Too Lost? Plus the Fuller Projection just looks different, attracts attention.\n\nObviously you'd want to test market first, maybe in your own airline magazine in the seat pocket in front of you, before committing to some outdoor display off Journal Square. I was young and inexperienced then, what can I say?\n\nPortland has a port, certainly, and trains right through SE, coming over Steel Bridge from Union Station. Clearly some of the same dynamics apply, with Seattle in the role of Manhattan (our giant rival to the north). The analogy is quite imperfect though. The economy around here had more to do with logging (hence \"Stump Town\").\n\nThen FDR promised government stimulus money for Bonneville Dam, which had this Bridge to Nowhere flavor. Who would ever need all that power? Portland was too Podunk. The skeptics sneered and jeered. Yet today Columbia River hydro-power is a leading export, bringing revenue to our region.\n\nGoogle plugged a data center directly into the dam at The Dalles ([Celilo Falls](http://worldgame.blogspot.com/2009/01/columbia-gorge-recent-history.html)) for the same reason an aluminum plant might: to take advantage of electricity hot off the generator. No leaky long line transmissions, no outages because of high winds.\n\nThat dam started operations in 1957, a year before I was born. No one was thinking about data centers back then. These are [what Stuart Kauffman calls \"exaptations\"](http://controlroom.blogspot.com/2009/04/reinventing-sacred.html) -- unanticipated consequences, naturally occurring non-computable leaps (ala Penrose). People still miss Celilo Falls.\n\nWhen I say \"grunge punk\" I'm in part referring to specific exhibits in Paul Allen's Experience the Music Project (EMP). Probably tourists should go there, and to the [Science Fiction Museum](http://mybizmo.blogspot.com/2005/11/baroque-cycle-manuscript.html) in the [same building](http://www.greatbuildings.com/buildings/Experience_Music_Project.html) (in Seattle Center), if wanting to really appreciate youth culture in our region.\n\nSpeaking of science fiction, I've gone back to [pressing for \"dot notation\"](http://mathforum.org/kb/thread.jspa?threadID=2026679&tstart=0) in some 3rd year high school math class. No, I'm not talking AP or IB in particular (our two accelerated tracks). I'm talking about a student feeling somewhat burned out after two years, doing say algebra then geometry, the standard textbook fare.\n\nOregon requires one more year minimum for that high school diploma and here's this bright shiny new math lab down the hall, with some promise of a new approach. Vector graphics with Python? Sounds interesting maybe. Sign up this September?\n\nMy proposal is we train teachers in place, encourage a self-selected few to take these classes, even choose summer camps if feeling that motivated. You won't get a math teacher using Python ala [Mathematics for the Digital Age](http://mail.geneseo.edu/pipermail/math-thinking-l/2010-January/000000.html) (Litvins) if she doesn't ever get an opportunity to learn it herself. Does the district provide in-service training then? What's the workflow?\n\nYou'd think I'd have all the answers by now, but lets remember I'm not a PPS employee, just an invested parent and citizen struggling to make ends meet. I'd like to help grow the economy as much as the next guy. There's no point being out of the closet as a futurist if you can't think of a future worth aiming for.\n\nI popped [that resume](http://www.grunch.net/4dsolutions/kirby.html) up on Facebook, have been getting some good pointers. Clearly I have a lot of background as a trainer and workshop leader, tried to tease that out. I've done the Python with spatial geometry direct-to-students (B2C) but when do we get other teachers more involved (B2B)?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}