{
  "id": "8251762382271923862",
  "title": "Eye Care",
  "published": "2011-12-11T19:41:00.000-08:00",
  "updated": "2011-12-14T10:04:48.525-08:00",
  "content": "The \"I Care\" campaign departs from the usual attack on a disease and simply states that every human being has a right to correctional lenses if indicated, which humanity has a moral obligation to provide. Of course [the NFL](http://worldgame.blogspot.com/2011/12/foray-to-washington.html) will debate both sides of that resolution, but in the mean time, the \"[aff camp](http://mybizmo.blogspot.com/2011/11/wanderers-20111116.html)\" (contending in the affirmative), with considerable resources, needn't sit on its duff.  Lets get more of those eye exam buses fielded already, backed by ophthalmologists without borders.\n\nThis goes back to [OPDX 2012](http://controlroom.blogspot.com/2011/11/virtual-opdx.html) and the planning we were doing for our Ministry of Education.  Camping gear / [XRL](http://worldgame.blogspot.com/2010/12/more-xrl-in-bhutan.html) was expected to become yet more ephemeral (more with less).  Rather than have such a [clunky dome](http://www.flickr.com/photos/17157315@N00/6281428905/in/set-72157627710609369) in the A Camp, we might cover all of B Camp, or call it D Camp.  This didn't have to be downtown.  You may remember the [planning meetings](http://www.flickr.com/photos/17157315@N00/6300595391/).  A way to occupy the indoors.  [I went to Ikea](http://controlroom.blogspot.com/2011/10/at-ikea.html).\n\nI've been suggesting [XOM](http://mathforum.org/kb/message.jspa?messageID=7624812&tstart=0) get involved, as a part of the [new Asian focus](http://controlroom.blogspot.com/2011/02/wanderers-201121.html).  Having a Russian Peace Corps ([MirCorps](http://worldgame.blogspot.com/2011/10/meeting-with-fcnl.html)) in the wings was the planning [around Troutdale](http://worldgame.blogspot.com/2011/11/city-as-campus.html).  These jets could be in Hillsboro as well, and meant for domestic / local service.  I haven't even checked where Gulfstreams are allowed to land, if we're looking to repaint more of those.\n\nWhen you get the exam, lenses and frames, an effort will be made to connect you in to medical records, if there's no record already.  You will likely get the usual messages about how integrating your identity across systems is a job you might help with.  Do not take only a passive interest in how your records get kept.  Activists welcome.  Designers, we need your assistance.\n\nSpeaking of which, the Oregon initiatives around open source record keeping in general might be a good place for \"I Care\" to start.  As an off shore NGO, we're not worried about trying to jump through hoops to become some certified HMO / PPO covered entity.  This isn't [business as usual](http://controlroom.blogspot.com/2008/12/industrial-scale.html).\n\nHowever, with the Chinese peacekeeper concept (like peacecorps), or the Russian MirCorps (like a geek corps), we're able to advertise some alternatives to high cost \"all American\" health care (the kind that leaves people out in the cold to die). [[1](http://tech.groups.yahoo.com/group/synergeo/message/66624)]\nLike the cruise ships (some of them), the criterion for service is not \"ability to pay\".  We expect that access to money accounts is negligible in these monopoly games, with way more losers than winners.  Doesn't mean they shouldn't have eye glasses though.  We're just not that selfish, even if that's not true about you.\n\nOf course realistically we might need more self serve, ways to administer one's own eye test.  Our delegation to Managua found people scrounging through boxes, trying pairs on, using trial and error against an inventory of hand-me-downs.\n\nI'm thinking /dreaming of a better service on average, such that we might have more pride our our species of hominid (however bloodthirsty).  Why deny a person prescription lenses in a frame (a pair of spectacles)?  Other healthcare may be more difficult to provide on such an industrial scale.  Lets make a difference where we can, when we can, while we can.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiytvaby5t8ksq91In_69YRiA70t3ZzSsUTMzlP9q0X5XMFqAa_IzNWCLQQTFcPalU6huIN2ck5bknHrMmzEsexQdMlHAfXwGPLz2mZ4UmnjcIL56XxSFE5UoRN9f3n5MqH4nL2/s1600/hippiexmas.png)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}