{
  "id": "7088284149940981436",
  "title": "Facebook Rant",
  "published": "2019-04-24T10:15:00.000-07:00",
  "updated": "2019-04-27T10:59:00.025-07:00",
  "content": "When a Medal of Freedom winner\n publishes a book saying \"the USA we have known is now bankrupt and \nextinct\" and that doesn't make headlines, we know right away that \njournalism lacks integrity. Walter Kaufmann (Princeton University)\n warned us about journalism. I sent \"headlines we'd like to see\" to WaPo\n at the time. \"Medal of Freedom Winner Declares USA Bankrupt!\"  I was \nliving in DC back then, [making trouble with my typewriter](https://mybizmo.blogspot.com/2006/07/making-waves-in-dc.html).WIRED\n and such have little choice but to fall into the trap of [calling him a crackpot](https://www.wired.com/2016/03/buckminster-fuller-brilliant-crank-lot-teach-silicon-valley/) (as he hoped they would, Brer Rabbit style (\"please don't throw\n me into the briar patch\")).  When you call someone with that many \npatents, awards, degrees, published works a \"crackpot\" you pay a price, \nas what does that make the rest of us by comparison?  Setting the bar a \nlittle high are we?  Idiocracy ensues, with WIRED paving the way.So\n now we're in the situation where a thinker advertised to the world for \nhis positive futurism (officially) is not read in schools because too \nmuch of a threat for speaking truth to power. Like \nhow could one possibly claim to know or teach American History and/or \nLiterature and not include that bit about a top celebrity turning a top \nsubversive?  How can we claim to have any \"public schools\" whatsoever \nwhen the geometry for which Bucky was explicitly given an award is not \nshared?  If you don't read Grunch of Giants in high school, let alone \ncollege, you must not have had real teachers.  Phony baloney is what you\n got.  Oh, and now they want you to pay back those loans?  For what \nagain?  For the heritage you never got?Instead of \nindulging in outrage, I can just sit back and laugh, knowing \nprivatization is complete, the public schools are all dead, and Bucky \nwas entirely correct in his prophesy and proclamation (as close to a \ndeclaration as we'll ever need).  The corporate \nmedia need very much to prop up their tawdry version of Uncle Sam (an \nimperialist psychopath), lest we see through it all and make Exxon pay \nfor its own team of goons, rather than tapping into a privatized \nmercenary force funded by unrepresented Americans who's heritage was \ndenied them in their schooling. \n\nThey don't even share Bucky with the \nmilitary do they?  Grunch of Giants at West Point?  Probably only the \nCIA reads it (required) as it's mentioned so often.After\n two generations of not teaching easy simple streamlining tetravolume \nstuff to 4th or 8th  or 12th graders (already certified useful by highest authorities), I\n think it's more than obvious we don't have a free press or a real \npublic education system.  I feel free to endlessly mock the true believers and their pathetic substitute for real learning.\n\n*  *  *\n\nIt's not like I'm saying that \njust because MF winner publishes yadda yadda, that we must all \nagree it's true, i.e. \"yes of course the US is bankrupt and extinct, the\n great Bucky hath spoken.\" \n\nNot at all.  No one has that kind of power. \n The book jacket calls it satire.It's just a once-adulated, much-awarded, icon of positive futurism, did in fact write \nthat, and gave his reasoning and context, and then was awarded the MF \n(not tossed in jail). \n\nIt's the historical facts of the matter I'm \nunderlining, not that we have to treat Fuller's writing as edicts.  These\n facts are what're so amazing and crazy-interesting, especially when you factor \nin there's a newfangled kind of geometry, and geodesic domes and... wow.  Why not\n in schools?  Are we really that afraid of our own past?Lets just share the facts.  Then be skeptical and critical, say why he's wrong and so on. But\n to just claim he's a crackpot, so we're justified in our silence, no that\n doesn't fly it all. \n\nToo double standard. \n\nIf Bucky's a crackpot, after \nso many faculty positions, awards, patents, inventions, then what are \nwe, who think that way about him?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}