{
  "id": "879762759381912683",
  "title": "Factory Girl (movie review)",
  "published": "2017-04-16T09:38:00.001-07:00",
  "updated": "2017-04-17T23:08:32.416-07:00",
  "content": "Andy Warhol fans and detractors already know this story. I was only \nglancingly familiar with most of his work until recently, when Portland \nArt Museum unveiled [a major retrospective](http://controlroom.blogspot.com/2017/01/andy-warhol-exhibit.html).  That helped me tune in more \nof his scene, though I didn't catch the name Edie Sedgwick until last \nnight, when I finally saw the dramatization.\n\nMy \nthoughts flashed to [Patty Hearst](http://controlroom.blogspot.com/2009/02/neverland-movie-review.html) a few times, and her relationship with\n her own family. I'm not a know-it-all on these families, just we have a\n lot of windows and telling remarks in the public record, which \nfacilitates discussion of celebrities.  Orson Welles comes to mind.\n\nEdie\n was an heiress from a Santa Barbara ranch family, transplants from \nBoston, East Coasters on the Pacific. Hearst Castle is on the same \ncoast.  When I think of Hearst, I often flash on [Homer Davenport](http://worldgame.blogspot.com/2016/12/toontown-revisited.html), his \nlead political cartoonist in some chapters, and native of Silverton, \nOregon.  I have quite a bit about Homer in my blogs owing to my \nfriendship [with Gus Frederick](http://mybizmo.blogspot.com/2017/04/digital-scanning.html), an expert on Homer's life and to some \nextent times.\n\nEdie's big dream was to find herself in \nNew York and to pioneer a freer way of being alive in a city big enough \nhearted to support such experiments.  She was by all accounts bold, but \nin falling victim to drug abuse, got derailed.  This was the story of a \ngeneration and has not ceased being the core plot of many scenarios.\n\nFolks\n in my cohort have their own generational window in that I was old \nenough to have Warhol on my radar, but not adult enough to track the \nsoap operas.  I uncover the history of my own time in my later years, \nhaving lived through it in my own day dreamy way, as some kid in Italy \nor whatever.\n\nA lot of work went into making this a real telling. The filmmakers undertake their task seriously. I'm [reminded of Mishima](http://controlroom.blogspot.com/2006/02/mishima-life-in-four-chapters-movie.html).  In being a dramatization, the script takes many [liberties with the facts](http://edieempire.livejournal.com/1026.html), many of which remain unknown. This movie is but one possible assembly of an intricate jigsaw puzzle.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}