{
  "id": "1180596933311213002",
  "title": "Fake News",
  "published": "2017-03-16T21:31:00.003-07:00",
  "updated": "2017-03-16T22:13:19.553-07:00",
  "content": "The money launderers were at it again today, exchanging their tainted cash for company equities, getting help from a suspect bank.  Cyprus may have carried water for a fertilizer enterprise. We're still watching those tail numbers, to see which private jets rendezvoused where.\n\nAlthough we have no firm evidence Flynn actually Skyped the Russian ambassador, leading to Microsoft's leaking the conversation directly to Warren Buffet, stranger things have happened. Click here for amazing weight loss facts. How the Vice Principal got the transcript, if he did, is the subject of ongoing baseless speculation, which the NYT will stand by, as Obama had nothing to do with it.\n\nThe intercepts, while not authorized by a sitting president, were nevertheless a legitimate probe into what might have been a nefarious business, and in the absence of proof otherwise, we're left at best with a diagnosis of [ODD](https://en.wikipedia.org/wiki/Oppositional_defiant_disorder) or \"oppositional defiance disorder\" (look it up).\n\nShould the numbers [prove disqualifying](http://worldgame.blogspot.com/2017/03/wading-around.html), an experienced Panetta has reassured us of his willingness to step in and lead us to our destiny, should things get too weird. Or would Colin Powell be our more compliant Smedley Butler and not turn on us this time? Never mind, just business plotting out loud.\n\nWhether this finding of ODD is more disqualifying for high office than ADD (or ADHD for those with trouble following) remains to be determined. The union of neuroscientists is expected to produce a report, rivaling that of NIST's on [WTC7](http://mybizmo.blogspot.com/2017/03/family-feud.html) for the completeness of its final, if surprising, conclusions. Will Puerto Rico be our 51st state by then?\n\nRumor has it that [FEMA](http://worldgame.blogspot.com/2017/03/nuts-and-bolts.html) wants you to know if you're registered to vote or not given all the rumors of a purge of double voters, a number one felony among the least-likely-to-vote. Some true blue, red blooded Americans (buy Cialis) have suggested (recently) that our Democracy of the Stars was in need of some emergency roadside assistance, AAA-style. If in doubt call 1-800-alt-real.\n\nRemember to use the promo code to collect your discount.  [Meanwhile, in Zanzibar](http://www.nytimes.com/1977/02/06/archives/meanwhile-in-zanzibar.html?_r=0)...",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}