{
  "id": "2664379446992896082",
  "title": "Family Feud",
  "published": "2017-03-05T09:30:00.000-08:00",
  "updated": "2017-03-06T12:05:17.395-08:00",
  "content": "If World Game were a game show, which game show would it be? Who remembers Family Feud? Good wholesome fun, right?\n\nAs I pondered aloud on Facebook:\n\n\"We've\n got billions, we can buy weapons, fortifications, governments... we've \nwon.\" But then there's the problem of other billionaires (multiple \ncabals) and to what extent do we need the people to tacitly go along. \nIt's starting to look like they don't miss their democracy and are \nwilling to play out their lives within a global plutocracy. Do they have\n a choice? That's a question.\n\nGiven\n how I'm such a Bucky fan, I feel as an exercise I need to investigate \nin what ways he might have been right in Grunch of Giants, about the \nfate of the United States. He saw the cash reserves of the world \nconcentrating in the hands of invisible private interests with \ngovernments left out in the cold as puppets acting out the various feuds\n among billionaires. He called this cash heist GRUNCH (\"gross universal cash heist\") and claimed it \nspelled curtains for the nation-state age, as the billionaire fortunes \nare supranational in nature. Given what I'm seeing on the news, this \n1980s \"science fiction\" is seeming plenty believable. I'm thinking Bucky\n Fuller deserves a place in the pantheon right next to George Orwell.\nThere I go again, trying to win more points for \"da man\" and besides, who wants to be the next Orwell? Doesn't that sound rather grim?\n\nWhat\n else have I posted recently that might be fun?  \n\nOh yes, my \"generation \ngap\" analysis regarding why the younger people have a vendetta against \nthe so-called MSM (mainstream media). \n\nI've sounded [these notes](http://controlroom.blogspot.com/2017/02/apollo-project.html) before. \n\nIn\n a lot of ways what I'm interested in is not \"the truth of what \nhappened\" but of generational perspectives thereof (ditto Apollo, which I\n believe happened but record numbers of Millennials have doubts and \nthat's interesting all by itself). If 0% think \nOswald acted alone, that's a fact independent of whether he did or not. \nWhat people believe is not the same thing as what's actually so, and I \nmay deliberately care more about the former than the latter. I'm\n saying there's a generation gap around the NIST report on WTC7 \nregardless of what really happened, which helps explain the positive \nreinforcement some politicians are getting for attacking the mainstream \nmedia (MSM).My personal opinion somewhat doesn't matter relative to what I care about (opinion at large).  As\n for how coordinated the conspiracy theory needed to be (the hijacker \ntheory is also a conspiracy theory, by definition), given WTC7 was \nevacuated ahead of time and its immanent destruction announced by \napparently clairvoyant operatives (NIST hypothesis), the decision-making\n network might have been entirely different than the one vested in using\n airplanes, in principle.WTC7 was clearly a white \nelephant by 5 pm (extremely damaged) and rubble cleanup would be \nhappening anyway, given the fate of the other towers, so why not pull \nthe plug on this bystander now, all people out of the area, rather than \ndemolish it later? I don't have to believe the \ndecision to bring down WTC7 was far in advance or coordinated with \nhijackers, only that it was wired to go, who knows how long ago, maybe \nyears, knowing all buildings have a life span in Vegas.  If you know the\n key codes, you can blow it. People say that's unrealistic, but then buy\n that the planet itself is wired to go, and that some president has a \nfootball to make it happen.  \n\nSpeaking of football, we've getting into the history of the soccer ball over here, thanks to HP4E. The Adidas hexapent pattern has been popular, however FIFA is standardizing on another way of dividing the sphere. We use common, but also invented, geometry objects to impart generalized principles, such as the Law of Sines and other trig.  More from Facebook, writing to David Koski:\n\nThe TetraBook is a \"job\" like in Montessori i.e. take it down from the shelf, play with it, put it back. Reshelving is important. Your physical designs for Bridges (ongoing) made sense. I'm not thinking we have to strictly nail what a TetraBook looks like physically, having done the diagrams. Leave that to the designers. Virtual TetraBooks, such as we've done already, sit on virtual shelves.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}