{
  "id": "5913789500996983945",
  "title": "Fantastic Beasts... (movie review)",
  "published": "2016-11-24T20:24:00.000-08:00",
  "updated": "2016-11-27T22:46:33.815-08:00",
  "content": "[J.K. Rowling](http://www.jkrowling.com/en_US/#/about-jk-rowling) (aka Robert Galbraith) is not that far from John le Carré (alias) in creating a [chthonic](http://www.merriam-webster.com/dictionary/chthonic) world parallel to that of the Matrix, that pale shadow of reality we take for granted as Muggles or [No-Majs](https://www.bustle.com/articles/195142-no-majs-muggles-both-may-lack-powers-but-one-harry-potter-group-fares-way-better-than) (no-madges), those without superpowers.\n\n[The Incredibles](http://mybizmo.blogspot.com/2005/02/incredibles-movie-review.html) sketches a similar backdrop:  those with magical powers have suffered persecution and need to keep themselves hidden. They have their own institutions, and wrestle with the same demons, who think \"hey, we're the supers here, lets take over the world!\" -- the standard \"bad guy\" thought process.\n\nA from above camera shot replicates all the CIA movies in having some seal or symbol on the floor, emblematic of this shadow world of Men in Black.\n\nIf you're not a spy, er wizard, and see too much, like [Jacob Kowalski](http://harrypotter.wikia.com/wiki/Jacob_Kowalski) does, they'll need to \"obliviate\" what you've seen i.e. wipe your brain clean of any classified memories.\n\nAlexia and I saw this together at The Bagdad.  I'd planned to join Friends on Stark Street for Thanksgiving afterwards, had made [the lentil dish](http://mybizmo.blogspot.com/2008/07/together-friends.html), only to discover upon checking the web that said event was at noon, not in the evening. I'd missed it.\n\nI ended up over at Patrick's, baching it with the dogs -- his family in Chicago -- fantastic beasts indeed.  We took in a couple episodes of The Blacklist on Netflix, another series I've not tracked (I've seen maybe only two Sopranos).\n\nThe Rowling universe strives for internal consistency, as the Star Wars one does.  We get partially overlapping timelines.  Dumbledore had defended Newt Scamander when the latter was expelled from Hogwarts, we're not sure exactly why yet.\n\nThe plot is still unfolding.  Expect more from this franchise.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}