{
  "id": "604092260199853012",
  "title": "Fear and Longing",
  "published": "2020-02-24T09:34:00.001-08:00",
  "updated": "2020-02-24T17:00:13.808-08:00",
  "content": "Chris pooh poohs that technology will save us, deus ex machina style. I agree technocracy sounds hollow if the only mantra is \"learn to code\" in the face of lifestyles vanishing.  A work/study lifestyle might have some coding in it, and you're not taking charity (sitting idle) by studying hard.  We need more serious students, not addicted to fantasy genres.  Like forget about coding.  Read Chris's books.\n\nA safety net that features study (and not amassing huge debts in the process) is about taking care of a population and cultivating diverse skills.  Study includes places to practice, to develop technique.  My friend Glenn has all the makings of a makerspace (a term he despises) yet real estate is so dear in this town, there's no room left for \"creatives\" (spaces in which to create).\n\nAs Bucky Fuller pointed out, if you take away the technology, you have mass starvation and uncontrolled outbreaks of disease within days.  Civilization grinds to a halt.  Technology currently sustains a population of billions.  Take away the politicians (\"send them around the moon in a spaceship\"), as during the recent government shutdown, and the crisis is relatively less dire.\n\nChris has been a war correspondent in Mesopotamia and in the Balkans. He shares a bleak view.  He's not in the habit of turning towards American Transcendentalism and seems relatively oblivious to Bucky Fuller's [teleological post-nationalism](https://controlroom.blogspot.com/2005/12/thinking-globally.html).\n\nFuller is always quoting Einstein to the effect that human psychology boils down to a fear versus longing axis.  Chris's audience is wondering about hope, longing for a brighter view of the future.  Hedges is focused on ending tyranny by inspiring fear among the would-be tyrants. He has little patience for what he considers \"hope mania\" minus concerted resistance.\n\nWhat is the [positive future vision](https://worldgame.blogspot.com/2020/02/midsummers-dream-in-portland.html) after that?  What would winning mean? Where's the science fiction?  A clear view of a more positive, yet attainable, future is ultimately subversive vis-a-vis any status quo dystopia, especially when the pathway forward is nonviolent.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}