{
  "id": "2359341326130448766",
  "title": "Finding the Grooves",
  "published": "2024-05-16T11:22:00.000-07:00",
  "updated": "2024-05-16T11:37:21.919-07:00",
  "content": "What have I contributed to the \"great AI debates\" thus far, and how to measure? \n\nIs \"AI debates\" catching on as a meme? \n\nI've stressed \"mirroring\" (as in \"chatbots mirror an educated layman's prose\"), and going forward I plan to use the word \"groove\" a lot more, a synonym for \"rut\" in a space of reduced dimensions.\n\nIn Active Inference, the quick rejoinder, that we're open to surprisingly beneficial developments in the field, is perhaps a subclass of \"mistake mystique\". \n\nWe really want the shortcomings in our models to be pointed out, and by definition we have trouble seeing those from the inside. \n\nThose who claim to self-generate all these exotic perspectives on themselves are likely in the self-fooling business. You need others to be the others.\n\nThis defensive reflex has to do with our loss function, in the sense of backpropagation (ML jargon), being about measuring \"free energy\" as what to minimize, in favor of precision, accuracy, less surprise, less entropy. \n\nTo dampen \"freedom\" and \"surprise\" as a matter of ontological bias, as what to minimize, results in predictable compensatory actions, per our dynamical equilibrium model. We mean to minimize the energy \n\nA pre-trained chatbot is looking to navigate the grooves in human discourse in a way that proves a next move is almost completely context determined. When we picture a tree of possibilities, we see how it gets out of hand unless vigilantly pruned, which means ruling out a lot more than we rule in. \n\nWe seek a \"straight and narrow\" if only because we're called upon to exercise our executive functions. Horizons broaden when the pressure to \"do something\" is relatively less.\n\nI've written before how in geekdom we relish languid relaxation mode over shouting instructions, because when everything is under control, shouted instructions are for the most part unnecessary. Players will have internalized what needs to be done and will have set about doing it, perhaps in tight collaboration, but without bottlenecking through some singularity. \n\nThere's no single pipeline or narrative through the content, and where one critical path falls behind, the algorithm will find a new one, perhaps by changing the goals (hey, goals change). \n\nNew grooves form, old ones fade. The valleys may become deeper, the ridges between them higher.\n\nI've been a Sophia-basher in some ways, not buying her (its) pretensions to AGI-hood. Her performances are scripted and her getting citizenship in a country, before Palestinians could, speaks volumes regarding how the billionaire class hoodwinks the less well-educated.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}