{
  "id": "8340748132118139596",
  "title": "Finding Dory (movie review)",
  "published": "2016-06-25T06:35:00.000-07:00",
  "updated": "2017-01-17T01:11:52.099-08:00",
  "content": "This is a film geared primarily for little kids, definitely deserving of well crafted on-ramps that bring them up to speed in an artfully thought-out manner (Disney's specialty).  Imagine this is just your third or fourth film ever.\n\nEven before we get to the story, lets remember that film is about managing our sense of time and space, giving us premonitions as well as flashbacks, memory shots, plus an omniscient camera (usually).  A kind of language, made from conventions (axioms) goes with watching and making film.  Ghostly images superimposed may represent a character's imagination.  We imagine a fish imagining other fish, and show what that looks like.\n\nDisney is great at portraying the minimum nuclear family of three or more nucleons, a single parent family more of an isotope.  Marlin & Son are single parent whereas Dory's starts out nuclear but she's at least one marble short and becomes separated from the family nest at a young age.  Flash forward, to where she's dorking around clueless, and starts to come in to her next phase.\n\nI thought of Glenn's story, heard a couple of times, when it came to the octopus, or septapus, another main character.  Glenn knows this species has [a well earned reputation](http://www.scientificamerican.com/article/are-octopuses-smart/) for being wily and sneaking around between tanks.  He knows of a real aquarium where a real octopus expressed such behaviors. I bet other marine biologists will attest to their wiliness.\n\nOn the subject [of memory](https://goo.gl/PivX8d) again, movie-makers of any caliber understand they are implanting what will likely be [long term memories](https://youtu.be/4OFUiYMU9DM) in the collective memory field.  Young children just starting on Global U work / study careers learn of a Maritime Institute (a kind of Monster U), including what it's like behind the scenes (back stage as it were), and of someone named Sigourney Weaver, a repeating loudspeaker voice (like [in North Korea](http://controlroom.blogspot.com/2016/06/songs-from-north-movie-review.html)).\n\nThose who know their film history know this is a seed for later.  Someday little Dory here, watching the film, will have a thought balloon pop up reminding her to \"find her family\" meaning her cinematic roots, first planted in the womb of a dark theater.  She'll get to see Aliens and [Wall-e](http://worldgame.blogspot.com/2008/06/wall-e-movie-review.html).\n\nDory goes through experiences children want and need to relate to, understanding that others get it, like about what it's like to be lost, to feel it's hopeless, to have access to intuition (which Dory has, despite her missing marbles).  Dory experiences both the love and concern of her guardians and strives to work with them in overcoming what they perceive might be weak spots.  She's attentive, just her attention wanders.\n\nI suppose my followup reading such as I'm led further, will be to read more clinical discussion of childhood conditions and their symptoms, as if I were training to become a pediatrician.  For every adult I encounter, my meditation will be along the lines of \"so what must this gal or guy have been like as a five year old?\"  Maybe I'll put out my hand [with a smile](http://mybizmo.blogspot.com/2008/11/smiley-guy.html) and ask:  \"so [what Room](http://mybizmo.blogspot.com/2016/04/the-room-movie-review.html) are you from?\"\n\nContrary to recent practice, sitting in the balcony with pizza and a pint, I sat rather close to the screen in the orchestra with neither food nor drink.  Many of my fellow audience members were indeed very young.\n\nOne girl a couple rows behind me loudly whispered questions to her dad at a critical juncture, when Dory was crossing another karmic threshold.  I was grateful for that as I go to theater to hear the feedback sometimes (although the etiquette in Portland is to silence both your cellphone and your mouth -- OK to rustle popcorn bags -- in the more adult-oriented movies; the trained guardian did not whisper back in an equally loud voice). \n\nDory has an amazing ability to enroll others in the possibility of her finding her family.  Not all others, just a few critical ones, forming a team.  She has her adopted family (Nemo with single parent), and she recruits the septapus, who sees ways to mutually benefit.\n\nOnce a critical mass of team players is reached, and a level of commitment established, the team members willingly compensate for one another's weaknesses, while leveraging one another's strengths.  Synergy occurs and before ya know it, big things start happening.\n\nRest assured, your kid doesn't need to be a five year old to appreciate this film.  The teenagers will not be pulled in by sex and violence so much as by the mouthwatering detail squandered on every scene, down to partially erased whiteboards in the basement, where they load the Cleveland-bound rig.\n\nGamers don't see that level of detail in real time gaming even with GPUs.  You still need a render farm to get Shrek-levels of resolution (right, not only Disney / Pixar is doing it, and diversity is what we want -- more innovation and experimentation in a competitive environment).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}