{
  "id": "4180951072938995773",
  "title": "First Stop on the Tour",
  "published": "2018-10-14T15:22:00.001-07:00",
  "updated": "2018-10-20T12:55:35.839-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/31449869888/in/dateposted-public/)\n\nI was just posting to Facebook that \"[bridging the gap](https://mybizmo.blogspot.com/2018/10/bridging-gap.html)\" would be a great first tourist stop in the mathemagical theme park (we use Python __magic__ sometimes).\n\nHere is where we familiarize ourselves with the concept of Zonohedra.\n\nA zonohedron has faces with opposite-edges-parallel (picture a stop sign), minimally rhombi, as well as opposite parallel faces, like a cube has, or a rhombic dodecahedron.\n\nThe rhombic triacontahedron is likewise a zonohedron and our \"gap\" inheres here, between two of them.\n\nConsider two RTs (thirty diamond faces each) of almost exactly the same volume, but the one is a little smaller, making for two sets of faces, one set slightly within the other.\n\nAlong each radial, from the body center, two diamond faced centers occur, towards the tip.  There's a tiny gap between the two.\n\nHere's the ratio we go by:  the RT inside, the slightly smaller one, has a volume of exactly 5, relative to the reference tetrahedron of edges 2R.\n\nThe ball of radius R very slightly protrudes, at each face center, a small hump, a pitcher's mound.  The apex of each hump marks the center of a 5+ volumed RT's face.\n\nEach RT has a \"nice\" property:  a volume of precisely 5, a radius of precisely R.  The latter, scaled up by Φ, becomes yet another RT of volume 20 * √(9/8).\n\nWhen we scale the smaller volume five RT up by 1.5 or 3/2 as a scale factor, its volume turns into 7.5 (red), and its radius into Φ/√2.  It now shares a set of vertexes with the volume 6 RD (yellow).\n\n[](https://www.flickr.com/photos/kirbyurner/4178618830/in/photolist-27mJSE2-9AU59Y-97TTvV-8dyvmP-8batBx-8awATh-7YZyV3-7nfvNf-7jzVRo-7jzVSm-5STUzp-5DsYfo-5zTRpB-Joybi-JoybP-6BkWWK)\n\nThe new face radius, of the 7.5 volumed RT, will be the 3rd root of 3/2 times whatever it was before (call it h), since to boost a volume by 3/2, the edges need to expand by the 3rd root of that number, or about 1.14471424255333.\n\nThe resulting face center to body center radius (believe it or not):  Φ/√2 where √ and sqrt mean the same thing, arithmetically.\n\nIn other words, the original h, for which the RT has a volume of exactly 5, is Φ/√2 multiplied by the reciprocal of the 3rd root of 3/2, or about 0.99948333226234344.\n\nAnother tad-bigger RT, has a radius of R precisely, just a tad larger than the volume 5 RT's of radius 0.9995, weighing in at about 5.00775803133283.\n\nThe tag-bigger RT's volume is granule greater than 5, of necessity, but look at how tiny the gap in radius:  0.000516667737 is pretty small, compared to 1 R, the reference length.\n\nThat's why we might pay you to pay some mind to this little difference.  Without concerted attention, it might be overlooked.  Attention means concentration means doing work (measured in iota perhaps).\n\nLet's take stock of what juggling balls we get in the air with this exhibit:\n\n- 2nd and 3rd roots and powers\n- the golden ratio Φ\n- the power rule (relating linear to areal to volumetric growth)\n- two spheres (and a thin wall between them)\n- a pair of RTs (tiny difference in radius, volumes 5 & 5+)\n- an RT of volume 7.5 sharing vertexes with the RD of volume 6\n- an RT of ~21.21 embedding the Jitterbug icosahedron (as long diagonals)\n- five concentric zonohedra (six counting the cube of volume 3)...\n- one of which is the the space-filling RD of volume 6\n- the concept of tetravolumes\n- T & E modules (RT)\n- A & B modules (RD)\n- alternative powering models\n- scaling by Φ\n\nFor a first stop, that's not bad.\n\nWhat schools have a mandate to teach this stuff?  Paw through Youtube?  I'm finding more researchers getting a clue.\n\nWe might call this exhibit Prying Open Synergetics as we're managing to suck some sense out of a hairline fracture that came to light only after Dr. Fuller already had put some years of concentration into his newly emerging discipline.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}