{
  "id": "6096701876173961200",
  "title": "Flipped Classroom",
  "published": "2015-09-03T08:46:00.003-07:00",
  "updated": "2015-09-03T10:23:02.486-07:00",
  "content": "The \"flipped classroom\" is not a new idea, nor need \"either / or\" be the logic, i.e. a school using flipped classrooms need not use them always, not even per a given subject.\n\nTake mathematics in the context of STEM.  Some shared equipment is spendy, such as lab equipment, and team building exercises are critical anyway.  Coding, on the other hand, may require some times alone, ideal for homework, though with on-line collaboration exercises also key (coding is a highly social activity).\n\nLearn your coding skills asynchronously through hands-on practice and give talks about your projects, recorded to the school server in some cases.  Adjourn to the lab for team work.\n\nDoes this sound like college?  The personal workspace ([PWS](http://worldgame.blogspot.com/2015/07/pws-personal-workspace.html)) is not necessarily a single location, but access to undisturbed safe study spaces, privacy, time alone, is an integral part of many learning patterns.  A typical campus takes the PWS concept very seriously, from dorm to study carrel.\n\nLower grades, twelve and below, have historically assumed the classroom as the core learning space, but this is changing.  Depending on the region and school system, learning may look more like scouting and homeschooling, and working in a TV production studio, in addition to sitting in classrooms.\n\nFood prep and cooking may be rescued from Home Economics and placed under STEM.  Both health and chemistry get the focus in serious food oriented courses.  Question dogmas.  The food and beverage industry comes with agendas, sometimes hidden.  Critical thinking means bringing these to the surface for analysis and open discussion.\n\nCritical eating (studying ingredients, nutritional value, production process, environmental costs and benefits) is as important as critical consuming of any kind, including of media.  We're fighting the \"mindless consumer\" stereotype less so \"the consumer\" as we all must consume, but lets do so mindfully.\n\nSharing kitchen equipment, like lab equipment, and learning to cook and clean up for larger numbers, is another benefit of sharing a school.  Larger scale kitchens have equipment not needed in the home.  Food Not Bombs took me into many a church kitchen (OK, a few).  The Quaker Gathering of Western Young Friends was likewise about moving into a large camp-style kitchen and making food for each other.  [2 Dickinson Street](http://worldgame.blogspot.com/2005/05/princeton-25th-reunion.html):  same deal.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}