{
  "id": "7607953688049004596",
  "title": "Food for Thought",
  "published": "2013-01-14T19:20:00.001-08:00",
  "updated": "2013-01-14T19:49:49.950-08:00",
  "content": "Books for kids that I read, by Enid Blyton for example, would glorify meal time, and give detailed descriptions of dishes, which could be enjoyed by an imaginative reader.  Not just visualizations were important.  Not being a budding gourmet, I might get impatient with some of these passages, but at least I was reading them.  Nowadays people get impatient with reading itself more quickly, and lingering over a description of a food is itself an acquired tasted.  Like Enid Blyton novels.\n\nLots of press for Alaska lately.  Allen could have shaken me by the shoulders in the movie version, where everyone's a caricature of themselves.  He's really quite low key.  We'd been thinking of doing a cruise to Alaska with dad when then 2000 accident happened.  \"Just take a bag\" he said, \"too late to book a cabin.\"  He's talking about the multi-stop inside passage ferry, where you get on and get off. Not enough bandwidth I'm thinking.  But I like the sound of seeing glaciers again.\n\nThanks to Mr. Blake for introducing my to Tumblr, through which I found [the Hexagonal Awareness Project](http://hexagonalawarenessproject.tumblr.com/).  Now that's a project after my own heart, dovetailing neatly with HP4E, Hexapents for Everyone.  The \"for everyone\" trope, with a \"4E\" is not my intention.  James Joyce had \"Here Comes Everyone\" (HCE), which I'd quote a lot, in my \"human centers environment\" writings, and then Guido came along with CP4E with DARPA funding, how cool was that.  Just for IDLE though, nothing all that sinister.  I got lots of mileage from IDLE, especially with Akbar font, as you'll find through these blogs (such as fragments exist).\n\n[The HexaPent](http://hexagonalawarenessproject.tumblr.com/post/40532961284) is well expressed as a spherical object, the soccerball most easily, which is also the pattern for C60, the \"buckminsterfullerene\" molecule (\"fullerenes\" the family).\n\nRomanticizing certain meats, as delicacies, praising their virtues.  It's as if the cow life, soft and certain until a sudden end, were so popular with spirit world that we were seduced and enticed, as predators, to crave bovines, so that more and more could be made upon this Earth, and so it was.  Bucky used to talk as if metals themselves had a voice and lobbied congress.  In language, the nonhumans criss-cross, make waves, with ergotic egoid eddies bobbing in the way.  The diets talk, share the carrots not their sticks.  \"Raw vegan magic\" sings Lindsey, a good siren for the genre, my pleasure to shipwreck so nearby, in the arms of some steak.\n\nAt the Bagdad the other night, the comedians were deep into food humor.  I honestly don't think the guy going on about bacon-wrapped chicken wings knew of our pepto-bizmol colored bacon-flavored beer, made by Rogue for a donut company named Voodoo.  Hard to top those economics.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}