{
  "id": "5728169542316044332",
  "title": "From Code:  Law",
  "published": "2019-12-15T10:45:00.001-08:00",
  "updated": "2019-12-15T10:45:32.063-08:00",
  "content": "The news story about the intel community using AWS type services for intel work is not surprising, as the \"elastic desktop\" has become the new normal.  Your front end API is to what back end?  The answer may change from hour to hour.\n\nThe \"code is law\" movement, such as it is, may have its roots in operating system design, as preventing users from sabotaging the kernel, or each other, is really the responsibility of the design itself.  The model anticipates bad actors, misbehavers.  However the operating system boots with a decisive advantage.\n\nEven with root access, your new powers may not give you an ability to damage hardware.  Once you've deleted all the files and reduced the software to unrunnable, an external procedure, involving reinstalling a fresh copy of the OS, may restore everything to normal.\n\nIn the DIY studios at the schools, take Free Geek for example (Portland campus), students are in a position to safely explore root powers and to otherwise practice in a sandbox.  The hardware has just been rescued from the dumpster in any case, and the OS, if it runs, is now running in an educational context, like in a college.  A FreekBox starts out like a corpse in a medical school, and is reanimated for students and then for the general public (if and when it passes all the tests).\n\nThe job of the OS is to protect the integrity of running processes, and the memory they expect (have reserved on their behalf).  In user space, the users expect their own files to not be world readable unless they want them to be.  One has degrees of protection.  However, if the root is compromised, what might that mean?  Risk assessment, with respect to cyber events, features in a growing set of roles.\n\nSpeaking of roles, I've seen the roleplay and cosplay communities converging in various places around Portland.  The \"silly job title\" trend is sometimes dismissed by the suits, but that's exactly the point:  we're in the process of freeing ourselves from the suits.  Owning the dress code is a first step.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}