{
  "id": "1627795149664233173",
  "title": "From Forum 206",
  "published": "2017-06-08T10:29:00.001-07:00",
  "updated": "2017-06-08T10:34:44.993-07:00",
  "content": "I haven't posted much about factoring quadratics, but would for one take a group theory approach if following the forking-off Lambda Calc track after Algebra, more vocational than Delta Calc (Calculus), in the sense of straight-to-job, minus college, for more trainees.\n\nYou've got the JS + HTML + CSS, what more could you need?  Of course plenty, and many will head back to college or code school or whatever, but the meaning of \"vocational\" still pertains.  You get some paid work as a front and back end developer, applying your high school degree, and afford college later, where you go into Physics, say.\n\nWhere I'd go with quadratics is full bore into History as I think it's a travesty how we try to tease apart maths from any cultural context.  Enough with the \"universal language\" already, if that means Greek metaphysics about infinite planes \"existing\". That's philosophy, so any PhD will be able to defend these theses of plane geometry (Euclidean), but lets not pretend that they're not cultural, and that mathematics is not as multi-cultural as Manhattan.\n\nThe fierce \"game show\" competitions on the Italian peninsula, to factor polynomials in contest, complete with pro wrestler style champions and death bed secrets (algorithms) is all too much to pass up. Then we roll forward to Galois, who scribbles some final words on Galois Theory before defending his honor in some dark ages duel to the death.  Bleep over all that?  Not unless you're into \"history avoidance\" which math geeks are often guilty of, but not in my course, no way.\n\nI like showing a Polynomial class in Python, complete with some Newton's Method type convergence algorithm for finding roots even when factoring is nigh impossible. I've got this in my archive somewhere. [0]\n\nAt least lets tell them about the limits to factoring.  And don't wait until some bitter end to share the quadratic equation, making it some punch line after slogging through months of seeking roots by other means.\n\nI'm into spending a lot more time with primes versus composites, Euclid's Method, because I'm heading to RSA (public key crypto), like they do in Mathematics for the Digital Age (Bob and I both like it, although I do class-oriented coding much earlier in the deck, see my Fraction [1]). RSA is a capstone \"thing to get\" in the aforementioned text, used at Phillips / Andover. I teach crypto too, had for years before I saw that book. [2]\n\nWhy Euclid's Method to get the GCD over factoring into primes?  Because factoring fizzles long before EM. Then there's the extended version (EEM). Check Knuth.  These are the algorithms they're gonna need.  As a mammal to other mammals:  don't let them write that off as \"just computer science\" in their snobby mathy way.\n\nKirby\n\n[0]  [http://4dsolutions.net/ocn/python/](http://4dsolutions.net/ocn/python/)\n\n[1]  [https://repl.it/H7VF/12](https://repl.it/H7VF/12)\n\n[2]  [http://4dsolutions.net/ocn/crypto0.html](http://4dsolutions.net/ocn/crypto0.html)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}