{
  "id": "7007031918261357531",
  "title": "From a Gothamite",
  "published": "2012-08-12T16:39:00.003-07:00",
  "updated": "2012-08-13T11:46:04.799-07:00",
  "content": "\"Gotham\" is supposed to be \"any city\" as you know, but there's that \"Goth\" right in the name, and the Dark Knight might be portrayed as a goth comic in some ways (yes, I'm referring to Batman, see post below).  But then \"Gotham\" fades into \"metropolis\" as in \"metropolitan\" which tends to mean any concentrated urban area, a CBD (central business district) especially.\n\nThe word \"business\" is fun as it contains \"[bus](http://worldgame.blogspot.com/2010/09/djangocon-day-two.html)\" as in Magic School Bus, or that bus on a motherboard that conveys data, perhaps in parallel.  In the urban center, things get \"bussy\" (pertaining to buses and business).\n\nI'm in such a place now, one of those open inventory caverns, air conditioned, where people flock to take goods, to each according to her charge card allowance.  I conveyed a shopper here, from the bank, not by bus but by motorcar, in the 4-wheeler sedan I've called \"maxi taxi\" or \"torture taxi\" depending on mood and lighting.  She's [an older Nissan](http://www.flickr.com/search/?w=17157315%40N00&q=taxi&m=text), the [successor to Razz](http://www.flickr.com/search/?w=17157315@N00&q=Razz), the raspberry colored Subaru.\n\nLloyd Center Mall:  I've [posted from here before](http://worldgame.blogspot.com/2006/09/across-from-blue-nile.html).  Back then, I was being cynical about the wifi and the nickle & dime me approach.  [Nixon](http://controlroom.blogspot.com/2006/02/history-is-surreal.html):  America's answer to communism.\n\nHey, I'll give [a pro-capitalism speech](http://controlroom.blogspot.com/2011/05/cowardly-capitalism.html) why not?  First, let me explain how I tend to use the word \"capitalism\", even as I struggle to bring it back to everyman's way.  I think in terms of capitals, i.e. major cities, or mover and shaker places, hubs, key players.\n\nLike when they say \"London believes\" in some propositions, as if cities could have beliefs.\n\n\"Portland agrees with Tehran\" on [some issues](http://groups.yahoo.com/group/WittrsEX/message/4863).  Phrases like that bespeak \"capitalism\".\n\nAnother meaning is \"[using one's head](http://worldgame.blogspot.com/2010/07/coffee-shop-capitalism.html)\" as in \"thinking cap\" as in \"being one's own boss in the 'what I think' department\".\n\nI'm in a vast (OK, big) mall, and people just help themselves to goodies.  Yes, they have to pay for them, sometimes (often) on credit.  But it's a layaway economy that one designs for oneself.  There's latitude for self expression.  You prefer [the Ikea look](http://controlroom.blogspot.com/2011/10/at-ikea.html)?  That's fine.\n\nThere's a sense of choosing for oneself on a level it makes sense to offer choice, rather than a sense of having a thing meted out, preferentially awarded based on impossible criteria.\n\nIn a relative distopia, you'll never get that pair of shoes, because you're not allowed to just pay for them.\n\nIn a fixed price (same price for all), catalog-based economy, you don't have to do it for favors or quid pro quo.\n\nYou do it because you put your time and energy in, in some other way, in some faraway land.\n\nYou are not beholden.\n\nYou walk away from the merchant, goods in hand, not owing that merchant.   Now it's between you and Visa, and that's how you want it to be.  There's just a lot less karma, or lets say freedom to create your own karma.  It's back to Alaska or whatever, to one's own adventure's, not some state's, though you may be a state's agent.\n\nThat being said, I came here, used the free wifi, and moved on.  My intent was consumerist though: I was thinking to upgrade the phone, from this hand me down first generation Android.  But this branch of Verizon doesn't stock HTC 1x, just Incredible and Rezound, so it's out the door and off to a blogging place.\n\nMy shopper is shopping.  She doesn't always get to be in such a large metropolis, with its many charms and wonders.  Bridge Pedal was today.  I stayed home and caught up on some studies.  I also am reconnecting with Free Geek thanks again to [Holden Web / Open Bastion](http://worldgame.blogspot.com/2011/02/open-secrets.html), a great web of connections.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}