{
  "id": "4618106422659155931",
  "title": "Futurism Again",
  "published": "2013-03-14T20:24:00.001-07:00",
  "updated": "2013-03-14T20:42:00.069-07:00",
  "content": "My dad subscribed to The Futurist and thought like one.  Fifty year plans were his bread and butter.  He helped get systems going, for the longer haul.  Naturally, some of that rubbed off, these being memes, not so much genes (or jeans).\n\nWhat I've found is I sometimes pray / predict / prophecy some future development, but then not recognize when it actually happens.  There's a lag as I adjust to the vision being just alien enough to be not seem purely a product of my own imagination (not a criticism).  Youtube, for example:  I used to write sundry strange things about [The Videogrammatron](http://www.grunch.net/synergetics/videogrammatron.html), short clips, a database, hyperlinks between them.  All that happened, not using my nomenclature and so almost escaping my notice at first, as my prayers already answered.\n\nAnother case in point:  I used to visualize that \"virtual companies\" that would conjure floorspace using the cloud.  Certain floors would be occupied, as a team suddenly appeared, conducted business, and moved on, like gypsies.  But now, sitting in this Hyatt in Santa Clara, taken over by the Python geeks of the world, as a paid, booked in advance venue, I realize that's how it already is:  floor space materializes even as people jet in. Convergence / divergence.  That's what's going on here.  And that's the conference biz, people meeting about anything and everything.\n\nTrue, I was thinking more small teams traveling in packs, but we have those too.  People come here as members of a tribe, a company, a nation, a virtual nation.  Henrique said I could quote him, about how it's \"more and more awesome\" every year, in terms of how many familiars from around the planet one gets to greet and catch up with.\n\nThe Oregonian wrote me up twice, Carlin the journalist both times maybe.  The second time I was predicting hypertext kiosks in hospitals.  This was before people knew what hypertext was.  [The first time](http://coffeeshopsnet.blogspot.com/2009/02/in-news.html) I was shown holding a postcard next to my head, of Fuller's global data projection.  That was in the Metro section only I'm pretty sure.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}