{
  "id": "6632972014792574992",
  "title": "Gadding About",
  "published": "2017-04-29T22:19:00.003-07:00",
  "updated": "2017-12-03T17:06:09.092-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/33500972794/in/dateposted-public/)\n\nPortlandia loses a great Creative with the departure of Melody.  She shot away from my place, her last base and former residence, perhaps to wind up in India we don't know yet.  She wouldn't drive all that way.\n\nMy next expected house guest texted me from seat 20-D what his alternative arrangements were, which make sense  (loose ends to attend to -- he used to live in Beaverton), just as the cabin door closed on his flight to Costa Rica was it?\n\nAnyway, Pycon-related. That's coming right up, and I'll get to most of it I expect.\n\nSpeaking of the Python.org \"nation\" (some people don't like me calling it that, something to think about before having a \"dictator\"?), edu-sig is ramping up again, in terms of activity.\n\nI'm by far the most active poster, and I'm happy to have my few haunts, my bat caves.\n\nYes, generous individuals have saved us rekeying the Periodic Table data, by saving it for us, [in JSON format](https://github.com/Bowserinator/Periodic-Table-JSON), workable license (as in free).  I've already updated periodic_table.db on my Github and [live Flask application](http://thekirbster.pythonanywhere.com/), my forty hour Python course a top concern.\n\nI also have SQLite tables named glossary.db and maybe polyhedrons.db.\n\nI'm signed up to give another lecture next week, outside my virtual classroom. I think that will help me speed think my way through some material.  I often get a boost out of such performances.\n\nNot that I think \"speed thinking\" is always the way to go.  Makes my blog posts less readable, some might insist.\n\nMelody has a plan and is self sufficient in many admirable ways.\n\nI know North Koreans are skeptical that USers are anything but brainwashed, given the craziness they buy into.\n\nMy working hypothesis is neural networks still outperform the machine learning ones in many critical-to-us dimensions.  I'm not against pushing work off onto machines though, where applicable.\n\nOn Facebook I'm looking at whether [college as an institution](http://mybizmo.blogspot.com/2017/12/work-study.html) combined with the loan industry is really viable.  We don't have enough GST going.  Still too much Econ, garden variety.\n\nThat's an analysis many don't share, but then I never claimed my blogs were anything other than esoteric.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}