{
  "id": "1174968918830066990",
  "title": "Gallery Time",
  "published": "2019-09-16T18:25:00.001-07:00",
  "updated": "2019-09-16T18:28:12.855-07:00",
  "content": "I've been spending some hours in Lattice Gallery, as an apprentice to the maestro, Sam Lanahan, who is orchestrating a whole series of happenings and events.  Flextegrity is the focus.  My curriculum content has for some years capitalized on my having access to Flextegrity, in its various iterations, as an educational supply.  You'll find lots on Flickr, as well as Youtube.\n\nGlenn has an amazing collection of books, many of them on matters mythological and archeological.  He's well versed in a lot of this material, and admires Sumeria especially.  Therefore I'm smart to consult him as I continue to explore specific stories, looking for raw material for contemporary storytelling.  These days I'm focused on the [Pythians of Pytho](https://en.wikipedia.org/wiki/Python_(mythology)) (later Delphi).\n\nNew to Glenn's collection: an amazing science museum gift shop type tome, featuring a plastic tarantula presented in layers.  As one turns the pages, the central spider is built, plastic parts fitting ingeniously into place, held to the pages by plastic.  The whole thing is somewhat delicate.  A rowdy kid, prone to throwing things or stepping on them, might soon destroy this work of art.\n\nRegarding tarantula anatomy, I don't want to call it \"simple\" exactly, but it's a fine on ramp to the human system in any case.  The heart is single chamber of that pushes blood by peristalsis (the way I think of it), whereas the lungs simply interleave hemolymph with surrounding air. The transport of oxygen is accomplished using a protein that's copper-based, instead of hemoglobin.\n\nYou may be wondering at my choice of topics here, a seeming blizzard of non-sequiturs.  But then that's what hyperlinks are all about: providing context, where it might be needed.  I've been looking at protein folding lately, rejoining the Linus Pauling generation in terms of my narrative.  J. D. Bernal was a focus across two Youtubes.  His lab was about using the techniques of crystallography to make headway on the problem of folded proteins (how does it work, what does it do?).\n\nHow I get to crystallography is through these \"lattice meditations\" (lattice in the sense of matrix and/or honeycomb) and all that somewhat Platonic geometry stuff I'm into.  My work with Flextegrity is symptomatic of these fascinations.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}