{
  "id": "4873271738898687988",
  "title": "Genius Bar",
  "published": "2023-08-20T19:22:00.008-07:00",
  "updated": "2023-08-23T09:21:10.694-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53130270512/in/dateposted/)\n\nI'm using the better of my two MacPros on battery. Upon clicking on the battery icon, upper right, I'm informed said battery has degraded capacity and I'd do well to schedule a maintenance visit. So I did. I'm into being compliant these days, almost a good doobie.\n\nHowever I'm not considering myself a genius as I tend to surround myself with sources of genius, such that I feel relatively low on the totem pole, and that's a good thing, as complacency about one's intelligence is clearly a pitfall when hoping to stay sharp.\n\nPeople have different strategies for staying sharp. I know YouTube knows my demographic info and therefore the targeted commercials tend to guess at what might be concerning me these days, health wise. No doubt said commercials pay attention to my search history as well. Even if I'm searching on Alzheimer's \"for a friend\" (or relative) the fact that I searched means the topic is topical.\n\nHowever, I'm not signing up for all the brain teaser programs that want to charge me for playing around in their obstacle course. Rather, I just need to keep using O'Reilly's Safari service to (a) get my money's worth from that subscription and (b) to tackle skills building in some way, shape or form. Today, that meant unplugging from power and enjoying the new aircon Dr. D installed, in the living room (where I could plug in, but why bother), and tackling Haskell.\n\nI've tackled Haskell before, but not with a Jupyter Notebook open in Binder i.e. in the cloud. I don't need to install the program locally to get some mileage, some practice. I need practice at what I'm preaching in my YouTube:  developing the cuboctahedral (icosahedral) number series in a number of computer languages, not just Python.\n\nTackling Haskell does not require me to venture far outside my comfort zone, as rock climbing might require me to do. I've been a programmer for decades and am used to thinking in terms of types. So I'm exercising within a familiar gym.\n\nThe next task after getting battery service from Apple, is to take my car through DEQ, which is closed tomorrow. I've customarily used my blogs to chronicle car stuff, so look for a subsequent entry soon.\n\n[](https://www.flickr.com/photos/kirbyurner/53131364413/in/dateposted/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}