{
  "id": "8217346927948147916",
  "title": "Geometry of Nature",
  "published": "2018-01-06T09:00:00.000-08:00",
  "updated": "2018-01-09T10:46:17.301-08:00",
  "content": "So where were we, before I was so rudely interrupted by [the reality of my mortality](http://worldgame.blogspot.com/2018/01/health-plan.html)?\n\nWhat gets under the skin of many professionals is that Synergetics dares to be polemical about topics no one usually gets polemical about, prompting by turns defensiveness or simply dismissal.\n\nHow dare Bucky assert he's giving us a \"geometry of nature\" that (A) is not what we're used to in schools and (B) does make some modicum of sense, meaning it's hard to dismiss as \"simply crazy\"?\n\nAs someone trained to read philosophy, I'm used to giving an author the floor and letting her or him construct a \"private language\" of sorts, meaning the author does some work to \"draw us in\" and make us privy to special meanings of this or that key term.\n\nSynergetics started with a \"deliberately remote vocabulary\" but then, in Fuller's experience, over a lifetime, it seemed to be in a \"merging traffic pattern\" with what contemporaries were up to, in nearby namespaces.\n\nNo one specifically claims that the XYZ coordinate system is \"the\" geometry of nature.  We have many coordinate systems.  I introduce [Quadray coordinates](https://en.wikipedia.org/wiki/Quadray_coordinates) the same way, as just one coordinate system among many, one that uses 4-tuples instead of 3-tuples vis-a-vis 4 instead of 3 \"basis vectors\".\n\nHowever, our culture does take for granted, without ongoing debate, that \"space is three dimensional\" because \"height, width and depth\" are represented by three mutually orthogonal sticks (the \"jack\").\n\nSynergetics begins with the same \"[res extensa](http://coffeeshopsnet.blogspot.com/2009/03/res-extensa.html)\" -- a lump -- but doesn't claim to disintegrate it into conceptually separable aspects that could exist \"independently\".  Instead, height-width-depth is a single mutually co-dependent phenomenon, and its avatar, if symbolized as a polyhedron, is more economically represented by the tetrahedron, not the cube.\n\nThat's a different beginning, outside our culture, a different set of language games.  We're not accustomed to anyone \"questioning authority\" in quite this way.\n\nFuller had given up such lines of questioning and was doing his best to fit in, but tragedy and sorrow jarred him into reassessing whether he could afford to \"fit in\".  His life plan of the day was not working out.\n\nThe rest of us tend to be grateful that he re-committed to his intuitions as, even if we don't buy into Synergetics, we credit his inventiveness and positive futurism as a boon to society.\n\n[As a philosophy](http://mybizmo.blogspot.com/2017/03/student-reading.html), Synergetics is committed to finding unity in complementary aspects, such as concavity versus convexity, tension versus compression, one could say two sides of the same coin.  Radiation and Gravity...\n\nAgain, with the Synergetics concept of Gravity, we're moving away from established usage patterns in the direction of logical coherence.\n\nWhat holds a system together logically such that it continues to make sense to us?  A kind of connecting around in all directions.  There's a sense of containment, but then we also sense when \"bubbles burst\" meaning systems fly apart thanks to internal and external forces.\n\nRadiation is divergence from a common center.  Gravity is convergence thanks to everyone holding hands and pulling together. \n\nThanks to [the computer science notion of namespaces](http://controlroom.blogspot.com/2015/10/art-history.html), we're able to relegate different usage patterns for such key terms, to their respective language games. There's not a requirement that we all be on the same page at all times.  Partially overlapping scenarios are both necessary and sufficient.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}