{
  "id": "3013492456877558953",
  "title": "Ghost Cities",
  "published": "2013-09-08T21:26:00.000-07:00",
  "updated": "2013-09-08T22:04:18.570-07:00",
  "content": "I was out hunting for new-to-me memes tonight and tracked down Agenda 21, thanks to Wanderers (our widely flung intelligence gatherers -- e.g. harvesting [from Terry Gross](http://www.npr.org/people/2100593/terry-gross) on NPR and such).\n\nAgenda 21 is scary to free-wheeling capitalists as it represents the more Borg side of humanity, those eager to fit in well enough to build great Cathedrals (not \"just\" Bazaars the way they see it).  Lets do something planned, top-to-bottom, not a patchwork, not sprawl.\n\nThe Ghost Cities look to me more like China's learning from the sprawlers' mistakes.  Portland has had its own [little Ghost City](http://www.flickr.com/photos/kirbyurner/2926871961/) recently, but it seems to be filling fast.  People don't throng to a construction zone, but do to a spanking new neighborhood, if the alchemy is right.\n\nChina isn't stupid about [Feng Shui](http://en.wikipedia.org/wiki/Feng_shui).\n\nThe whole Ghost Cities meme is maybe somebody's marketing ploy to get free publicity for these lifestyle options.  Clever.  The lure of the mysterious.  \"We're moving to a Ghost City.\" How cool.\n\nAnyway, I like that this guy (the videographer) is out there with his videocamera, following up on 60 Minutes.  We all know 60 Minutes goes over the line sometimes.\n\n[Stewart Brand](http://controlroom.blogspot.com/2011/03/stewart-brand-at-reed-college.html), the Reed alum (like Jobs) and visionary, welcomes highly concentrated cities.  Humans seem well adapted to pack and stack, but that doesn't mean they can't enjoy the wilds.  Just mount your bike and head out. \n\nThe wilds will be vaster and freer of humans to the extent humans concentrate and leave nature well enough alone.\n\nBetter a smattering of Borg Cubes [by Paolo Soleri](http://worldgame.blogspot.com/2010/02/incoming.html) than strip malls 24/7/365 as far as the eye can see.\n\nI think he has a point there.\n\nThe flip side of concentrating humans in cities is purging more nature of human beings.  Not in the sense of totally forbidding access to thrill seekers, but not encouraging human settlement on a large scale either. \n\nThe infrastructure won't be there for that, though for a light powdering of humans, as in agriculture, there may be.  Those wanting small communities in relative isolation need not be disappointed, and again, people willing to be concentrated in high rises are helping them enjoy that option.\n\nThe same people may go back and forth of course.  I'm not talking about a daily commute but about life being in chapters. \n\nYour school is in the wilderness, though amply high tech, while your first teaching job is in a densely populated area. \n\nThen you take a wilderness job.  Then back to some brave new Soma City with some unique hive mind vibe.  Delphi had a vibe too, many over the years.  Humans achieve new synergies in cities.  Why diss that lifestyle?\n\nJust because \"both\" (urban / non-urban) ecosystems exist doesn't condemn any given individual to an either/or choice of lifestyles.  Experiment with a full gamut.  Life is short, yes, but that's the hand you're dealt in being human.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}