{
  "id": "6527313617607042371",
  "title": "Girl Rising (movie review)",
  "published": "2013-04-21T08:55:00.000-07:00",
  "updated": "2013-04-27T09:55:32.219-07:00",
  "content": "My sympathies are with girls, not pit against boys, but with all genders having a shared co-investment in having their world be less cruel.\n\nThe film is nakedly propaganda and that's quite OK with me as I'm one of those [USSA types](http://worldgame.blogspot.com/2006/07/back-in-ussa.html) who understands one must show one's hand sometimes, even hold it out for donations.  One must beg, even if one is The Grunch, i.e. [Paul Allen](http://www.vulcan.com/), [Meryl Streep](http://www.imdb.com/name/nm0000658/), [Anne Hathaway](http://www.imdb.com/name/nm0004266/), Intel, UNESCO and so many others.\n\n\"[The Grunch](http://grunch.net/)\" is insider vocabulary, cant, jargon, shoptalk, for the amorphous post-nationalistic Global U.  This film is the Global U recruiting girl students, seeking to perpetuate the lifestyle of a long on ramp of skills acquisition, wherein various fluencies are developed.  You need years to prep for your first adult life roles.  Marriage and children comes much later in this model.\n\nYou might want to see this in tandem with [Waiting for Superman](http://controlroom.blogspot.com/2011/01/waiting-for-superman-movie-review.html), another documentary that conveys statistics, and that points to trouble spots further along the pipeline.  Just getting to \"school\" isn't the end of the matter.  A lot of these girls seem to think of getting into school the way Christians imagine getting into heaven.  There's no \"but then what\".   [Samsara](http://controlroom.blogspot.com/2012/09/samsara-movie-review.html) would be another good one to see in close proximity, keying off the opening dancer in hypertoon fashion.\n\nWere I to push back, it'd be about not giving up on adults, on the parents.  They need education too and to abandon them to their dead end jobs while putting all the pressure on sister Susie, is overly stressful, making girls take the brunt again.\n\nGuardians need their little screens, the tents all need WiFi.  What's up with that UNESCO?  One lap top per adult?\n\nFamilies learning together with the adults in the household (dads, moms) having some say?  Lets all watch Girl Rising as a neighborhood, without trekking to a \"school building,\" or at least let us enjoy the benefits of a \"flipped classroom\".  Let parents continue to share in the job of teaching, as the dad does in buying his girl a coloring book.  Maybe he draws (and is a space case) too.\n\nBecause \"school\" does have a track record of unthinkingly persisting a hollow meme set.\n\nA great lifestyle that just needs fine tuning gets eradicated, because the families are carved apart by a new Central Casting institution. A landlubber farmer [in Ladakh](http://worldgame.blogspot.com/2011/01/economics-of-happiness-movie-review.html) is called \"being poor\", and the \"fixes\" may involve destroying a next generation's ability to carry on the family business (farming), because \"school\" is all about impractical uses of time, or imparting outmoded skills.\n\nMay we count on our schools to share the best ways of learning reading, writing, music and programming (accounting, tabulating), and how to work with an ecosystem (gardening, cooking, fishing, shopping)?  We have a real global shortage of such schools, including in the so-called \"developed\" world.\n\nA lot of kids drop out everywhere the same reason:  they're too responsible to stay in school.  They're needed behind a cash register or sales counter.  School itself cannot afford to retain them.\n\nThe trick is to have the Global U compensate the tent cities more immediately.  If the tents are doing homework, passing tests, then the WiFi is considered to be \"paying for itself\".  Investors see what they were hoping for, not a doubling of their money (that's just inflation), but a rising in real assets, human resources (the army you've got), people launched in ways that create exciting (even to them) resumes.\n\nIf education is such a world-changing positive, then why delay all the gratification?  That's a questions I'm left asking, when I see the condition of our student body.  I blame a weak curriculum, artificially dumbed down.\n\nThe film has a lot of fine lines to walk.  The oppression of peoples is in the foreground and the analysis is how girls are treated is a \"canary in a mineshaft\" indicator.  Slavery in general, in any form, is an enemy.  [Cloud Atlas](http://controlroom.blogspot.com/2012/11/cloud-atlas-movie-review.html) seeps in.\n\nThe girls show spunk and are encouraged to do so.\n\nThey question authority, use reason, stand up for themselves, hold out for better.\n\nLiberation poetry is proposed as an acceptable genre.  Secular leadership, indigenous values... ancestors are not completely shut out, and that's a positive.\n\nThere's no liberation theology per se (those films are left to others), but there's an academic global development culture that cares about numbers (statistics) and wants conditions to improve.  This culture is busy recruiting girls.  Here's a film made for that purpose.\n\nIf only the war of ideas could be waged in darkened theaters and on smaller more private screens, versus in the primitive monkey-brained Universe of blood and guts \"theater\" (drones, cruise missiles, cluster bombs, tanks...).\n\nClashing titans in the form of competing propaganda films (like this one) would be far more tolerable than making the point with terrorist / torturist implements -- a widely shared sentiment I realize.  Hence the [Countdown to Zero campaign](http://worldgame.blogspot.com/2010/07/countdown-to-zero-movie-review.html), which has lots of grown up girls behind it.\n\nSpeaking of which, the grown up girl who watched this with me at Fox Tower owns her own truck, owns land, and has training in film making.  She sells her photography all over town, in the form of greeting cards.  [Dora Marsden](http://mybizmo.blogspot.com/2012/11/arrest-of-dora-marsden.html) was hoping for more such women.\n\nMaureen had wanted me to see this film, a WILPF member.  I wondered if [Dr. Tag](http://controlroom.blogspot.com/2009/07/experience-music.html) had seen it.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}