{
  "id": "8245036252833780910",
  "title": "Glorious Gas Town",
  "published": "2024-05-26T21:10:00.000-07:00",
  "updated": "2024-07-10T19:55:02.911-07:00",
  "content": "Yes, that's a reference to Mad Max. Our party just saw the Furiosa movie. I was glad to see both Alex (visiting Portland) and Alexia (back from her Alaska cruise). And of course Dr. D., bouncing back from his latest First Person Physics adventure.\n\nWe won't be saying \"goodbye\" to the whole idea of fossil fuels any time soon, but we do see a change in emphasis, towards the renewables. You don't say goodbye when the emotions in charge are resentment and anger. Fossil fuels will finally fade amidst a celebration of their golden ages, and even then it won't be gone. We'll be the new fossils.\n\nMy science fiction, woven throughout the hypertext of Martian Math, features a long under-ocean chapter for the human species. I don't know what that will look like exactly. Will we bifurcate into a water-breathing species? Why bother, when we have scuba (my sport of choice)?  \n\nI know that high and low pressures and temperatures shape both our maritime and aerospace technologies. They're related. Light is also an issue. But then we have a cave dwelling past, some of us, as humans. Piping in light, using shafts and mirrors, is not a new idea, plus now we have bulbs.\n\nSome habitats require what we might call umbilical cords, however slender. Taking refuge down a mineshaft is not a solution when the enemy simply needs to close off the entrance, entrapping the defenders. Siege is easy. Likewise if one is deep in some ocean cavern, piping in sunlight, fresh water, fresh air. If one has reason to expect vandalism, ala NS2...\n\nWe're not yet in a chapter where long umbilical cords are practical. People just don't yet trust one another enough. A colony on Mars is impractical as long as the political scene is such that Earth might lose its ability to marshall sufficient resources, both physically and metaphysically. They might get a Mars colony going, but not have the wherewithal to keep it going. Ditto under ocean colonies, but these folks would likely have more opportunities to outlive these experiments.\n\nPerhaps humans fear that if they get along with themselves too well, that the future will be insufficiently challenging. In my view there's no danger of that. It's more like humans will never tackle certain challenges until they get their house in better order. The species is currently too dysfunctional to attempt many of its one day likely gigs. That's OK. Doing everything all at once was never going to be practical. Humans live on a geological time scale.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}