{
  "id": "2840915194742941705",
  "title": "Go By Train",
  "published": "2016-10-04T10:44:00.004-07:00",
  "updated": "2016-10-05T19:29:55.047-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/29372346763/in/dateposted-public/)\n\nUncle Bill, the mining engineer turned naval historian, in his 90s now, is heading this way by Amtrak for a lunch at Ringler's or other brew pub near Union Station, before heading home two hours later.\n\nThis will be his fourth such visit with me, however he's come down independently to visit with other relatives.  He used to drive his Aztec but voluntarily quit driving after a passing mini-stroke ([TIA](http://www.webmd.com/stroke/tc/transient-ischemic-attack-tia-topic-overview)).\n\nCarol had hoped to join us this time, but decided getting her [INR checkup](http://www.webmd.com/dvt/tc/warfarin-and-vitamin-k-topic-overview) (like Hillary gets) with her favorite checker would be tough to reschedule.  So I'll get her there early and she can while away the time reading her recently-acquired book by Hendrik W. van der Merwe, regarding his work to end Apartheid in South Africa, a story more USers could learn from.\n\nSouth African Friends were more than a little miffed when the US-based AFSC showed up in force and presumed to advise them on how to best deal with ending Apartheid and self governance in its aftermath, given the RSA was actually overcoming racist thinking, whereas USers were still singing \"we shall overcome\" in some future tense.\n\nThat's a song for young people in my book.  If you haven't overcome by 58, it ain't gonna happen, is my attitude, whatever \"overcoming\" means to one.  YMMV.\n\nRSA means Republic of South Africa in the above paragraph, not Rivest-Shamir-Adleman, a public key crypto system similar to Diffie-Hellman.\n\nI recommend [the movie ](http://worldgame.blogspot.com/2015/03/chappie-movie-review.html)[Chappie](http://worldgame.blogspot.com/2015/03/chappie-movie-review.html) to better appreciate the difference Ubuntu makes.  AFSC still uses Windows.  If you don't use the bash shell, you're not a real activist, is my rule of thumb (Carol an exception).\n\nUSers like to be bossy, believing themselves enlightened or ahead of the curve. Didn't Michael Moore help lay that notion to rest in his latest movie, which mom and I both want to see (I've seen the previews)?  \n\nUSers are among the more backward, culturally, adding them all up and dividing, to get an average. They have \"diversity issues\" in the sense of insufficient schooling in dealing with it intelligently.  Remember the people who came here were those with the most trouble fitting in (like the Quakers).\n\nI'm teaching class tonight, really more like hosting a talk radio show, with me doing most the talking.  My listeners text message, and see each others texts.  I work their questions into my discourse.  I'm doing a highly technical talk on Python, the computer language, which I get to teach in forty hours.\n\nLast night I was at the code school again, \"the guild\" as we call it, catching up with my peers and ignoring DC politics.  Oregonians live on the Pacific Rim and tend to not always share East Coast perspectives.  I brought along my XO-1 for show and tell. \n\nCarol has a speaking engagement elsewhere tonight, which I won't make.  She's in demand as a speaker, and this year she took it on the road, riding shot gun with Ellen Thomas in rented vans, from LA to Seattle, and from Boston to Cape Code and Boston.  Most 87-year-olds wouldn't have the stamina.\n\nThen she joined me for her granddaughter's graduation, in Richmond, Indiana, flying to Dayton from Reagan International, before packing her stuff to base herself here.  Like the Pope, she has winter and summer residences.\n\n[ ](https://www.flickr.com/photos/kirbyurner/29989347082/in/dateposted-public/)\nCharles Cossé with OLPC XO",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}