{
  "id": "2234799618301718701",
  "title": "God Talk",
  "published": "2023-07-08T12:47:00.000-07:00",
  "updated": "2023-07-17T07:46:49.191-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/3246020088/in/photolist-oZKsQo-rayQ3M-5e7wRy-5vJgg4-5xiooh-5xPR7b-5ybCNp-5QB13i-QQ5ESx-5WQGFA-68VAhF-6qSkVP-6wePQ3-76u2nv-2n1WbrG-e8Zjpu)\n\nLet’s talk about “God talk”, and here I picture a congregation, hats off, heads bent, eyes closed in some cases, giving thanks to God for a lot of important stuff in their lives, and asking for greater wisdom and attentiveness. What’s good about this attitude is that it’s in principle the opposite of authoritarian, a fact which many critics have a hard time seeing.  \n\n“God talk” is often characterized as authoritarian by definition and usually highly patriarchal in practice, given the Roman experience (pervasive even today). Certainly subcultures (cults) may be heavy-handed, and sometimes escaping them and their influence is the best course.\n\nHowever, in thanking God, one is pronouncedly not thanking the Emperor for one’s daily bread. It’s not the party, the company, the boss, leaders, visionaries, scientists, or my betters, to whom I am beholden.  \n\nIf we don’t have our daily bread, some humans are in the way from a systems point of view, maybe the very humans who decided to hike up this unforgiving mountain or dare whatever odds, given physics.  \n\nGod represents the idea that humans are not the be all end all and that sensibility is vital to keeping the humans-playing-God syndrome from becoming a pandemic.  \n\nGod represents synergy at a very high level, meaning intelligence flows “above our heads”, “among the angels” say, or “unconsciously” if you’re more a Freudian, or “in demonic realms” (the trope of an “underground,” the chthonic).  \n\nThere’s Ouija Inc. and its many board rooms. Monster U. Wisdom plumbs the deeper depths. It’s not anti-science to say so.\n\nThe prayer of thanks comes from a cybernetician who understands Nature is automated to provide, and humans are a part of that automation. Using the term “automation” comes across as derogatory perhaps, too mechanical.  But then humans exult about being in the flow, in the zone, where everything “just goes” without a lot of overthinking and ego involvement.  \n\nThat feels like God’s will (Thy will) being done, and it’s a Kingdom of Heaven type experience. The cybernetician is nodding along with all that, likewise prayerful and grateful.\n\nThe fork comes with “divine right”.  \n\nSome revolutionaries talk as if we finally closed the door on “divine” period full stop, in depriving even kings of this status.\n\nOthers say our notion of “divine” was extended in Democracy, to all, from King to Beggar. That’s where the Quakers came down, around the 1600s.  \n\nThe idea is our equality, the sense in which we’re equals, is built in to our sense of God’s love.  When we apply the idea of unconditional love to all humans equally what viewpoint do we get back?  One that beacons away from putting peers on pedestals, as idols, as God’s competitors.\n\nEnshrining other humans as the source of all that’s good in our lives, including life itself, is a first step down a wrong path.  Yes, thank your peeps, and be grateful for them.  But don’t confuse that thankfulness with a growing debt.  Think of the Sun’s energy.  Enough of that was meant for you, that you shouldn’t have gone wanting without a scholarship.  The Sun doesn’t charge a debt to its students.\n\nThank the Sun for your being adequately energized, as a teacher and student in the Global U, not other students or faculty.  The Sun and the plants impound carbon dioxide and other nutrients, providing the raw ingredients for your cafeteria plan.\n\n“Oh so you’re justifying monarchism by using God in a purely political sense, irrespective of His existence”. First, I’m not “justifying monarchism” or at least not for free.  You’d need to pay me. Next, I don’t think the political sense would have such staying power if it weren’t also people’s experience that whom they owe for life itself is not the landlord, but the same Lord to whom the landlord owes his own life. That’s more democratic.  \n\nThere’s no King as Ultimate Landlord model. We each have our private “image i nation” (private sky). That of God in each of us. Quaker jargon.\n\nThe main debates hinge around laws or rules. Where do “rights” come from? Again, I see the reason behind having inalienable rights come from God, and then maybe affirmed or codified in some widely agreed upon document, such as the United Nations Declaration of Human Rights.\n\nThere’s no problem enshrining these rights, just with thinking we owe specific people thanks for providing them in principle.  Defending them is again different.  However to what extent is one’s effectiveness, as a defender, dependent on having the right attitude?  When too much ego gets into the mix, effectiveness may be at risk. So we’re back to Transcendentalism, not as a hindrance to American democracy, but at its foundation.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}