{
  "id": "1264023313966384877",
  "title": "Golden Oldies",
  "published": "2020-02-26T12:17:00.001-08:00",
  "updated": "2020-02-26T12:38:38.509-08:00",
  "content": "The embedded Youtube is Part 4 of a five part series, which I've watched before, and viewed again yesterday, before sharing it to Facebook.\n\nFuller is adroit in thinking metaphorically, but for most of us, science is a literalist affair, with the true grounded meanings. Metaphors are for embellishment, not for supporting weight.\n\nHowever, Fuller's Universe is light and airy, highly tensile, remarkably devoid of brute force strength or forcing more generally.  He flits about, always resecuring his own technology, a synergetic language as dense as Heidegger's.  Equilibrium is the name of the game, but in a Universe intent upon success for its humans.\n\nI've been endeavoring to shed some light on what Fuller branded as \"the geometry of nature\", a claim for which he takes flak. Does XYZ ever make such a claim?  Is the counter-position that geometry is merely a human invention? \n\nHis scaffolding is the IVM (\"octet truss\"), a pattern found in nature for sure (CCP, FCC), with volumes 1 and 4 respectively.  Rectilinear patterns don't go away, as we've seen in C6XTY (another IVM-related space-frame design). His paradigm cubes have volume 3.\n\nBy some reckonings, synergetics offers but a small tweak at first, with this shift to tetravolumes, resulting in some simplifications (more whole number volumes).  Where that leads next is the next question.  Fuller points to intuition, but has intuition served him well?\n\nDoes 90 degree precession really pick up where 180 degree gravity ends?  He seems to think the Earth's orbiting and axially rotating are resultant behaviors given the Sun's pull.  Textbooks suggest a primordial kineticism for which \"gravity\" should not be blamed.  \"Critical proximity\" is where the changeover occurs.\n\nStuff \"falling in\" is not the usual thing with gravity, according to Fuller, as the whole-unpredicted-by-the-parts is more like stuff \"wandering\" (not \"falling in\").  The effect of bodies in motion on other bodies in motion seems chaotic and complex.  Is he seriously questioning Newtonian dogmas?\n\nI get the tetravolumes meme and have taken that to heart, and when it comes to \"metaphysical gravity\" I see \"precession\" as Bucky means it.  Metaphysical == Metaphorical? \n\nHe dives into speaking very specifically about literal gyroscopes.  When you tug a pole towards you, it yields in a different direction, thanks to its spinning disk.  That's precession for you, I agree.  But the initial spinning did not result from the tugging, right?\n\nIn always shying away from \"cult leader\" status, Fuller is free to exercise and share his private language, fact-laced and interdisciplinary.  His relative success as an inventor, his track record, becomes his evidence that his thinking outside the box (which takes courage) is what more of us might want to try.  \"Come on in, the water's fine\" is what echoes between the lines.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}