{
  "id": "927789347536530116",
  "title": "Google App Engine",
  "published": "2009-03-25T08:03:00.000-07:00",
  "updated": "2009-03-29T14:33:49.020-07:00",
  "content": "I'm learning more about cloud computing this morning.   Hey, YouTube is coded in Python, didn't know that.J.C. Gregorio is taking us through the app.yaml file (don't use /_ah/ or /form).  You fall through the rule set.  List the top level handlers, what to skip, caching rules.  Not everything in your tree has to be mentioned though.  Specify whether a login is required and, if so, must it be admin.Django 0.96 is the current default templating language, but you're not forced to use it.  Use os.path.dirname(__file__) to build an absolute path to our template file.  We're getting questions about [using Mako](http://www.makotemplates.org/) instead of Django.  I found some stuff [in the blogs](http://blog.pansapiens.com/2008/06/24/mako-templates-in-google-app-engine-seems-to-work-for-me/) about that.  [What about Jinja2](http://appengine-cookbook.appspot.com/recipe/upgrade-the-django-templating-system-to-jinja2/)?Lars is here from the Mozilla development team.  He's been working on a crash detector that phones home (sends httpRequest) with a binary payload, with Python doing the analysis on the server.  Mozilla is able to monitor, in quasi-real time, where their browser is breaking.Read PEP 333 to get a better handle on WSGI, which supersedes CGI.  The SDK includes a lightweight version.  We're moving quickly here, as the datastore is what's most important.The datastore is an \"entity store\".  It's not an RDBMS.  You can't do joins.  GQL is the new language, based on SQL but different.  Subclass db.Model and create your properties, setting defaults (e.g. auto_now_add=True for db.DateTimeProperty).  The writes probably take longer than you're used to, given the redundant write stipulations (like the Hadoop, you'll have x3 replication).  Update the same entity about 5 times a second, but as many entities as you like in parallel.  Reads are very fast.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj0OqBvcgXLRnxuRG9wL_q_9kjXGYbTq9EaQeKxES24tOOQgF50Yyvs8UlalWrY4OAcNFwDP1urkIwCJw4t0Vf7tF3yWLEwX_AG3FRnt-lBFLAB9BuVqTTOV4IEUwn0foWxIw_h/s1600-h/appengine.gif)I got stuck trying to store and read the above GIF in a model blob property, couldn't get it to work.  The famous [Wesley Chun](http://corepython.com/) in the row in front came back and showed me his solution (he liked the challenge, which I'd asked about publicly).  He knew some tricks it'd've taken me a long time to come up with (set mime-type, use read method).  Thx!  I hope he sends me the source code (note later:  he did).[](http://www.flickr.com/photos/17157315@N00/3385549291/)Cowboy Programmer(K.L.L., Mozilla Corporation)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}