{
  "id": "5947463613115699325",
  "title": "Google Classroom vs ALE",
  "published": "2015-08-26T10:43:00.003-07:00",
  "updated": "2015-08-31T15:32:55.108-07:00",
  "content": "Of course a lot of you loyal readers may have been wondering:  \"ya'll are going on and on about ya'll's Asynchronous Learning Engine (ALE) but what about the Google Classroom API?\"\n\nExcellent question.\n\nGoogle's metaphors are more staidly rooted in the idea of a brick and mortar building with classrooms, whereas ALE has more hints of [travel industry thinking](http://controlroom.blogspot.com/2015/08/asynchronous-learning-engine-ale.html).  One may regard a lot of these differences as superficial, a matter of \"skinning\" (GUI = skin).\n\nHaving ALE and [Google's classroom API](http://www.edtechmagazine.com/k12/article/2015/08/google-classroom-api-goes-public-giving-users-more-power-share) both in the same genre or category is muy convenient as well, as that helps with comparing and contrasting learning engine models more generally, a discussion we need to have, as learning is now the core business of so many of us these days.\n\nMy work on ALE is influenced by years of working with Nano, an in-house solution wrapping an approach to andragogy which inherits from the DIY or \"craftsman\" schools, such as Make: Magazine. At the other end of the spectrum is kicked-back watching videos, passive absorption minus much kinesthetics.  Combine both modes, but definitely the \"off your duff\" active learning mode is not the one to sacrifice.\n\nDifferences in philosophy need not be closely followed by an API; the same classrooms and buildings get used by all manner of faculty member and student enrollee.  I'm not looking at ALE as staking philosophical turf except insofar as I've suggesting making \"grading\" ancillary, an add-on.  ALE should be compatible with a non-graded flex-time style (self paced) but not dictate this template as a universal format.\n\nTesting a prototypical Python course in the Google Classroom sounds like a worthy project.  That would be hands on experience I could take to the bank when it comes to envisioning a next generation of Nano.  Y'all would benefit.\n\nALE is vaporware as of this writing, a stub ready for test case development, however it inherits from a working version within an operational school.  Google is ready for developers to start using its API today.\n\nGoogle Classroom is an exciting reality and door-opening possibility I'm eager to explore more deeply.  I've been [nudging the Quakers](http://mybizmo.blogspot.com/2015/08/all-math-is-ethnomath.html) about it, given priority access is reserved for non-profit / non-commercial enterprises.  We could use it to conduct Interest Groups.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}