{
  "id": "8019066462413193117",
  "title": "Goonies (movie review)",
  "published": "2015-06-06T19:03:00.004-07:00",
  "updated": "2015-06-06T19:22:37.248-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/17870315534)\n\nNow, after that post below about engineering as a moral enterprise, lets talk about film making as a kind of engineering.  It is, clearly.\n\nLife is in layers, from nano and micro, where the Platonic forms appear (very small), on up through Murder She Wrote, where you need plot and characters.  These latter [obey the quantum laws](http://mybizmo.blogspot.com/2005/11/physics-emergent-isepp-lecture.html), which are in turn in-deterministic (uncaring / un-causing) of the corpse found in the kitchen.  Just no miracles had to occur (those cost a lot more and shift the genre to fantasy).\n\nGoonies is pure fantasy.  [Compare it to horror](http://mybizmo.blogspot.com/2015/04/horns-movie-review.html).  The formula is somewhat similar in that teenage lust is a core theme.  But is it punished or rewarded?  In Goonies, a scary comedy, it's rewarded, whereas in horror films one builds a grudge against a character into which one projects evil intentions, or other failing one might be sensitive about, and gets catharsis.  Revenge is satisfied.\n\nThere's revenge in Goonies too of course:  they throw mama from a boat, instead of from a train this time.\n\nDonner is the director and he's coming from Superman, one can tell.  Spielberg is a co-director and producer, picking up the early jail breakout scene.  [Astoria, Oregon](http://mybizmo.blogspot.com/2015/03/welcome-to-wellville.html) is the backdrop and Astoria celebrates this film, as it captures a slice in time, almost in freeze frame.  Shades of Stand By Me.\n\nWhat's weird is I hadn't seen this before and here I am, 57, in my \"chair of computer science\" from Steve Holden, taking it in.  Not only that, I have a whole Willamette Week issue devoted to Goonies spread out in front of me.  What happened to each character in real life (Chunky got thin).  How cultures clashed when LA came to rural Oregon to make a movie (\"ew, get that stinky deer carcass out of our sight\").\n\nSo in a way I'm blessed, as a tourist, to come in so late in the game.  Glenn brought the stuff over.  Now that's what I call fun homework!  One Eyed Willy and Free Willy, both freed from the same shores.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}