{
  "id": "2555801899901970791",
  "title": "Got the Facts on Milk? (movie review)",
  "published": "2014-03-31T04:00:00.004-07:00",
  "updated": "2014-03-31T22:18:54.360-07:00",
  "content": "This is an interesting talking head documentary and road trip across North America, taking a look at the many cultures and the power of lobbying and advertising.\n\nThis DVD, along with SuperSize Me, is already a popular homework assignment in some high school classrooms, flipped and otherwise.\n\nAmericans enjoy finding out how they have been manipulated with clever misinformation.  The power of advertising excites the neuro-scientist within.\n\nThe USDA comes off as pathetic, as one would expect.  As the authorized \"pusher\" it crams dairy  products down unwitting throats, basically child abuse on a vast scale.  These children grow up reciting the same ridiculous mantras from their junkyards of mental wreckage, their true American heritage denied them.\n\nWashington DC is more interested in killing and/or imprisoning Americans for profit than providing them with a good nutritional support system, but that's not news.  Its policies have been similarly cruel overseas.\n\nI do enjoy dairy products and tolerate lactose well.  However I treat cheese and chocolate as luxuries, not because I can't in principle have unlimited amounts but because luxuries are only such if enjoyed in strictly limited amounts.  One can't be luxury class and swill one's luxuries, an oxymoron.\n\nI've been reducing my milk intake.  I'm brand loyal to Tillamook and Alpenrose.\n\nI've eaten my share of such products and do not wallow with self pity in denying myself as much future access.  I'm actually rediscovering my power to enjoy food in my imagination again, as when reading books containing food scenes.\n\nFood may be interesting and rewarding in different ways than just through the sugar family (thinking about ice cream, candy and breakfast cereal).  Chemistry and food prep (including cooking, but also raw foods) go together.\n\nFor those looking for ways to lose weight, I recommend studying nutritional science and really taking an interest in the biochemistry.\n\nMake weight loss your door to the whole of the life sciences and really take an interest in upgrading your sources of information.\n\nTurning away from junk memes in supermarket checkout lanes, in favor of better sources for science, expands your focus from a personal obsession to a concomitant and related societal phenomenon (obesity, a form of malnutrition) which is actually the level where effective anti-bodies are needed.\n\nFood Not Bombs has been a great influence in my case, expanding my horizons regarding foods, and Wanderers, which percolates with the biochemical interests of our hero Linus Pauling.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}