{
  "id": "115403796812696728",
  "title": "Gotta Luv that GUI Goo",
  "published": "2006-07-27T15:00:00.000-07:00",
  "updated": "2007-11-26T21:57:40.428-08:00",
  "content": "[](http://www.wxpython.org/)[GUI programming](http://r-101.blogspot.com/2006/08/evolution-of-desktops.html) is an art.  You face the user like a punching bag, but instead of hunched over, like an opposing boxer, you're this super-sensitive surface, alert to every mouse motion and key press (up and down strokes separately).  That sounds kinda painful, so let's tone it down:  you're coding a user-friendly surface, open to unprogrammed sequences of attack (click, click, 'r','r'... etc.).In [wxPython](http://www.wxpython.org/), every wxWidget inherits from an Events-minded superclass, meaning every surface is available for signal processing.  There's an implied hierarchy, where unhandled events either die unreported, or trickle up the chain of command, which is automatically searched both ancestrally (an inheritance tree) and in terms of successive containers (what widget's inside of what, out to the top frame and/or application object).  The programmer needs to explicitly bind a widget's event handler to whatever types of event (not all events get treated equally).[wxWidgets](http://www.wxwidgets.org/) is actually a C++ library, some 20 years in development, and reaches into each platform (Mac, Windows, Linux) for a native look and feel (unlike Tk, for example, which is equally strange on every OS -- which some people like).  wxPython uses SWIG to wrap this library, exposing its functionality in familiar Python syntax.  Plus Robin and friends add a few new bells and whistles just for those lucky snake charmers among us (other gnu languages bind to wx as well, including Ruby and Perl).As we roll around to [OSCON 2006](http://business.newsforge.com/article.pl?sid=06/08/01/1234216&tid=18&tid=138&pagenum=1) in Portland, gnu math teachers have a new resource to help feed those developing their appetite for facing-the-user \"GUI goo\", an acquired taste to be sure.  The resource?  wxPython in Action by Noel Rappin and Robin Dunn (Manning Publications, 2006), ISBN 1-932394-62-1.wxPython is sponsored in part by the Open Source Applications Foundation.[](http://www.osafoundation.org/)Follow-up: [Monday Inspiration: User Experiences of the Future](http://www.smashingmagazine.com/2007/11/26/monday-inspiration-user-experience-of-the-future/), Smashing Magazine (November 26, 2007)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}