{
  "id": "5601529283475933161",
  "title": "Gravity (movie review)",
  "published": "2013-12-21T20:55:00.001-08:00",
  "updated": "2013-12-21T21:43:02.153-08:00",
  "content": "Tara and I caught the 3D version at Fox Tower.  Good sound.  Yes, a pet peeve I've always had is how much spurious sound gets added over top, where \"sound\" is an oxymoron.  In outer space, you don't have sound like that.  Finally, at last, a film with the guts to add some realism in that regard.  Having vast destruction occurring in silence reminds one of the role sound does play in alerting us to situations.\n\nMany bold moves.  First person shots, \"in helmet\".  You couldn't have that other point of view, that we get as an audience, but those quasi-omniscient points of view were long ago accepted.  We say we don't believe in angels but only because our language buys them entirely, hook, line and sinker. The film industry is the champion of impossible viewpoints.  And right next to them:  the stars.\n\nClooney does a fine job.  At first we think maybe he's a loudmouth jerk, but soon realize he's grounding the whole mission, anchoring.  He's a geodesic.  A meaning of gravity (yet with levity -- he's always cracking jokes).  Clooney is a rabbi, if we want to go with that, a dharma teacher.  Then Bullock is gutsy brave and evolving, as one tends to do in death's face.  Nothing like death's face to spur one to get a move on, spiritually speaking.  She goes through plenty.\n\nTara, a physics student, was fairly OK with the physics engine.  In reality, the inertias involved would likely just be too great.  Grabbing a moving car on the freeway or leaping onto a moving train, is not that much easier in zero gravity.  Grabbing the box car door as it flies by is just too much a jerk on your body.  You need to swoop alongside and grab, but just a fire extinguisher is likely not up to it.  She's in that lack of O2 fantasy.\n\nThat's a darker interpretation:  when she's dozing off as an homunculus, perhaps to be reborn in China (as a dog maybe), we think she has like an hallucination, but it's more like a discontinuity, with George having his desire to keep living the dream too.  Both have died at some point, and we the audience are left with our impossible point of view, dead long ago and far away.\n\nThis got us both eager to cross-check (omni-triangulate) and we sat at Ringler's later (a McMenamins) with our smart phones, reading about the Chinese space program.  Most of the hardware credited to China in the film is planned to make it's real time debut in the near future.  The film is \"quite close to now\".  No Orion yet. \n\nAt the Wanderer's Solstice Party, Brenda, a lab tech [at MHCC](http://mybizmo.blogspot.com/2013/04/wanderers-201343.html), said the new planetarium software was really great.  She's Ms. Frizzle from Magic School Bus when in character -- she actually dresses up as that during one of the college campus summer festivals.  She'd probably be a good astronaut, or could at least play one.\n\nLife of Pi was somewhat a precedent for this movie, in exploring seamless CG.  We've come a long way in films.  This was the industry's way of showing off it's own breakthroughs, its ways of communicating the reality we know is out there, the reality of \"outer space\".  We live in it, within a biosphere as thin as the oil on the surface of an orange or thereabouts.  Maybe a little thicker.\n\nThe themes of death and gravity stay tightly interwoven in this film, which is what probably keeps it from being \"just another action thriller\" and makes it a meditative play, a profound work worthy of these serious performances by stars, lots of close-ups.  It's an existentialist stage play, ready to join conversations with other works, in future writings, and yet it's a roller coaster as well, a thrill ride in addition.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}