{
  "id": "4993594879539370533",
  "title": "Green Screen",
  "published": "2018-08-08T11:16:00.003-07:00",
  "updated": "2018-08-08T12:25:42.403-07:00",
  "content": "The \"green screen\" bizmo is one that drives around doing interviews, podcasts, other reconnoissance. Sometimes it's more convenient to actually go to a place and visit interlocutors close to home -- their home -- versus flying them to Burbank or whatever.\n\nA green screener may do solo-casting from the mobile studio as well.  The bus or van is well stocked with video editing equipment.  The nearest truck stop may provide the uplink station.  Not every such van is like a TV news van with live satellite back to headquarters.\n\nThe connotation around bizmos is they're not passive observer speculator journalist mobiles, who \"get the story\" and then move on.  Some bizmos may be of that type, but their tendency is to network and followup.\n\nNot that any specific community is obligated to host any given caravan.  That's where the dispatchers come in, and the control rooms (see other blogs).  Today we see a lot of interventionist control rooms thinking they know how to \"cure\" various global ailments.  They're way ahead of the science, acting on pure superstition a lot of the time.\n\nMy recent trip through the Warm Springs reservation and to the Madras area (Cascadia), to one of the \"[spy camp](https://medium.com/@kirbyurner/spy-camp-499da1c87428)\" [XRL spots](https://mybizmo.blogspot.com/2017/08/international-school.html), was by Torture Taxi (the Nissan), and was not a green screen adventure.  Smith Rock was really behind me, and I really did feed the alpacas.\n\nIf you're going fully for the illusion, then you don't really need a bizmo at all, do everything in studio.\n\nThe caravans plus innocent bystanders with cell cameras, create more points to omni-triangulate, meaning the believability of the operation will get a boost.  Spoofers won't be as good at authentication, most of the time.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}