{
  "id": "590547783715616155",
  "title": "Group Theory for 8th Graders",
  "published": "2022-03-14T14:21:00.003-07:00",
  "updated": "2022-03-15T22:16:34.307-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/51939193425/in/dateposted-public/)\n\nCarol was reluctant to follow orders this morning.  I'm making it sound like a boot camp, but any nurse knows it's about being a bit bossy sometimes.  She's still pretty strong.  She cycles.\n\nSpeaking of cycles, I just finished another one of my Algorithms and Data Structures class, the one I usually drive out to. \n\nHowever, this morning, on top of cajoling Carol, I could not for the life of me find my car keys.  I eventually decided to swap my on-site Monday for an on-site Thursday instead.  Then I found the keys, under the paper towels I'd purchased the last time I shopped.\n\n\"What do cycles have to do with Algorithms and Data Structures?\" you may well ask.  Well, I'm thinking in terms of cycle notation, where you take a Permutation, say of letters mapped to those same letters in a different order, and express the same mapping in terms of cycles.\n\nThink of watching wheels turning, or at any rate wheels of different sizes.  When do they ever come back to the configuration in which they started?  That's where the LCM comes in, or lowest common multiple of cycle lengths.  The will give you size of your overall wheel.\n\nMaybe all this sounds pretty hard and you've decided I'm just trying to show off as some kind of egghead. \n\nMy point, though, is in this era beyond only calculator in the schools, we have hands-on access to such groups and are free to play with and flesh out the concepts while learning them.  Calculators don't have the symbolic abilities a language like Python or Julia does.\n\nSo here I am, teaching eighth grade, in much the way I'd like to be taught were I back in 8th grade myself, but with all these new toys at my disposal.  How could anyone expect me to slog through high school, without my Jupyter Notebooks?\n\nThat's what Oregon Curriculum Network is all about:  prototyping the curricula of tomorrow, which may also include sourcing them.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}