{
  "id": "456656901557718870",
  "title": "Growing Up Quaker",
  "published": "2017-01-28T11:34:00.004-08:00",
  "updated": "2017-01-30T00:02:12.234-08:00",
  "content": "A story from my boyhood: my mother Carol was working with [other WILPF ladies](http://wilpf.org/), as a young mother, to counter the prevalence of war toys on the market. She harvested a pile of examples and stored them in our two-car suburban garage. Dad and I found them, and decided to play with them. The remote controlled Tiger Tank was especially cool.  As a general rule though, toy guns were discouraged and I didn't play with toy soldiers, as did some of my peers.\n\nWhen we moved to Rome, I met friends in military families. Reggie liked to fantasize about wars and weapons. Mom served as a cub scouts den mother.  I was a Bear, with my friends Mahlon, Kijoon, Reggie, Hayden and Joe. Kijoon, son of the South Korean ambassador, had a stash of toy guns, as well as a pellet rifle and we'd play with those, more in a 007 mode than as soldiers.  Movies at the nearby Archimedes, an English-language theater, were influential.\n\nIn the Philippines, my dad started out with the UN, which was doing land reclamation in Manila Bay. Dad switched over to USAID and taught planning at the University of the Philippines as well. He was helping spread a culture of local planning, versus top-down from a central government, and flew all over the islands. Thanks to his job with the State Department, we were able to go on base, mostly Clark AB and Subic NB. We also had access to officers facilities in Baguio and vacationed there at one point.\n\nMy years in the Philippines helped me more fully grasp the global scale of US military infrastructure. The American War (Vietnam) had been really hard on my mom especially. The way USers like to rain bombs on defenseless civilians didn't impress me either.  However I also saw how a lot of brave individuals inside the military were also skeptical.  Daniel Ellsberg went to Vietnam as a Marine to check the reality of the situation. Brian S. Willson was there serving his country as well.  Dad and I also heard [Ralph McGeehee](https://youtu.be/BDZv57p1Ixk) talk at the Institute for Policy Studies in DC (this was later). He'd been with the CIA.\n\nAfter Princeton, I dove into international affairs quite a bit and thought seriously about joining the foreign service. The [Woodrow Wilson School beckoned](http://mybizmo.blogspot.com/2016/11/thinking-globally.html), however I decided philosophy was more my thing. Wittgenstein was doing a kind of anthropology, looking at how words mean. I also took a course in psychological anthropology, with Imee Marcos (daughter of Ferdinand and Imedla) in the same class.\n\nFast forward and I found myself plunging into the Bucky Fuller corpus. He was still alive and circumnavigating the world, giving those famous long talks. His blend of futurism and philosophy appealed to me. He'd been in the US Navy and credited that experience for exposing him to big picture worldviews, what the admiralty shared in officers training at Annapolis. This was a high point for him, preceding a deep low, when he needed to support his new family in Chicago and went broke, coming close to suicide.\n\nAnother author with a lot of military experience was [L. Fletcher Prouty](http://mybizmo.blogspot.com/2010/05/cold-war-operations.html), played by Donald Sutherland as Man X in the Oliver Stone movie JFK. Prouty cites Fuller when explaining why humans are squandering resources to kill each other instead of collaborating to enjoy better living standards. The \"you or me\" picture of Malthus-Darwin and a belief in global scarcity had turned endless war into a means of population control.  This was the picture World Game worked to counter. In principle, humans had the wherewithal to better their lot. We had the necessary mastery over principles. Ephemeralization (more with less) was on our side.\n\nThrough my study of Fuller, I got to meet E.J. Applewhite and his wife June. I met their daughter Ashton briefly, haven't yet met their son, a boyhood friend of Sam Lanahan's (Sam accompanied Bucky to the Philippines when I was there, but wasn't tracking at the time).\n\nMy parents and I had dinner with Ed and June in DC (I forget which restaurant). Also Ed and June [flew out to Portland](http://grunch.net/archives/171) to hang out with me there, meeting some of my people. Ed had a CIA background, having served in Berlin and Beirut. He'd been a Fuller fan as a teenager and devoted his post CIA years to collaborating with the guy, shepherding the two volumed Synergetics through to publication.\n\nThe US military had worked closely with Fuller and the companies set up around the geodesic dome invention. Don Richter, T.C. Howard, Ed Popko and many others did much of the actual engineering, in both civilian and military sectors. The radome (radar dome) became a relatively common feature of the landscape. My uncle (actually grandmother's sisters kid) had a contract to work on those in some way, doing maintenance. I only found that out recently (Bill is 91).  Soviet premier Khrushchev had been impressed by the dome in Kabul. Fuller was always friendly to the Russians, as his commitment was to all humanity (he credited that commitment for his successfully synchronistic lifestyle).\n\nHowever, Synergetics is about a lot more than just geodesic domes and spheres. It's a hard philosophy book that most philosophers don't actually read, but contains some simple geometric innovations based around polyhedrons. When the World Wide Web became available, getting more of Synergetics on-line was my priority. Dr. Bob Gray got the actual text of Synergetics on the web, followed later by the Synergetics Dictionary, another Applewhite production.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}