{
  "id": "7585018562757073455",
  "title": "Gummo (movie review)",
  "published": "2013-05-15T14:14:00.002-07:00",
  "updated": "2013-05-15T16:47:45.918-07:00",
  "content": "I am only just tuning in the movies by Harmony Korine. The [Lotts](http://worldgame.blogspot.com/2013/03/argo-movie-review.html) have a son Harmony so I'm used to that being a \"guy name\" but IMDB had it wrong in their Trivia section, which I've subsequently corrected:\n\nWas spotted by 'Harmony Korine' (qv) on a drug prevention episode of _\"Sally Jessy Raphael\" (1985)_ (qv) called \"My Child Died From Sniffing Paint\", and cast in his movie _Gummo (1997)_ (qv).\nI changed \"her movie\" to \"his movie\", pending acceptance of edit 130515-205327-871000 [re Nick Sutton](http://www.imdb.com/name/nm0840371/).\n\nI told my friend afterward that I wanted Sam, my late wife's brother, to see it, as [he and Dawn](http://worldgame.blogspot.com/2007/03/about-dawn-brief-bio.html) grew up in Ohio and coped with poverty.\n\nYou should know before starting this film that no cats were harmed in its making.  Perhaps they used corpse kitties.  They're actually not being drowned, shot or beaten to death on camera, much as it seems that way.  It's a story, a couple of boys trying to make a living (and feed their glue sniffing habit) by hunting stray cats, and dealing with competition from another boy.\n\nThe characters are shown following their own intuitions a lot, not being told what to do or think by others.  Children spontaneously assume the demeanor and vocabulary of adults, as they pretend to shoot and kill a \"fag rabbit\" (another boy) and otherwise explore their world.\n\nThey are self-actualizing, and in that sense high on Maslow's Pyramid, which may seem ironic given what appears to be dire poverty and need.  But take [a second look](http://mybizmo.blogspot.com/2008/05/cry-baby-movie-review.html).  They have plenty of clothes and time to just hang out and workout.  Bicycles provide mobility.  This is not crowded shanty town living.  People enjoy big houses.  This is our \"land of the free\".\n\nThe boy we might call Gummo is Solomon in the movie, played by the talented Jacob Reynolds.  His voice narrates on occasion, adding depth to his character and turning the movie into a kind of novelesque retrospective, a latter day Tom Sawyer, some midsummer night's dream (between tornadoes).\n\nThe camera's eye moves smoothly through peoples lives, not noticed, or else it's stared at directly, someone the person knows, like a home movie.  The intentional mix of film types and quality adds to the sense of watching amateur, home brewed stuff, an effective form of immersion.  \"Intoxicating\" says one of the critics, of [this widely acclaimed film](http://www.imdb.com/video/screenplay/vi3198877977/).\n\n[Harmony likes many of the same films I do](http://www.imdb.com/name/nm0005101/bio#trivia), e.g. Badlands.  I'm not surprised his films grab me the way they do (so far; I've [seen two](http://controlroom.blogspot.com/2013/05/spring-breakers-movie-review.html)).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}