{
  "id": "7177893266410812820",
  "title": "Gutter Talk",
  "published": "2016-08-18T14:40:00.002-07:00",
  "updated": "2016-08-20T02:19:45.252-07:00",
  "content": "I'm talking literally about gutters, the rain guides houses need to protect their foundations from sinking into a moist earth.\n\nMy gutters need some work, but not of the kind Jim's company provides, and Jim Thomas was quite up front about that.  We joked about Kirbys, the vacuum cleaners (he owns one, I don't).\n\nAnyway, homeowner talk is one I'm still learning.  Property values, property taxes and yadda yadda.\n\nThe unit right next to mine is about to go bye bye.  The owner was passing literature around to all the neighbors, reassuring us a handsome domicile would replace the bungalow.\n\nI'll have something to photograph, a whole process.  Portland is seeing a lot of demolition / upgrades.  Those in my generation who had kids (we had two), learned about doing that from playing SimCity and [other Sims games](http://controlroom.blogspot.com/2013/01/sim-farm.html).  Properties would upgrade or decay, depending on several parameters.  Quite a fun game.  Plus my dad was an urban planner.  He did a lot of work on Tripoli (Libya) in the 1960s.\n\nI'd gotten confused because the homeowner / neighbor and Ecobest guy showed up back to back, and somehow I'd gotten the impression [the Ecobest folks](http://www.ecobesthi.com/) were involved with the neighbor's demolition and rebuilding project.  Not so.  Their brochure said \"Our Apologies\" for a different reason. \n\nI should jump on [ObamaCare or something](http://worldgame.blogspot.com/2016/08/yakking-about-health-plans.html).  I continued with COBRA after the full time salaried job, getting one dependent and I through the summer, but come September, circumstances will have changed enough that I'll need a new health plan.\n\nMy gutter on the northeast is hanging off the house, not doing its job at all, or maybe a little (not that we're [having any rains](http://mybizmo.blogspot.com/2016/08/heat-wave.html) at the moment).  I should make an appointment or something, or try to hammer it in myself if my ladder is tall enough.  I'll ask [Glenn](http://worldgame.blogspot.com/2006/03/global-matrix-wanderers-meeting.html) what he thinks.\n\nThe Addams Family thing will only take me so far (or is it The Munsters -- I liked that one even more).  The goal of a middle class homeowner like me is to fit in (to stay in the middle, to be the herd animal).  This isn't Grey Gardens (recommended by Melody), a home for the rich and perhaps over-privileged.\n\nGrowing up, I thought maybe the Design Science Revolution was at our door, and it was, but not in exactly the way I'd imagined (surprise, surprise).\n\nI thought maybe I'd be in some Ecovillage by now, with more domes and bubbles, driving a BizMo around for work.\n\nThat was [a worthy dream](http://mybizmo.blogspot.com/2007/04/ecovillage-update-synergeo-33452.html), however these 1905 wooden monsters still have some life in them, and I expect the Ecovillages will still happen, with or without my help. \n\n[](https://www.flickr.com/photos/kirbyurner/28698053200/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}