{
  "id": "1329503367240328717",
  "title": "Hacker Ethics",
  "published": "2008-01-28T11:58:00.000-08:00",
  "updated": "2008-01-28T12:53:32.795-08:00",
  "content": "To some, \"[hacker ethics](http://mail.python.org/pipermail/edu-sig/2008-January/008406.html)\" actually sounds oxymoronic, as they've been raised among bigots or, more likely, have met a lot of unethical types calling themselves \"hackers\" or, more likely still, have heard of such types, maybe seen them on TV, like on some cop show (and maybe they've tried to imitate what they've seen?).As so often happens, the fictionalized version trumps reality by default.  No wonder so many of our students suffer a crisis in confidence at some point, in trying to make the transition from some televised never-never land of dreams, to an actual career path in the real world.  \"What do you mean real doctors aren't like on [House, M.D.](http://www.imdb.com/title/tt0412142/)?\" -- and don't get me started on [Numb3rs](http://www.imdb.com/title/tt0433309/).Why blame the screen writers though?  Their job is to write engaging material, not set the bar on how much reality intrudes.  Audiences have some collective responsibility for setting the standards.  Liberal Vienna was known for its high quality piano parties because of how people could take in the music, not just for how they could pump it out.Ivory Towerites often assist the entertainment industry in projecting lionized (Olympian) screen versions of themselves -- makes the profession look good (or foolish, as some peers will judge), plus maybe helps down the road with recruiting (or backfires, maybe by playing into the hands of spoof artists and yes men).Cops do it, and private eyes, so why not mathematicians?And let's not forget lawyers.  Everybody likes having \"larger than life\" more glamorous versions of themselves out there, even if only in pulp fiction.Anyway, the dumber the audience, the less hard you have to work to get them to suspend their sense of disbelief, i.e. to turn off their reality checking facilities (mainly because they dont' have any worth mentioning).  It's so easy to satisfy the gullible with cheap thrills, and yes, that is how [some geeks](http://worldgame.blogspot.com/2007/06/nightmare-alley-movie-review.html) have made I living, I don't deny it.So if you really think hackers don't have ethics, ask yourself how you came to that conclusion, and especially whether fiction, including science fiction, might have had some role in shaping your views.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}