{
  "id": "6767603650960265164",
  "title": "Hannah Arendt (movie review)",
  "published": "2015-12-24T22:01:00.005-08:00",
  "updated": "2019-08-21T23:31:35.703-07:00",
  "content": "Tara found a nifty wall projector I'd somewhat misplaced (as in lost) and the original plan was to hook that up, renting from Amazon (not my habit).\n\nI'm trying to get out of my box, shake loose old habits.  However, just getting the DVD from the Germany section at Movie Madness proved simple as pie (I also made pie, x2 pumpkin) and we ended up watching [Hannah Arendt](https://www.imdb.com/title/tt1674773/) on the Sony Trinitron, not even an HDTV.  Talk about stuck in a pattern (but one that works!).\n\nBesides, if I'd rented it on Amazon would I get the lengthy extras, including the panel discussion at Deustsches Haus / NYU?  Maybe, I dunno.\n\nHeidegger has been [bubbling up](http://mybizmo.blogspot.com/2015/10/portland-doings.html) in conversation.  I think I'll develop my narrative around Hannah [and Ayn Rand](http://mybizmo.blogspot.com/2011/11/ayn-rand-sense-of-life-movie-review.html) as a kind of dynamic duo.  Checking with Google, I see that's hardly a new idea.  I'm entering a well-plowed field.  Excellent.\n\nI've been chipping away at my own self portrait, the better to fit in as a puzzle piece.  Whereas I make direct ties to Vienna Circle figures (Ludwig Wittgenstein and [Karl Menger](http://controlroom.blogspot.com/2015/12/listserv-posting.html) for example, and lets throw in Jung and Freud), I'm somewhat distant from the Continental line, coming from Princeton, though my thesis adviser, Richard Rorty, did help me to tune in.  [Walter Kaufmann](http://mybizmo.blogspot.com/2008/02/philosophy-101.html) was happy to send Heidegger to the back of the queue, in terms of readings we might choose.  So why not approach those thinkers through leading women instead?\n\nI hadn't realized the Eichmann trial in Israel had occurred on my watch, much less that Hannah was there for the New Yorker.  I was still somewhat oblivious at age two or whatever it was.  By the time of the Kennedy assassinations, I was tracking, and when we got to Nixon's bombing of Cambodia I was fully aware, though still just in middle school.\n\nSo Hannah and I partially overlap on the timeline.\n\nThe movie makers underline the challenge that adds, as many in their audience will, like me, have lived through this period.  Affecting realism is harder when the judge has a practiced eye.  We know what a phone sounded like when ringing.  They got it right.\n\nI think I'll add [Margaret Fuller Ossoli](https://en.wikipedia.org/wiki/Margaret_Fuller) as another thinker here, on assignment for the New York Tribune at one time, then editor of Dial, and [Dora Marsden](https://en.wikipedia.org/wiki/Dora_Marsden), the British \"anarcho-feminist\".  How these dots connect is for later.  The movie got me in the mood to link to thinking women.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}