{
  "id": "8930411982481357095",
  "title": "Hanukkah 2010",
  "published": "2010-12-12T14:10:00.000-08:00",
  "updated": "2010-12-15T19:54:04.890-08:00",
  "content": "We're getting [closer to Judaism](http://worldgame.blogspot.com/2010/09/wanderers-2010914.html) in making Hanukkah our December event after Thanksgiving.We used to throw [a big Solstice Party](http://www.flickr.com/photos/17157315@N00/sets/72157611469130829/with/3129058411/).Dawn didn't proclaim herself Christian, though she was cleared as [a Quaker](http://mybizmo.blogspot.com/2009/08/quakers-101.html), was a member of the Religious Society of Friends through Multnomah Meeting.We enjoy schmoozing with those doing the tree thing in their living rooms, even if we don't do one ourselves.  More ornaments should be polyhedrons.  A virtual tree would do (on the LCD). The scene would keep changing.  [A reverie](http://coffeeshopsnet.blogspot.com/2010/04/smart-bar-lcds.html).I'm somewhat predatory, though appropriately diplomatic when it comes to nuts, eggnog, other winter cheer.  I got a ride in a Cadillac today, to the supermarket.  Our kitchen was somewhat bare again.  Last night I tried boiling vegetables, including some greens and marinated tofu.  Not half bad.  But I do like a box of Coca Krispies now and then, and lots of coffee.The hanukkah gifts were generous.  Soaps and chocolate, socks, stuff we really do use.I grabbed [an Advent Calendar](http://www.flickr.com/photos/17157315@N00/3695572071/) out of the garage awhile back, a wooden one that Dawn hoped we'd use -- she was raised Catholic and recognized the power of rituals.  I set it atop the upright piano, a gift from the Braithwaite family years ago.This time of year, I tend to truck out my \"[Fourth King](http://worldgame.blogspot.com/2009/07/xmas-in-july.html)\" myth, but I haven't thought of anything new to add.  Maybe others will take it on (they weren't Christians either, those kings -- no one was back then).Speaking of Christmas, Sam Lanahan his been like Santa Claus lately, mailing out [his beautiful book](http://mybizmo.blogspot.com/2010/10/art-of-note.html) to a long list of people ([Dave Koski](http://worldgame.blogspot.com/2010/09/buckyball-day.html) was pleased to find his, under a pile of snow on his doorstep, in the midst of a blizzard).Sam is also giving away [free samples](http://www.flextegrity.com/free-samples.php) of the prototype materials.  Customers need only pay shipping.FNB was also distributing some hanukkah \"geld\" (chocolate money) thanks to Satya.  He offered the bag to me but we agreed it was for younger children than mine.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}