{
  "id": "1762932055029310143",
  "title": "Hanukkah / Xmas / Saternalia / Solstice",
  "published": "2011-12-26T16:22:00.002-08:00",
  "updated": "2022-01-09T12:56:47.198-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157628581959457)\n\n:: december, 2011 ::\n\nI'm serious about Saternalia, thinking of \"that of God\" (Quakerese) \nin Roman culture, from the vantage point of Mt. Tabor and the aqueducts \nleading into it.  The architecture looks old English, but echoes still \nolder.\n\nSome District of Columbia wants us to cover them\n over, like with domes. Like Alaskans and Californians, Oregonians don't\n always follow orders from this non-state calling itself a \"district\".  \nCascadia has its own forms of nationalism / bioregionalism.\n\nThe\n Hanukkah party featured little hand crotcheted hats by Alexia's David.  We \ndiscussed various medical conditions and treatments, affecting old and \nyoung among us (each a different case).  Conversation roamed into \ncomedy, that of Louis CK and others.  We exchanged gifts and ate latkas.\n\nXmas itself was a low key affair featuring immersion of the household, especially Tara and I, into living room movie watching:  [Gattaca](http://www.imdb.com/title/tt0119177/), [Alice in Wonderland](http://worldgame.blogspot.com/2011/12/alice-in-wonderland-movie-review.html) (Disney's newest), [Primer](http://www.imdb.com/title/tt0390384/) (twice:  once with director commentary), [The Great Debaters](http://www.imdb.com/title/tt0427309/), [Rocket Science](http://www.imdb.com/title/tt0477078/).\n\nGlenn\n came by Xmas morning and shared the rest of the cinnamon french toast. \n He gave me a set of DIY books for home maintenance.  Nothing about \nbuilding a TV studio per se, but an overlapping skill set for sure.\n\nJen and Melody departed south and north respectively, to rendezvous with their families.\n\nAt intermission, I downloaded Stellarium\n to the laptop and projected the night sky to the south.  Tara and I \nthen stood on our south-facing porch and identified Rigel, Sirius, \nBetelgeuse, Procyon using short term memory. \n\nFor dinner, Tara and I adjourned to the very busy Fujin,\n one of the few restaurants serving, along with Mt. Tabor Cafe.  Earlier\n on Christmas Day we took Sarah Angel to the reservoirs and surveyed the\n city from about half way up.  We'd planned to hike to the top, like the\n Nallys had, but it started to rain.\n\nCousin Mary's visit before Xmas Eve was a highlight.  She regaled us with stories at the Bagdad. \n She and I had Moroccan Coffees (alcoholic) while Tara got the crumble \ndessert (which all sampled).  We discussed our wide ranging family and \nfriends, Tara's college process.\n\nTara couldn't make the\n Solstice Party (nor the boat ride with Barry).  Dawn used to host [a big one](http://mybizmo.blogspot.com/2008/12/more-about-christmas.html), ever since our first \ntaking up residence together on Rhine Street (not far from Aladdin \nTheater).  We'd invite lots of Quakers.  As I was mentioning around \nBurma Night, Dawn would have integrated well into our Food Not Bombs community.  The gathering at Satya's was epic, though I didn't stay long.\n\nThrough\n all of this, I'm putting in my hours along the Python track, making \nsure students stay busy.  They can work on ahead without me, but if I \nkick back for too long I just have that much more to catch up on.  \nStaying up all hours is a theme around here though.\n\nThe\n Blue House is a lot like a submarine, with someone always awake.  We \ndon't \"burn the midnight oil\" so much though -- we only have the furnace\n on a few hours a week.\n\n[](http://www.flickr.com/photos/davebollinger/4204650398/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}