{
  "id": "111109582109714507",
  "title": "Happy St. Patrick's Day!",
  "published": "2005-03-17T13:31:00.000-08:00",
  "updated": "2006-11-15T11:43:43.114-08:00",
  "content": "So I finally got my hypertoon concept implemented in souce code.  Although I published the idea to the web in [1996](http://www.grunch.net/synergetics/hypertoon.html), only recently have my programming skills intersected available technology ([Python](http://www.python.org/) + [VPython](http://vpython.org/))  such that I could write a working prototype.I'll be sharing about it at [Pycon 2005](http://www.python.org/pycon/2005/) next week in DC.  Looking forward to seeing Glenn and his family.Looking ahead to that, I tried the [the app](http://www.4dsolutions.net/ocn/python/hypertoons/) on the family laptop (1.2 Ghz Compaq Presario) and found the results [disappointing](http://groups.yahoo.com/group/synergeo/message/21182).  The family budget is tight (no [Animal Planet](http://animal.discovery.com/) or new fish tank accessories for Tara) -- because dad spends all his time pushing the [Bucky stuff](http://controlroom.blogspot.com/2005/03/consolidation-phase.html), work nobody pays him for (except precessionally, which counts) -- but I couldn't see a way around ordering up a new (refurbished) laptop. Like, I've got this 3 hour teaching gig for some big GIS corporation (ESRI) the day after my return, and this Presario keeps overheating and cutting out. That just won't do.Trying to get used to the new haircut. Jennifer had a lot of time to trim away, going for the perfect cut. My head feels pounds lighter. She wrote a bunch of \"must see\" movies on a biz card (she's another Netflix fan, knows a lot about movies, and [Pink Floyd](http://worldgame.blogspot.com/2005/01/dark-side.html) too).On Tuesday, Matt (speaking of Irish) took the day off to finally get a home computer (his first ever). I helped him pick it out (iMac) and get it connected through Comcast -- the test was to get Amy Goodman on RealPlayer (we passed the test).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}