{
  "id": "3201479557390473078",
  "title": "Headless Nations",
  "published": "2024-11-18T05:43:00.002-08:00",
  "updated": "2024-11-19T22:14:02.580-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh8XQSMhm25Kh0efS5XZEbaLhCaPNIesEXxiMISZjoOxoVXYY7otDp64_yukGRXssUPKjgCzyaDKqtdryjvZuf6STZHpeMLWbVMlE_AaN-oxxig4xPMMr-lNdi15OV3oS1uAozSaHxeTHEt3fqXd-0ltLyOtEw-4881Q5SuT4oTZBfUYasPGXaX/s1607/IMG_0358.jpeg)Excuse me? Who are you calling “headless” in this picture?\nToday’s YouTube thumbnails are saying “Joe Biden” and or “the US” is giving the green light to this or that, through the New York Times. Clearly someone is feeling authorized to make stuff happen, as the Davos crowd seems to be surging in a particular direction. \n\nYet public attention has been elsewhere, possibly making this feel like a window of opportunity to these political actors.\n\nHow all this lashing out is supposed to advance US interests is hard to decipher. One presumes some last grasper is hoping to express manhood or otherwise address a perceived failing. Everyone knows there’s no “commander in chief” at the helm and that we’re running on reflexes. \n\nWe’re back to the usual fun game of headless chicken.\n\nHow is the world to deal with zombie juggernauts? \n\nMy Silicon Forest is far away from The District and has its own circuitry. We do microchip fab a lot, with Intel here, in Hanoi, in New Mexico. We’re not “Atlanticists” here on the Pacific Rim, somewhat by definition. \n\nWe haven’t green lighted anything from here. \n\nThe Empire attacked us with storm troopers ala Star Wars not that long ago. We continue to flaunt federal restrictions on controlled substances and sometimes break the human trafficking laws, by providing asylum.\n\nAnyway, there’s no danger of me saying “we” when it comes to whoever is doing the signaling with those green lights. We’ve known since Reagan that the deep state is all about working around Congress and carrying out business plots regardless of whatever “oversight” the so-called government attempts to exercise. Evidence: the Nord Stream extrajudicial special military operation.\n\nPeople still talk about the Constitution a lot and brand themselves as defenders thereof, but I don’t see where Congress gets to seriously debate anything anymore. We see orchestrated symbolic votes but not actual discussion. The whole debate process has been privatized. \n\nThe executive branch simply executes, disconnected from any legislative controls. And yet they claim we have a system governed by laws, not egos. In these circumstances, some see it as their duty to disobey.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}