{
  "id": "5357608779189793585",
  "title": "Head Banging in Private",
  "published": "2015-07-07T11:42:00.000-07:00",
  "updated": "2015-07-07T11:50:12.710-07:00",
  "content": "That sounds like a bad thing, that \"head banging\" and indeed I'm speaking only metaphorically, as when one debugs computer programs and finds it slow going sometimes.  There's the sense of a frustrating uphill battle.  This is called \"head banging\" sometimes, symbolic of frustration.\n\nWhat helps with head banging a lot is no, not aspirin, but relevant and useful feedback.  One needs some surface to push against, to gain traction.  What I like [about REPL](http://mathforum.org/kb/message.jspa?messageID=9726165) i.e. a computer command line that \"talks back\" is one has the ability to practice, to head bang, in response to feedback, without delaying another human i.e. without inviting scrutiny, auditing, supervision etc.\n\nPut another way, it's gratifying to learn to program against a machine, like a chess playing machine, that is non-judgmental i.e. is not seen as a source of projections or fantasies.  People do not worry, as [in Ex Machina](http://mybizmo.blogspot.com/2015/06/ex-machina-movie-review.html), if they're being \"used\" by the shell program.  They understand how it works, down to the metal, and are not about to imagine they're talking to a ghost, as it were.\n\nIn saying all this, I am not meaning to short circuit difficult debates involving Turing Tests and so on, i.e. celebrating the efficiency of REPL when learning programming, is not tantamount to saying Ex Machina (a science fiction movie) does not present us with problems, most especially the machine-like determinism in the humans just as much (what was so important about materials again? -- the same question as in AI).\n\nI'm more using for contrast the archetypal one room school house with a bunch of mixed-ability mix-of-interests kids.  The teacher pauses for a student to \"get it\" e.g. work it out on the board, in front of spectators.\n\nThat may be a fun and useful exercise and I'm not denigrating classroom practices that feature that (nor ignoring the possibility for traumatizing i.e. classrooms feature in many nightmares), I'm only saying many are grateful for alternatives, such as the ability to engage an interpreter in prolonged battles of wits, during which the rules of the language one is learning become ever more clear.  And during which interval one does not feel under scrutiny or judged.  One is not \"in front of the classroom\".  Teachers like that too, appreciate respite, R&R.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}