{
  "id": "298700518628848542",
  "title": "Heat Wave",
  "published": "2016-08-15T18:47:00.001-07:00",
  "updated": "2016-08-17T20:25:28.088-07:00",
  "content": "I waited at the bus stop awaiting a Tri-Met bus 4, ticket already purchased, heading to Monday night [Flying Circus](http://controlroom.blogspot.com/2016/08/accelerator-project-continued.html).\n\nI was brimming with stuff to share about, regarding Measure 97, [Raspberry Pi](http://worldgame.blogspot.com/2016/08/vml-verboten-math-lab.html) and whatever. \n\nI'm pro M97:  [https://t.co/PWt2qEWBTq](https://t.co/PWt2qEWBTq)\n— Kirby Urner (@4DsolutionsPDX) [August 15, 2016](https://twitter.com/4DsolutionsPDX/status/765301264544468992)\n\nHowever the bus didn't come and didn't come and we're having a heat wave.  I'm built for colder climes and started to sweat a lot.\n\n\"Poor Barry [our real python] needs a mouse\" I was thinking.  I then decided to abort and visit the mouse store.\n\nGetting the Chinese for \"tetrahedron\" the better to explain \"isotropic vector matrix\" was on my plate earlier, when the M97 people called, about a lawn sign etc.  I'm glad we're coordinating.\n\nThese Chinese interactions were tweets, [not hard to find](http://controlroom.blogspot.com/2016/08/martian-math-in-chinese.html).\n\nSince I'm back from these errands now (e.g. the mouse store), I'm able to watch the evening news show (CBS) about the flooding in Louisiana and fires in California.\n\nTerrible flooding in the Deep South.\n\nThe winds are blowing embers into buildings, destroying whole towns in California.\n\nTrump is [softening on NATO](http://4dsolutions.net/mycartoons/cartoon4.html).  Was that the Bernie wing burning up?\n\nWill he embrace TPP next?\n\nThese were my queries, not the news show's.\n\nDoes our National Guard have more rescuers to spare this year?\n\nSome have seen service far from home, several tours, in the Islamic State (formerly Iraq), near Persia, in \"Messy Potamia\".\n\nHorrible crimes, in Chicago, the city of my birth.  Sudden Infant Death Syndrome (SIDS) -- how to prevent.\n\nNo other cases of Zika have been reported \"in any other state\" besides Florida.  Deliberate wording.\n\nWe bleep over Puerto Rico with over 10K cases, State of Emergency declared -- not a state, more like District of Columbia, more on Facebook.\n\nNothing about the Quantum Science Satellite, launched from China earlier today, nor about India's 70th [independence day](http://www.ibtimes.co.uk/india-celebrates-70-years-independence-15-august-2016-heres-history-significance-day-1575698) celebrations.\n\nOne needs to pick and choose from a blizzard of stories. \n\nLong story... I suggest Muhammad Ali and his story as core curriculum, great guy, stood up for principles. [https://t.co/drwfWhFn11](https://t.co/drwfWhFn11)\n— Kirby Urner (@4DsolutionsPDX) [August 15, 2016](https://twitter.com/4DsolutionsPDX/status/765290841426399232)\n\n[](https://www.flickr.com/photos/kirbyurner/28878875112/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}