{
  "id": "915145999093425527",
  "title": "Hectic Day",
  "published": "2018-04-17T20:21:00.004-07:00",
  "updated": "2018-04-17T21:12:48.651-07:00",
  "content": "Although I made a token appearance at Wanderers tonight, I didn't have much energy for conversation, and left early, seeking cheap caffeine, which I have at my place.\n\nThis was marathon [psychotherapy day](http://worldgame.blogspot.com/2018/04/more-therapy-needed.html) with H&R Block, only to find out that the USPO had changed pickup times at Fred Meyers.  Only yesterday, April 16, the day before the tax rush.\n\nFortunately, I had an afternoon gig in Clackamas County.  Unfortunately, the detour to Fred Meyers cost me valuable minutes and a few kids gave up on me and went home as usual.  I'll be there extra early next time.  One of those schools where if you show up when the bell rings, you have no way of parking.  My first day in Happy Valley (that's not the name of the school).\n\nAfter an hour with the kids sharing MIT Scratch, a favorite of Portland Public Schools (I'm private sector), I used the maps app to find the nearest post office.  The thing is:  these were amended returns and it's especially true that the State of Oregon freezes whatever you claimed on this date.  I had a few dollars in savings, which, to me, actually means something.\n\nI sent checks with both returns and have Trimet queued.  I just need to wait for a couple invoices to clear.  In the meantime, I have overdraft protection.\n\nIt's all going through the motions for me, as it hurts to face extortion by organized crime, which is how it feels when an executive at some far off desk job chooses the most reckless course possible, thinking people buy the farcical \"reality TV\" they're pumping out to us.\n\nYou know how it is.  My family tried to live overseas as much as possible to avoid propping up the military junta, as we might as well say in the open now. The facts are on the table.  I've lived under martial law before.\n\nYou don't need to declare war to have war.  That's a lesson these latter day executives have taken to heart.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}