{
  "id": "2564522623815674645",
  "title": "Hello Blogosphere",
  "published": "2019-03-01T21:55:00.001-08:00",
  "updated": "2019-03-01T22:54:01.158-08:00",
  "content": "Does anyone still call it that, the \"blogosphere\" I mean?  [Wikipedia has an entry](https://en.wikipedia.org/wiki/Blogosphere).  We wouldn't call the term \"dated\" yet would we?  The notion of \"blog\" itself is pretty recent, and bloggers still abound.\n\nAnyway, I like how the term has \"spheric\" in it, which describes \"a land without borders\" as in \"never coming to the edge\".  A world that abruptly ended, at some cliff or river, would be not a sphere in that sense.  A sphere lets you stumble every which way, and still be on it.\n\nSpeaking of stumbling around the planet, I read and watched about the summit meeting in Hanoi, twixt the DC civilian team and DPRK.  I was happy enough with some side results to not be especially disappointed with a holding status quo.  Part of how nation-states establish their longevity is by moving at a glacial pace.  Be the hour hand.  Live forever.\n\nDeeper things are going on in Korea that outsiders will appreciate, is what I'm thinking.  What Americans think and do about Korea is not what matters, or at least that's how it should be.  Americans should feel so relieved when the weight of the world is finally off their shoulders.\n\nIs it because Plymouth Rock was all about Puritans, or for other reasons, that Americans are so prudish?  We burn through presidents on the basis of their peccadilloes quite a lot in seems to me.  The home folks want morality plays, another term for soap opera.\n\nCongress is seeing new potential there, in hold highly televised hearings.  Are we finally getting somewhere, in terms of stirring voters out of their apathy?  The Kavanaugh hearings were like a pilot.\n\nI understand:  the heroic partisans aren't really that offended by what's outwardly touted as the sin, but the less superficial reasons can't be prosecuted.  We keep it shallow on purpose and so on.  Didn't people vote for a playboy, a Hugh Hefner type?  That was a way to reassert a kind of male dominant prowess no?  Hawkish Hillary wasn't that different in some ways.\n\nForgive me if I get bored.  I'm just thinking we could have a lot funner planet with different screenwriting.  I didn't really like soap operas either.\n\nThey say it's not really about sex outside of marriage (with Clinton either, or with Kennedys), but the lying.  I've grown up with presidents lying all my life.  It's what they do.  So?  Goes with the territory.\n\nProhibition is and was interesting.  When government aims to be \"secular\" that's a way of saying the different ethnicities can regulate \"what's moral\" to some degree, that's not our business.  If your religion says it's OK to drink alcohol, then go for it -- as long as you're not a legal minor.\n\nBut this hands off attitude only goes so far, as we've seen, and the boundaries keep changing.\n\nSecularism includes the idea of rules, and therefore of breaking them.  But does one follow rules to be \"good\"?  Does one play chess for the halo?\n\nMarriage is a secular institution as well as a religious one.\n\nSpeaking of which (screenwriting), Patrick was full of great ideas today, regarding how Truckers for Peace (an academic program) might model itself after massage therapists who do the same thing (swap jobs and places to stay).\n\nWhich reminds me, I thought a genius piece of the Standard est Training was the \"needs a ride or place to stay\" segment.\n\nUh oh, I'm likely to veer into Scientology next.  Talk about segues.\n\nRight when the Academy Awards were on, it turned out later, I was back in the old feud between the British BBC guy and the various factions of this powerful church, catching up on the movies (genre: documentary, expose).\n\nYou've gotta admit, it's a pretty gripping drama with all the elements, including families split down the middle, at the highest levels.\n\nWhen will someone run for US president with Scientologist on their resume?\n\nMy rude and crude Youtubes (I'm proud of some of them) keep me cycling through the Virus Meme, somewhat by design.  I'll do another Medium story on that maybe.\n\nI've been contributing more Youtubes (U2oobs) to the meme pool.  I mentioned some recent ones [on edu-sig](https://mail.python.org/pipermail/edu-sig/2019-March/012067.html).  I collect them [here](http://worldgame.blogspot.com/2019/02/viral-videos.html) and there in my blogs.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}