{
  "id": "7326052260286847755",
  "title": "High Bandwidth Brainwashing",
  "published": "2020-10-10T11:12:00.005-07:00",
  "updated": "2020-10-12T13:49:38.608-07:00",
  "content": "Back in the early days of the internet, I used to campaign for [higher bandwidth formats](https://controlroom.blogspot.com/2006/02/boosting-bandwidth.html). Sometimes what's hard about school is not that the teacher is going too fast.  The teaching is meted out at an agonizingly slow rate, aimed to last about twelve years. The teacher is under no obligation to keep pace with students.  It's a one way street.  Stay with the pace of the teacher or get singled out as too slow or too fast.As expected, with the sudden tsunami of alternative channels, those wanting the higher bandwidths could produce and consume at their chosen frequency.  It's not like a given student always consumes at the same rate.  Per Evelyn Wood Reading Dynamics, one adjusts to match the content.  Other reading comprehension strategies pertain.  I scored 790 with my best combined SAT scores.  Both times I was consistently high on both scales.  Add that I'm living in the Philippines and I'm easily interesting material, for whatever student body a recruiter might be building that year.However all of the above doesn't mean I adore brain teasers and crossword puzzles. Nor do I esteem myself as a master of trivia.  My Go skills suck, Golang whatever.  However I enjoy movies and lectures about what I'm not good at.  Where I'm low performing, I look for complementary instructors and entertainers.Of course we say \"brainwashing\" is bad, because what's implied is an involuntary reprogramming. However when studying or cramming, wanting to get good at something fast, we actively seek out effective shortcut or time-saving techniques. If the connotation is \"I'm brainwashing myself, with stuff I really need to know\" then the innocuous meaning is you're seeking like a PhD in something.  We all wish for the magic pill that gives us Spanish, or Devanagari or whatever.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}