{
  "id": "6073451946617288164",
  "title": "Hiking Trail",
  "published": "2018-10-27T15:32:00.001-07:00",
  "updated": "2018-10-27T15:41:32.957-07:00",
  "content": "I recommend the Ezra Pound Trail into this thicket, or wilderness, and not because I'm expert in that country.  I just did another saunter and realized how little I'd explored before.\n\nIn a nutshell, right when we're discovering another Unabomber (FBI doing what it does best), and cogitating on how mental illness warps politics, I'm looking at the case of Ezra Pound.\n\nEzra was amazingly active, including politically, and saw himself as a change agent, helping to free his home country from crass tastes dictated by money.  He would reach them by true craft.\n\nHowever, his hatred of the bankers behind the US side in the World Wars (1900s), because of how he saw things, had gotten him added to Hoover's \"most wanted fugitive\" list.  He was living in Italy.  When they caught him, they caged him, which would drive anyone crazy.\n\nWhen Ezra was shipped back to DC to stand trial, he got to avoid the noose by pleading insanity instead.  He spent the next ten years penned up in an institution.\n\nConservatives sided with Ezra, not because of his Fascism so much as his lifelong commitment to freely speaking his mind.  He was the hallmark individual in the showcase of Individualism, which casts itself against the Borg, the hivemind, the groupthink attendant upon any Cult of Personality (these are the dragons we individuals must fight).\n\nRight when he's in the middle of being committed and/or executed (the case is hotly debated in the rabid press), the Library of Congress decides he's a true American genius.\n\nLondoners thought so too (he'd been living there a lot).  Ezra was admired around the world and friend of many a literary figure, from Robert Frost to T.S. Eliot.\n\nThe literati of that day wished Ezra to be spared the DOJ's wrath, and even the dimmest of wits could appreciate the bad light the \"freedom champions\" might be in, if they inanely gave the death penalty to one of their most celebrated rock stars.\n\nThis epic saga resonates so well in the current political climate that I'm surprised we're not seeing the movie already.  Hey, Hollywood!  Over here!  Start with The Pound Era for more context?  Who might we cast as Ezra?  Gump?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}