{
  "id": "115497154509013952",
  "title": "Hiroshima Day",
  "published": "2006-08-07T11:50:00.000-07:00",
  "updated": "2011-08-07T19:04:15.280-07:00",
  "content": "Portlanders traditionally gather on August 6th (mas o men0) to renew their commitment to fight against those who'd bring nuclear weapons into reality.  Whether used or not, it's the intent behind them that exudes low living standards and foments mental squalor.Soulless zombie wombat corporations (only fictitiously human) feed on those still living, sapping their strength and intelligence, perpetuating obsolete and irrelevant reflex-conditioning (jerky puppets, \"Pinocchio syndrome\").I was doing BBQ this evening, on Kim & Jimmy's new rig (I helped them assemble it), but first drove Carol (Mom) to the event, at Waterfront Park, and got a full report afterwards (from [Maureen](http://worldgame.blogspot.com/2005/02/methodist-morning.html) as well).Apparently Bucky Fuller's idea of \"final exam time\" was used to frame the main speaker's speech (Maureen:  \"he's a medical doctor\").  Several hundred people turned out.  The City forgot to turn off its sprinkler system, which came on towards the end of the event, but spirits were not dampened thereby, thanks to taiko drummers and company.I've been on the phone with brother Sam this morning.  Apparently Bud is willing to help back our bizmo concept from his HQS in Florida.  Also, friend Kathleen sent this [helpful picture](http://tinyurl.com/pw2cm).  We're definitely cookin' with gas.Also in celebration of our livingry-based global culture, I bought a used 60 gig iPod complete with iDog and extra speakers on eBay (shipper in Indiana).  August 6 is a time to think ahead to a promising future, as well as to celebrate our escape from the wrong thinking of the past.We also watched the pilot of [The 4400](http://www.imdb.com/title/tt0389564/) (on loan from Elizabeth) and some Popeye cartoons from the mid 1950s, including [Parlez Vous Woo](http://www.imdb.com/title/tt0151908/) (speaking of wrong thinking see pg. 111 of Todd Schorr's Dreamland, Last Gasp Press, ISBN 0-86719-589-4).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}