{
  "id": "9217523513821199163",
  "title": "Hominid Diaries",
  "published": "2016-04-14T23:14:00.004-07:00",
  "updated": "2016-04-24T12:10:30.893-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/26412210136/in/dateposted-public/)\n\nIan Tattersall sees a pendulum swinging in paleo-anthropology.  Darwin was peculiarly distant from the actual human fossil record so far assembled in his own time.  A new and challenging specimen apparently made it into his hands.  He wrote about it in a letter, but it's nowhere mentioned in Descent of Man.\n\nPerhaps we forget how radical his thinking seemed at the time?  He was unwilling to stick his neck out much further, in an area so sensitive?  Old bones went to anatomists for examination, not to this new kind of dirt-digging, Galapagos-visiting geek.\n\nThe pendulum went towards an excess of invented species after that, multiplying without much rhyme or reason in the creative writings of many a chronologist.\n\nThen swung back, to where we had maybe only the one track, with three successive phases (Sapiens the third). \n\nThe picture these days is settling down to something in between and more complex.  Many lineages of hominids come and go.  Nature always seems to have a next hominid up her sleeve, starting at least three million years ago.\n\nThe success of the Sapiens, in terms of sheer numbers, but also degree of tool use, is of course entirely unprecedented on Planet Earth and should not be used as our guide to the past.  In geological time, this phenomenon has just started, and marks the start of a new chapter.\n\nLet us not project ourselves and our patterns too forcefully upon our ancestors, was Tattersall's cautionary message.  Projecting back to Darwin's time is hard enough, and for then we have decipherable symbols (actual history we can dig up).\n\nHe doesn't think we have evidence of symbolic processing until 40K to 70K years ago, even though the physical architecture of Homo Sapiens had been in place well before that.\n\nThe hardware was there, but Humanity 1.0, the software, came later, mesh-networking we Sapiens into a platform, a noosphere, a cloud.  By 40K years ago, Southeast Asia had its symbol-using Sapiens.  They were starting to show up everywhere by then.\n\nTurnover in tools, language being a tool, does not correspond to speciation.  A new species will continue making a previous specie's tools.  Dramatic changes in tool-making techniques do occur in the archeological record, but not in some simple correspondence with the type of hominid behind them.\n\nNeanderthals made beautiful tools, but were they thinking with symbols?  That's dubious.  Which is not to say they were unsuccessful or unworthy in any way.\n\nWe could say the jury is still out on whether symbolic reasoning was such a great innovation, if species longevity is to be the measure.\n\nAnyway, why be so judgemental?  Is it because Genesis has God seeing things as pretty good at the end of each day, that we presume Judgement is the whole point, of what's to be the Last Day as well?\n\nCould having Good Judgement be more a matter of having Good Taste?  Around the time of Noah (The Flood) we're to understand God was getting a bad aftertaste from Humanity and had decided to snuff it out.  His sense of taste had been offended.  We weren't the right kind of hominid.\n\nGod's ambivalence towards Creation seems on display in Noah's day, with the rainbow an eternal promise to not give up again.  Next time He'd try an even more drastic measure, and send his only Son (the Christian story line) -- this lecture was in a church after all, but this is just me thinking, i.e. I'm not relaying Tattersall's rap at this point.\n\nIn any case, we needn't look for language and Sapiens to emerge in the same moment.  Any theory premised on the notion that such a moment must have occurred (suddenly, a new species of language-wielding hominid burst upon the scene) is perhaps over-indulging in science fiction, with an emphasis on the fictional part.\n\nOn the contrary, cultural ontogenesis seems to have no simple basis in physiology, though we may trace the arc of brain growth to trading away the protection of the trees, for the cooperative hunting and gathering model of the open savanna.  But that's not the saga of just one lineage, plus its closer to an hypothesis than an explanation of anything.\n\nWhen did fire come on the scene and wouldn't that have added to brain power, by some natural selection process?\n\nNobody knows for sure, as the fossil record is mostly silent about the use of fire.\n\nDuring the excellent catered dinner afterwards (salmon!), in the church basement, I asked him about the new finds in the deep crevices and limestone caves of Southern Africa.  He was well aware of the findings and praised the finder for adopting a more open source approach, more reminiscent of what \"real science\" used to mean (versus sitting on one's stash for cash).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}