{
  "id": "112924561539219714",
  "title": "Hotel Oregon",
  "published": "2005-10-13T17:19:00.000-07:00",
  "updated": "2009-08-27T23:27:23.348-07:00",
  "content": "Dawn and I did a retreat at Hotel Oregon recently. That's in the small town of McMinnville, in the heart of some wider sprawl engineered by a freeway- and mall-minded culture. We stayed in the first manager's bedroom, Tom White's. Yes, another Mason, like many departed in [McMenemin's world](http://www.mcmenamins.com/).  We learned of more Masons at the Grand Lodge in Forest Grove on another visit.Then we visited the Spruce Goose and friends, at [Evergreen Aviation](http://wweek.com/editorial/3315/8562/). Our tour guide and former F4 pilot was none too pleased his bombing mission got canceled that day Hanoi Jane was in town. Fonda's visit recalls the early days after WWII, when the OSS thought Ho'd be a fine leader of a Jeffersonian democracy (Ho thought so too) if only the French empire would pull back, which it eventually started doing (Japan's empire had already been pushed back, thanks in part to this new US-Vietnamese alliance).Then LAWCAP (e.g. Dulles & Dulles) decided to rebalance the powers by joining forces with former enemies Germany and Japan, now vanquished and ripe for rebuilding (see JFK by Col. L. Fletcher Prouty). In Vietnam, the \"quiet Americans\" ([Capitalism's Invisible Army](http://mathforum.org/kb/message.jspa?messageID=6182753&tstart=0#reply-tree)) started taking over, to fight an Evil Empire. Thus began WWIII, or the Cold War as they called it, in which many more millions would die, especially in Southeast Asia. That was before the Grunch came along (e.g. Fuller & Co.) and another rebalancing.Evergreen also has an SR-71 Blackbird [spy plane](http://wweek.com/editorial/3315/8562/), which could read license plates and sense where the bodies of migrant farm workers were buried in California. Very cool. Its competition, [the U \"shot down\" 2](http://worldgame.blogspot.com/2009/02/u2.html), is still in service, exposing miles of film to targets of interest.I especially recommend the Hotel Oregon's rooftop pub and restaurant (we took the stairs, but there's an elevator somewhere). Park in the 2-story garage opposite the police station on 5th. And be sure to check out the [Mack Theater](http://www.macktheater.com/history/) directly across 3rd street to see what's showing. Dawn and I saw [Junebug](http://www.imdb.com/title/tt0418773/).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}