{
  "id": "3661433556921277015",
  "title": "HP:  Half Blood Prince (movie review)",
  "published": "2009-07-20T21:03:00.000-07:00",
  "updated": "2009-07-21T21:22:40.722-07:00",
  "content": "We piled into the car for this one, the girls going for a 2nd time, mom and I first timers for this one, though [HP veterans of sorts](http://mybizmo.blogspot.com/2005/12/harry-potter-gof-movie-review.html), plus I recall reading at least one of the books maybe.  I parked [my Razz](http://mybizmo.blogspot.com/2006/07/deq.html) @ Lloyd Center outside, from where Robin [got stolen](http://worldgame.blogspot.com/2009/07/tinkerbell-swiped.html).We're deep into teenhood at this point (and in the thick of a plot that's hard to follow if you haven't been) all concerned about drugs and [the opposite sex](http://mybizmo.blogspot.com/2008/01/gender-studies-2-of-2.html), [personality trajectories](http://mybizmo.blogspot.com/2007/08/hp-v-movie-review.html).  On [Sean's Wittgenstein list](http://worldgame.blogspot.com/2009/07/wanderers-2009715.html), I call it \"a namespace\" as in \"Next up:  Harry Potter (gonna pile in the car with the family and revisit that namespace).  Tara and I [both Slytherin](http://mybizmo.blogspot.com/2006/03/wittgenstein-for-dummies.html).\"  We're also into role modeling inter-generational relations. Like Dumbledore gets to pry into Harry's sex life (not much to see), wink about that Jamaican muggle in the opening scene (hey, I liked her too, thought this movie might really be going places (poor Potter, just has to go with the flow, hoping for strokes of good fortune, something more than a dismal diet of death eaters (wow, luck in a bottle! (but that might've been a placebo?)))).There's more talk of \"the loo\" (even wizards have to go), including a fight scene in one amidst urinals (a place to compare wanding skills).  Adults let their hair down more, booze it up without apology, confess to infirmities, though [Dumbledumb](http://controlroom.blogspot.com/2008/05/prince-caspian-movie-review.html) is still very clever and brave, wants Harry to know this.For the most part there's plenty of respect in both directions, across generational lines.Notably absent are wholesome same-sex infatuations, though males do sit in bed together, grab at one another.  A lot of the time they just fight and break things, more like British soccer fans. The XXs are all predictably fixating on and/or competing for XYs, include no one like Willow, ironically more of a real witch, but then [that's Sunnydale for ya](http://worldgame.blogspot.com/2005/12/more-tv-talk.html), lightyears ahead of ol' Hogwarts in some ways, as Giles could tell ya.Of course you could read something namby pamby into those suppressed memories of Tom Riddle, potentially ruinous.  He seems into especially dark research with his \"you're not like the other profs\" pick up line.  We shouldn't fixate on him except in small doses as he's guaranteed to make ya [grow up twisted](http://worldgame.blogspot.com/2004/12/team-america-world-police-movie-review_04.html), like that unhappily married Malfoy character.Back to the Wittgenstein list, and fading out with a plug for my own readings and writings (a kind of syllabus):So, I'm just back from the latest Harry Potter, which is all about an inner circle shamanic elite that gets to do drugs, with adult supervision, even sometimes slips them to others (dangerous) -- lots of poisons in play.For more serious connected literature, check Walking with Nobby, chronicling conversations with Norman O. Brown, one of my favorite thinkers who cites both Wittgenstein and Bucky Fuller in quite a few places.  That's a good intersection for me too, one I used [sic] around Pycon this year, per this blog post for example:[http://controlroom.blogspot.com/2009/03/airplane-reading.html](http://controlroom.blogspot.com/2009/03/airplane-reading.html)(and don't forget the 57 minutes of me lecturing, plus another 6 or so if you track down the stash of talks on Blip TV -- gives a sense of what my tribe is like).I came to NOB's Love's Body through Ernest Becker's Denial of Death (which Woody Allen plugs in Annie Hall).  I think this literature is a good entre to Wittgenstein, as it's all about \"meaning and bandwidth\" which connects to \"waxing and waning\" of one's logical world, in an ethical dimension.  \"The wages of sin is narrowing meaning\" might be a way to summarize Nobby's view (though he was distancing himself more from Christian imagery towards the end there).Mom found it hard to understand much of the dialog, even with the hearing aid, given the thick accents all round.  Also, I was reminded why it's good being part of an audience sharing a theater:  you get all those titters, chuckles and guffaws i.e. it's not a [made-for-TV \"ghost audience\"](http://mybizmo.blogspot.com/2007/04/about-earthala-tv.html) in some idiot box.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}