{
  "id": "880063343670811777",
  "title": "Hunger Project on Synergeo",
  "published": "2010-06-21T20:09:00.000-07:00",
  "updated": "2011-01-11T00:36:57.411-08:00",
  "content": "Per Diet for a Small Planet, if you want to feed more humans a healthy diet, you need to not run so much feed through cattle on their way to the dinner plate. Bucky ate a lot of steak, and spinach. Some people crave meat. I'm not saying to not be a meat craver. But if you're not one, and not a smoker, then why start? Eat lower on the food chain if you can afford to. You will be popular and score lots of dates (if that matters to you).The word on the street [in Havana](http://groups.yahoo.com/group/synergeo/message/63563) should not surprise you: no McDonalds and no Burger King. How about Ben and Jerry's, in the [Unilever portfolio](http://www.flickr.com/photos/17157315@N00/5098052415/)? That might be different, in terms of floating the decor and best product (minus any notion of \"corporate personhood\" of course -- that stays within USA borders, where they seem to know what it means (the Supreme Court does at least, right?)). No, I'm not suggesting a \"cigar flavored\" ice cream.Getting the concentric hierarchy as an OLPC app is at least as important as the iPad / iPhone and other versions. I've got it on iPod, podcast downloadable (see [Synergetics on the Web](http://www.grunch.net/synergetics/)).Around here, we're close to zero meat, except mom is a meat craver sometimes, and we don't blame her. Actually, we all eat some meat, given the opportunity. But when we buy, it's usually more like rice and beans. As a \"radmath\" house in the Pauling Campus network (one of several), we have plans for rain barrels, solar panels and such, right down to the trim color.That's what home economics class is all about, whether offered at a book store, Washington School or wherever.What we don't have is a huge budget as Havana is poor. Showcase homes, with appliances by Google (control panel connected to house meter), other sponsors, are not out of the question, once the embargo against Bucky is lifted against the United States (there's a ring of oil companies trying to fence her in, other obnoxicists).Where there's excess food available, there's no excuse for people not having food. Where there's no excess, there's a transportation problem or a transit problem, or the potential for more farming. Portland's neighborhoods maybe don't have the vegetables Havana's do, but there's lots of emphasis on urbanites doing some of their own food raising. Chickens are permitted etc. I don't actually know all the rules (just that we're well within them).For how long this ban on high fat fast food? Fast Food Nation is a popular film in Cuba they tell me, as it provides [a fairly bleak analysis](http://controlroom.blogspot.com/2006/11/fast-food-nation-movie-review.html) of the North American \"paradiso\". Lets not say I'm the expert. Couldn't tell ya. Maybe a long time, as tourists want and expect that \"commercial free\" atmosphere, something they can't get at home, and often crave with a vengeance. Keeping Cuba pretty commercial free might just be the ticket. That doesn't mean no interesting work. S3 cartoons require lots of computers and studio time, maybe in cahoots with University of Toronto?Kirby",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}