{
  "id": "6609960424074940655",
  "title": "Idiocracy Two",
  "published": "2016-07-30T23:59:00.002-07:00",
  "updated": "2016-08-02T15:01:37.517-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/28634406056/in/dateposted-public/)\n\nOne of the reasons people treasure Portland is the quality of the drinking water.  However, a Federal mandate dictating that municipalities go to covered systems, ending above ground practices, is driving the health of this water system closer to average, in the direction of Flint.\n\nUnderground cisterns have a host of problems, starting with the absence of sunlight and its ability to break down various germs.  Then there's radon...  Hey, read the articles.\n\nFor Portland, it's a PR disaster, as the city has never adequately explained why it is slitting its own throat in this way.  The existing gravity-powered system of aqueducts was a feat of engineering beyond the abilities of today's engineers.\n\nHowever, clearly the healthy water we've been enjoying was not sufficient to prevent the pandemic of idiocy that has swept the rest of the country.  Portland is joining the rest of the Lower48 in its perfectly dumb-ass behavior.\n\nThat means less reason to move here, which means lower property taxes.  I already know several cases of people giving up on Portland, now that it has become this dumb.  At least we know why:  turns out the schools have been serving lead in the water, probably for decades.\n\nPortland is actually spending big bucks to dismantle its legendary water system and replace it with something more substandard.  Why this is smart has never been explained.  [Some citizens](http://mybizmo.blogspot.com/2015/10/portland-doings.html) have raised questions but where there's money to be made, that's sometimes the only answer. \n\n[](https://www.flickr.com/photos/kirbyurner/28440530060/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}