{
  "id": "4897329277398078788",
  "title": "if Universe == \"__main__\":",
  "published": "2015-03-20T21:30:00.002-07:00",
  "updated": "2015-03-20T21:57:01.470-07:00",
  "content": "My title is Python jargon, where usually we'd put __name__ in place of Universe, meaning the name of \"this module\", which, when running top level, not imported, gets the string literal value of \"__main__\" for its value.  The Python interpreter tags a single module as \"it\", per process. with other modules brought aboard as additional cast members.\n\nBucky Fuller's Synergetics is designed with one Universe to call one's own, as in one's namespace or \"world\" as Viennese philosophers were prone to call it, around Wittgenstein's day.  Universe comes with chatter, commentary, verbal discourse.  Don't just picture the Grand Canyon in silence, sans narrator.  Universe oft contains someone with an opinion as well as a point of view.\n\n\"Partially overlapping Scenario Universe\" was / is one of the stock phrases in that magnum opus, wherein we're represented as inter-subjective dharma tubes, rubbing up against one another, twisting past and/or sometimes convergent in various ways.  There's a difference between \"coasting along with\" (fellow traveler) and \"falling in with\" as perhaps a partner in crime (\"crunchy Grunchy\").\n\n\"Non-unitarily conceptual\" is another stock qualifier in Synergetics, in that there's no one frame that is this Universe as some singular object or private sky.\n\nOne has the \"__main__\" namespace, which you may import, say from within timeit(), as in \"from __main__ import write_it\" just before its called, plus one has any number of imported namespaces, not built-in and not even necessarily native.\n\nYou'll be bringing a lot of namespaces on board per the constructivist model, in an endeavor to \"construct your own reality\" (good luck with that).\n\nThe Python Standard Library uses business English, fairly global by the 1990s, however 3rd party modules need observe no such restrictions.  Name your objects in Chinese or Sanskrit if you prefer.\n\nIs Synergetics a work in English then?\n\nI'd say \"yes and no\" in that \"yes, English is a big help when reading it\" yet the usage patterns are alien enough to set up sometimes dialectical if not antithetical relationships vs-a-vs \"normal\" usage. \n\nFuller imparts his own spin within a vocabulary that's deliberately remote, such that his \"quantum\" and his \"gravity\" might be kept at arm's length rather than be allowed into the \"__main__\" stream (a Pythonic pun) in some university discourse.\n\nFor example, Fuller's \"dimension\" concept, and \"4D\" in particular are not going to seem all that familiar in contrast with the four mutual orthogonal axes of hypercross dogmatics or related flavors of sacred geometry.\n\nMany ethnic groups, many subcultures, have made use of the same exact words, but in namespaces that need to be spelled out (qualified). We need to anchor our words in their respective namespaces (discourses) if we have any hope of maintaining a high level of reading comprehension.\n\nThat's why the namespaces concept is so useful:  we're able to compartmentalize and tease apart the various meanings others might confuse (sometimes willfully), thereby avoiding a descent into empty babel.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}