{
  "id": "444941605807987640",
  "title": "In Defense of Public Medicine",
  "published": "2020-12-29T11:28:00.004-08:00",
  "updated": "2020-12-29T11:30:25.089-08:00",
  "content": "Dr. Fauci gets a lot of criticism for \"lying\" and \"moving the goalposts\" etc. however let's think about medical practice more generally.  I may wish the doctor to only address my rational ego, to enlist the support of the persona I might imagine myself to be, and yes, that's important, but long practice has taught the doctor it's also a good idea to scare the bejeezus out of me a little, hit a button.Flip side: the doctor knows I might live longer and more happily if I don't get the full \"benefit\" of knowing in detail all that could go wrong, given whatever condition. If I'm a worrier, I'll dredge that all up, but no need for the doctor to encourage such fantasies.Don't tell the patient they'll very likely be dead in a year, if having a positive outlook has the effect of adding quality time. That's just not good medicine. Don't be all negative and extinguish all hope. You're a doctor, not a philosopher, let's remember.When Dr. Fauci lied about the efficacy of masks, it was to triage the supply of PPE to front lines medical workers. \"Just level with us doctor, if it's about saving masks for the front liners, just say so, we promise not to hoard.\"  An \"honest Dr. Fauci\" might reply: \"yes you will hoard. Everyone will want their precious children to have the very best N95s, a black market will develop, and many of you will buy cases and cases of the things to sell from your basements, look at toilet paper. Our front liners will have to do what they're doing now, reuse surgical masks for days, like in Haiti. I know you. You'll break your promises in a heartbeat when confronted with the actual situation.\"What's great about Dr. Fauci is he comes out later and reveals his technique, like a magician explaining his trick. Or he'll even tell you at the same time as he's \"lying\": \"yes, I'm moving the goalposts because if you're tantalized by the prospect of 'herd immunity' you might start acting even dumber, idiot human that you be\" (that's \"honest Dr. Fauci\" again). In sum, the medical profession includes psychology, and much as we like to imagine ourselves as rational beings, the model must be developed empirically, not just on wishful thinking. Doctors as a part of their professionalism are not allowed to take our so-called \"rational selves\" too seriously.  Advertising, for better or worse, also includes psychology, and the lesson there is the same: if you want to induce a specific behavior pattern, it's more effective to bypass the rational \"talk to me\" earnest individual who erroneously regards itself as an in control sole proprietor of its psyche. Better to talk to the subconscious demon who actually runs the place. Politics 101.Sometimes we get lonely, we rational cogitos, so well educated and introspective, because none of the institutions are really wanting to communicate with us as reasoning brainiacs. They're all too busy manipulating us to give us that courtesy.  But hey, that's a strategy based on results, and not entirely misguided. I'm for cutting public medicine (its practice) some slack.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}