{
  "id": "716304076279424757",
  "title": "Institutional Wealth",
  "published": "2023-04-10T20:35:00.001-07:00",
  "updated": "2023-04-20T13:37:36.929-07:00",
  "content": "Let's start our GST analysis with the economics of an individual.  \n\nAre babies born into property?  I'm thinking they'd have to reach their majority before their inheritance kicked in.  Some call it law, others call it anthropology (me more in the latter camp).  Some babies show up inside wealthy families and are slated to own the farm, if lucky enough live that long.\n\nOK, but to what extent does a civilization provide high living standards to its hobos and vagabonds?  The question is designed to give one pause, as, given stereotypes, the nomad has a hard life, that of a drifter. Nomadic tribes, such as gypsies, show up in fairy tales as shunned.  Rock bands, with their roadies, like traveling circuses and carnivals, are sometimes romanticized, but just as often derided by the genres.  \n\nWhat I'm suggesting, however, is that the lifestyle of the wandering pilgrim could be a new normal. Not owning much property could become a satisfactory option for many. \n\nThe issue now though is that, if you drift, you'll probably have no mailing address for snail mail and probably can't interest a local bank in your business, or subscribe to healthcare programs. A smartphone and/or a laptop are not enough, to plug in to most infrastructure.  Even if you have a room at the Hilton.  \n\nYou'll be on a tourist visa or maybe a student visa.  Somewhere, there needs to be a home where you're rooted.  That's the expectation.  But need it be?  Snail mail could be delivered to your box through hotel services.\n\nThere's no reason in principle that an individual would have to own a lot of stuff, in order to get around, staying groomed and clean, well dressed and well fed, attending meetings, classes, sometimes teaching or instructing, other times learning or taking instruction.  \n\nLife in a global university need not entail amassing a garage full of stuff, shelves full of books, knickknacks and souvenirs.  Or even if such cubby holes do exist, filled with items of personal value, their contents are appropriately storable and/or recyclable.\n\nA fallacy associated with such speculations is the knee-jerk fear that a proposal is being floated that \"everyone would have to live this way\".  The alarm goes out, warning that \"private property\" has been targeted for abolition.\n\nClearly, some lifestyles are all about serving in custodial capacities, vs-a-vs specific buildings, ships, other infrastructure.  That's one kind of ownership, connected with stewardship.  Mostly though, \"owning\" implies \"an ability to sell\". Yet many properties have value-adding capabilities unrelated to their salability or transferability.\n\nIn suggesting a life without title to real estate, need not be a life bereft of entitlements, we're simply stating the obvious:  that having one's health and freedom, along with the means to stay out of harm's way, is in principle sufficiently satisfying to many people.  \n\nConsider those in religious orders who feel welcome to partake of the order's shared assets and facilities.  \n\nAre such people living in poverty necessarily?  \n\nOf course not, although their wealth might be more institutional than personal, one might say.\n\nBut is the mere existence of such a lifestyle option a threat to those enjoying home ownership?  The implication oft seems to be those of high net worth, as conventionally accounted, are inevitably subsidizing those \"of no means\" (again, as conventionally assessed).  \n\nBut we're saying a global student-teacher nomad could have work-study access privileges vs-a-vs luxurious apartments and/or rustic situations without any specific ownership relationship to these programs and/or  accommodations.\n\nHow might we crew a business mobile, an exploratory vehicle for the Trucker Exchange (T4P), without having extravagant wealth?  \n\nThe vehicle is an institutional property, one in a fleet, and is enjoyed and operated by its crew without being owned by it.  \n\nSome crew members might be holders of properties, here and there in the world.  Others might not be engaged in those language games, and yet they still have access to healthcare.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}