{
  "id": "6283267267742441608",
  "title": "Insurgent (movie review)",
  "published": "2015-03-22T21:58:00.002-07:00",
  "updated": "2015-03-29T11:18:12.087-07:00",
  "content": "If we have [schools in the desert](http://mybizmo.blogspot.com/2011/06/simulating-school.html), remote villages, with time to watch films, we'll do [Divergent](http://controlroom.blogspot.com/2014/03/divergent-movie-review.html) and Insurgent as they're meant to be seen:  back to back, not a year apart.  Readers of Charles Dickens had to put up with getting his stories in magazine serial format, whereas nowadays one plows through a whole novel, no commercials, or did, when people still had time for reading.  In those high desert schools of Oregon or Arizona or New Mexico or Old Mexico, we might even have time for reading again.\n\nWhat I wanted to remark on was Chicago's decay.  Leaving aside what is real and what is Memorex (old commercial), I was noticing all the partially imploded buildings and imagining some kind of violence, instead of benign neglect.   But now I realize they were just getting old.\n\nWhen old buildings crumble, what does one do if the civilization no longer as new plans for the same real estate?  True story:  I'd been to [a ReThink911 talk](http://controlroom.blogspot.com/2015/03/rethink911-hgp.html) at Humanists of Greater Portland (HGP) that same morning and was already thinking about the life cycle of buildings.\n\nClearly the old gray towers of the original New York were built for some forever in which buildings never needed to come down.  The [Empire State Building](http://science.howstuffworks.com/engineering/structural/empire-state-building.htm), for example.  People were not thinking in terms of its eventual retirement by solving the puzzle of how to [keep it safe](http://mathforum.org/kb/message.jspa?messageID=9732526).  People leave these problems to future generations without really thinking that much about it.\n\nBut then people don't plan for the seas to rise or the poles to melt either, at least the north one [to such an extent](http://abcnews.go.com/Business/story?id=3609686).\n\nThat thing about humans being fairly good adapting:  we're not done doing that, and may need to be better than fairly good.\n\nAnyway, I won't psychoanalyze the whole movie or boil it all down for ya.  Just I appreciate that treatment of Chicago, more shocking even than JoBerg's treatment [in Chappie](http://worldgame.blogspot.com/2015/03/chappie-movie-review.html), in part because further in the future, yet in a world wherein AI never really took off.\n\nSo many fictional realities to explore even if, as it is, we have [just this Universe](http://mybizmo.blogspot.com/2015/03/if-universe-main.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}