{
  "id": "2874478662126245942",
  "title": "Insurance Story",
  "published": "2020-10-21T10:52:00.005-07:00",
  "updated": "2020-10-23T20:24:30.325-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/7101158683/in/photolist-bPvi5p-aBUhaj-9Jw4Wb-9Jw4Eb)\n\nI've been putting off yakking with my car insurance lady, about an accident over a year ago by now. Exactly what was I paying for in terms of damages?  \n\nWe'd pulled over and talked, I didn't see any dings, everything looked fine and she agreed.  Then comes the call from her insurance about something that happened on a Saturday.  That's not when it happened.  Yet my account was dinged.  I need to follow up on that.  Scrounging around for a number...\n\nOK, we had an excellent therapy session. We talked about 2017, and how the date of the accident is wrong. But no big deal. That's what I needed to hear, and what got charged (claimed and approved).\n\nNow I'm in line to get a tracking app that will measure my mileage and adjust my rate accordingly. I'll be one of the guinea pigs.\n\nWhat would Medicare for All really look like?  I still think GI phones, which you won't want to use in subterfuge because it's designed to track. Keep a private phone for other purposes.  At least poor kids at the border get the apps, because America is for Americans.\n\nI also talked to customer support. If the rooster sound in the distant background was added, for texture, much as people on Zoom stage their heads (audio version), then brilliant.  I much prefer the \"rural setting\" picture of customer support.  Relaxed on a beach somewhere, with a data helmet?  Lucky me someday, right?\n\nI know it never happened on a Saturday, since I was driving home from Sellwood Middle School. Probably a Friday then?  I gave her my business card for contact information.  I'm glad everything got settled.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}