{
  "id": "170475916379442519",
  "title": "Integral Design",
  "published": "2018-09-26T09:37:00.003-07:00",
  "updated": "2021-06-15T09:05:55.066-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/44215935934/in/dateposted-public/)\n\nI showed up early today in hopes of crossing paths with Jon Bunce.  Don said on the phone he comes early sometimes, makes coffee.  No dice.\n\nBeing early has other advantages, in that I get to overhear the three ladies to my right chat with each other.  Nirel is here too, busy setting up two cameras to make a video.  We're waiting for the coffee to be ready.  It's ready.\n\nGlenn is talking about what he's been reading.  He has lots of stories.  He enlisted in the Navy to avoid being drafted into the Army.  Thanks to really high test scores, he got sent to the long program in Vietnamese, almost a year, at Defense Language Institute (DLI) in Monterey.  He excelled at learning Vietnamese.  That's the only school he's graduated from, aside from high school.  That's when he learned he'd be serving in the NSA.  He received a top secret cryptographic clearance.\n\nI was teaching Python last night, until 10:30 PM or so, then switched to watching more 911 videos on Youtube, this time through the LaRouche PAC.  I've tracked him for a long time, all of 96 years old by now. I checked Wikipedia.\n\nLike many Americans, I've spent quite a few hours considering the events of those hours on September 11, 2001.  You'll find a [smattering of posts](https://worldgame.blogspot.com/2016/01/conspiracy-dynamics.html) in my blogs about it.\n\nBack to Glenn:  he was studying the PT boat fleet and working on cracking the Vietnamese code matrix, which had changed right around when he got there.  As the new guy on night duty, he got out his colored pencils and managed to crack the code.  As the lowest ranking guy with an attitude, he got no credit for his feat.  He was also never asked how he broke the code.\n\nIn Vietnam they'd been under attack quite routinely (not from PT boats; they were on a base on land).  The guys were not in a good mood, this being an ill-conceived war.  Higher ups were actually thinking of sequestering the ammunition, not a popular proposal among the enlisted.\n\nRotating vets out ASAP was the better solution, the Pentagon had learned, so their anti-war sentiments would not affect the new recruits.  For the next year and a half, he was back at Fort Meade, at NSA headquarters.  \n\nUpon completing his military service, Glenn managed to secure a scholarship position at Antioch College, which, given its work / study approach, lost a lot of its students to full time employment.  His far western background and military service made him a good diversity candidate.\n\nHe'd tried formal schooling before, before enlisting, and after leaving the electricians union, much to his dad's distress.  He worked 8 hour shifts in a commercial laundry, dealing with restaurant, hotel and hospital linens, in order to pay bills and sit in huge lecture halls listening to grad students with microphones.\n\nDropping out, yet continuing to go to school, was not an unusual pattern in those days, and Glenn followed it in the case of Antioch.  One could still learn, but without the overhead of a big tuition.  Attend class, keep the student card, just don't expect a degree at the end of the tunnel.\n\nThrough Antioch, Glenn encountered [Helen and Scott Nearing](https://adventuresinthegoodlife.wordpress.com/2015/06/09/helen-nearings-good-life/) who preached radical simplicity as a lifestyle.  Glenn absorbed these values and became more yet autonomous and self sufficient.  He learned to live off the grid.  He'd become one of those back-to-the-land anti-war hippies.\n\nIn a later chapter, he joined a Jerome, Arizona manufacturing outfit.  The company made some of the best mercury vapor detection devices anywhere, important in mining especially.  Thin gold mesh filters.  Better than most of the competition by at least an order of magnitude.\n\nHe learned to build clean rooms, wire networks (computer, electrical), do plumbing, while working at this remodeled high school.  With rent going up, they moved to another high school (this time buying it outright), and Glenn took on refurbishing it from the ground up, outfitting it to be the next factory facility.\n\nA five day intensive workshop on integrative facility design, which he took in San Francisco, in preparation for the factory's move, proved pivotal.  Having already had years of hands-on experience, he was in prime condition to take advantage of the course, and see the value in its teachings.\n\nThose with only college coursework behind them lived in a different world.  Glenn was coming more from a construction background.  The workshop instructors actually invited Glenn to join their traveling road show in the end, a high compliment.  However he went back to his dream job in Jerome, where he had a family and friends.\n\nThe Jerome instrument company was eventually bought up by a competitor, its people fired.  Glenn and his wife divorced, with Glenn retaining custody of the two kids.  His son was precocious with computers and already had a computer business before finishing high school.\n\nThrough his son, Glenn was introduced to the internet, which inspired him to unify a lot of his thinking, using a set of heuristics he calls \"the Global Matrix\".\n\nBy a global matrix he means what I tend to call a \"hexapent\" (not in the Oxford Dictionary -- at least not the shorter edition) as in HP4E (\"hexapents for everyone\"). His spherical matrix has layers, say 256 of them.\n\nIf the word \"layer\" gets you thinking of \"data layer\" or \"drawing layer\" in like Photoshop, you're on the right track.  GIS systems typically superimpose data layers to give us relevant visualizations.\n\nThe Global Matrix inherits from memes like Macroscope, also Geoscope.  These are animated globes, ways of displaying global data.\n\nGlenn is inspired by the I-Ching's ancient octal matrix to think in terms of bits and bytes.\n\nThe global matrix is more like a computer, and octaves stay important.  This wasn't the technical talk.\n\nMy own path took me to \"Global Data\" as the name of a science fiction supranational, one hatched outside the whiteman jurisdiction in some N8V context (e.g. Warm Springs), managed by wise elders.\n\nGDC, which I've often blogged about, was all about sharing global data as a service (DaaS), not unlike Google Earth does. When Glenn and I met, we found we had much in common, in terms of goals and aspirations.  We both think in terms of a public service.\n\nI'd compare my relationship to Glenn with my connection to David Koski, who likewise was highly committed to a certain path that converged with mine in many ways.  I'd glomed on to Synergetics, not knowing some guy in Santa Monica was blissing out on recursive E-modules.\n\nGlenn has written a synoptic outline of a book, with clever chapter titles.  He's passing that around now. He thinks a lot about history, ancient civilizations, logic.\n\nThe operations 'and', 'or', and 'invert' make more sense to him then 'and', 'or' and 'not'.  Negation and inversion have different connotations.  He got into triangles.  His two hour meeting with Stuart Kaufmann at Sante Fe Institute was another milestone.  Stu has been an ISEPP speaker here in Portland.\n\n[Sam Lanahan](https://controlroom.blogspot.com/2017/09/gala-gathering.html), another \"blog character\", has entered the story at this point.  He's been supportive, including by providing some color copies of Glenn's book, which has text on left pages, pictures on the right.  Two were passed around. Glenn and Nirel are working on a website.\n\nYou'll find a lot more about Glenn in my blogs.  I've told his story before, however today he's been doing a good job distilling it.  He's planning to do more technical talks as a follow-up.  \n\n[](https://www.flickr.com/photos/kirbyurner/44024121455/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}