{
  "id": "2074094950660802270",
  "title": "Into the Fire (movie review)",
  "published": "2009-11-05T05:52:00.001-08:00",
  "updated": "2009-11-05T13:06:23.466-08:00",
  "content": "This tightly edited documentary traces the beginnings of WWII to its dress rehearsal, the fascist bombardment of Spain by the Axis powers, Hitler and Mussolini puppeting Franco, who was in rebellion against the duly elected government in Madrid.  The aerial bombardment of Guernica was memorialized [by Pablo Picasso](http://worldgame.blogspot.com/2004/12/dj-vu.html).  Ernest Hemingway narrated a movie from the Loyalist perspective (those loyal to a democratic, parliamentarian Spain), showed it to the Roosevelts in their White House home.As those reading their history remember, the USA was already sick of the whole WW1 experience and was not anxious to rejoin the European adventure.  However the world was shrinking owing to the development of air transport, and those watching world events could see that failing to stop the invasion of Spain by the dictators would simply postpone the day of reckoning.  Many Americans got into the fight early, and this film chronicles the dedication of those called to nursing, helping mostly men on the front lines.  The [horror of modern warfare](http://worldgame.blogspot.com/2005/12/more-about-narnia.html) was just becoming apparent through newsreels.  That Americans weren't lining up to join in the madness is understandable, but the situation only got worse as Hitler and Mussolini were sensing their behavior was being reinforced, they had a free hand.  The ostensibly democratic governments of the USA, France and Great Britain, weren't really doing anything to get in their way.[The Spanish first stand](http://controlroom.blogspot.com/2007/03/pans-labyrinth-movie-review.html) against what would become a terrible enemy was echoed elsewhere in the world where newly literate classes were eager to manage their own affairs with less bullying from some power elite.  Central governments were worried about communism.  In the USA, the eugenics movement was strong.  Plenty in the business class were backing fascism at first, not yet aware of the monsters in the making.  Hitler was still writing Mein Kampf from prison, consuming racist pseudo-science from Cold Spring Harbor and places, well funded North American think tanks, as documented [in War Against the Weak](http://www.waragainsttheweak.com/).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}