{
  "id": "6496693730067531985",
  "title": "Iron Ministry (movie review)",
  "published": "2016-07-11T14:38:00.003-07:00",
  "updated": "2016-07-13T00:12:54.474-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/28154599611/in/dateposted-public/)\n\nGlenn and I both enjoyed this well-crafted documentary, on a Sunday afternoon after lunch.  My habit of late has been to borrow movies on Sundays and return them on Wednesdays, from a local rental shop.\n\nThis week my two were [The Last Colony](http://controlroom.blogspot.com/2016/07/the-last-colony-movie-review.html), one I'd seen on the shelf weeks earlier then lost sight of, but this week I scored; and Iron Ministry, which I'm reviewing now.\n\nShades of [Songs from the North](http://controlroom.blogspot.com/2016/06/songs-from-north-movie-review.html) in some ways, with the long camera shots, often intimate as in \"in your face\".  I found myself speculating as to the filmmaker's technique.  People were so willingly not camera conscious, is how it seemed, except that time in the diner car.  In North Korea, they minded a bit more.\n\nWhat's salient for me in particular about his film is I was fascinated as a kid by the vestibules between train cars.  These were \"the noisy parts\" for me, and the whole \"air lock\" quality of joining cars together, with couplings and all, just permeated my little brain, such that I still regress to my childhood whenever a passenger train goes by.  There go those noisy parts!\n\nThe thing about his movie though, is it's so \"inside the train\".  I'd been expecting what I call \"external shots\" and those were meticulously provided as a special feature, all together.  Instead we were this passenger, the filmmaker, not an omniscient ghost, not on a Hollywood budget with cranes and helicopters, computer animation.\n\nThe other passengers call us \"foreigner\" and feed us stuff.  We're a person, albeit both intrusive and unobtrusive, hard to calculate.  We never get to see the filmmaker in the mirror.  We get names in the credits is all.\n\nSo yeah, kinda claustrophobic if expecting grand vistas, though we do get some of those, see out the window in a few long takes.  We see out the window a lot, just not in that postcard vacation movie sense.  More like we're camped out on some floor in a smoking area near the toilets.\n\nI'd call the tone \"democratic\" in some sense, but not without different classes.  Some cars and compartments had more amenities, were more private, looked more modern, moved faster.  The kids on the bullet train had smartphones and knew about Michael Jackson, a common currency, a trader bead.  The inlanders knew a lot about pork.  Things looked pretty hygienic but for the fact of all that smoking and smog.\n\nThe people are friendly and eager to get along.  They see the world outside China falling prey to warmongers and don't want to sucker for that.  One speaker sincerely admires Americans for being so able to assimilate, says \"we Han\" could learn from that.  The Tibetan woman is haunted by how the prophesies of iron beasts are dreams come true, more like nightmares.  Trains brought the big mining bosses (more ruthless) whereas they'd been more used to local little ones.\n\nOther Chinese speak frankly about their government being secretive, in a way I hear a lot of Americans talk about their own secretive state.  Sure the bullet train was struck by lightning, sure it was.  I don't speak Chinese but hear a mocking sarcasm in some understated way.  Dead pan.  Chinese have a fun sense of humor.\n\nLots of shots of Chinese train-goers passed out, sleeping.  Admit it, you won't get long shots like that in just about any other movie, so don't dismiss this opportunity as beneath your radar, especially if into cinematography.  We're learning a lot from these narrator-less documentaries that nevertheless have a point of view, if only an angle and an avatar (not a ghost camera).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}