{
  "id": "3261881231672563459",
  "title": "Jackpot Junk (memo to Nodes)",
  "published": "2019-03-29T11:45:00.005-07:00",
  "updated": "2019-03-29T11:56:35.028-07:00",
  "content": "I understand how casinos themselves might like to have some control over the machines I've been talking about.  [Over on CSN](http://coffeeshopsnet.blogspot.com/2019/03/csn-explained.html), the discussion has turned more to hardware, the actual arcade or casino style gambling machine, modified to pump crypto to charities.  Church bingo.\n\nRetrofitting an old arcade game with the necessary internals is easier than getting a casino classic, most likely, though ironically.  The machinery of payout has been simplified, even in the classic setting.  Here, payout is to those fintech thermometers, or to this or that QR code.  You may actually \"shoot money\" out of a gun in some games, giving health and happiness to your cute and cuddly targets.\n\nYes, I'm talking about old junk and garage based experiments in some cases.  You need your own internal crypto to play with, the money of the house, the currency by which parents pay their kids sometimes, redeemable through the parental bank and/or catalog.  Do the dishes and you're credited with this or that cartoon.  Smart houses already include these, don't they?  Hey, Alexa!\n\nPlay pinball, get to a level, and your winnings start meaning real money from the coffers of Big Company, with its Good Will line item.  The circuit diagrams make sense to electronics engineers, who understand about amplification already. \n\nIf you've designed the games to be fine tunable, then you'll be able to excite performance as a way of valving \"ions\" (charged particles) to charity, leading to repeat business and reputation building.\n\nI think of a cryptocurrency as \"ions\" (includes \"anions\") meaning particles with the ability to do work.  That's just a shorthand for \"battery\" i.e. a source of power or revenue on the chip. \n\nIf you want your CPU to do its teraflops, you need to feed it, power the motherboard.  We seem a lot  less clear about people, whether to power them, despite their evident godliness (NIH -- not invented here).  We're suspicious.  Indeed, a lot of companies sell the implements of people slaughter (like Home Depot but focused on mayhem and demolition).\n\nThe CSN nodes are not about recruiting vast numbers into the people slaughter business, lucrative though that may be.  We have our standards. \n\nThat being said, causes you'd willingly fund may also be causes you'd support by other means as well, such as by traveling to a work/study site.\n\nObviously the authorities don't want crypto to fund armed and dangerous organizations, which is why I'm leveraging my Quaker background to get out ahead with a brand that's clearly not about weapons trafficking. \n\nI'm not advertising a lot of other prohibitions though.  There's no ban in principle on serving boozes, such as rums.  Whiskeys.  In some regions, I understand local laws prevent such sales, however I'm just making it clear where the restrictions are coming from (i.e. not me).  The Nodes (\"shops\" in shoptalk) need morphological capabilities, and biodiversity.\n\nSpeaking of guns (implicitly -- we were talking about weapons), the North Americans treasure their privacy and private property rights as much as their right to bear arms in public places.  But what about on private property, if the owner has rights?  Can't Farmer Jones, a Quaker, keep all guns off his property?  The litigation piles up.\n\nThe etiquette of the West was to respect the wishes of a church, such that gun nuts would leave their pieces in the carriage, with the driver.  Naturally that's an invitation to cowards in search of unarmed victims, and some churches might post armed sentries at the door, assuming local police respect the practice.  Hotels.  Theaters.  Zoos.  Theme parks.  Not all of these belong to the government.\n\nAm I saying Nodes will be \"invitation only\" and more like speakeasies?  Am I suggesting airport style screenings to get in?  No, not in general.  Those would be special case.  Think of night clubs you already know.  I'm not reinventing every wheel here. \n\nRemember the prototyping chapter.  You don't want the general public working your machines until you've had a chance to work out the kinks.  Every industry has its skunk works, its test pilots.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}