{
  "id": "210671317851352765",
  "title": "Jitterbug Party",
  "published": "2011-12-20T15:13:00.000-08:00",
  "updated": "2024-02-03T07:44:36.154-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157628502978695)\n\n:: jitterbug party, 2011 ::\n\nOne can't but help feel one's cult or club member like status in a room full of people who speak the shop talk of Synergetics to some degree.  The lineage is still somewhat obscure and esoteric.\n\nThere's a crystallographic flavor, which brings in the more classically trained chemists such as Steve Mastin. \n\nWe had some bona fide Silicon Foresters in our midst (at least two folks from Intel).\n\nOur guest of honor was James Nystrom, a computer geek and professor, with lots of overlapping interests in physics and so on.  John Driscoll picked up on a lot of the jargon from his Systems angle. \n\nThe event was orchestrated by Sam Lanahan, with Wardwell and myself assisting with the guest list.  Having Trevor Blake, Glenn Stockton and Nick Consoletti in the maxi taxi was a privilege.  Good seeing LaJean again, as well as meeting these new people.\n\nInteresting to me was how [the night before](http://worldgame.blogspot.com/2011/12/mystic-ball-movie-review.html) we'd been looking at a picture of a younger Alex, accepting the Nobel Prize on behalf of his mom, and now tonight John was boasting (in a self-humbling not too self-serious way) about delivering a talk on the physics of consciousness from that very same famous podium / stage.  A nice segue between consecutive dinner parties, both of the highest caliber.  The projected synergy is already kicking in it seems.\n\nWhat I found gratifying is that a gent was applying differential and integral calculus to a cuboctahedron and coming up with some interesting properties, and was also playing cellular automaton games with the tetrahedron, random walking it, per a rule set, within the IVM. \n\nHe wants to tackle A & B modules maybe.  He gets some of his graphics from Bob Gray.\n\nThe back story here is Sam and his 10-frequency flextegrity tetrahedron made their debut at the Rhode Island School of Design for the annual SNEC-organized Synergetics shindig, where he met this fellow Nystrom (Pearce was there too).\n\nThe fact that Dr. Nystrom talked Jitterbug and IVM and knew differential calculus made him the ideal resource to pair up with Mark Martin, who has been sweating the details of a Flextegrity computer model based in differential equations for springs.\n\nNystrom is one of those who takes seriously Fuller's pulsating vector field concepts, as articulated by the Jitterbug sending ripple effects through the IVM.  There's a Negative Universe aspect.\n\nSince he asked, whether we thought \"IVM\" or \"octet-truss\" would be best, I argued for IVM in the more theoretical context, as it makes a better dramatic foil for XYZ (also three letters).  \"Octet truss\" refers to the more times-size realized versions, the less abstract.  Bell's kites come to mind immediately, for many of us.\n\nSaving the best for last in some ways:  Nystrom mentioned [using quadrays](http://en.wikipedia.org/wiki/Quadray_coordinates) in one of his academic papers.  I'd not heard of anyone doing that besides me in FoxPro Advisor, March 1999 (more an industry trade mag than an academic journal for sure).  Wow.  If there's a citation to track down here, I should do so.\n\nTrevor and I played at the dinner table with BuckyBalls that he'd brought (the magnetic balls, so simple).  Even though they're polarized, they'll come together in a tetrahedron.\n\nHoliday shopping... must do some.  But work has me pinned to the laptop.  Boat ride with Barry coming up.  Wish Tara could go but she'd probably be the only girl.  Nirel has the same consideration.  Sam suggested I invite Dondi to his event but I don't know her well enough, speaking of woman Wanderers I admire.  Maybe Trish and her son will join us on the boat.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}