{
  "id": "4896684125455194228",
  "title": "John Carter (movie review)",
  "published": "2012-04-07T23:45:00.002-07:00",
  "updated": "2012-04-07T23:51:51.316-07:00",
  "content": "This is one of those movies where it makes sense to encrypt / decrypt in various ways.  That Edgar Rice Burroughs would be pressing the letters of his own name, in code, on that tomb, supposedly trying to get in, while clearly the outside is likewise his imagination, suggests his own uncle is his alter ego, his heroic self projected large against the big screen of Plato's cave.\n\nThe Victorian escape to another astral plane was through death, with spiritualism persisting on into the time of Thomas Edison.  Technology and the lore of outer space, extraterrestrials, were beginning to gain a firm foothold and meld with the old plot lines.  An out of body experience would take you to Mars.  Your Earth body would lie, vulnerable, like a corpse, while you experienced your superpowers (and limitations) in a next life, with new love.\n\nCarter clearly thinks beyond the grave already, as he continues to feel a bond to a partner in a former life, one we see the end of.  We understand Carter's bravery as a kind of no longer caring, as if giving himself over to the dream of life, in despair, not caring that much when it'll end.  People see him as crazy.  He barely holds his world together.  A spider, a cave, gold.  Not much to go on.  No friends.  A drifter.\n\nLying motionless in that cave, as if bitten by a snake, he takes on another life.  One could easily see it as a projection of the stories he's learned as a boy.  Roman soldiers.  Chariots.  Great battles in the plains.  The beginnings of airships.  The beginnings of large scale machinery, mixed with the delicacy of optics.  All these fragments of his 1800s existence make it to his next life.  He is once again a hero.  He celebrates loyalty, bravery and compassion among the peoples of another planet.\n\nThe moment he realizes he's on Mars is reminiscent of that moment in Idiocracy, when it all comes together for our protagonist.  There's the problem of going back, whether this would ever be possible.  The new world has its own attractions, its people, its problems.  There's the temptation to stay.\n\nThe really powerful bald guys that seem to orchestrate everything, masters of disguise, are reminiscent of the Q in Star Trek.  They know about all the worlds, including Virginia in the post Civil War era. \n\nOutwitting these guys (their women not shown) is part and parcel of the human heritage; our destiny (or calling) is to rival the angels in bringing glory to God.  We demonize those whom we hope to surpass.  To just be the puppet of the angels, without rising to their level of authority and immortality, is what spineless sell outs would do, and hence our human enemies (not as noble as ourselves).\n\nSo is this really Mars, or are we just talking about \"a next world\"? \n\nGiven the Victorian themes of poison, even suicide, a need to find lost love, the theme of death cannot be avoided, nor is it.  Edgar himself is dying and going to heaven in inheriting fantastic wealth.  His uncle urges him to a life of adventure.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}