{
  "id": "2714076309484010474",
  "title": "Jotting Notes",
  "published": "2010-02-05T10:55:00.000-08:00",
  "updated": "2010-02-10T16:12:39.748-08:00",
  "content": "I was helping my Indonesian student again tonight.  He's an undergraduate from physics in the State University  of Surabaya and is learning English and Python at the same time, tackling a really steep learning curve.I referred to him [on edu-sig](http://mail.python.org/pipermail/edu-sig/2010-February/009781.html), also sent him that link to [the IndonesianLanguage page](http://wiki.python.org/moin/IndonesianLanguage) at Python.org (hi Carl), not sure if that helped at all.We use a shared whiteboard sometimes, type code back and forth.  What about Python tutorials?  [Dive Into Python](http://diveintopython.org/) is an old favorite.  Even [this WikiEducator page](http://wikieducator.org/PYTHON_TUTORIALS) is pretty good, ahem (note:  WikiEducator will be out of service on February 6 as WE upgrades to the new WYSIWYG editor).  [Think Python](http://groups.google.com/group/freecomputerbooks/web/think-python-an-introduction-to-software-design-2008-2009-allen-b-downey) is good.Teacher Training:A PCC person and I met before class yesterday (she's a teacher).  The meeting was not about Python this time. Portland Community College has a building near OMSI.  I had a meeting there about Python awhile back.  That was not about teacher training though.  [The math-through-programming idea](http://mathfuture.wikispaces.com/Plans+and+dreams+2010) was still pretty new in 2010.Speaking of adult education (andragogy), I did not manage to access [the virtual classrooms at Educon](http://groups.google.com/group/mathfuture/browse_thread/thread/c6eb1384e43c9970?hl=en) (Philadelphia) via Elluminate.  Maria had sent around a heads up.  Lots of logistics, somewhat ambitious.  Pycon doesn't even try to stream live.  I'd seen a couple talks listed that appeared to be [about digital math](http://www.4dsolutions.net/ocn/numeracy0.html).Teachers are organizing across the land to come out with a more world class mathematics track.  However there's not much uniformity, based on my windows into the action.  Lots of experiments (and that's as it should be).  Nor is it clear, based on feedback from Korea and MIT, that an \"always on-line\" style will promote focus and concentration.Multitasking may trash one's ability to write lengthy coherent thoughts?  Essay questions elicit single paragraphs, in a style more like here:  fragmentary (these are jottings).  Korea now has detox centers for students overly addicted to digital distractions.  Games tend to be implicated as neurologically addictive.Recruitment:The effectiveness of computer games as recruitment devices is undeniable.  The institutions behind them create the live opportunities though, for better or for worse, so best to not reflexively blame the fantasies.  Advertising a game as a recruiting tool adds some serious spin.Philanthropic gaming (per CSN) might likewise inspire higher commitment levels, beyond donating profits as an outcome of game play.  Disaster relief per Sims gets one thinking about logistics, supply lines, temporary facilities.  Health workers have many of the same concerns as soldiers in the field (often the same field).Reported story:  Laughing Horse  collective did direct service to homeless people all day today.   All  the gear was disbursed, as well as vegan food.  Cold rainy night.   Military surplus sleeping bags most welcome.Education Proposals:Most grant proposals for education seem to focus on developing new web sites, less on developing educational games or providing teacher training.  I agree web sites have an anchoring role.  Sponsors like to have their logos displayed.  However, organizations need to be known for their people too.  A website and nothing more is too absentee.Somewhat cross-disciplinary teams from the private sector might work with the teachers, not to replace them but to equip them with new skills.  Unions need not object in that case (this is not an end run).  Where is this model already working?  Do we have allies in the UK?Eliciting Versus Imposing Solutions:There's no imposing a framework on people, if the goal is to have lasting institutions.   Edicts from on high stir resentment and excite efforts to sabotage.On the other hand, feuding factions may choose to import a management team, at least for the interim.  Italian hill towns would sometimes bring in the mayor as an outside consultant.  Visiting experts may help catalyze a framework, design new workflows, based on what has worked in other contexts.Those [village electrification projects in Borneo](http://controlroom.blogspot.com/2010/01/wanderers-201019.html) only work because of indigenous support for them, including with engineering.    One needs to be able to diagnose and repair locally, perform routine maintenance.However, the design for those tiny electrical plants (no dams required) came from multiplying experience around the world, especially in mountainous areas.  Bhutan has micro-hydro as well.  Every situation yields its lessons and \"doing more with less\" means not always repeating the same wasteful mistakes.Villagers get Internet now (some of them), meaning these kids have a newly realistic option to stay in the village.  Education comes to them.  Place based education.The Indonesian student I'm working with is highly self motivated.Curriculum Delivery:Creating cohesive and mutually supportive town-gown relations is part of the equation.  I would gladly sit through classes on Wordpress, Django, Javascript, delivered by Wanderers I already know, maybe copying the four meeting format I used for teaching Python that time.Lightning talks (five minutes) are at one end of the spectrum.  Bucky's eight hour talks were further out, more like a serialized TV show.The user group meetups give a foretaste, but many intelligent adults, eager for this material, would never think of attending a user group.  How might we offer free classes?   The Princeton Computer Center (another PCC) had those in my day, with members of surrounding community, not just students and faculty, welcome to attend.  Reed College?Free Skool provides another model for delivering curriculum, as does Laughing Horse Books, especially since the closing of Liberty Hall, although not to the degree Free Geek has been able, in terms of providing us with workstations (thinking back to my class for home scholars). West Precinct was in the forefront years ago, with that Red Hat lab.How does one make work / study a safety net?  Another on-line discussion.  I've suggested programs for vets.  Start the training even while awaiting rotation.David Koski forwarded Magnus Wenninger's posting to the Polyhedron list, saying \"But now I must tell you what I have to say. Ludwig  Wittgenstein is my favorite philosopher...\" (January 31, 2010).My guy in Indonesia is back in his chat window.  Gotta go.  \" thank u mr kirby I will always remember the kindness of  Mr. Kirby.\"",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}