{
  "id": "1559452251409265294",
  "title": "Journal Entry on Racism",
  "published": "2019-02-26T10:49:00.004-08:00",
  "updated": "2019-02-26T19:57:03.845-08:00",
  "content": "Copied over from Facebook.\nActivity log:  \nFeb 24, 2019, 11:43 AM\n(commenting in an already long thread)\n\nWe\n can celebrate the expressiveness and adaptability of the human genome \nwithout buying in to the specific taxonomy of races invented mostly by \nwhite supremacist social Darwinists with an agenda to justify \nimperialism and/or slavery.  \n\nThe racists use animal husbandry \nfor their concepts, wanting to identify humans as either \"pure \nspecimens\" of this or that breed (race), or \"mongrels\" (hybrids, mixed\n race).  We could go much further in this direction if we wanted, with \n\"Best in Show\" specimens of whatever pure breeds the authorities decided\n to enshrine, perhaps inventing new races as time goes on.   In \nthe meantime, racists forge ahead without any universally agreed upon \ntaxonomy.  It all keeps changing, and \"race\" gets hopelessly confused \nwith \"ethnicity\" which is different.  It's not that I don't see genetic \ndifferences (and/or ethnic ones), I just have little respect for the \npseudo-anthropology that pretends to see a clear and clean taxonomy. A \nlot of academic white guys with snobby attitudes want to tell me, \nanother white guy, what the races are.  Are there five or seven?  What \nare they again?    Their answers always sound stupid to me, from\n pretentiously pseudo-educated college and university types with a cave \nman's understanding of the world.  I can't credit racists with any kind \nof intellectual integrity.  They're a morally bankrupt camp and yes a \nlot of them have white skin and academic degrees.  I consider racists \ninferior, intellectually, in so many ways.  To believe in races is an \nethnic trait.  Not everyone suffers from that specific meme virus.\n\nFollowing up;\nActivity log:  \nFeb 26, 2019, 6:54 PM\n\n The\n original \"I don't see race\" post implies it's only whites who deny \nrace, which is telling if true.  I'm going to remain on the lookout for \nprominent thinkers of a variety of skin colors, eye shapes and so on, \nwho think we might need to revise our thinking in this area.  \n\nIf\n it's really true that only white-skinned people, palefaces, think the \nracial schema / taxonomy is a crazy-bad way to approach the reality of \ngenetic differences (let alone cultural differences) I'd be surprised. \nBut it's an empirical question. I should investigate more. \n\nMy\n thanks to the original poster for starting this useful thread. I hope \nwe keep revisiting racism for as long as it takes. Ashley Montagu \nconsidered it our most dangerous myth. We should not let up and just \naccept it unquestioned.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhoCCoRTqy5VBdSOVBf1rOIw1pZYMXPPSD64_yuV1PwF_CFpGEVhyJj4tXMcULlvt8wtfeo-vsrUbbvIV0q1AP5BeVXhWNgueyu4sqBxQTRTRLPTXy8lljdTxnO0c3jfpLodmyB/s1600/race_on_facebook.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}