{
  "id": "2882323482114689861",
  "title": "Julien Donkey-boy (movie review)",
  "published": "2013-05-19T18:35:00.004-07:00",
  "updated": "2013-05-28T00:52:37.166-07:00",
  "content": "I'm seeing more patterns in Harmony Korine films.  One is what I'll call \"closure\" where the presence of the camera is explained, not left open.  Trash Humpers goes furthest in this direction.  It's the [Blair Witch Project](http://worldgame.blogspot.com/2006/08/drinking-liberally.html) solution:  the people in the film had one or more video cameras and were filming themselves.  That's making more and more sense, whereas in the old days the camera's point of view needed no explaining.\n\nDonkey-boy on DVD is good because you get the special features, including an interview with the director himself.  They played a lot with strapping cameras to the sides of peoples heads or elsewhere and sending them into scenes where the cameras were unseen.  This has a Borat-like aspect in that some of the actors are real people who are clueless about being filmed.  Candid Camera.  However, we have less than complete closure in Donkey-boy.  The camera may be anchored to a first person point of view, but not because they have a camera in the story, and not because the camera's viewpoint has to be explained.\n\nI only got it during the credits that the dad in this film is played by Werner Herzog.  He and his voice seemed so familiar, but I wasn't prepared to find Harmony's favorite director starring in one of Harmony's own films.  What a coup in a way, how fun for him.  Thanks Werner, for a brilliant somewhat dead pan performance (not unlike his narrator voice).\n\nThe DVD special feature also makes clear that Harmony was serious about presenting mental illness in an unvarnished, unsentimentalized vein.  We are encouraged to have empathy for Julien, whom we follow most closely, but as the reviewer at IMDB points out, for all we know he's guilty of some rather large sins. The church, a mix of Irish Catholic and Black Evangelical, is, I think, portrayed in the story as clueless, e.g. the priest keeps trying to talk him out of the pursuing voices he hears as a consequence, suggests he go see a shrink.\n\nThe shrink does not show up in the final cut, but is in one of the deleted scenes.  The Julien character, brilliantly played, shows off more of what he can do.  An uncle in the mental hospital gets some credit:  Harmony insisted the actor spend some time with the role model for this character, the schizophrenic uncle.  We get some cuts to the hospital in special features.  This feels like Brad Pitt in 12 Monkeys and prepping for One Flew Over the Cuckoos Nest combined.  Harmony is tossing his hat in that ring, the ring of those who do their own homework where mental illness is concerned.\n\nThis movie was made [after Gummo](http://mybizmo.blogspot.com/2013/05/gummo-movie-review.html), but long before Trash Humpers and [Spring Breakers](http://controlroom.blogspot.com/2013/05/spring-breakers-movie-review.html).\n\nOne of the patterns in a Harmony Korine film is that an apparent murder or perhaps negligent manslaughter goes by almost as a footnote, not as a major plot point and not as a crime to be solved.  We're left to wander through these events, helpless spectators whose opinions and judgements may be of little relevance to the action.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}