{
  "id": "7625153533014356960",
  "title": "Jupiter Ascending (movie review)",
  "published": "2015-02-15T19:30:00.001-08:00",
  "updated": "2015-02-15T20:07:11.166-08:00",
  "content": "We caught the Sunday matinee, [Alexia](http://worldgame.blogspot.com/2007/09/stardust-movie-review.html) and I did, on a very sunny afternoon, uncharacteristically warm.  We enjoyed excellent pizza and ginger-pear cider with our movie.\n\nThis movie contains many allusive elements:  a skating hero, a poor servant girl of humble origins, and inter-planetary intrigue among twisted royals, who see the peasant girl as their mother.\n\nAs I've been [revisiting](https://www.flickr.com/photos/kirbyurner/15900422403/) the Bay of Pigs and Cuban Missile Crisis chapter, I was imagining Jupiter Jones as poor Cuba, suddenly caught up in superpower chess.  When Khrushchev shared with Castro later how he got Kennedy to agree to remove the missiles from Turkey, as a part of the deal, that seemed oddly far afield, given Gitmo right next door.\n\nBut that was the Cold War for ya.  [Castro](http://mybizmo.blogspot.com/2006/08/blaming-castro.html) didn't care about Turkey that much.  He was just hoping to kick the Yanks out of Gitmo (the western hemisphere's Abu Ghraib -- can't blame him for trying).\n\nThe movie alludes [to Cloud Atlas](http://controlroom.blogspot.com/2012/11/cloud-atlas-movie-review.html), which in turn alludes to Soylent Green. An image of themselves humans have always found unattractive, oft posed by the angels, is of a self-parasitical beast, one that feeds on its own young (and on its old of course -- whatever is weakest (e.g. \"undocumented\")).\n\nThat which is healthy within feels called to end such a wretched existence, if that's what this is.  A character's heroism is quite often manifest in some fight to restore aesthetic beauty (aka humanity) to the humans' scenario.\n\nI thought some of the best screen writing was when one of the royals explained how \"time is the only dimension worth paying for\" (paraphrase) or \"time is the only dimension\" for short.  Space is a given, and once you add hyper-drive and wormholes, effectively infinite as a permutation space, even if it follows a strict physics.\n\nOne also has to add, in addition to a physics, a string of incredibly good luck events in the face of impossible odds but there's a reason they call it fiction, wherein only the impossible happens.  That's what makes it so action-packed and suspenseful.\n\nI'd say there's real depth to this movie once you juxtapose the foreground plot (servant girl) with the fantasy (the day dream).  That's a Jungian world, pregnant with archetypes, worthy of college-level essays and such.  No reason to blow these movies off as footnotes.  They're works of art, worthy of comment, no less complex and textured than Cinderella or Snow White.\n\nI don't claim to do them justice with these quickie blog posts, which serve as bookmarks in the sand, bread crumb trails to treasures.\n\nBack to the Castro / Kennedy story, I'm not casting JFK as mad King Ludwig of Neuschwanstein fame, far from it.   He had some great advisers (like [his brother](http://worldgame.blogspot.com/2015/02/food-chains-movie-review.html)), like King Ludwig never had.\n\nThe parallel I'm drawing is a clandestine service fighting for its political survival.  Ludwig to spies:  \"go kidnap so-and-so high level diplomat in Vienna and hold him for ransom, anonymously of course, so I can get money for more castles.\"  Spies to Ludwig:  \"sure Ludwig, sure, whatever you say boss\". Cut to spies enjoying themselves in Vienna for a week, expenses paid. \"Dang it boss, we nearly had him, but the clever dude picked the lock and got away.\"  Ludwig:  \"Dang it!  Maybe next time then.\"\n\nThe mad King Ludwig in this film is one of the twisted sibling royals, even more twisted than the other two.  I thought he (the actor) did a marvelous job being twisted, and as Alexia pointed out later, it's not like the others were refusing the currency i.e. the soylent substance that bought more time -- the [unobtanium](http://mybizmo.blogspot.com/2009/12/avatar-movie-review.html) in this Universe.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}