{
  "id": "116183333030643075",
  "title": "Just for the Hard Fun of It",
  "published": "2006-10-25T21:04:00.000-07:00",
  "updated": "2006-11-15T11:44:06.812-08:00",
  "content": "Now that we've let go of the math teaching cadre, when it comes to new curriculum writing, at least in a few flagship schools, at least on the drawing board, it's easier to see where we went wrong with those losers.In English and Music, we don't say \"a student should never read Shakespeare until she or he might write at that level, nor listen to Bach until he or she might sit at a piano and play like [PDQ](http://www.schickele.com/).\"Yet those poor math students were shackled with this \"math as a vocational subject\" philosophy (hardly ever explicit), that forced one to sit through hours and hours of tedious exercises before they let one in on any secrets worth knowing.Hardly any previewing occured. It was all \"math in the rear view mirror\" with a promise (often hollow) of major revelations just around the corner.\"No 'higher math' until you can do it yourself -- and that'll take years and years\" was the silly premise.Imagine if we taught English that way. It'd be laughable, a joke.Yet that's exactly how they taught it, for the most part -- minus any really appreciative or interpretive gloss on stuff too advanced to just sit down and do, but otherwise quite accessible.You don't have to be a circus performer to appreciate a good circus. You don't have to be a calculus whiz to get hip to a lot of what the calculus is all about, maybe starting with the ancient Greeks, not just Newton and Leibniz (the more parochial approach).The traditionalists were just as bad. You had to follow in lockstep, with no fractals until you could do them -- and since computers were verbotten in traditionalist classrooms, that meant like never (doing fractals by hand was just a joyless waste of time, believe you me).Another consequence of this latent vocationalism was students were only allowed to \"solve problems.\" They were almost never invited to \"just do something interesting\" with their growing set of tools. Yet just playing with polyhedra is a way to exercise one's vector arithmetic abilities.\"Problem, what problem? We do math just for the hard fun of it.\" This attitude was practically unheard of back then. They preferred to keep you inundated with busy work, pseudo problems -- less fun than even puzzles or games.The constructivists were a little better here, but still, very little appreciation for art or architecture, and the role of geometry through the ages, was manifest in their curricula.History was suppressed, art was suppressed.It was all about \"weed and feed\" i.e. kill off all but the die-hards, who'll be your next generation of hair-shirt killjoy.Make them be problem-solver good doobies, never the more explorational question authority types, such as we breed in the humanities.Math teachers worked for slave ship owners, not for freedom-loving krews.So it's a good thing that's all so over and done with, at least in some of our better flagship USA schools.Copyleft by Kirby Urner, [Oregon Curriculum Network](http://www.4dsolutions.net/ocn/), feel free to republish with attribution, edit only to fix typos.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}