{
  "id": "7200826327710974950",
  "title": "Just Gender (movie review)",
  "published": "2016-07-17T21:24:00.001-07:00",
  "updated": "2016-07-18T00:54:58.255-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/28296107891/in/dateposted-public/)\n\nI'll have some X-refs at the bottom in case you're interested in related blog posts.\n\nThis documentary acknowledges that language is at the core of the challenge, of accommodating what's actually the case.  That challenge is perennial and language doesn't always have the luxury of getting too set in its ways.\n\nThose with a quick, shall we say facile, even cursory view of gender might go with the simple binary model, of male and female, but at the cost of all nuance, and outright blindness to some aspects of human experience.\n\nSafe to say, I advocate not sticking with overly simplistic models unless under severe time pressure.  If you have a full life of some decades, you'll have plenty of time to develop your appreciation for gender and sexuality.\n\nStarting with the good news first, the 21st Century is off to a pretty good start relative to the 1900s, in terms of transgendered people feeling less alone and disconnected.  The general public has developed a greater understanding and tolerance for more complicated stories, and the Internet has made finding and building community easier. Suicide attempts among transgendered, a leading indicator, are still way too high though.\n\nAs the movie makes clear, we're still the prisoners of yesteryear's reflex-conditioning in a lot of ways.  When a person experiences anger welling up -- one reaction to feeling powerless in the face of fear -- that rage or wrath may seem God-given and therefore a license to righteously lash out.\n\nThose with an \"angry God\" upbringing have a tougher time dealing with transgendered family members.  Given my own liberal upbringing and attitudes (Rome was pretty cosmopolitan), when I hear people insisting their gender was never a choice for them (I don't dispute that), my thought is even if it were, that would have been OK too.\n\nThe film uses \"transgendered\" as the umbrella term, literally showing a symbolic umbrella and putting other terms underneath it.  In one pithy quote, one of the interviewees makes the important distinction between gender identity and sexual orientation:  who you want to sleep with is orientation, who you want to sleep as is identity.  There's no logical entailment connecting these two.\n\nYes, the word \"gender\" was used in place of \"sexual\" to make \"transgender\" easier to talk about -- this insight from an activist in San Francisco.  \"Transsexual\" comes with a lot of baggage, even if some of it is lighthearted; yes I'm thinking of Tim Curry's performance in Rocky Horror Picture Show.  Did you catch him later in Kinsey?\n\nAnother spectrum might be how much one focuses on or cares about \ngender.  The film emphasizes repeatedly that one's gender is very \ncentral to one's identity.  I wouldn't dispute that that's very true for\n some people however others come across as more asexual in the sense of \ncaring less, which I'm not circling as either pathological or repressed (though it may be in some cases).\n\nWhen I think back to a very young age myself, it was being human at all I had a problem with, but not in a way that was too distressing or that led me into suicidal thoughts.  I just remember a strong sense that many other animals seemed a lot cooler than these hominids.  I was jealous, I guess one could say.\n\nThe real pathology we all need to deal with is this thing we call \"bullying\".  The alternative is not being a doormat, but learning more diplomatic skills.  The right to express disapproval of what one disapproves of is not one to take away.  Neither is it a basic right to never feel offended or insulted by others.\n\nI learned the term \"stealth trans\" from the movie i.e. some are so \nsuccessful at making the transition that they're once again closeted in a\n way, in terms of not being open about having transitioned. \n\nComedians are often our best diplomats, in terms of getting away with treating of sensitive topics that many would just get stuck within and lose their way.  Arthur Koestler on \"why we laugh\" is worth reading.  Laughing is often therapeutic stress relief.  Enter the clowns and cherubs.\n\nX-refs:\n[Kinsey](http://worldgame.blogspot.com/2004/11/kinsey-movie-review.html) (movie review)\n[Prodigal Sons](http://www.quakerquaker.org/forum/topics/reflections-on-the-transgender-conflict?commentId=2360685%3AComment%3A144410) (as mentioned on QuakerQuaker, also [here](http://worldgame.blogspot.com/2015/02/running-from-crazy-movie-review.html) and [here](http://mybizmo.blogspot.com/2014/12/wild-movie-review.html))\n[Gender Wars](http://worldgame.blogspot.com/2014/09/gender-wars.html)\n[Gender Again](http://worldgame.blogspot.com/2014/11/gender-again.html)\n[The King of Masks](http://worldgame.blogspot.com/2016/06/king-of-masks-movie-review.html) (movie review)\n[Gender Bender](http://mybizmo.blogspot.com/2009/10/gender-bender.html)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}