{
  "id": "129020681170995698",
  "title": "Keeping it Quirky",
  "published": "2024-10-30T12:30:00.005-07:00",
  "updated": "2024-10-30T12:33:20.591-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEie3nDoflWAEL1WbloopcZjnfL9zOLwfUr9OSGsZ_kG2_nMYx0CopXdgw4vAYSYtQnwEpdvJVtXpVpmrR-jlaYTUvSt7_mnsQd6s9S6G3wY8WqbToHVfyN3sKg311fGmke35yzxrFzARXxMyALOw8j0XLAV5j8cEaxiduNNAvfNLhhhzPvxbL_1/s1024/art_deco_1.png)What's becoming more clear to me is I'm not on the hook to author some veridical textbook standard that nails it. Nails what? \n\nSpeaking of nails, cosmetics, Max Factor, I am welcoming the view that polymathy, a commitment to comprehensivity, does not entail a commitment to omniscience. The \"know it all\" as a personality type is already off-putting vs-a-vs my type, whatever that is (I've not done Myers-Briggs, or if I have, for joining with temp agencies, they didn't tell me my sign).\n\nInsofar as School of Tomorrow is concerned, this means I'm free to continue exploring off the ends of the roads I've already achieved. That'll lead to new connections, such as I discovered yesterday, H.G. Wells and Orson Welles in the same room with a journalist, on radio methinks. \n\nThey discussed the similarity in their names, as I've pointed out, and Wells asks Orson about the upcoming movie (Orson: thanks for the plug, citizen Kane). \n\nWells has an especially kind spin on the Halloween Panic, when Orson persuaded some listeners there'd been an attack of the UAPs. Wells: oh we knew from across the pond how you Americans like to dress up in a bed sheet on Halloween and pretend you've seen a ghost and start screaming, hah hah. Orson: you're very kind -- he was up to his neck in hot water after that stunt -- which he knew better than to ever live down.\n\nI free to stay with Mark Fisher and his nostalgia for pre-Thatcher English brutalism in architecture, echoing Sovietism, because it reflected a for-the-ages commitment to public works. So Tucker was impressed by those subway stations, why fight it? \n\nPrivatization has come at a cost, and it makes sense for a Portland-based open source freelancer type guy to say that, if not for Pearson to make a textbook out of it. Not that I thoroughly understand the British Ingsoc. What's the BBC again? A private company you say? Not really?\n\nI'm able to stay with David Graeber and fellow travelers, who to my mind were pointing out that it's not a grand struggle between two or three mega-designs, where we all end up on the same page at the end of the day. Why? Why even make that a goal. I'm fine that you and your campuses look and feel different and feature different course offerings. That's how I succeed in recruiting, by emphasizing how we're different.\n\nThink of all the board games there are. I've been to houses where every shelf was pile high with game boxes, because that's what this household chose to specialize in and there we certainly enough offerings out there, to fill a house worth. No problemo. \n\nAnd that's how to think of human communities and their internal arrangements: highly variegated. \n\nGraeber likes to recount how one tribe he came across was all hippie dippie loosey goosey communal anarchist in the summer, but went for hierarchical fascism with lockstep minions in the winter (I paraphrase). Phase changes: a single substance will have gas, liquid and solid phases, quite different. Now multiply by a lot of substances and divide by 137 (just kidding, I mean 42).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}