{
  "id": "5767436869179497586",
  "title": "Keeping Tabs",
  "published": "2017-02-25T10:14:00.001-08:00",
  "updated": "2017-03-18T15:56:56.526-07:00",
  "content": "Denizens of [the USSA](http://controlroom.blogspot.com/2017/02/rabble-babble.html) are the most spied upon in the world, thanks to their \"own\" devices, which phone home to inform all sorts of private interests about one's activities and location.\n\nThose wishing more privacy have an uphill battle out of the box.\n\nOne could argue that people are not entitled to complete privacy and/or invisibility assuming they share public resources.  If you're on the road, sharing it, we have the right to know your identity, no?\n\nThe sense of paranoia that's been building is being deflected onto the Russians these days.  They're the ones doing the spying, not the home team.\n\nBannon served on the board of Cambridge Analytica, which boasts having data on every voter in the US, enough to compute an OCEAN profile and target ads.\n\nEven though this company openly takes credit for the Trump campaign's effectiveness, we learn it was [Russians and Wikileaks](http://controlroom.blogspot.com/2016/12/countermeasures.html) that tipped the scales.\n\nHow many mainstream media reports have directed attention to \"Russian hackers\" versus this psychometrics company based in the UK?\n\nThose media reports picking up on that story are mostly [dismissive of this \"myth\"](http://littleatoms.com/news-science/donald-trump-didnt-win-election-through-facebook) that Cambridge Analytica has working voodoo.  I agree with the \"myth\" part, but then so is the \"Russian hackers\" story about mythical powers.\n\nIt's myth versus myth.\n\nThe effectiveness of targeted advertising based on profiling is hardly a \"myth\" to social media companies such as Facebook and Google.  That's how they make their money.  The fact that political campaigns are likewise advertising campaigns is obvious.\n\nSo how does playing down the role of psychometrics companies stack up against the reams of stories playing up their importance?  How hypocritical are these \"myth busters\" willing to be?\n\nAre psychometric computations what drive this narrative of \"Russia the evildoer\"?  That seems a truism in my lexicon.\n\nPoliticians (social engineers) feel in their gut that oughta work (scaring people about the Russians).\n\nGoing with one's gut is what psychometrics is all about, especially minus the big data component, which might serve as an unwelcome reality check in some cases.\n\nUSers have been susceptible to Red Scares for a long time, so what does it matter if the Russians are no longer red?  Can't we scare the USers anyway, or at least make them angry?\n\nThat's what organized crime wants to find out.  Experiments are underway.  The mainstream media is their tool of choice, what they've learned how to use.\n\nYou know what I always say:  if you want to be a US president, you need to:\n\n(A) know how to lie persuasively and\n(B) have close ties with organized crime (including the CIA).\n\nFor example, president Clinton well understood about the need to ship arms to the Contras in contravention of the Boland Amendment.\n\nThe CIA wouldn't enjoy the loyalty of its home team mercenaries if big money were not involved, meaning cocaine sales and money laundering, with lots of partying for friendly politicos.\n\nClinton could not have become president had he not, as governor of Arkansas, helped with the CIA's program, a continuation from Vietnam War days, where drug trafficking was likewise a big part of Air America's business.  Not a secret.\n\nPresident Trump is still being tested by organized crime, as Putin has his own criminal networks and the idea of \"getting along with Putin\" is pitting mob against mob, at least in the lower ranks. \n\nTrump's base wants to find out if \"draining the swamp\" has anything to do with telling more of the truth about recent history.\n\nGiven the mainstream media is purposely forgetful (\"United States of Amnesia\") and has no means to connect the dots for people in any short evening news format, the social media habits of USAers have changed.\n\nThey want the bigger picture.  They're turning to Youtube.  Many of them are not big readers, thanks to TV, but then the Internet is turning out to be [a lot like TV](http://worldgame.blogspot.com/2009/03/urner-workshop.html).\n\nHollerith machines were all about keeping tabs on people and of course the Germans wanted them to implement Nazi programs.  IBM helped them out.  Lets figure out who all is Jewish.\n\nWe forget how many in the US business community were tacitly rooting for Hitler.  Eugenics, as a \"science\" was co-developed on Long Island.\n\nOnce the war was over, the losers did not necessarily agree it was over and the Cold War picked up right where WW2 left off, just as the war in Korea rolled right into the war in Vietnam.\n\nMany Nazis ended up in [the Middle East](http://mybizmo.blogspot.com/2017/02/study-circle.html), working with the CIA to frustrate Arab nationalism.  German scientists pleaded innocence and flooded into the US rocketry program, resulting in ICBMs.\n\nUndermining governments, forcing regime change, has been the game for a long time.  The mob rules.  That's a tough lesson to teach in school though, so a lot of people end up confused.  They suppose ideals match the reality and criminality relates to \"a few bad apples\" and nothing systemic.\n\nNo one is asking if the Trump campaign was in close touch with UK intelligence operatives throughout the election season.  If we're as fast and loose with definitions as we are where Russians are concerned, then the answer is yes, of course.\n\nWhich nation did the US have a war with to win independence for itself, Russia or the UK?\n\nAh, but with the latter we (the USers) have a \"special relationship\".  British Aerospace and the Pentagon are joined at the hip.  [BP oil](http://mybizmo.blogspot.com/2012/07/big-fix-movie-review.html) powers the USSA's aircraft carriers.\n\nWe've been taught that Russia is our enemy.  Those reflexes still work, but maybe not as much as they used to?  Stay tuned.  Global literacy levels are still on the rise.  Telling people how they must think is getting more difficult.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}