{
  "id": "8171149332657257994",
  "title": "Keynote at NPYM 2015",
  "published": "2015-07-16T12:18:00.003-07:00",
  "updated": "2015-08-11T17:35:59.716-07:00",
  "content": "Our theme this year is Quaker Craft, and our keynoter Robin Mohr was faithful to said theme.\n\nThe connotations were comfortable:  handicrafts, carpentry, pottery, guilds with apprentices.  The sense of craft as in \"crafty\" was somewhat missing.  No one said \"witchcraft\" out loud.  No connotations [of shamanism](http://www.amazon.com/Waking-poet-Acquiring-usually-talents/dp/0941386007), at least not obviously.\n\nQuakers the World Needs:  what would those look like?\n\nThe imagery was fairly conventional:  we need Friends who:\n\n- Visit other Friends in the hospital (no mention of jail)\n- Help at the Food Bank maybe ([the Luchinis](http://controlroom.blogspot.com/2014/06/notes-from-business-meeting.html) do that -- most active Friends in our region)\n- Address one's own racism (in some way other than swilling in guilt we hope)\n\nThe liberal-academic middle class profile was much in evidence, with specific mention of:\n\n- listening to NPR\n- driving a Prius\n- dutifully replacing incandescent bulbs with compact fluorescents, and \n- learning what not to say to friends in the hospital (following the rules of social etiquette is important) \n\nNPYM Friends tend to be car-owning good doobies in [nuclear families](http://worldgame.blogspot.com/2014/07/serious-about-soaps.html) (on [my resume](http://grunch.net/kirby-urner) too!), so what else is new.  We're comfortable.\n\nEncouraging:  Gayle in her intro mentioned [Robin's Twitter profile](https://twitter.com/robinmsf).  Robin herself mentioned discussing ideas on-line as a way to practice.  Of course I'm thinking \"listservs!\", a technology Quakers under-utilize. \n\nQuakers have said for ages that, semi-sardonically: we started out wanting to do good (like the saints), yet ended up doing well (as in wealthy).\n\nYet these comfortable Quakers also want to be \"dangerous\" according to some of their (our) aspirational literature.  Really?  Seems like science fiction right, as in pretty far out.  Who could seem less dangerous?\n\nFormation in the Vocation of Being the Quakers the World Needs:  that's what our Friend in Residence considers our business.\n\nRobin herself is general secretary for the FWCC section of the Americas, FWCC being Friends World Committee for Consultation.  Coincidentally, Nancy Irving and I were chat partners for \"share your Quaker credentials\" exercise.\n\nNancy was FWCC general secretary when we visited [in London that time](http://worldgame.blogspot.com/2006/04/london-knowledge-lab.html), plus has served on God knows home many committees.  Improvising a fun answer, I confessed to my role of \"Quaker Pirate\" (pointing to my black hat on the floor to prove it, an now the Whitworth University Pirate T-shirt).\n\nSpeaking of confessions, Alan Mountjoy-Vinney noticed I was acting like a professional cameraman and as board member for Western Friend suggested I might be the best one to help editor Mary Klein, who'd sent out a call for pictures in advance of her being here later.\n\nActually, Mary had already suggested by email that I play that role (in addition to her board people), but in my own mind that was contingent on getting the XQ-1 back from Camera World.  But it wasn't ready in time.\n\nSo instead, I brought along an untested-by-me vintage Nikon Coolpix which Melody very thoughtfully rescued from a free pile and passed along, knowing how much I missed the Fujifilm.  This Nikon is old enough that even its memory card is hard to find a reader for anymore.\n\nAnyway, I tried confessing to Alan I was somewhat faking it, until I figured out if this camera's pictures were worth sharing.  I've yet to see the final images, pending acquiring said reader.  [Thank you Melody](http://worldgame.blogspot.com/2015/05/mad-max-fury-road-movie-review.html), for thinking of me (she went to Witch Camp again this year, used to work with AFSC in Austin).\n\nPutting the keynote theme another way:  Quakerism is a factory for making more Quakers (yep), stamping out more in the same mold.  Query:  what does this factory look like and what does the world need more of, in terms of product?  Good question.\n\nSpeaking for myself, I'm not convinced the world needs any\n more middle class Protestants of the North American variety, evangelical or otherwise.  Of course\n it's really not up to me and they'll keep flooding in by the legion no doubt.  However, insofar as I'm\n\nhelping to design and build a next Quaker factory (a next Quakerism), I'll tap other influences a \nlot more.\n\nWhat influences?\n\nWe had mic runners, which reminded me of est, but only a little.  A few years ago I picked up some resonance with Scientology, but [just a tad](http://worldgame.blogspot.com/2008/07/interest-group.html).\n\nMaybe the world really does need [more est people](http://controlroom.blogspot.com/2009/12/some-storytelling.html), per [that science fiction novel](https://en.wikipedia.org/wiki/Est:_The_Steersman_Handbook), by S. Clark Stevens I still need to read.  Note to self:  download Kindle edition if available (whoa, hard to find!  Expensive!).\n\n[Scientology](http://controlroom.blogspot.com/2013/09/interfaith-meetup.html) is good around improv and so is popular [around Hollywood](http://controlroom.blogspot.com/2007/08/which-hollywood-star-for-president.html), but beyond that I'm not into it.\n\nAnyway, I'll take more Crafty Witches over more Protestant Good Doobies any day of the week.\n\nWhat resonated the most for me personally was the theme of diplomacy.  \"We need to speak both NPR and NASCAR\" Robin said, paraphrasing another Friend.\n\nAble to [communicate effectively](http://worldgame.blogspot.com/2012/11/plain-speech-meditation.html), with people in many walks of life:  that's a craft, even if the mix of [walks one talks](http://worldgame.blogspot.com/2005/09/talk-like-pirate.html) is highly variable.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}