{
  "id": "8188076565492412876",
  "title": "Knocking on Doors",
  "published": "2013-04-16T16:56:00.001-07:00",
  "updated": "2013-05-26T21:57:14.554-07:00",
  "content": "[](http://www.flickr.com/photos/afscportland/8846782329/)\n\nI was brainstorming with our Portland AFSC support committee about associations for \"doors\" recently.  The Door Project is one of those Mike McConnell like efforts to make a meme, condense a dharma.  Anyway \"knocking on doors\" is one of the themes, and that's the stage we're at now.  Sounds Biblical.\n\nMike McConnell was an AFSC regional director who died recently.  Quoting from email:\n\nMichael became a passionate and creative leader in AFSC \nand with many partners for building our programs to challenge war and \npreparations for war, while lifting up alternatives. He\n was one of our chief thinkers and strategists for work on ending war \nand violent response to conflict, from developing the “Eyes Wide Open” \ncampaign to our current F-35 campaign on military spending. He supported\n creative and effective programs dealing with\n healing justice, immigrant rights, peace, and economic justice across \nthe region and the whole of AFSC, nurturing leadership qualities among \nstaff and championing opportunities for young people to engage in AFSC \nwork and gain knowledge, skills and  passion\n for peace with justice.    Michael’s legacy is deep and enduring.\nMore concretely, Right to Dream Too (R2D2), close to the Chinese Gate, has a fence / flank made of doors along SW Burnside, in a zig-zag pattern.  This has become an art installation, with R2D2 seemingly air mailed from Burning Man.\n\nSome here would likely gladly staff an eco-village prototype if they trusted the company, but few trust The Corporations holding \"personhood\" hostage.\n\nYou can sponsor these symbolic doors if you want to, a place to put your message, like a brick in a plaza, though less permanent, we understand.\n\nIf the \"gentrification of camping\" (living outdoors) could be taken a few steps further, we might have communities we're proud of, find aesthetically pleasing, and yet their camp-like nature is as unmistakable as their high tech may be overlooked, at least at first.\n\nOccupy Portland was not that much of a scuzz bucket as some would have you believe.  On the other hand, it did become a magnet for monsters, molesters and other marvels, and lo the village was quasi defenseless, despite its security tent and squad.\n\nThe FNB tents held their ground and provided some alternatives to big tent fare.  We packed up on schedule, with other principals, preferring the big party notes of the previous night to a more serious confrontation with police, which is what awaited the lingerers and/or those who didn't catch our broadcast.\n\nWhen I say \"we\" I don't claim to have been a denizen.  My Blue Tent (a wooden affair) was not that far away, and more capacious and comfortable.  I helped with supplies mainly, pulling SkyBlue (a trailer) behind EmoKid (a bicycle).\n\nWith all that straw spread around, and festive buzz in the moonlight, it was much like a petting zoo, like The Grotto in years passed.  Children were safe, at least initially.  Had this experiment been conducted in a proper setting, versus in the downtown of a major city, much would have gone differently, obviously.  More of a perimeter could have been preserved.\n\nI've called for such villages through DemocracyLab, following the \"company town\" model but with DemocracyLab more of an infrastructure provider than landlord.  The kind of eVoting stuff Massimo writes, with some help from David -- that was a topic at our last meeting, just before Thirsters.  The Python Software Foundation [uses this product](http://worldgame.blogspot.com/2013/04/birthday-party-spring-2013.html).  Deb Bryant was on the alert for such open source offering given [OSI's](http://opensource.org/) in-house needs.\n\nI couldn't stick around for that particular Thirsters though, as I had my appointment with H&R Block to finish refiling, plus my preparer had a good letter regarding the 1099 mirror and IRS seeing double in 2011.\n\nThat was actually just the one income, with the partnership TIN being retired, DWA / 4D transferring to my personal SSN where they (it) continue(s) serving the public, albeit not in any especially high profile capacity.\n\nI'm mostly a W2 guy these days, as the 2012 1040 makes obvious, with the back office the one getting the makeover (that's the $9000 reported expense, funds from business dealings for an office the biz pays for, enduring two years of leaking from water damage, taking about 10.6% of floorspace).\n\nThis Sunday is a memorial service for Igal Koshevoy.  I'd been kind of taking him for granted as a pillar of our open source community, the paradigm geek.  Geeks can suffer some hard times, I know that.  We should learn to support each other more, not that we don't already, to an admirable degree even, but that still leaves room for improvement.\n\nIgal gave some of the best talks ever, on exotic trains (BarCamp), and on virtual worlds (WhereCampPDX).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}