{
  "id": "607676484119261160",
  "title": "Laila's Birthday (movie review)",
  "published": "2009-07-05T20:42:00.000-07:00",
  "updated": "2009-07-09T18:04:55.552-07:00",
  "content": "This turned into a family event, which I was happy about, and both Tara and Carol expressed some satisfaction in getting to join in, meet some new people.  Our venue:  NW Film Center, [Whitsell Auditorium](http://controlroom.blogspot.com/2006/01/power-of-nightmares-movie-review.html), Higgins beforehand, for appetizers (and [no beer](http://worldgame.blogspot.com/2009/07/independence-day-weekend.html) for me).Although a bunch of us in the audience were from Ramallah [or had visited](http://mybizmo.blogspot.com/2006/07/eighth-grade.html), the sprawling backdrop was hardly recognizable and indeed the movie does nothing to defend the geography, lets it spill over into the imagination, might as well be [favelas around Rio](http://mybizmo.blogspot.com/2009/06/favela-rising-movie-review.html).  I coulda sworn the opening vista included an ocean, but that was before he even woke up (loud noise) so this might've been in his dream.Existentially, it's a high hassle environment with [lots of crazy characters](http://mybizmo.blogspot.com/2006/11/about-secularism.html).  Our protagonist is a man of dignity and fair play who adores his family.  He represents Everyman, not uncommonly brave, nor slow, just a kindly gentleman who would prefer if people didn't smoke in his cab.The scene in the Justice Ministry is truly Kafkaesque and beautifully executed.My worry was his righteous indignation would get in the way of his having a workable solution, and that he'd spin out of control, which he does, but only for a short period.Instead, he demonstrates what [Stuart Kauffman](http://controlroom.blogspot.com/2009/04/reinventing-sacred.html) calls \"[exaptations](http://www.grunch.net/synergetics/mathsummit.html)\" i.e. the ability to repurpose.  His resourcefulness keeps him from being a tragic victim.  We empathize without seeing him as a hopeless case, although one of his peer drivers is pretty sure the story has unraveled (and indeed, things were looking somewhat bleak at that point).Our family man was fortunate to have this home life to return to, whereas [our protagonist Wendy](http://worldgame.blogspot.com/2008/11/wendy-and-lucy-movie-review.html) has a lonelier row to hoe as that movie ends.  She too is resourceful.  Sometimes it's more the hand you're dealt than how skilled a player i.e. let us not judge too harshly, if we must judge at all.Tara is admitted free to the Art Museum until age 18, is looking forward to [the tattoos exhibit](http://www.flickr.com/groups/markingportland), as am I, though I don't qualify for any discounts ([yet](http://www.flickr.com/photos/17157315@N00/3655785298/)).  We also wanna make the M.C. Escher exhibit, which Tag was exulting about.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}