{
  "id": "112326110855042613",
  "title": "Last day of OSCON 2005",
  "published": "2005-08-05T15:01:00.000-07:00",
  "updated": "2006-11-15T11:43:44.722-08:00",
  "content": "I grabbed the 75 bus this AM and got to OSCON early -- plenty of time for coffee and baked goods, conversation with a Perl programmer from Denmark. He asked what I spoke about (my name badge indicates I'm a speaker) and I explained about the Fuller School, how I'm a big fish in a small pond, how open source has facilitated our work enormously and on many levels.Keynotes:Asa Dotzler discussed a perennial topic: how Linux might do more to help Regular People on laptops and desktops, even while keeping it a kick ass system for developers.The next keynote by Drew Endy of MIT was about programming DNA -- maybe just to insert some documentation. Yeast consists of about 12 million characters of info. Open source yeast? Problems: (1) balkanization of basic biological functions (patents widely distributed -- imagine individual coders owned each piece of punctuation in a program and needing multiple permissions to write each line) (2) quality of code (3) screwed up rights to reuse, react, reverse engineer.Tony Gaughan (CA) talked about his experiences with Ingres (now open source). Licensing is confusing (GPL, LGPL, CDDL, CATOSL etc.).Danny O'Brien talked about good and evil in Open Source (software patents are evil).My favorite presentation was [Saul Griffith's](http://conferences.oreillynet.com/cs/os2005/view/e_sess/7506) about [Howtoons](http://www.howtoons.org/): kids hacking the [physical world](http://www.finkbuilt.com/blog/?p=52), using comic book instructions. Lots to learn here, about teaching software skills as well.The panel on women in open source, and engineering more generally, provided interesting insights. Juggling time commitments and priorities -- an age-old problem (it's what operating systems do). The ability to telecommute certainly helps, especially if you're a parent (this is certainly true for me, a dad).During the Python lightening talks I was able to squeeze in 10 minutes about [hypertoons](http://www.4dsolutions.net/ocn/hypertoons.html) (with projected demo), a real crowd pleaser. Guido was likewise into graphics: a clock featuring multi-colored turning disks, making use of Tk.Miguel's concluding keynote gave us a foretaste of where Novell is taking the Linux desktop: X running atop OpenGL (= xgl), meaning Gnome, with Mono at its core, will be able to keep pace with OS X (and the next Windows) when it comes to eye candy. Beagle looks like fun.Shortly I'll be packing the car for a weekend camping trip -- time to get away from computers for awhile, unless I take the laptop to show hypertoons to Bridge City Friends.Thanks to all for making [OSCON 2005](http://flickr.com/photos/tags/oscon05) a fantastic learning experience.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}