{
  "id": "111358540233259688",
  "title": "Last ISEPP Lecture 2005",
  "published": "2005-04-15T10:46:00.000-07:00",
  "updated": "2009-04-27T15:12:15.410-07:00",
  "content": "Our guest last night was Dr. William Wulf, currently half-way through his second and final term as president of the [National Academy of Engineering](http://www.nae.edu/) (NAE), which co-exists with the [National Academy of Sciences](http://www.nas.edu/) and the [Institute of Medicine](http://www.iom.edu/) within the framework of the [National Research Council](http://www.nationalacademies.org/nrc/).Dr. Wulf made it clear that whereas the NAE is an honorific society (per usual with such academies), it also has a special mission to advise the federal government on matters of technology and social policy on a not-for-profit basis. The membership churns out a lot of in-depth, well-researched reports in answer to various policy questions coming from Congress and federal agencies. Occasionally a report will have a classified appendix (meaning it's not accessible to the general public), but for the most part, these studies are all [available on-line](http://www.nap.edu/).The theme of Dr. Wulf's lecture was C.P. Snow's \"chasm between the two cultures\" by which Snow meant the humanities on the one hand, and the technology fields on the other, the latter being characterized by their heavy emphasis on mathematics.Whereas the idea of \"two cultures\" is easy to grasp, sometimes it makes more sense to break it down further, and Wulf outlined differences between science and engineering, which are indistinguishible in the middle, but also define two extremes.Engineering is different from science in its emphasis on creating new phenomena, versus simply studying existing ones. Engineers create, bring into existence, design. As such, Wulf considers them to have more in common with artists than with many scientists. He wants to communicate this to new generations, so that creative, imaginative students don't buy into some silly stereotype of the engineer as some nerdy cog in the machine who doesn't think about the concerns of real people or topics within the humanities.This difference has also been a key part of ISEPP president Terry Bristol's philosophy, so I found it interesting to have them both addressing our pre-lecture on this issue (a small gathering of teachers met with Dr. Wulf ahead of time, in the Heathman Hotel). Terry pointed out that the US Constitution may be viewed as a [product of engineering](http://www.grunch.net/synergetics/usaos.html), a blueprint or circuit diagram, complete with [feedback loops](http://controlroom.blogspot.com/2005_02_01_controlroom_archive.html), load balancing and so forth.At the dinner afterwards I commented that [Dr. R. Buckminster Fuller](http://www.grunch.net/synergetics/synessay.html) also wrote a lot about C.P. Snow's famous lecture, and that one way of bridging the chasm is to treat Fuller within the sphere of the humanities, as a New England Transcendentalist for example, and a poet, and then follow his threads into geometric and engineering domains.Then I brought up Dr. Donald Knuth at Stanford, who suggested we fight overspecialization by becoming competent in at least two fields, preferably quite far apart. In Knuth's case, this would include his [foray into theology](http://www.amazon.com/exec/obidos/tg/detail/-/0895792524/002-5534072-8368000) (a humanities topic, rather different from computer science, in which discipline he's considered a giant).I asked Dr. Wulf (who has a background in computer science) if he liked this model: you don't get to consider yourself well educated or accomplished in the liberal arts, if you don't have fairly well-developed competence in at least two disciplines, one from each side of C.P. Snow's chasm. Dr. Wulf pointed out that Dr. Knuth was also an accomplished organist, that few attain such stature in even one discipline, let alone more than one, but yes, aspiring to competence in at least two widely spaced disciplines was a good idea and he was all for it.[Don](http://mybizmo.blogspot.com/2005/02/power-skating-with-ceo.html) was in high gear last night, helping organize the pre-lecture and handling logistics, including the transfer of Julian's sculpture Unraveling Collagen from the neighboring Performing Arts Center to the lobby of the Arlene Schnitzer Concert Hall -- and back, after the lecture. Featuring [Julian's work](http://mybizmo.blogspot.com/2005/01/going-down.html) was a great idea for this lecture in particular, as it bridges C.P. Snow's chasm very effectively and intelligently. Good brainstorming by [Wanderers](http://www.google.com/search?q=wanderers&ie=UTF-8&sitesearch=worldgame.blogspot.com&x=0&y=0)!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}