{
  "id": "5650303698860064481",
  "title": "Late August Weekend",
  "published": "2024-08-26T11:04:00.000-07:00",
  "updated": "2024-08-27T08:45:22.780-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72177720319788214)\n\nSo what was my weekend like? As you know, I like to study, and that includes adventures into the environment, such as taking Springwater Corridor to Sellwood and over the bicycle bridge to the Sellwood-Tacoma Max station. Ride Orange Line back to OMSI stop, transfer to FX2 to within blocks from home. That's work-study time.\n\nOn Sunday it was walk by Terry (ISEPP prez) and a consultant working on finding homes for left behind office furniture and supplies. I gather the John C. Lilly group has moved to other digs. Onward to Stark Street Meetinghouse (formerly ESI, before that Jantzen) where the testimony was about \"sangha\" (community) -- although no one actually used that Buddhist word (but many were maybe thinking it, given our demographics (I know I was)).\n\nThat night I watched Kubrick's Eyes Wide Shut, believe it or not for the first time, although having seen clips over the years, it felt familiar in places. I'd checked Movie Madness for it before, and imagined it was rented out, not realizing their Kubrick shelf wrapped around and down. I'm illiterate in so many dimensions I've lost count. Talked with fam through Verizon on my iPhone.\n\nAt Quakers, I met up with Dr. Carl Abbott over snacks and thanked him for his excellent presentation on Portland history for Humanists of Greater Portland (HGP), to which I'd been party over Zoom (not the first time I'd caught one of his talks). Urban Studies, PSU. I caught up with Leslie, back from California. \n\nAlso, Megge suggested I join up with Peace & Justice (as it's now called -- did I get that right?). Quakers revolve through a finite set of management committees, learning to see a shared business from the inside, from many angles. Good experience building social and supervisory skills.\n\nI'm just hitting some of the highlights. Weekends don't stand out that much at the moment. I do have a work schedule in the queue, with Clarusway again, but that's always contingent on other outcomes, per some cosmic Gantt chart I'm not privy to.\n\nSpeaking of Clarusway, this morning (Monday) I posted to edu-sig, a Python org Mailman group of longstanding, regarding digital roots (or \"indigs\" as some've called them).\n\nHawthorne Street Fair!  Slides above.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}