{
  "id": "1245300852179704369",
  "title": "Launch Pad",
  "published": "2017-12-15T12:22:00.000-08:00",
  "updated": "2017-12-15T12:36:18.427-08:00",
  "content": "The house next door held an album release party last night. I believe Peach Pit is the name of the band. One of our regulars found a wallet on the sidewalk and mentioned to several partiers we had it. Stopping the band for a sec to make an announcement proved impractical.  She came and collected it later. I never saw the lass as I was engulfed in the Steve Holden Chair of Computer Science, now with a large log in the back to compensate for lost screws.\n\nThese were the days, at the conclusion of 2017, when DC was relinquishing relevance left and right, butting out of businesses it no longer has the capacity to either regulate or understand.  Like the military, DC depends entirely on the private sector for any remaining smarts.  I'm not saying the public sector can't or won't make [a comeback](http://controlroom.blogspot.com/2011/05/cowardly-capitalism.html), however that needn't happen in DC in particular.  OSCON is [returning to Portland](https://thenewstack.io/oscon-coming-back-portland-show-wrap-co-chair-kelsey-hightower/) after all.\n\nMelody and Alexia each took a guest room as we switch tracks through this hub.  Blue House experiences turnover.  I've finished my most recent cycle of ten meetups, netting more LinkedIn connections.  That's an over-the-wire closed circuit TV show, built atop Internet technologies (or should we write \"internet\" -- the Buzzfeed copy editor shared some views on that at Powell's recently).\n\nThe idea of a global oligarchy / kleptocracy is not new and the concentration of capitalism in fewer hands, amidst a rising financial literacy index, has helped it once again gain foreground status. The notion of a \"grunch\" of giants pulling the strings is ingrained in the folklore, as expressed in various narratives.  The demise of nation-state politics, or shall we call it an eclipse, was never an overnight phenomenon.  We'll have true believers clinging to their true beliefs long into some future.\n\nTom's, a favorite breakfast nook, was not quite up to snuff this morning; too busy? The PSU student I was with required one fried egg over hard, but got two, soupy.  For a hard egg person, soupy is not appetizing.  Have you notice the \"hard over\" types also trend towards crispy bacon?  Lets see a scatter plot right?  Big Data where are you?  I posted a semi-favorable review on Yelp!.  No place is perfect.  They recooked the egg part then still billed for two (neither eaten), a sixty cent difference, but the bookkeeper trainee stood on principle, bless her heart.\n\nComing back to Blue House we encountered a small murder of crows, nothing like what we see (and hear!) in the PSU park blocks.  I mention that \"group word\" for crows in explication of my \"grunch\" (of giants) above.  Haim and I used to joke on math-teach about how I got it wrong in [Desovereignization](http://www.grunch.net/synergetics/grunch.html) (a web page):  I said \"gander\" instead of \"gaggle\" (of geese). I still get those two confused.\n\nPlease don't ask that question. I think we have seen there is no bottom to stupidity.😝😝😝 [https://t.co/Z9QjaaCitN](https://t.co/Z9QjaaCitN)\n— Dorthea Kemp (@dkempdesigns) [December 14, 2017](https://twitter.com/dkempdesigns/status/941376612263710720?ref_src=twsrc%5Etfw)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}