{
  "id": "2191935588428789339",
  "title": "Layers / Anthropology",
  "published": "2013-07-11T21:47:00.001-07:00",
  "updated": "2013-07-11T23:07:53.098-07:00",
  "content": "Those who stare at GIS displays a lot (not me these days) know that data comes in layers.  Check out Google Earth or one of those: you can turn the layers on and off.  Turn the roads on and off. Check out the I-net. Highlight different features.\n\nI think that meditation was in part kicked off by [Applewhite's saying](http://mybizmo.blogspot.com/2013/05/the-age-of-carbon.html) \"tomographic\" with respect to [Synergetics](http://controlroom.blogspot.com/2006/06/gobbledygook.html) (in The Futurist), a word found in PET, positron emission tomography. Positrons don't last very long but they're integral primitive objects with their key roles.  Solar fusion [is positronic](http://hyperphysics.phy-astr.gsu.edu/hbase/astro/solarpp.html#c1) along one path.  CERN is really into positron channeling, not just hadrons.\n\nESRI's ArcView and related products, give you layers from datasets.  Superimpose this and that, learn from the patterns.  Like when slime molds define a transportation system, do the math.\n\nSome tribes speak of the ancestors stacked up on one's shoulders, like a totem pole I suppose.  Some journal-keepers might have branded that \"superstitious\" denying them their metaphors for what we in the computer programming business take for granted:  the objects have their lineage, their parents.\n\nWhen a community is stressed, you will see the alchemy at work, as personalities differentiate and assume a foreground.  [Winston Churchill](http://worldgame.blogspot.com/2004/11/great-pirates.html) was the war time leader for Britain, a product of those times. Or does it go the other way?  Historians debate these chicken and egg matters.  How does one explain Hitler or Napoleon?\n\nLet me point to the TV remote as one of the great equalizers we didn't have back then.  We're freer to register \"ratings\", a level of approval / disapproval.  Some people say Hitler would have been that many more times a monster if Nazis had today's TV.  But would his series have taken off?  Things have to check out to some degree, and with television comes a new level of scrutiny -- or not if the newsies get lazy.\n\n[Omni-triangulating](http://worldgame.blogspot.com/2005/12/omnitriangulating.html) and integrity go together.  We have a lot of well-placed faith in not coming across utter contradictions.  How well placed is that faith?  I'd turn that around and ask what else there is to have faith in?  Utter capriciousness?  How does one \"surrender\" to that?  We'd rather surrender to \"eternal laws\" I'd usually think, though we do respect freedom and heroic postures.\n\nAnyway, back to layers, we see them in people.  Shades come to the foreground, as a new persona takes over, slowly solidifies.  We all create / cast each other.  Projection is that powerful.  It takes a village to have a self, or at least a self of the kind we think social, in shape to interact.  We get new levels with greater aggregates or \"[piles](http://mybizmo.blogspot.com/2005/11/physics-emergent-isepp-lecture.html)\".\n\nThe hermit gets tired of social interaction and retreats to a life away from the rat race.  We sometimes call that retirement in this country.  In India, they see \"holiness\" in that, but then \"holiness\" is a chief form of entertainment in the land of Ganesh.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}