{
  "id": "8238809280108323119",
  "title": "Learning Curve",
  "published": "2016-06-28T08:14:00.000-07:00",
  "updated": "2016-06-28T08:36:42.248-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/27883710431/in/dateposted-public/)\n\nI was fortunate to meet up with a strong mentor at the code school yesterday evening, who clued me in to both [CodePen.io](http://codepen.io/) and [ToDoMVC.com](http://todomvc.com/), both valuable and well-crafted websites.\n\nCodePen shows three coding panels side by side:  HTML, CSS and JS (JavaScript), with the resulting web page beneath.  A developer is welcome to reuse the code, and also to change the code and see the difference that makes immediately.\n\nToDoMVC demonstrates the front end solutions from which developers might choose, such as Angular, React... Vue, and implements the same task manager (to do list builder) in each one.\n\nAs my teacher explained, the trend is to turn the browser itself into more of a development platform with all the moving parts needed inside to write serious applications.\n\nIn the early days, a browser would more passively splat out the rendered page then just sit there.  With AJAX the pages became dynamic but the development experience was still somewhat clunky.  Turning the browser into more of a developers' platform is where we're heading today.\n\nI purposely did not bring a computer of my own to the school, as I wanted to immerse myself in others' projects.  Greg and Margaux showed up, which I appreciated, especially in light of Greg's falling down a mountain about two weeks ago (long story).\n\nThen I meandered down to the River Place marina where Don has his boat moored for Blues Festival season.  I snapped the above picture as I was leaving to walk home.\n\nI'll be studying the above websites in earnest.  Just knowing they exist is already a big help.  [Bento.io](http://bento.io/) is another one I've come to value.\n\nAlso on the code school front, my new Raspberry Pi kit came in the mail, from Amazon.  My plan is to install the Pi3D library and start working through some of the examples in Peter Farrell's Hacking Math Class.\n\nPeter, Jorge, the Litvins, and [a very few others](https://mail.python.org/pipermail/edu-sig/2016-June/011474.html), are up to writing new high school math curricula that make use of current technologies.  Most math teachers are slogging ahead using scientific calculators, which to me seems retro and alien, inappropriate preparation for a life in my tribe.  I wrote about my sensibilities (yet again) [on edu-sig last night](https://mail.python.org/pipermail/edu-sig/2016-June/011477.html).\n\nNext week I'll start a next gig teaching IT workers in California, from my base in PDX. \n\n[](https://www.flickr.com/photos/kirbyurner/27941812845/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}