{
  "id": "396287527722701502",
  "title": "Learning a Living",
  "published": "2016-06-24T12:31:00.001-07:00",
  "updated": "2016-06-24T13:10:16.355-07:00",
  "content": "The above RSA animation makes some good points about our obsolete system of education.\n\nI'm seeing that in Portland, my home town, where [refugee families](http://controlroom.blogspot.com/2015/10/journalistic-shorthand.html) show up all needing to learn the same things, but depending on age, family members get split up.\n\nJunior has to take TriMet to school to learn Common Core Math in an overcrowded room, whereas Mom & Dad, eager to learn more English, perhaps by reviewing Calculus, might study for their GEDs at home.\n\nYou have to be over 18 to get a GED scholarship, so junior is out of luck.  How is that \"equal access\"?  The family is split apart.  Why can't junior stay home and log in to the same courses the older siblings are taking?  They could study together and help one another as family members are wont to do [in some cultures](http://worldgame.blogspot.com/2016/01/ethnic-diversity.html).\n\nWhy does Oregon subsidize the practice of college professors teaching what by rights are high school level courses?  Don't we expect college professors to teach at the college level?  If a teacher is trained to teach high school, why must that teacher compete with college professors for students needing high school level content?\n\nThe school districts would be better able to keep up if allowed to offer online secondary school level courses to adults as well as to those under 18.  This would result in many curriculum improvements as adult students have a better sense of what's really relevant in the real world.\n\nThe question of whether high schools or colleges teach specific content should have more to do with the content than the age of the students, especially in the Internet age.  Why should a 21 year old not be allowed to take the same math course as a 17 year old online?  \"Because that's how we've done it in the past\" is simply not a good answer.\n\nI'd like to teach CS-friendly math to adults and kids alike online, like I've done for adults in California and for kids through Saturday Academy and Saint Dominic.  Portland Public Schools need to offer CS-friendly math to anyone ready to tackle the subject.  I'd do classroom work with the teachers if they want to know more about [what \"CS-friendly\" means](http://worldgame.blogspot.com/2016/06/pandering-to-muggles-editorial.html). I can't do all this public school teaching by myself.\n\nWhen it comes to exams, lets follow the [Nexus Academy model](http://controlroom.blogspot.com/2015/06/high-school-21.html) used in Michigan:  proctored study halls and testing centers will authenticate a student's identity.  But if you're just studying and preparing for tests, you're not required to spend your time in a proctored setting.\n\nIf you have guardians and a place to study at home, why bus across town just to sit in a crowded room listening to a teacher who might not know your name.  You can get the same content on Youtube with a lot less duress and pain.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}