{
  "id": "1601452037478989500",
  "title": "Learning to Code",
  "published": "2018-04-24T13:08:00.002-07:00",
  "updated": "2018-04-24T13:12:45.321-07:00",
  "content": "I'm about to head out to a distant section of Greater Portland, actually outside the city limits I'm pretty sure, to work with elementary school students on learning to code.\n\nWorking in this wartime economy is difficult.  You might think I'm far away from any wars, living in some American Dream, so what am I talking about?\n\nIn truth, North Americans have become psychologically damaged by Endless Wars with no end in sight.  The Weapons of Mass Suicide are singing a siren song to a lot of people.\n\nThis morning I galvanized the Wanderers discussion list to pick up some controversial topic for debate, something with science and engineering angles.  We'll be looking at so-called 5G and the topic of microwave radiation.\n\nThere's a sense that we're drowning in false reports and propaganda.  The narratives have not grown up sufficiently to sound realistic, so we get these little nightmare scenarios.  We know they have a short half life. I think that's because we've already outgrown the nation-state system, such as it was, but so what if that's what I think.  What people feel are the constraints of the straitjacket.\n\nPeople take refuge in what's slower moving, the more cosmic, the wheel of life itself.  The political narratives of the wartime economy are a source of brain damage.  Lets just call it \"wrong frequency\" and seek protection.\n\nI'm all for increasing tourism to replace terrorism.  That's stereotypically a leisure class activity and a lot of people are being expelled from the leisure class.  Another way to tour is in uniform, not as a guest necessarily, but as an armed combatant.  That's how many get to see the world today, as terrorists.\n\nHowever, we also see that many of those engaged in the fighting cannot afford uniforms.  They're civilians defending a piece of turf, turned into combatants by circumstance.  North Americans see how this phenomenon is spreading and cling to their own weapons just in case.  They see Aleppo and realize that cities are not safe.\n\nThat's what happens in wartime.  Planning for the future tends to low ebb.  People just don't see a shared vision.  Only positive science fiction is in any way unifying.  Dystopian science fiction is more ubiquitous, but then people can't agree on it as easily.  The narrative fragments even as it demoralizes.\n\nI don't bother my students with world affairs.  We're focused on learning skills and concepts.  I do my best to exit the wartime economy and create a small oasis of peacetime for them.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}