{
  "id": "5284315749623096225",
  "title": "Learning Reading",
  "published": "2010-06-07T10:05:00.001-07:00",
  "updated": "2010-06-19T00:37:50.267-07:00",
  "content": "[ [from Math Forum](http://mathforum.org/kb/message.jspa?messageID=7089910&tstart=0), fixed some typos ]On Sat, Jun 5, 2010 at 12:48 PM, Robert Hansen  wrote:> Landmark School>> $45,000.00 per year.>> It would take some time to study the ramifications> of that one fact.>> Also, they tutor (I should hope so at that price).>> I am less than convinced now than when we started> this debate.>I've been perusing this whole thread. I liked the part where Pam talked about decoding words, not just getting stuck on trying to memorize a whole bunch. You need good mnemonics, which requires delving into heritage, roots (root = radical).So, for example, we delve into ancient Greek for our hedra, our polyhedra. Tetra, Penta, Hexa, Septa, Octa, Nona, Deca and so forth. Ennea. Triaconta. Icosa. Building these associations takes time and is an exercise in reading. People who think mathematics is just noodling iconic symbols around, while never reading or writing anything polysyllabic, have another thing coming.One curriculum segment I've worked on [takes us to Kanji](http://controlroom.blogspot.com/2010/04/workshop-news.html) i.e. Japanese characters heisted from Chinese and repurposed in many cases. We study the Kanji for polyhedra (such as rhombic dodecahedron) while [learning about Unicode](http://mybizmo.blogspot.com/2008/05/chinese-names-in-python.html), the binary basis for encoding all these symbols (including a lot of the math noodling symbols from Iraqi math (aka algebra)).Spatial geometry tends to be polysyllabic as well as cram packed with acronyms and abbreviations. That's just like the IT world in some ways (although here we find an emphasis on single syllable posix commands, many quite alien by today's standards, yet fun to learn about in math class). Ergo, it's good training for 3rd graders to learn about these space-filling tessellations that'll be on the test.Q1: the [depicted Schlafli orthoscheme of the cube]fills space with itself and a mirror image(a) true(b) falseQ2: [picture] fills space with:(a) [picture](b) [picture](c) [picture](d) none of the above.However, in place of [picture] think of something more like LiveGraphics3D (per Math World) or VRML / x3D. The \"textbooks\" are online, ergo at least five times more colorful and interactive, less than half as expensive, and not made of dead trees trucked from distant factories using peak oil. A win all around.They're also quickly fixable, when mistakes are discovered, provided we have a responsive publisher.The spacefillers are starting to get simpler names in some curricula. Let me preview:Minimum spacefiller: miteMite face-combines with another mite to make:  rite, lite, bite -- three species of syte.Two sytes make a kite, of we now have three:  kit, kat and kate.[](http://www.flickr.com/photos/17157315@N00/4676742214/)Some old skool geometers may object that these naming conventions are incompatible with what's on the books, in terms of the tri-rectangular disphenoid tetrahedron (the rite) already having a name on wikipedia (which is editable by people just doing their jobs).The point is to jump in and out of namespaces. These are local variables more than permanent assignments. When you tour in a new country, all the food names are changed, but it's the same foods (at a primitive level -- the recipes may vary wildly). Likewise, no matter what you call it, a Smite or a Schlafli orthoscheme of a cube, you'll need that mirror image to complete your space-filling tessellation. We have a toy to help and to provide more tactile understanding. It's not all about visualization. Kinematics enters in.[](http://www.flickr.com/photos/17157315@N00/4676742560/)[I think reading specialists know the importance of body language. Learning to crawl (before walking) is a good precursor to left/right differentiation. Don't just sit 'em in front of the TV if you want 'em to be highly coordinated). Crawl before you walk, walk before you run (and don't forget to \"toddle\" some)]This thing about price tag is a no-winner, as the minute something worthwhile shows up, you set it out of reach. I don't think I should discuss my pricing, as that'll immediately be used to prove that [my approach](http://mybizmo.blogspot.com/2010/03/wanderers-20100302.html) cannot succeed, because we do not have the resources. Actually, we have plenty of people willing to tutor the young, and it's actually part of human biology to look for opportunities along those lines, as teaching others, not just the young, is self-reinforcement, is a way to stay in shape yourself. What a civilization is is people always teaching one another (a life long process).Like, suppose we say we use Mathematics for the Digital Age and Programming in Python. Someone comes back with the fact that some schools already using it cost $xx * 10**x per year, so why bother? The public schools will just never have that kind of money. Do you see the complete non sequitur here? This is an argument completely without logic. Maybe the Russians gave us the copyleft rights for free electronic alternatives and we're doing more with OO right out of the box. So what? It's not about the economics, it's about pedagogy. Lets give them all scholarships in our mental models at least,  and then talk about \"what and how should it be?\" not just \"how much will it cost?\".I've proposed the following state standard: kids need x number of nights when they get to view the stars \"live\" i.e. [under a naked night sky minus light pollution](http://controlroom.blogspot.com/2008/08/escaping-light-pollution.html), such that the stars are directly and brightly visible. Exceptions apply, but the whole middle of the Bell Curve is expected to meet this requirement or... no high school degree. Period. A culture that can't pay for that, can't organize night sky experiences for millions of kids, is just too dumb for the history books. Lets get some new managers.The next best thing: a planetarium for every high school and/or elementary school. Not that expensive. Any civilization worth beans would do that, I'm sorry. We have the technology. We just don't have the smarts (a self reinforcing cycle, as people with no clue end up just talking about money (the great cop out)).There have been no substantive economic arguments on math-teach to date that I'm aware of, e.g. explaining why we skipped a whole generation. The Idiocracy (\"Ed Mafia\" per Haim) has other explanations (they're rewriting the DSM as we speak, so I'm thinking we should contribute new edu-speak in terms of psychological complexes. What led people down this path in the first place? I have my theories, [similar to president Eisenhower's](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html) in some ways).People forget that blitting pixels to multiple screens is dirt cheap,  likewise sound waves to speakers. There's a whole new distribution architecture already in place, yet the food fighters in Math Wars are still thinking in terms of truck and train loads of physical wood pulp textbooks. This is too retro for words really. Can we even talk to these people? Stone Age prehistoric, these math warriors.That's why I like the One Laptop Per Child campaign, which actually doesn't depend exclusively on the XO line to get the word out. \"Adults will just hold you back, as they impose the patterns of their own childhoods. What else do they know?\" Sure, some kept up, pioneered, but there's a Bell Curve.You get [too many old guys remembering their glory days](http://worldgame.blogspot.com/2005/01/napoleon-dynamite-movie-review.html) and wanting to help little Johnny learn how to swing that bat. No contemporary skills. Skipped generation types. Don't even know what the minimum space-filler is. Good thing you've got a way around 'em then (those boomer-geezers). So lets rock.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}