{
  "id": "2553407898668018968",
  "title": "Let Us Debate",
  "published": "2024-10-04T08:35:00.000-07:00",
  "updated": "2024-10-04T08:41:09.322-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/5236864896/in/album-72157625538952986)\nPosting to the Facebook Epistemology group:\nIt’s not “factually true” in any epistemological sense that political ideologies span a one dimensional spectrum from far right to far left.  These directions (relative to whom?) are arbitrary to begin with, and come with a built in bias. “Right” also means “correct” whereas “Left” inherits the historical stigma of “sinister”, from the Latin “sinistra”. So there’s a thumb on the scale right from the outset. Bad design from the get go.Tangential aside: It’s like “positive” and “negative” in mathematics, hardly neutral terms. Only the positive three vectors in the XYZ system get to be “basis vectors” whereas the negatives are always secondary, even if you can’t tell them apart in terms of the work that they do.Biased labeling aside, the idea that a simple linear spectrum is adequate for modeling political ideologies should be met with well-founded suspicion, especially in this golden age of data science (apparently). Who knew statistics would be overnight transformed into the sexiest of professions by the brilliant success machine learning?In data science we have something called Principal Component Analysis (PCA) which adjudges, by mathematical techniques, what we might call the “rgb colors” or “fundamental properties” of any space. To each component corresponds a dimension, in some n-dimensional Hilbert Space.PCA involves not necessarily knowing in advance how many dimensions we might really need. To specify in advance: only one dimension, is to prevent the PCA algorithm from optimizing.  In other words, “left versus right” is not only poor terminology (because biased), it’s bad science (data science). Too few dimensions to not a cogent model make. Even astrology had more dimensions, not forgetting the superseding Myers-Briggs.And yet political scientists put up with it, do not fight back. That’s akin to the situation in anthropology, where the pros know we don’t have “five races of man” (black, white, red, yellow, brown), that’s so much bogus BS, and yet corporate sponsored pop culture is allowed to stay uncorrected. A great dumbing down is allowed to persist.So what’s my ultimate conclusion, in light of this rant?  Resolved: that English, without major modifications, is a garbage language, not suited to logical or rational thought. Let’s debate.So many of core English concepts are so obviously poorly conceived and corrupt (computer science: buggy). Should “good philosophy in English” be considered an oxymoron then?  I wouldn’t go that far. I think English in the right hands is still capable, as a language.  But by default, English left to its own devices, is not suitable for scientific communications. That’s why education in professional grade English is so important, right?[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjbQ4t8uuSJqNKy6cOoWfosSzmhF5wihQ6NeESm1B5IDKAakY94T4NLV72r4NQwoK4HBS-gDulcQNeqoy89wk3mmSDDHJMFItWQ0BWXFZgHe72jYrFbiamF_3b-1SAciY0q5C51otGmvg2UJBUfbUGIYhI2D3pb14RufAgiiBOeuGwUzmJFF-38/s931/Screen%20Shot%202024-10-04%20at%208.39.47%20AM.png)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}