{
  "id": "6638347868841392451",
  "title": "Leveraging Python",
  "published": "2013-08-12T02:13:00.001-07:00",
  "updated": "2013-08-17T21:54:25.360-07:00",
  "content": "Some people come to Python because they heard you could get a website up and running in not that many steps, if you downloaded and installed something called Django.  There's more to it than that of course.  You need a public-facing web server with something in DNS (a name, a URL).\n\nShould I say \"an URL\" and pronounce it \"Earl\"?  Some people do, whereas others say \"You R eL\".  I'm aware of the [pun on Uri](http://worldgame.blogspot.com/2005/12/whats-urner.html), not far from CERN, where http was invented.  URLs were originally URIs, Universal Resource Indexes.\n\n[Uncle Bill](http://mybizmo.blogspot.com/2007/05/aunts-uncles.html), 88, swung through today, enjoying public transportation, looping from Seattle.  He'd been to the \"big Powell's\" downtown, where a PSU professor just happened to be haunting the stacks, and directed him to well respected tomes on (a) the life and times of Mohammed and (b) the early spread of Islam -- topics of interest to many readers, and especially those steeped in history, like my uncle.  I recalled a book called The Arabists from Free Press.  I found the letter Adam Bellow sent me, son of Saul, when he sent me that book.  He was with Free Press then.  I dug it out of the garage, thanks to synchronicity, and gave it to Bill.\n\nAt \"little Powell's\" (across from The Bagdad), Bill and I looked at books on HTML and Python.  I was sketching some history of how / where I work and wanted to point to the publisher's logo.  I also had a copy of Make:, the \"danger issues\", all about making \"sugar rockets\" and a tesla coil 'n stuff.  The founder of that had discovered this math teaching school and corralled it for Sebastopol.  The Python book was Learning Python, but mostly we talked about HTML (Head First series) which I traced back for him to Boeing.  Boeing is familiar to Seattlites like Bill.  SGML came from there, from which were derived other ML flavors, such as XML and XHTML.\n\nWe crossed back over to The Bagdad and Steve Holden joined us, on his way for ice cream down the street at Ben & Jerry's.  Bill and I had just had breakfast at Cup 'n Saucer.\n\nWhat's probably easiest to grok is \"substitution\" i.e. the Madlibs kind of thing, otherwise known as \"fill in the blanks\".  You start with the whole story then punch some holes it it, make those variables, which gives you a realm of possibilities.  If we're filling in with (x,y,z) coordinates, and the story is about objects such as cylinders and spheres, then we get colorful renderings in Pov-ray.  I worked for a toy company doing that for awhile, making realistic images of StrangeAttractors, which was actually manufactured in a last bid to put a great geometry toy in the hands of both children and adults.  Another plastic rod and ball-bearing affair, with detachable magnetic tips, cone-shaped.  The dimensions were those used in ZomeTool.  They came color-coded.\n\nDoing the math requires rotation matrices.  You can do quaternions too, as \"math machines\" or \"math objects\" to make polyhedrons turn.  This was where Stickworks came in, my 3rd party library.  I'm still hearing the admonitions at OSCON to put licenses on all my code.  Apache's would work.  I just haven't gotten around to it.  I'm not even on github.  That's a social faux pas in geek world these days.  Gotta be on github.\n\nMy lightning talk at the Pycon EduSummit took us through an hypothetical fifth course in our series out of Sebastopol (actually the servers are in Illinois).  Cellular automata ala Wolfrom.  Not unlike the PSU systems curriculum in some ways.  Doing next, next, next... in the sense of exercising a Python generator, is a really good idea.  I have a whole farm, a kind of midwest place, built as a place for Tractors (instead of turtles).  We get into it.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}