{
  "id": "7338478732784917282",
  "title": "Life in the Material World (movie review)",
  "published": "2011-10-08T10:48:00.001-07:00",
  "updated": "2011-10-08T22:32:10.510-07:00",
  "content": "Catching up on the life and times of George Harrison was an eye opener.  The guy had a lot of eloquent, well spoken friends who came forward to testify about his life, as a dad, husband, brother, boyfriend [and Beatle](http://controlroom.blogspot.com/2006/10/us-versus-john-lennon-movie-review.html).I had never realized the extent to which George was involved with the Monty Python troupe.  I'd seen Ringo Starr in [The Magic Christian](http://mybizmo.blogspot.com/2011/03/magic-christian-movie-review.html), under the tutelege of Peter Sellers.  Some of the Python gang make appearances in that film.  But I'd forgotten how The Beatles were seeing so much of themselves in the irreverent, satirical Monty Python movies.  George bankrolled Life of Brian to the tune of $4 million, after EMI dropped it like the hot potato it was (right up there with Jesus Christ Superstar in terms of inspiring righteous outrage).This movie is cram packed with footage you'll likely see nowhere else, unless this becomes the new source for clips on YouTube.  The movie takes us back to the very earliest years of The Beatles and rolls forward.  George's friendship with Ravi Shankar is pivotal, in terms of its effects on his music and subsequent career.  His friendship with Eric Clapton was likewise transformative.  He loved his friends, clearly, women and men from many walks of life (race car driving included). I found the stories captivating, as did the others in our audience.  The film received a warm applause, both at intermission and at the end.  Many of the on-camera remarks got a hearty laugh as well.  George knew some funny people, was pretty funny himself when in the mood to be.  He also channeled quite a bit of fury, one could sense.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}