{
  "id": "2692036866611559205",
  "title": "Logan's Run (movie review)",
  "published": "2016-09-02T11:18:00.001-07:00",
  "updated": "2016-09-18T08:46:00.133-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/29121886170/in/dateposted-public/)\n\nI'd already turned down a generous invitation from the Barton family to jump in on this one, thinking the 3rd Anniversary birthday party [for PDX Code Guild](http://controlroom.blogspot.com/2016/08/code-school-evening.html) was an evening soiree.  That was more my over-clocked imagination, misassuming, and if I'd read the Eventbrite invite more closely, or even looked more closely at [my own slides](https://flic.kr/p/LySA48), I'd have noticed the 1:30 - 4:30 PM as the timeframe.\n\nBy the time I'd figured out my faux pas, it was too late, however a side-effect was I was free in the evening after all, so jumped in at the last minute, buying a ticket from, you guessed it, Eventbrite.\n\nWe're in the middle of the Portland Film Festival and Logan's Run, an old classic, was billed as just that, with the added bonus of the book's co-author on stage, both before and after, an old guy by now, in keeping with the theme of the movie (they AI-bot running the place kills the humans at age thirty).\n\nIn the book, the co-author told us, for the benefit of those who'd only just seen the movie, did have a place called Sanctuary that was more welcoming than an over-grown, in-ruins District of Columbia. The movie is more like Planet of the Apes outside (with Lincoln in place of the Statue of Liberty), with one aging ape, Peter Ustinov.  The escaping humanoids (the AI programmed quasi-humans) find the old guy and use that to myth-bust back in the bubble.\n\nWhat's intriguing about the myth-busting is it doesn't work on the AI-programmed, only at the bot itself, probably a Docker application by the looks of it, running Ubuntu (for irony).  Humans are easy to program so a world like theirs looks fairly doable.  We have the prototype bioshelter in Cornwall (UK).\n\nAs for the spacey electronic music, that stuff's old hat by now (but really well done here -- the Lego slash Disney World is clearly a model, but with little people on the walkways and in the tubes, so persuasive enough for folk music).\n\nThe beautiful people are coyly modest and have their main party times off camera, a lot like Idiocracy in that way (another tasteful film).  In the book, they were all under 21 but that might have changed the rating. The handsome Michael York was already in his early 30s by then, and the lovely Jenny Agutter in her mid 20s.\n\nThere's lots more back story to share about the surrounding drama, outside the movie.  The Screen Actors Guild (or something like it) was meeting at our restaurant location.  I noticed more gesticulating and posing than usual, nice costumes.  These people were used to being \"on\" (or \"in\") camera (or \"room\").  Patrick and Mike had walked to Hollywood Theater before realizing their mistake.  Other details.\n\nSpeaking of Docker, I've got [my head in that silo](http://worldgame.blogspot.com/2016/09/gateway-to-asia.html) this morning, seeing how it's available for the Pi.  I'll probably end up adding it to my Mac Air as well, but lets explore the Pi first, as it's more purely a Linux box and that's the most native environment for Docker.\n\nThe actual images and containers needed to program sandmen, those who \"put you to sleep\" if you don't want to gamble on the carousel working (highly speculative), would include such procedures as we saw Logan Five put through.\n\nWe're led to think by the ambient lore that \"sandmen never run\" however the 1.5K unaccounted for may indeed have included sandmen.  Keeping secrets from the quasi-humans is not a problem for this bot.  We're not actually privileged to this private container ourselves, omniscient camera notwithstanding.\n\nWe're also led to think none of this 1.5K got passed Box.  That's more believable. Thinking outside the box is indeed hard to do.\n\nThat's another wrinkle I'll leave you with:  Box in the movie looks like an easy push-over.  The Box in the book as a truly worthy adversary.\n\nThe co-writer, William F. Nolan (George Clayton Johnson died last Christmas) ridiculed the movie version of his character, saying he'd witnessed them filming that part with Ray Bradbury who asked him \"who's that?\" upon which replied \"I have no idea\" (oh yeah, Box).\n\nAnother factoid:  the book was dashed out in just three weeks, an intensive marathon process.  A standard criticism is books splatted out that fast tend to be still-born, however these particular co-authors had done about a decade of preparation beforehand, so when it came time to commit to paper, they had an established base on which to build.\n\n[](https://www.flickr.com/photos/kirbyurner/29330230771/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}