{
  "id": "2809663137717084407",
  "title": "Looney Tunes",
  "published": "2022-11-02T15:33:00.010-07:00",
  "updated": "2022-11-04T12:08:59.544-07:00",
  "content": "I'll say up front I'm skeptical of those who assert the \"US + UK + EU = The West\" in some way.  Like I know that's a common trope among storytellers, I just don't consider it a stable memeplex.  \"The West\" is the western hemisphere (North, South, Central America) and \"The East = Eurasia + Africa + Australia\" to just focus on the continents.  Greenland could go either way.  In sum, shop talks that map to the realities of geography likely have more staying power.\n\nAlso, geopolitically speaking, I think too many Anglo-Saxons (to use the Kremlin term) fail to appreciate how different the Americans are, from the whites who stayed home in the various homelands, if we might call them that.  \n\nMany Anglo-Euros right here in the Americas may not appreciate that either.  I'm talking about the influence of original peoples, their thought patterns.  As The Dawn of Everything makes clear: the anthropology and psychoanalysis was a two way street, and still is.  It was never a question of which were the savages:  those would be the Brits.\n\nFast forward and we get those Halloween images of a horror film Truss, still wiping blood off her lips after biting hard into Germany's jugular.  Now the latter has fallen to the floor, shivering, with few prospects.  \"It is done my lord\" she whispers on her phone, to a vamped up Darth Vader type.  Very cinematic you have to admit.\n\nAll joking aside, I think \"US + UK = Looney Tunes\" is what we're seeing today, with John Bolton as Yosemite Sam, minus the charm.  I would not think it possible for Anglo-Saxons to be genetically berserk, so it boils down to something in the water maybe?  The District = Flint = Jackson, Mississippi?\n\nYes, I've recently been to a comedy club (actually, a main line theater, that happens to feature comedy from time to time).\n\nSo given I'm so remote with my vocabulary to begin with, even questioning the Louisiana Purchase as a truly done deal, you can see where I'm not making the rounds as an interviewee.  No, I'm just a deeply buried Quaker blogger with some political views.\n\nFrom another point of view, I see the US Congress and the old USSR (the ghost of) on the same side, collaborating to extinguish a kind of ethnic nationalism that doesn't rise to the level of nation state.  These political bodies cannot effectively turn away from their own destinies, as two sides of the same coin.  \n\nYou could say I'm being cynical but I think that would require positing a high level of conscious awareness on the part of the perpetrators.  I'm suggesting we're running on automatic, as bots.  That's not a new phenomenon.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}