{
  "id": "528411069429522499",
  "title": "Lost in Oregon",
  "published": "2009-05-20T21:55:00.000-07:00",
  "updated": "2009-05-22T16:33:56.462-07:00",
  "content": "This was a time for the Swedish side of my family to converge, to a church in Cornelius.  Uncle Bill Lightfoot was there, and the Hancocks, Wilma and Howard, Bo, some of the July 4 circle, which overlaps [the Thanksgiving circle](http://controlroom.blogspot.com/2008/11/thanksgiving-2008.html).  We were there in support of the Person family, in memory of Martha Jane Person (April 1, 1943 - May 16, 2009).I got a late start then got all turned around in a beautiful and bucolic scene, turned it into an opportunity for worship and communing with nature.  I got to thinking about dad, [his mother Esther Person](http://mybizmo.blogspot.com/2006/01/more-fragments.html), Carl... a continuing conversation.Bill Hancock briefed me in on Humphrey Bogart's operations, Portland bars where they served you drinks from your own bottle, while you schmoozed with other customers.  Humphrey seemed always just coming or going, so you felt his presence.Bill named two of the bars he'd been at.  I'd like to learn more.Vis-a-vis Washington, Oregon was the more untamed state, less under the boot of the killjoys.Exploring my heritage, recording what I find, is a big part of what I do.  Call me an historian in that sense.Barbara Hancock used to be a nurse on long distance trains.  She taught herself to ski to keep up with Bill and they ran a dynamite ski school when not running the small business (surveying).[Their daughter Alice](http://mybizmo.blogspot.com/2006/07/summer-of-2006.html) has been living across [the lake](http://worldgame.blogspot.com/2007/07/my-independence-day.html), having lived in Hong Kong in an earlier chapter, and discovered the container shipping business, big in Seattle, even bigger than Boeing.As the reception wound to a close, my relatives popped back into regular clothing.  Howard had his [bib overalls again](http://www.flickr.com/photos/17157315@N00/3550840520/), just like always.  We were the informal family again, keeping on keeping on.Uncle Bill, the maritime historian, is starting for Florida in the morning, caravaning along I-84 to I-80, then I forget how it goes, ending up on I-75 in a week or so.  He'll fly back, although I suggested he rent something and drive it a different way, take a month or so why not?  He said he'd never thought of that, sounded intrigued.Gordon and Susan had me over for lunch today.  Susan heading for yet another visit to the dentist, got a kick out of [Steve Martin's rendition](http://www.youtube.com/watch?v=bOtMizMQ6oM) of that Little Shop of Horrors character, which she'd not seen before.  It's fun being able to old movie scenes of the ether and share them, in addition to just telling old fashioned stories -- those still work wonders as well.I shared an XO from the back of my car with Barbara & Bill as we prepared to disperse.  They'd not seen one before, though were aware of the idea, and happy about it.  One Laptop Per Child (OLPC) was [a topic on edu-sig today](http://mail.python.org/pipermail/edu-sig/2009-May/009356.html) as well.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}