{
  "id": "7846849132641503076",
  "title": "Love is a Verb (movie review)",
  "published": "2016-06-19T17:24:00.000-07:00",
  "updated": "2016-06-21T14:32:02.598-07:00",
  "content": "The term \"secularist\" has different meanings to different people.  I use it more in the sense of [liberal towards cults, religions, tribes](http://mybizmo.blogspot.com/2006/11/about-secularism.html), and providing enough infrastructure and security to allow each some fun in the sun.  Let them practice freely, and they will not turn virulent in self-defense.\n\nReligions themselves will have this liberal streak in some cases, notably the Sufis and the Quakers, whereas a \"secular military\" may be fascist control freaks, more like the Inquisition under the Roman Catholics.\n\n[Liberal Islam](http://controlroom.blogspot.com/2013/09/interfaith-meetup.html) ala Muhammed Ali, combined with more homegrown movements within the US need not be terroristic in any way, but given the attitudes of some \"secularists\", the pressure is on to [make them more threatening](http://controlroom.blogspot.com/2011/04/roller-coaster-at-reed.html), so they'll fit the bill and play the game. \n\nRadicalization of liberals is the agenda of many secularists, as once a group has been radicalized, it's OK to target them and possibly wipe them out (that rarely works), with public approval (but the public is fickle).\n\nThe Gulen phenomenon is neither a political party nor an organized movement, so much as an ideology based in values.  Follower's of Gulen's teachings are often inspired to serve selflessly, in some of the most forlorn places, where hope is war-torn and/or disease-ridden (these go together).\n\nGiven it's not controlled by the secularists, it's perceived as a threat, and you get the Turkish equivalent of [Mubarak types in Egypt](http://worldgame.blogspot.com/2016/06/the-square-movie-review.html), cracking down on anything too Islamic, like the Muslim Brotherhood.\n\nIn Turkey the pattern was set by Mustafa Kemal Atatürk, in Iran by the Shah.  Military secularism, a kind of Fascism, has been [a favorite blend in DC](http://controlroom.blogspot.com/2016/06/war-planning.html), understood and supported by many in the Pentagon who recognize their brothers in arms.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}