{
  "id": "631720673092290945",
  "title": "Lucy (movie review)",
  "published": "2014-08-03T04:02:00.000-07:00",
  "updated": "2014-10-25T17:45:51.204-07:00",
  "content": "Tara tells me the critics have been unkind to this film and she left the theater saying \"too unkind\" and \"I'm glad I saw it on a big screen\".  My remarks were \"interesting how it had so much didactic content, like cutaways to documentary footage\".\n\nWe agreed the science itself, as presented by Morgan Freeman, playing a scientist, was rather bogus.  I also remarked on the blueness of the crystals, how reminiscent of Breaking Bad, and would this film help boost the demand for \"smart drugs\" if not [crystal meth](http://chemistry.about.com/od/medicalhealth/a/crystalmeth.htm)?  Certainly it plays off the meth meme.\n\nWhat's interesting about the film is it presents us with a superhero where smarts / knowledge is the superpower, not swinging from buildings (Spiderman), not physical strength (Superman).  Lucy gets lots of auxiliary powers from her amped up brain for sure (e.g. a kind of X-ray vision), but the core capability is purely gnostic.  I can't think of another superhero with \"intelligence\" verging on \"omniscience\" as the core capability, except maybe Spock in Star Trek, who cultivates \"logic\".  Addendum:  co-worker John Baker reminded me later, during my stopover in Toledo:  Tony Stark as Iron Man.  I would add:  the anti-hero / bad guy in The Incredibles.\n\nThe aspect of \"enlightenment\" is present as well, and fulfilling a built-in human capability.  Shades of Lawn Mower Man, and Time Machine by H.G. Wells.  But to what extent is her enhanced intelligence filling her with compassion and empathy, per the Buddha or Jesus?  She doesn't act very Jesus-like, converting her enemies to allies or turning the other cheek.  She does perform lots of miracles and could probably part the Red Sea towards the end.\n\nThe sense that she's running out of time and has to get it all done within maybe a day or two means she has to optimize in many ways, leading her to break the rules right and left.  She drives crazy and won't put her tray table up in the stowed and locked position, when preparing for landing.  She cuts to the chase in every interaction, interrupting her roommate / friend's girlie chatter with House M.D. like diagnostic remarks, while handing her a prescription and walking out the door.  So a kind of gruff compassion then.  She retains her humanity.\n\nThe fact that time is running out means we don't have to get into long term scenarios like manipulating the stock market or building an empire -- the stereotypical things an omniscient might do. \n\nI was curious going in if there'd be any reference to the prehistoric Lucy, the name for the fossilized hominid skeleton from Ethiopia we got to [visit in Seattle](http://mybizmo.blogspot.com/2009/03/field-trip-to-seattle.html).  Of course.  That Lucy is her name is drummed in from the opening scene, with the link to our hominid made right off the bat.\n\nThat's probably what I like most about the film:  despite the bogus science (we forgive science fiction taking liberties, Morgan Freeman acknowledges we're in that genre as we boost brain power in some hypothetical dimension) the movie does a lot to survey the evolutionary experiment called \"humans\", taking us to lots of cities (ala the 007 franchise) and diving into the distant past (she travels in her office chair), meeting Lucy herself, as well as seeing dinosaurs and pterodactyls. Time is the only real dimension, we're given to learn.  Very Synergetics, very Heraclitus.\n\nWe get treated to lots of nature film clips and get to \"think about\" cells, anatomy, reproduction... lots of science memes, colorful and fast-moving.  That's what I liked:  the didactic flavor.  The audience is treated to a hypothetical \"what it might be like to think in a connected big picture way\" -- an ISEPP lecture on steroids.  Fun.  Maybe more people will feel inspired to do some reading, get some education.  Good PR for STEM, and with a strong woman at the center.\n\nAs Tara mentioned a few times, we have to consider that Scarlett Johansson also plays [Her](http://www.imdb.com/title/tt1798709/), another super-intelligence (so yet another super smarty).  She's well suited to her role here, as a bitch-witch well able to handle herself in a world of cruel Asian Matrix-like, black-suited bad guys.  So yeah, a role model for girls being both badass and smart.  We need those.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}