{
  "id": "817102222228450009",
  "title": "Lunch on Hawthorne",
  "published": "2008-01-18T14:05:00.000-08:00",
  "updated": "2008-01-18T18:07:48.324-08:00",
  "content": "I had a fine lunch with [the Boltons](http://mybizmo.blogspot.com/2005/12/sushi-for-xmas.html) today at Than Thao, followed by some show & tell at my residence -- they'd not met Naga before, are new to this whole [YouTube business](http://youtube.com/results?search_query=WILPF).Chuck is a retired emeritus from a golden age at Portland State, his career as a sociologist a product of the post-WII GI Bill-sparked renaissance, North Carolina's [Black Mountain](http://www.grunch.net/snelson/) a flagship of that era, from whence our own [Catlin Gabel](http://www.catlin.edu/home/) gained some of its [founding faculty](http://listserv.buffalo.edu/cgi-bin/wa?A2=ind9310&L=geodesic&P=3956).Mary is a WILPFaholic like mom (I say that affectionately, akin to [Buckaneer](http://mybizmo.blogspot.com/2006/08/buckaneers.html)) and during lunch was trying to remember where she'd sat next to Dennis Kucinich on Hawthorne that time.Dawn and their eldest daughter were especially close, from solstice festivals and such.On our subsequent tour of the [Linus Pauling House](http://mybizmo.blogspot.com/2006/08/linus-pauling-house.html), she thought maybe this was the place.  Could've been.  Certainly mom [gave her talk](http://controlroom.blogspot.com/2007/10/wilpf-meets-wanderers.html) here.They recommended [Kite Runner](http://www.imdb.com/title/tt0419887/), the movie, which Chuck thought followed the book remarkably closely, unlike so many movies.Our families go way back.  When they first met dad in Portland, they already remembered him from University of Chicago days.Mom and Mary were active in WILPF even then, protesting in the streets against [strontium-90 in the milk](http://www.sciencemag.org/cgi/content/abstract/133/3466/1768) etc. (I sometimes joined in my stroller).Congratulations to Glenn Baker on winning a [CINE Golden Eagle](http://www.cine.org/golden-eagle-award.php) for [Stand Up: Muslim American Comics Come of Age](http://www.imdb.com/title/tt1016022/). Glenn and I were high school buddies in the Philippines, house mates for awhile in Jersey City, have stayed in touch.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}