{
  "id": "3239060094385057965",
  "title": "Lurching Ahead",
  "published": "2010-08-09T16:47:00.000-07:00",
  "updated": "2010-09-02T19:27:01.112-07:00",
  "content": "There's this guy in [The Adamm's Family](http://www.youtube.com/watch?v=gFD7KGBUtKI) I think it was, Lurch, kind of the butler.  When I did some volunteer logistics for [the est people](http://controlroom.blogspot.com/2009/12/some-storytelling.html) awhile back, I remember some kid, looked like a younger me, calling me Lurch.  The grownups around him wanted him to shush, as I was obviously just another one of them.  A room full of Lurches, what a concept.Trains lurch when they start up again, and every car down the line gets this tug on the coupler, to get moving.  Good seeing Leslie and others at Oversight yesterday.  I ran by the Food & ~Bombs plan, got some preliminary nods.  I've circulated the proposal on Facebook as well, where I do some of my Quaker business.The math teachers are yakking about globalization again, with [Robert Hansen](http://www.mathforum.org/kb/message.jspa?messageID=7147485&tstart=15) sounding a traditionalist theme, in contrast to a recent Keith Devlin posting.  [I chime in](http://www.mathforum.org/kb/message.jspa?messageID=7148411&tstart=15) along the way.The Toshiba is having weird disk problems.  After chkdsk I was able to xcopy the ktraks subdirectory (a VFP app PSU is using), but I'd not want this to be the source copy, as the external drive version might have remnants of file corruption?  I wish I understood NTFS better, or ext3 for that matter.I see F15s as bloated and wasteful (today's Wall Street Journal).  You don't need to burn vats of fuel to get thrills in this world. A lot of carbon footprint for what?  Save it for a rainy day?  Ward off the desert?  [Terraforming](http://controlroom.blogspot.com/2006/06/summer-camp.html) is not just about doing stuff on Mars, obviously ([the Rovers](http://www.4dsolutions.net/satacad/martianmath/mm22.html) did make a difference though).How many deep silo workers inheriting VFP applications will want to use Python as a ladder out, more into the open? That's a joke... Snakes and Ladders.  I don't know the answer, but let me point out that xBase ended up as an interactive, C-extensible, dynamically typed language with user-defined classes. GUI integration was more ambitious (Python leaves that to 3rd party libraries).  Some will go with Java, or Jython maybe?Microsoft would rather not compete with its own products, seems to be the wisdom in Redmond, and rewriting Visual FoxPro (VFP) to make it 64-bit is beyond anyone's job description.  That'd be like trying to rewrite MUMPS (the M language) -- or is somebody doing that?Yes, I know about Ed Leaf and the Dabo project, have [blogged about it before](http://mybizmo.blogspot.com/2005/03/pycon-2005.html).  We're not just talking about one ladder. PythonCard helped a lot of people learn GUI programming outside the VB sandbox.  Lots of VFP in Prague they tell me (hi Kathy).For a lot of developers, it's more about giving up the thick client model completely and making the web browser the stage where it all happens.  Not everyone's there yet, nor needs to be.  Web apps are thin clients.  [Are iPhone apps considered \"thick\" then](http://www.pragprog.com/magazines/2010-03/nice-apps-if-you-can-afford-to-write-them)?People hard at work on their respective projects around here.  The side yard is a low key stockpile of bamboo varieties, amidst the vegetable beds, providing raw materials to piece workers building bike trailers.  On the storyboard, they're painted pink, but that might be more an in-house joke at the Blue House.  I'm not the chief planner on this one, so don't expect details on Facebook (or Plaxo for that matter).[Barton](http://controlroom.blogspot.com/2010/07/book-of-lore.html), Portland Energy Strategies, is coming by.  I was mentioning his interest [in developing simulations](http://www.mathforum.org/kb/message.jspa?messageID=7148411&tstart=15) with some other energy companies.  Dr. Nick is vectoring this way.  I recently uploaded some pix of his  mom, the late Gill Faure, to some interested NGO (at Nick's request).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}