{
  "id": "142035558559644434",
  "title": "M4W Pow Wow",
  "published": "2023-08-07T21:50:00.000-07:00",
  "updated": "2023-08-15T06:21:34.200-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53099730287/in/datetaken/)\n\nRyan's bus from Roseburg was running early, so Andrius and I were able to pick him up downtown, not far from Union Station, and return to headquarters in time for the broadcast.  Math 4 Wisdom (M4W) was hosting a talk on Pascal's Triangle and the Binomial Theorem, but from a novel viewpoint.  \n\nI was the \"warmup band\" doing something Pythonic. I introduced the idea of a Python generator. We had five participants on the two part call (with 10 minutes intermission), with three of us (Ryan, myself, Andrius) all here in the one node (house), with Bill and Jerre in widely separated locations.\n\nNext, after 80 minutes of program (40 + 40), we were ready for breakfast. I treated my guests to a house tour first, only to have the door lock behind us on the second floor deck. I could call Derek, who was on his way anyway with the Monday haul, but my cell was inside and I hadn't memorized his number. \n\nWould I have to slice the screen or risk climbing down?  Neither prospect was enticing. Then I realized I had my keys. Duh. Sigh of relief. It's just not a door I usually close behind me.\n\nBreakfast at Tom's was great, a business expense for Oregon Curriculum Network for sure, as I was having really high level discussions with these guys. \n\nRyan is quite young (in his early 20s) and is as yet unspoiled by academia, unlike Andrius and I, thoroughly spoiled by some in-depth brainwashing, though not the same brainwashing. \n\nMy claim: none of us gets but a dumbed-down version of the others, given how this world is put together. I'm not saying without exceptions.  Sometimes another seems more comprehensible than one's self, at least with regard to some specific topics.\n\nOur foray into Category Theory was experimental. I was using the language of Supermarket Math, considering what sounded like special case workflows (e.g. adding to a shopping cart, checking out), unique to supermarkets, but I was using them metaphorically, more operationally. \n\nLike the idea of \"paying for it at checkout\" had corresponding actions in both worlds (our local Fred Meyer's and a supermarket in Vilnius), such that a Functor between them would carry the weight of translating and/or mapping between the two. In ordinary reality, CT tends to be about sets, vector spaces, real numbers, and like that -- not supermarkets per se.\n\nOregon Curriculum Network has a four-fold approach to maths in its inventory, the four aspects being:\n\n* Supermarket Math: transportation, logistics, databases, pricing, marketing (how shall we live?)* Casino Math: probability and permutations, risk taking and avoidance (what's worth trying?)* Neolithic Math: maths from the present day looking backwards (where have we been?)* Martian Math: casting maths predicatively forward, as in science fiction (what's coming up?)\n\nFrom a posting to TrimTab Book Club this morning:\nHow about, as an experiment we (some workshop group) don't credit humans for any\n of our concepts for a change? In this \"new\" way of thinking, humans \nonly \"channel\" ideas but never \"create\" them. I put \"new\" in quotes \nbecause this model is more like in the old days, in ancient times, when \ndivine beings (e.g. Athena) did all the thinking and humans were mere \nmouthpieces, spokespeople. Lets say Athena coined the word \"radio\" which\n a number of humans then picked up on and shared. \"Credit the gods and \nonly the gods\" might be the language game in this WestWorld. Most \nso-called westerners learned to stop crediting the Holy Spirit in the \nso-called Enlightenment Period, a time of many colorful revolutions e.g.\n the American and French ones.\n\nWithout having read any of the above, Ryan spontaneously shared his sense, after breakfast, that mathematics was using him, pretty much as a puppet, to think out loud to himself. We then sat around the table, sharing concepts, more in the mode of channelers than as originators, of our concepts. The various math-informed viewpoints got to iteratively interoperate, whether we as individuals comprehended, was another matter. Sort of. To a degree.\n\nI've been having a similar conversation with Richard Hawkins, regarding AI. \n\nLets look at language as a non-sentient pattern or program of action, an evolving dance. We get carried along, perhaps away. ChatGPT (the generative large language model implementation) is not that different in principle, even if following different rules. ChatGPT aspires to be predictable, whereas some plans or stratagems discourage predictability.\n\nThe centerpiece of M4W is not the Bucky stuff, which I talked about some today anyway, but Wondrous Wisdom, a cognitive framework developed by Andrius Kulikauskas over several decades. \n\nHe's looking to build a network of close collaborators. I'm doing what I can on a logistical level at least, and institutionally as well, as the Oregon Curriculum Network guy. I'm helping more people become aware of their option to work with Andrius, without insisting that they do so, as some kind of prerequisite for working with me. I'm independently accessible.\n\nFor example today's meetup dealt with the theme of a Bell Curve of combinations between extremes, all or nothing, as demonstrated by successive rows of Pascal's Triangle.  All and/or Nothing bracket a permutation space of alternative scenarios, sometimes characterized in a binary manner, as left versus right, or positive versus negative. Forks in the road. Roads not taken.\n\nAt the extremes though, we're getting more existential, talking about the difference between Being or not Being, versus the many distinctions inside of Being.  \n\nPretty abstract huh?  M4W is like that. An acquired taste.\n\n[](https://www.flickr.com/photos/kirbyurner/30716653627/in/photolist-29hYE5w-NNjSYk-2cu89WA-2ncPJFj)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}