{
  "id": "115436741033866393",
  "title": "Making Waves in DC",
  "published": "2006-07-31T17:04:00.000-07:00",
  "updated": "2011-10-18T13:43:42.516-07:00",
  "content": "So I was living in DC, with my parents between assignments, me out of Princeton by then, looking for a life, post being a high school teacher at St. Dom's for two years.  That'd been my next assignment after being this heavily-into-Wittgenstein's philosophy dude (I wore an LW T-Shirt, a gift from dear Linda, a [2D alum](http://worldgame.blogspot.com/2005/05/princeton-25th-reunion.html) like dear Selma, dear Vicky, dear Tom...).Philosophy included diving head first into est, leading to Bucky ([check public records](http://controlroom.blogspot.com/2008/12/fuller-archive.html) on that score) and his hot-off-the-press (St. Martin's) [Critical Path](http://www.amazon.com/gp/product/0312174918/).  Like any good fact checker, for the New Yorker say, I was wanting to verify some apparently newly declassified details from maritime history.I nagged at the Washington Post for a story, by sending 'em faux headlines in sort of early Comedy Central (kinda edgy).  Just another guy with a typewriter in DC, trying to make a name for himself, ho hum.Well, if you know how Washington works, you know that things don't stay simple for long.  Word gets out and around, probably at those fabled cocktail parties, embassy types gossip, and before ya know it, you're getting a lot of subtle messages too.  Wow, democracy in action.  Kinda fun.  Kinda creepy.  Probably Moscow's the same way (I was through there once, but only on a short assignment, again with my family).Sometime later (1985?) I became a Stansfield Turner devotee, having scanned his newly minted [Secrecy and Democracy](http://www.amazon.com/gp/product/0060970251/) (I was still trying to figure out about [those sea peoples](http://mathforum.org/kb/message.jspa?messageID=7589887&tstart=0) and Turner was Navy).  That was like my intro to the Zendo, and after that I was hooked, following other DCIs' careers both [before](http://www.state.gov/www/about_state/history/intel/index.html) and [after](http://www.amazon.com/gp/product/0743274032/), paying at least some attention to the intelligence community's kabuki dances (not all set in DC, thankfully).Anyway, if you've read [Grunch of Giants](http://www.amazon.com/gp/product/0974060518/) (Critical Path's sequel) you know the CIA was all over it, with Applewhite's sly blurb on the back and all kinds of weird banker talk (check out political cartoons of DCI Casey at the time, a Mr. Moneybags who was always \"scalping\" people (odd combo)).[ Our dear friend Mary just called, to ask about Dawn (she's doin' OK, just printed a bunch of laser checks, bills and donations, which I've just collated, signed and mailed). Mary and Chuck are heading into the Cascades today (sounds wonderful). ]Another angle:  Bucky liked hanging out with the retired brass at the Center for Defense Information (CDI), where my buddy from high school worked as an archivist.  But as any journalist knows, just because an audiotape matches a book by the same author doesn't count.  The police work here was to [cross-check](http://worldgame.blogspot.com/2005/12/omnitriangulating.html), not prove at least minimal self-consistency (Bucky was hardly a nut case).That first DC assignment didn't last all that long (my parents moved to Bangladesh).  But I'd be back again later, in 1984, this time living on my own, and working for Americans for Civic Participation (aka Project VOTE!), trying to get USAers to believe in the whole idea of voting again (this was before private computer companies told us how we'd voted).We worked with Jessie Jackson's group (he'd dropped out of the presidential race by then, so no 501(c)(3) problem there).  Reagan won a second term (another low turnout), and I joined McGraw-Hill in New York, thanks to est buddy and Jersey City cronie [Ray Simon](http://www.amazon.com/gp/product/0809225905/sr=8-7/qid=1154362405/).And then again I was through, [this time with Matt](http://controlroom.blogspot.com/2006/06/gobbledygook.html), to drop in on Ed and score a gift copy of his [Synergetics Dictionary](http://www.amazon.com/gp/product/0824087291/) in four volumes (a treasure).Also back in the day, when AFSC'd fly me from Portland to Philly for board meetings, I'd spend time with Chris Fearnley and [Kiyoshi Kuromiya](http://www.grunch.net/synergetics/kiyoshi.html), then train down to DC for more meetings (open jaw plane ticket), culminating in our [SNEC summit](http://synergeticists.org/), hosted by Russell Chu.  That was my second time to meet Joe Clinton, plus Ed's presence made it official (Bonnie's too).Most recently, I was in DC for a [Pycon](http://mybizmo.blogspot.com/2005/03/pycon-2005.html) @ GWU (the one before Texas), showing off my synergetics hypertoon ([Python + VPython](http://www.4dsolutions.net/ocn/life.html), runs on a laptop).  The year before that (2004), there'd been that Bucky Symposium, also at GWU ([Blaine D'Amico](http://home.gwu.edu/~damico/damico.html) hosting), and a Pycon just starting when I got the news of my wife's stage 3 cancer and quickly flew home.  That was the [last time](http://mybizmo.blogspot.com/2005/02/ayatollah-of-tetrahedron.html) I'd see Ed, though we still [phoned each other](http://worldgame.blogspot.com/2005/01/national-treasure-movie-review.html) sometimes.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}