{
  "id": "445865807807853537",
  "title": "Martian Mathematics",
  "published": "2024-03-01T09:15:00.000-08:00",
  "updated": "2024-03-04T16:44:35.304-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/22562610085/)\n\nObviously I'm into science fiction as a modality (mode). One of my signature stories involves \"Martians\" with the \"Martians\" in scare quotes because we all know they're not from Mars. This is just a nickname, an alias, that one may randomly apply to any ET. \n\nI market my mathematics curriculum as a Martian Math, and per copyright law I'm not able to claim exclusive rights. My freedom is to build momentum, as in a snowball rolling downhill (in a cartoon usually -- in the real world, such growing snowballs, naturally occurring, would be a relative rarity, a black swanish event), and having my Martian Math be self referentially into science fiction probably helps along those lines. A little recursion to get the ball rolling.\n\nWhat's the story though? Picture a classroom, say in the computer science building at Reed College, so each student has a high end Mac, with Anaconda (this part is real). Then the teacher talks about this Mesa in Arizona or New Mexico or someplace, and if you know your computer game lore, we're clearly drawing from the Half-Life universe, as developed by Valve. There's this Mesa where the Martians (ETs) have their campus or complex and we're building like a Hoover dam together. I say \"like a\" because this is science fiction, so make up your own details. \"We\" as in Earthlings, the humans and such (denizens of Earth, the planet).\n\nThe curriculum twist (like in a Mobius strip) is I want to encode a lot of Synergetics into the mix, which might be confusing to those thinking I might mean Dianetics or some other Synergetics (remembering copyright), or off-putting to those who don't like \"ics\" (cybernetics, economics... informatics) more generally. Maybe you're an \"ology\" person. \n\nThe historical fact is I was doing stuff around the B, E, A, S and T modules, meaning tetrahedral wedges, native to Synergetics, alien-seeming shapes our \"Martians\" (ETs) seem to care about and use when schooling their own kids. What gives?\n\n[](https://www.flickr.com/photos/kirbyurner/21934650733/in/album-72157624750749042/)\nfrom: [Storyboard Martian Math](https://www.flickr.com/photos/kirbyurner/albums/72157624750749042/)\n\n\"And so...\" the teacher continues, explaining to the class... \"we're going to train you to think more like Martians as our goal here is to get you ready to work with them at the Mesa, on this dam project. So we'll be studying hydro-electric power generation too, as a part of our coursework.\"\n\nSo you see how I'm using a science fiction premise to: \n\n(a) introduce contemporary geometry, drawing on our geodesic dome heritage and \n\n(b) open doors in the field of electromagnetics. \n\nThat's all very STEM flavored and in my neck of the woods (Silicon Forest), STEM is considered a priority. I recognize that not every locale uses this jargon. My Oregon Curriculum Network is geographically specific. \n\nWe also teach Casino Math, which in other regions might not be considered part of any taxonomy, although clearly risk, probability, combinatorics are all implied. Around here, casinos are an aspect of the ecosystem economy.\n\nOnce we have a bedrock of science fiction, brainstorming possible futures using expressive tools becomes more like par for the course, more the rule than an exception. We want STEM, with other subjects, to embolden and inspire, more than come across as foreboding and/or forbidding. \n\nEncouraging a playful imagination entails a lifestyle wherein it's fine to find time for fiction and fantasy. Whereas some curricula tend to drum that out of ya, as in everyone marching to the same drummer.\n\nIn saying I'm wanting to make room for Synergetics, within the Martian Math rubric, I'm not thereby discounting or removing other topics already considered STEM-worthy, such as cryptography, with both number and group theory feeding into it. \n\nDiscrete maths more generally get a lot of attention, with some looking-askance at the alternative, thereby helping to draw attention to various perennial debates regarding the analog-versus-digital \"true nature\" of reality. \n\n[](https://www.flickr.com/photos/kirbyurner/4903291460/in/album-72157624750749042/)\nBuilding the dam: Pouring Concrete",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}