{
  "id": "115611867895243563",
  "title": "Mathcast Storyboard",
  "published": "2006-08-20T22:30:00.000-07:00",
  "updated": "2006-11-15T11:44:00.550-08:00",
  "content": "Structure: split pane, left/right, two realms of action, synchronized.Format:  I'd recommend targetting HDTV's 16:9 format.Left pane:  Victorian in the movies look, pulling some leather- bound volume, perhaps fiction, off the shelf (looks like some library in [Borges](http://www.themodernword.com/borges/), or maybe @ Sunnydale High,  [Giles](http://www.well.com/%7Eladyhawk/Giles.html) standing by).Right pane: more futuristic graphical instrumentation, showing exploded DocBook XML in an illuminated tree diagram (more like some Klingon control panel).Action:  actor on left thumbs through book, her or his focus (sometimes 1st person) flitting to pictures, across pages; while meanwhile the illumating cursor jumps around in the scrolling XML tree to the corresponding nodes.Audio:  paper shuffle, muffled reader noises ([sotto voce](http://www.answers.com/sotto+voce&r=67) perhaps) mixed with electronic bling.The point of this action:  record that the parts of a book may be represented in a tree structure, and encoded in [human-readable](http://controlroom.blogspot.com/2006/08/more-cast.html), machine-parsable XML.Curriculum objective:  gradually increase a student's comfort level with XML, with previews of and forays into such markups as [SVG](http://www.w3.org/Graphics/SVG/), [XHTML](http://www.xhtml.org/), [MathML](http://www.w3.org/Math/), [DocBook](http://en.wikipedia.org/wiki/DocBook), [X3D](http://www.web3d.org/) plus roll-your-own XMLs (and/or SGMLs if you must).Obviously such a storyboard could be implemented in lots of different ways, even given these  stylistic stipulations (sort of \"Victorian meets Vulcan\").  That's OK.  A storyboard is like a class template, capable of spawning any number of special case instances.Experiment with switched panes, top/bottom etc.  Keep in mind that future includers may be looking for convenient splice points inside your segment.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}