{
  "id": "3597650787007910113",
  "title": "Me Too",
  "published": "2018-10-02T13:00:00.001-07:00",
  "updated": "2018-10-02T16:26:02.820-07:00",
  "content": "I was falsely accused of sexual assault once.  We were stopped at a busy train signal, lots of cars waiting, in SE Portland near OMSI.\n\nI was driving her back to her car, or thought that's what was happening.  All of a sudden she jumps out of my passenger side seat and jumps in the car behind us.  The gate goes up and I go on by myself.  Gee, I thought we were just friends.  She had a boyfriend in India.  I knew we weren't dating. She'd been a guest at Wanderers that time, which is how we met.\n\nThe next day I get a call from some policewoman saying so-and-so was registering a complaint or something like that.  I told the officer I was clueless and incredulous and had my hands on the wheel at all times.  She'd said nothing to warn me she was about to jump ship.\n\nWhy would I try making unwanted advances in the middle of a packed street while waiting for a train?  Headlights were shining through my rear window.\n\nThe officer advised me to think twice next time before driving a younger female around unaccompanied.  Meanwhile, my accuser texted me that any time we were in a public place together, such as a public meetup, she reserved the right to scream about it, stage major theater.\n\nWe'd been at a pro Jeff Merkley party (he was running for office) and she worked for Novick (likewise running, and competing), or she claimed to, so I always assumed her motivations were political.\n\nShe thought I might be influential and wanted to show me how quickly she could tarnish my reputation, spread rumors, and keep me away from venues she might attend.\n\nShe later moved away and changed her name (I found a public blog post where she talked about doing that).  I don't try to follow what happened after that. I posted [something to my blog](http://mybizmo.blogspot.com/2007/10/dirty-tricks.html) closer to the time.  This all happened over a decade ago.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}