{
  "id": "6023831302026285122",
  "title": "Melancholia (movie review)",
  "published": "2013-07-07T01:56:00.003-07:00",
  "updated": "2013-07-07T16:21:44.735-07:00",
  "content": "[The special features](http://www.imdb.com/title/tt1527186/) focus on the two sisters, Justine and Claire, not so much on the other characters, and casts one as the wannabe nurse for the clinically depressed other, the bride, Justine, at the end of the day not truly happy at her wedding, the happiest day of her life in some romance novels.\n\nIt doesn't seem that happy to us either though, to our wandering know-nothing camera, \"we\" the voyeurs.  The guy is someone dug up by the boss.  The boss is hounding the bride to make him rich, as he squanders money seeking influence, power and control over those around him, eager to corner her talents.\n\nOf course Justine blows a fuse after awhile, fights back, and ends up losing the guy, who was an appendage anyway.  She's figuring out the puzzle and not liking what she's finding, and fighting back.  Not melancholia and not romantic either.  She's just doing the math.\n\nShe's ending up a stupid trophy wife and it's not going to be fun.  He's got it all figured out and springs it on her (\"I wasn't going to tell you until later but...\").  Was she consulted in any way?  How d'ya like them apples?  She doesn't.\n\nAs the voyeur audience we're trying to figure it out with her. Who are \"these people\" we've suddenly intersected with?  We do the math too.\n\nFor sure these people have all coped in various ways, which makes them appear insane to the know-nothing camera.  The stupid dad plays a dumb \"trick\" with the spoons, putting them in his pocket and bugging the waiter for more.  He's an idiot for entertainment and in real life as well. \n\nHis wife hates being married to him and is bitterly watching her daughter enter a similar arrangement.  She's as comforting as nails, a prototype melancholic.  Both parents are present, yet unavailable.\n\nThe fighter girl bounces around looking for comfort but ends up proving the stronger one who then gets to comfort the others.\n\nThe others have tried to be strong in their various ways.\n\nThe men stand for science and some kind of authority.  The women look to them for reassurance but then have their intuitions and just know, like the horses.  Yes that sounds formulaic but then this film plays with well-known patterns, stitching them together in novel ways. \n\nWith the end of the world looming, are we able to trust them to really tell us?\n\nWouldn't that just mean panic?  Why not lie to us instead?  Like we do about other stuff?\n\nI'm half remembering science fiction along those lines: a few scientists know but elect not to tell us.  Maybe it's some other finding, like a spreading disease with no cure.  They'd tell us then, eventually, as it would be obvious soon anyway.  But in The Walking Dead, the CDC guy had his secrets, even post Apocalypse.\n\nThat brings me to where I was focused at first: seeing this as science fiction and wondering how close this would match a real end of the world catastrophe.\n\nUntil the special features set me right, I had the planets reversed and during the overture (tricked into listening to Wagner, tsk) I was seeing Earth as Melancholia, thinking a smaller planet, more moon size, was hitting ours, not ours crashing into something much bigger, more gaseous.\n\nEither way, it would have been a huge calamity.\n\nSomething much smaller could do us all in. A moon-sized object hitting the Earth would be \"game changing\" as they say, plus so much depends on velocity.  Cosmic speeds.  We sit around a table at what we call the Linus Pauling House (he lived there as a boy for a short while) and consider these scenarios, given so many of us are astronomy buffs of one kind or another.\n\nI'm thinking gravity would have worked rather differently and the weather would have gone much crazier, not just the horses like before an earthquake.\n\nThe movie worked hard to create an atmosphere and reached into our psyches more than it tried to lecture us about science.  The suspense builds, even though we've peaked at the ending.\n\nAnother focus was the living standard these folks were enjoying.  Early 21st Century pre cell phone, with palatial estate living complete with butlers, stables, no apparent limit on luxury.  Yet there was weirdly no TV, no flat screen telling us about Melancholia.\n\nClaire sneaks on the Internet furtively checking to see if her husband might be concealing something from her.   That's more the feeling that they're withholding a diagnosis because you're not considered capable of facing the truth.\n\nWhat do we hide from ourselves?\n\nHaving a giant planet in your face, looming, is like the elephant in the room, a loud reminder of personal mortality in microcosm, a ticking clock no matter how privileged your access to palatial gardens with sundials.\n\nAre we having fun yet?\n\nSuffering from a hatred of life when it's so precious leaves us feeling disloyal, or is it just that we're immortal and are loathe to face up to it, plus we're still mortal enough to have to die and die again, and who knows how many times get married, if not to a person to a company maybe?  To a lifestyle?\n\nPeople posit \"Heaven\" as \"happily ever after\" just so they don't have to think about it, Hell the same way.  Mark Twain poked at those conventions, poking fun.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}