{
  "id": "205750770570643650",
  "title": "Members Only?",
  "published": "2017-03-20T13:53:00.002-07:00",
  "updated": "2017-03-20T14:11:02.067-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/32236528686/in/dateposted-public/)\n\nWhat \nsaves the institution of membership from degenerating into \nrun-of-the-mill cronyism and cliquishness (the common lot of your \naverage black box church) is transparency to non-members, i.e. no \n\"members only\" rituals and initiations. \n\nThis guiding design \nprinciple puts the non-member in a position to fully \"try before buying\"\n while placing workflows under permanent \"outsider\" scrutiny. Members \nfeel publicly audited 24/7, and that's actually what public companies \n(non-profits) are supposed to provide, in exchange for their not having \nto pay taxes the same way an ordinary business does.  We're more like \ngovernments, of, by and for the people. Religious institutions take that\n \"nothing to hide\" route, and then often hide plenty. However Quakers \npride themselves on conducting their business openly, as a part of their\n truth testimony.\n\nDuring my most recent tenure on Oversight, I pioneered having a clear\n policy of inviting non-members to join clearness committees for those \nwishing to become members, even to convene same. I must say some members\n found this highly counter-intuitive. We did always have at least one \nmember on said committees, as for purposes of clearness, the candidate \nmember should have worship discussion with Friends of both persuasion.\n\nIn\n my view there's no other way, outside of transparency, that has much \nintegrity. Otherwise you get \"members only\" signs and symbols and before\n you know it ruling clique mafioso with rank and gradations, handing out\n favors to the most sycophantic, and the whole anti-egalitarian \nhierarchy of an illiberal church, blech (some pastor-led churches may be\n quite liberal in the sense of open source, not saying only unprogrammed\n have a shot at salvation).\n\nYou want your convinced Friend / new member to have had the \nopportunity, at least in principle, to have served in any capacity asked\n of her or him, which may include sensitive positions that fully \nexercise a person's talents (e.g. AFSC liaison).  Nominating is free \nto overlook membership in seeking to bless people with opportunities for\n growth that serve the meeting (win-win). Non-members on Finance, \nProperty, Oversight & Communications, Ministry and Worship, is more \nthe rule than the exception. I know I've shared all this before, but I \nthink it bears repeating.\n\nThat being said, because we have to map\n to Oregon state legal templates at some level, as a 501(c)(3), we \nreserve some of the fiduciary / corporate roles for recorded members, \nwith maybe some rare exceptions. \n\nThat's in keeping with the \ninstitution of membership's main purpose: to draw attention to those \npublicly identifying as Quakers in some recorded / authorized way. \n\nIn\n theory (I've heard this often) the recorded members are presumably \ntaking more risk, like if Quakers get in trouble with the authorities or\n people start spray-painting Quaker stars (red and black) on peoples \nhouses. Members get credit for bravery and going to jail first. This \nsense of \"going first\" traces to olden times when Friends were deemed \npolitically incorrect and extremist.\n\nBut then we need to remember\n all the not-members and un-propertied, all the slaves and indentured \nservants, who were also brave in lending our Society their integrity, in\n whatever ways open to them.\n\nThe not-public Quakers comprise a \nkind of Wall of Stars, of anonymous benefactors who never outed \nthemselves (how could they? Maybe I'm a general in some army somewhere, \nyearning for peace, whereas outing myself would be political suicide in \nmy position) but supported us behind the scenes nonetheless.  \n\nThe\n theme here is respect, earned or by entitlement, and I'm suggesting \nmembers and non-members are flip sides of the same coin (and I \nunderstand meetings not wanting to bother with the overhead -- I'm \nthinking more of how to cope with inertia from the past, vs. trying to \nimpose an unwanted institution on newer, membership-free brands of \nFriend like Howard's).\n\n[ [copied over](http://www.quakerquaker.org/profiles/blog/show?id=2360685%3ABlogPost%3A151548&commentId=2360685%3AComment%3A151851) from QuakerQuaker ] \n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjdKq6xNQKV67qU9KOZOHlpfc_iy2cnyXG3tdrQ9BE2peUSanz2tgRN55btiJEhgUOK3aahgKvUwmTdXoTfERStLlMdeVaIZ30TqG0W-q6dlAFAJ5PgLXZlwV0j9SG4LvmaHQ6F/s1600/ks4-2a_quaker_star.jpeg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}