{
  "id": "1896235411021443413",
  "title": "Meme Spotting",
  "published": "2019-04-09T13:54:00.000-07:00",
  "updated": "2024-10-22T21:42:08.927-07:00",
  "content": "The internet is abuzz with rumors, that Yang Gang is hoping to \"steal\" the mascot of the Trumpians, Pepe the Frog. The rumor is sketchy for a host of reasons, starting with Gamers who've adopted Pepe were not, to a player, loyal to that one camp to begin with.\n\nPepe grew up alongside Annoying Orange, after Evil Bert got too scary (mixed up with Al Qaeda, another story).  He needs to live on beyond the Trump Era, and so if he takes on some Yang vibe, is that really a radical transectomy, or more a re-shade and [new slant](https://www.youtube.com/watch?v=4gDUeYLuITM)?\n\nA typical scenario for a Gamer is I'm doing well in a cool basement, holding down some part time work, underemployed but addicted to gaming anyway, and that's a lot of work in itself.  Youtubes show what a lot of work it is.\n\nThen some foreign policy wonks from Groupthink Inc. come along, and whisper in the ear of some all-gullible Columbia (the name of a District, and a mythical figure), that she needs to yank our boys away from their computer games and deploy them in Middle Eastern deserts, to right some wrong that's being done. \"Go shock and awe someone son\" says the latest \"brought to you by...\" Uncle Sam.\n\nMany troops witnessed first hand that \"doing good\" and \"spreading democracy\" had a lot more to do with spreading terror, and that families back home were paying the price.\n\nThe Tulsi Gabbard followers include an overlapping constituency, many stuck overseas to this day, and deprived of much representation.  No wonder there's a Yang-Tulsi meme going.\n\nHaving siblings overseas in harm's way is no way to encourage concentration in school.\n\nThese wars needed to have been necessary, in retrospect, to justify the continued allegiance of the eligible classes of male and now also female resident, whether citizens or in line for said status.  Keeping that narrative intact has proved difficult among the English speakers (the UK has gone through some similar soul searching).\n\nWhen Yang Gang comes along with new Silicon Valley think, and a kind of economics relating more to the thermodynamics of Planet Earth than we're used to, and fully conversant with automation, then Wall Street gets nervous.  The financial capitals have their own economics which they understand, and which is less like [electrical engineering](http://coffeeshopsnet.blogspot.com/2019/03/csn-explained.html) (with a solar power socket).\n\nPepe might be safely symbolic in the traditional financial sector, which has gained control of governments on many levels, but Silicon Valley has its own metaphysics, inheriting as much from Asia as the European families.  The Empire State is more comfortable with a mindset it well understands, even if it poses as despising same.  At least Trump's main focus is the Middle East.\n\nYang is happy to discuss his race, and what it's like to be bullied, but how that gives him no right to say he knows what it's like to be black, and stigmatized for it.  That part of his banter is nicely worked out, and then race becomes more of a non-issue.\n\nSure we're allowed to notice people's \"race\" (whatever that means to us), and talk about it (somewhat differently).  He's not at war with the many vernaculars.  He's comfortable with colloquialisms.\n\nIn that regard, Yang is media-fluent in a way Trump surprisingly is as well (for someone that old -- but groomed by TV to be ratings-worthy).\n\nI don't see myself as the answer man, when it comes to how Pepe will tip.  I'm purposely not reading a lot of opinions on this topic, as I'd prefer to think it through independently.  I'll be watching.\n\nI do know that a lot of draft age youths would prefer $1000 a month to play computer games, some of which could be educational [and rewarding](https://worldgame.blogspot.com/2018/09/benefactor-new-board-game.html) in other ways.  Ditto their parents and siblings.\n\nAs a Coffee Shops Network avatar, with gaming for charity blueprints, I'm obviously not trying to fight the Gamer community.  Quakers Play Quake is one of my imaginary bumper stickers.\n\nYang and I share an appreciation for truckers and trucking (the industry).  He doesn't know about Truckers for Peace (citizen diplomats, getting academic credit, with truck stops the new embassies in some ways -- including for the so-called \"virtual\" or \"diaspora\" nations).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}