{
  "id": "9099408548344147113",
  "title": "Memo to Quakers",
  "published": "2014-05-08T14:07:00.001-07:00",
  "updated": "2014-05-09T11:41:08.735-07:00",
  "content": "Here's is something I posted just today to an EcoMind Group, like a reading circle, at the Friends meeting I attend (typos fixed, more hyperlinks added).\n\nI'm summarizing the ISEPP lecture last night as a part of it.  Great talk, great Heathman dinner afterwards.\n\nThen I stayed up until 2 AM watching movies (Mr. Death again).  I'm a bit of a glutton for media, aren't I?  I've lost quite a bit of weight though, despite the gluttony.\n\n=====\n\nRe: \n\n[http://workthatreconnects.org/wp-content/uploads/2014/03/Planetary-Hospice.pdf](http://workthatreconnects.org/wp-content/uploads/2014/03/Planetary-Hospice.pdf)\n\nI was glad to see methane getting more focus in this reading, not just CO2.\n\nI recently viewed the funny-edgy documentary 'Got the Facts on Milk?' and somehow it spoke to my condition such that I haven't needed to chug down a huge glass of milk at a sitting for many weeks now.  I don't even have it in my refrigerator, had to borrow some from the neighbors when Friends Ek and Scholl came by to help with [the tree planting](https://www.flickr.com/photos/afscportland/13911154529/).  \n\nLowering our methane footprint ties into [Lappe's writings](http://www.ecampus.com/ecomind-changing-way-we-think-create-world/bk/9781568586830&pos=3) in that if we so-called \"rich people\" can wean ourselves from our big steak big milk fast food lifestyle, we'll: \n\n(a) enjoy greater health and longevity\n(b) return more land to cultivation for people, not their proxy livestock and \n(c) help cut back on a greenhouse gas that, pound for pound, is far more damaging than CO2.\n\nMilk is not helping with keeping calcium in the bones.  It leeches the stuff away and osteoporosis is higher in milk-drinking cultures.  It's basically liquid meat with growth factors (what milk is primarily for:  to boost growth in babies).  Our beliefs about milk are manufactured on Madison Avenue by \"mad men\" (the same ones who told us cigarettes were good for us).\n\nThis idea that the more economically privileged will naturally want to give in to uncontrollable meat addiction with big meat every night is highly questionable I think.  Such slaves to meat are not \"privileged\" that much is clear.  Economics textbooks all purvey this myth, that the better off you are the more you indulge in your meat habit.  I find that assumption to be questionable.\n\n\"Affluenza\" (Galbraith) should be included in the DSM is what I think, as an obviously debilitating mental disorder -- at least I can add it to my spellchecker dictionary.  Quakerism's simplicity testimony is about countering pathological over-consumption, endemic in this culture.\n\nThe ISEPP lecture last night, by science fiction novelist, futurist and computer scientist, Ramez Naam, was a lot about global warming. \n\nCheck out these graphs:\n\n[https://www.flickr.com/photos/kirbyurner/14140165804/](https://www.flickr.com/photos/kirbyurner/14140165804/) (exploding CO2)\n[https://www.flickr.com/photos/kirbyurner/14136596051/](https://www.flickr.com/photos/kirbyurner/14136596051/) (ratcheting up the temp)\n\nI liked the line:  \"Republicans in Alaska believe in global warming, as the permafrost is melting right beneath their feet.\"\n\nNaam was not coming off as super pessimistic.  He's a big believer in the power of innovation, our one unlimited resource (that's the title of his new book):\n\n[https://www.flickr.com/photos/kirbyurner/14140219754/](https://www.flickr.com/photos/kirbyurner/14140219754/)\n\n(The Infinite Resource:  The Power of Ideas on a Finite Planet)\n\nHe's open to a kind of open source not-for-profit genetic engineering aimed at helping decrease dependence on expensive fertilizers and pesticides, and like Stewart Brand, he still thinks there's hope for these smallish nuke plants that you bury in their own sealed containers and never move.  Storage battery technology figures big on his radar.\n\nHe pointed out that sperm whales made a come back when people discovered kerosene burned as well in their lamps.  A species on the brink of extinction may be saved by a simple substitution sometimes. Population is no longer exploding as it once was.  As infant mortality drops and women have more choices, 2.1 kids on average is becoming the norm, and is the replacement rate.  \n\nThe ozone hole appears to be healing thanks to banning CFCs, despite dire warnings from industry about how that ban might hurt them.  Corporations can be such cowardly wimps sometimes.  They may be \"human\" under [white man] law, but that doesn't mean we need to look up to them as role models.  Many of them are \"ethical cripples\" meaning they don't get enough moral fiber with their breakfast cereal.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}