{
  "id": "4213022386940245710",
  "title": "Metabolics",
  "published": "2023-10-14T22:25:00.000-07:00",
  "updated": "2023-10-15T13:59:13.524-07:00",
  "content": "I'm headed to the fat farm tomorrow, my internal name for it. I don't have the budget for any health club getaway at this time. The shift is more from low energy to low energy in a different shape.\n\nToday, for example, my shape was \"sports bar\" i.e. Tom's on the corner of SE Chavez and SE Division. Deke the Geek as I've called him, is a U of O grad and dedicated athlete, at one time a track star, so he was aware that today was a big game: U of O versus Huskies at University of Washington. Not so many weekends ago, I'd watched this same Oregon team against another (winning that time, not this time).\n\nAs I probably mentioned in some other entry, I've bought in to the new dietary model focusing on insulin and insulin resistance. I've tended to be medically minded since at least the 8th grade, and this theory has the right level of complexity to match my expectations.\n\nOn Math 4 Wisdom, we've been discussing \"what's a sweet spot?\" in the sense the Complex numbers seem to be. The more rigid Real numbers are a tad under powered, give less prominence to rotation but through a more cumbersome trig. Or so it seems to Andrius and John Harlan. I have to say I see what they're talking about.\n\nYou'll have noticed the above lifestyle sounds a tad sedentary and you'd be right. With the games come some drinks. I'm not the one driving. We're within walking distance. None of that really matters when it comes to adding weight I don't need. The fat farm will help me fast. I'll still be thinking online using WiFi.\n\nI've embedded my other work of the morning, and extension of my blogging into some vlogging (video blogging). I should add that watching a steady stream of YouTubes is another reason I'm so soft. Thanks to the Bluetooth brick, I'm at least able to move about and do chores when the screen does not require my undivided attention.\n\nI invoked Kierkegaard's name recently, on M4W, thinking mainly of his Concluding Unscientific Postscript, but then it's been a long time since I actually raked my eyes through that. \n\nPeople would love to have an algorithm to follow that makes their actions above reproach. They won't be facing inquiries later, because \"doing what the machine says\" is a safe course of action. The existential predicament is we don't get to closure in that way i.e. our science is not up to the task of proving we did the right thing looking back. Yet we must act anyway. Thinking in terms of justifications is not atypical. One imagines oneself before some board of inquiry, as in Oppenheimer.\n\nWhether that's a good interpretation or not, of Soren's philo, I wanted to jot down his other focus: that of the undivided Will. Since the will was ultimately for the good, or of God, it's a good bet having an undivided will (whatever that means operationally) would be blissful. Ties to Taoism go here, clearly.\n\nI'll be cutting out the alcohol at the fat farm. I've gone over a year without beer, not counting the alcohol free kind (which I've sampled). Again, it's more about calories. If I allow myself beer, I over allocate and/or exceed my quota.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}