{
  "id": "8915671243793920207",
  "title": "Minister of Education",
  "published": "2008-11-26T08:57:00.000-08:00",
  "updated": "2008-12-01T09:02:36.743-08:00",
  "content": "[ reposting from Synergeo #45758, hyperlinks added ]So as a former Minister of Education with portfolio, rotating position (might do it again), within, as ya'll know, our benign dictatorship called Python Nation, I've been marketing my rbf.py to [gnu math teachers](http://worldgame.blogspot.com/2008/05/propagating-gnu-math.html) as a way to rationalize IB level vector studies around our [eternal war of incommensurability](http://controlroom.blogspot.com/2006/08/eternal-war-of-incommensurability.html) aka the concentric hierarchy and its unifying dynamisms (jitterbug etc.).rbf.py has gone through several incarnations, but the common feature is to can the core polys, lately in the form of a MySQL database, with students needing both [LAMP](http://www.4dsolutions.net/ocn/geoquiz.html) and [MVC](http://www.4dsolutions.net/ocn/pymath.html) in some approximate form (might be Ruby on Rails), in addition to computer graphics (i.e. 4D++ stuff, Eulerian topics like [V+F = E+2](http://worldgame.blogspot.com/2008/11/posting-from-my-xo.html), part of any state standard worth beans, duh).AFAIK, my next major gig will be in Chicago where I'm doing a [parallel processing demo](http://mail.python.org/pipermail/edu-sig/2008-November/008873.html), in the sense of two tutors running on independent threads, [Steve Holden](http://holdenweb.com/) being the other [clown in the room](http://worldgame.blogspot.com/2008/11/ieee-presentation.html), plus we have a plant maybe, a professional mathematician with lots of background in Bucky.Anyway, it's not like I'm planning the whole show around just [the VPython piece](http://www.4dsolutions.net/ocn/koskigeom.html). Mostly I'm demoing the Portland prototype curriculum of tomorrow, which takes for granted these various 20th century breakthroughs, not just Fuller's. [We do RSA](http://www.4dsolutions.net/ocn/rsa.html) in the context of a few simple theorems, simple to understand and use if not prove (Fermat's Little (not Last), Euler's for Totients). The point here is not to turn junior into a cryptographer necessarily, though knowing some helps, but to [open doors in group theory](http://www.4dsolutions.net/ocn/crypto0.html), [number theory](http://www.4dsolutions.net/ocn/flash/group.html). Can't tackle quantum physics without that notion of small groups, permitted operations amidst conservation laws. I'm sure that's what Bucky was talking about, in terms of his spun systems being likewise permutations with lots of suggestive angles.Also on tap: some Fractals with PIL for after the break, drawing against my signature [4D Solutions collection](http://www.4dsolutions.net/ocn/cp4e.html).[](http://www.4dsolutions.net/ocn/cp4e.html)In Synergetics news, Koski is barreling ahead with those Baer Cell studies, bringing the enneacontahedron into better focus as the last in a sequence of convex blobs, each dissectable into Baers in very definite ways. Those of us who prefer definite / finite in place of open ended and infinite, are having a field day. More in my blogs.KirbyPS: here's the write-up for my Saturday Academy course in the spring. If you live in a city with nothing like SA:, maybe study the website and get some friends together. Students really flock to this kind of programming, know it's very good for their futures.Computer Animation ProgrammingSupercharge your programming skills asyou learn the software Star Warsanimators, Google engineers, andgame designers use to make theirprojects a success!You will develop your Python skillsusing simple vector-based geometryin an object-oriented approach.You'll get hands-on experience withPOV-Ray, a full-featured ray tracerthat can create stunning photo-realistic computer-generated imagesand animations and experimentin VPython, a real-time game-likeenvironment.Other topics include data structures,classes and objects, control statements,and reading and writing files.[](http://www.flickr.com/photos/17157315@N00/3067306286/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}