{
  "id": "195251641726891552",
  "title": "Minions (movie review)",
  "published": "2015-07-10T21:17:00.001-07:00",
  "updated": "2015-07-11T20:06:14.621-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhYhTnOCodALJpC34g5oOB64ECAO0O9DxfYUu1myObM2FmoTqpPveollJQxAIyviyptKLcaD7qSUlkwscKuyjw5xnWGP9WS5JuV_Gqm9d32Ygj2RuhUoNsn_KcbhN5xF_TQl0iG/s1600/Minions-Film.jpg)\n\nSeeing Minions isn't [work](http://mybizmo.blogspot.com/2015/07/what-is-work.html), is it?  I'd worked double hard the day before, needed some R&R.  I'm fortunate The Bagdad right nearby had the 2D version on opening day.  I was there by the second showing, at 3:45, mixed in with kids and their parents, no doubt with a few other over-the-hill cartoon nuts.\n\nI was glad to catch this [so close to Spy](http://controlroom.blogspot.com/2015/07/spy-movie-review.html), thinking of Overkill, the female villain.  Spy had a similar jealousy thing going between a heiress baddie, a highly spoiled brat type character, and an earthier female goodie agent in a mostly-male agency.\n\nStrong female models of both Goodies and Baddies are needed by 1968.  We already have a female Goodie by then, the Queen of England, but what about a signature Baddie?  [Barbie](http://controlroom.blogspot.com/2009/03/hb2u-barbie.html) will not do.\n\nOur villain shows up in Orlando (Scarlett does sound Southern).  [The Mouse](https://en.wikipedia.org/wiki/Walt_Disney_World) is still underground (not much going on yet, cloaked in secrecy).  She of course wants her new Minions (adepts) to steal England's Queen's crown (what else?).  It's as tight as mathematics.  Some will call it formulaic.\n\nMinions are a species, see, that evolved independently of humans but immediately took to them and has followed them ever since.  Humans were too hopeless however, for a long dark age, to attract the continued devotion of Minions, who in the meantime had stumbled upon a sanctuary free of natural predators.   Why not try democracy for a change?\n\nTheir freedom from sycophantic service to a Tyrant or Boss, was initially greeted with enthusiasm, but such freedom went against the very constitution of their being; they needed a Commander in Chief, like a hive needs a Queen.  Call it a craving, call it an addiction.  Minions are called that for a reason.\n\nThree brave Minions, led by Kevin, set forth then, leaving the ice cave (symbolic of the dark ages period) to seek a new Boss amidst humans, which parallel species had evolved by then into 1968 urbanites.\n\nRock music is still somewhat new (The Beatles is all the rage), the Sydney Opera House is still under construction, and Nixon is running for president.  Kids go with their grandparents to see this summer movie, it all makes so much sense in 2015 with the Grateful Dead about to play their farewell concert.\n\nAfter New York and Orlando, we end up in London, persuaded Scarlett is worthy, only to end up meeting a young Gru, this being a prequel to their later stories together.  Like I said, the plot is tight, and part of a larger franchise, like the Oz books.\n\nMinions are following their destiny just as predictably as everyone else is in this story.\n\nMeanwhile, the cave-dweller Minions, getting news of success in London, and finding local surrogates not working out, follow their instincts and make the trek, like the penguins do, to become Scarlett's invisible army (Minions do seem close to invisible at times).\n\nI'm seeing predictability versus surprise and transformation as thematic, as in [the Lego Movie](http://worldgame.blogspot.com/2014/02/the-lego-movie-movie-review.html). \n\nCritics might complain of \"a formula\" but cliches and cardboard cutouts are the raw material for knowing satire and/or for sharing Gnosis with a sophisticated movie-educated crowd.  I'm happy to use the word \"deft\" to describe the twists and turns.\n\nHaving a Minion grab the mystical Excalibur, bringing superstitious Britons to their knees, and sending QE2 to the nearest bar to drown her sorrows, was brilliant and leads to the 180 turn in the Minions' relationship to their villain sponsor.\n\nScarlett is their Enemy now, outraged that instead of stealing the crown, they hath crowned themselves King, a betrayal, after Herb had armed them with special powers.\n\nAs King, however, Bob has the power to make things right.\n\nMy seeing predictability-versus-surprise as thematic is perhaps explained by the fact of my meditations these days ([including blog posts](http://worldgame.blogspot.com/2015/07/animusic-2-movie-review.html)) drifting to [the topic of epiphenomenalism](http://plato.stanford.edu/entries/epiphenomenalism/),  the philosophical sensibility of being \"along for the ride\" -- somewhat surrendering versus control freaking.  Observer : Observed :: Train Whistle : Train :: Rider : Roller Coaster.\n\nClearly most stuff just runs on autopilot, on a track, so where is the will in all this?  An old question.\n\nWe make choices (executive decisions) all the time of course, but the events of history come off as more than the sum of the parts.  We choose, yes, but in hindsight somewhat as puppets of history acting out in bigger scripts, a concurrent computation of some unknown precision (compared to what?).\n\nArguing for or against epiphenominalism as a rational exercise is empty calories, as affective psychologies (I didn't say \"disorders\" -- \"orders\" too) are more like phases of the moon, to be experienced and savored, not adhered to as ideologies in need of disciples (of minions).\n\nLike in theater, if someone loves improv -- as an actor, as a spectator -- that bare fact doesn't commit that someone to any specific philosophy, not even Scientology (popular in Hollywood).  Yet your abilities and sensibilities along those lines may grow more within some practices more than in others.\n\nYour coaches or gurus may matter most and your improved improv skills need not entail your becoming an initiate in every teacher's philosophy.\n\nImprovements and skills just \"rub off\" sometimes.  Transmission occurs.\n\nJust being around someone may prove contagious in a good way i.e. one gets what they've got, and is grateful (not all meme viruses are unhealthy, i.e. some are worth catching and spreading).\n\nDiplomats need to improvise, are improv artists, agents for their agendas.\n\n\"[Exaptation](http://mybizmo.blogspot.com/2010/04/smart-mobs.html)\" Stuart Kaufman called it (improvisation), in that ISEPP lecture:  evolution by surprise innovation.  It's a phenomenon in no way confined to the human realm.  Bacteria are especially adept at innovation.  \"Synergetic\" implies \"unpredicted by the parts\" i.e. surprising when made whole.\n\nSpeaking of which (OK, a bit of non-sequitur), I enjoyed [Vi Hart's comments on gender](https://youtu.be/hmKix-75dsg) in a recent Youtube I saw (and Facebooked).\n\nThe tie-in is: she tells the story of, as a teenager, suspecting people who said they liked beer were hollow phonies just posing as beer lovers, as the stuff tastes awful and how could that not be obvious to all concerned?  But then she discovered Belgian beers, and had a change of heart.\n\nLikewise, some theme in the philosophical literature will seem an empty waste of time from a distance, but in another chapter will gain some foreground respect and new-found relevance.\n\nThe same literature comes to seem more colorful and lush.  Life goes in phases, in spirals.  We're born not just again, but again and again and again.  We go from hating beer to liking beer, to not caring about beer, to forgetting about beer, maybe back to liking beer, and so on.\n\nAnother tie-in with Vi's talk is Minions are seemingly genderless, like her stick figure drawings, the film poking fun at some of their meaningless modesty gestures.\n\nYet Scarlett Overkill is a first female super-villain.  So gender is likewise a theme.  She has a husband, a chief of staff, named Herb, providing complementary contrast, and role balancing.\n\nHigh contrast and comedy, count me a fan of this [Gru-some brew](http://controlroom.blogspot.com/2015/02/despicable-me-movie-review.html).\n\nBTW, how does it work where Universal is able to claim all resemblance to non-fictional characters is purely coincidental?  Isn't the Queen of England a real historical figure?  I agree Minions is not a documentary nor aimed at relaying actual historical events.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiXdOfyXAGeYa12DPLh_iOn3x04NvygteBopFO4UDVyc4nvx6RPTRA7l1kiu5CFk4P32JWcqfVbykbX8bFRUjhgKmGwWP0sYeUH8xj93gUCx4n23hx1MpCUQDhIuBPzeEvVKre3/s1600/Pink-bow-on-should_2232427a.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}