{
  "id": "8504869588330181302",
  "title": "Mixing It Up",
  "published": "2012-09-10T18:39:00.003-07:00",
  "updated": "2012-09-10T19:09:13.306-07:00",
  "content": "I experience a fair amount of continuity between say [Crystal City in DC](http://worldgame.blogspot.com/2012/09/djangocon-2012.html) and The Pearl here in Portland, thanks to the overlapping cast in our Python Nation (a \"ghost state\" i.e. \"virtual\").  [The Djangocon crowd](http://mybizmo.blogspot.com/2011/09/my-character.html) sloshes about.  I'm always meeting new principals.\n\nHowever, I've certainly been meeting a lot of new people lately.  Yesterday I was lucky enough to meet up [with Alan Potkin](http://worldgame.blogspot.com/2010/06/asian-scholar-visits.html) and his friends and family, out in the suburban west.  He's through here quite infrequently.  His daughter and brother were there too.  Amazingly.\n\nI was Alan's best man at his wedding to Kati in Bhutan.  Thimphu is really built up since then, coming closer to Thailand in its global face, yet maintaining its own threads of culture.\n\nI said good bye to Lindsey's mom at the bus stop this morning.  Lindsey was escorting her back to PDX International, to have a little more quality time.  I wish them both my best on their respective adventures outside of Portland.\n\nAlan showed me some more 360 inside shots of old temples.  These were in Thailand I think.  Alan has specialized in digitizing off the beaten track sites, some still in use.  The new tablet, one of Apple's, was very up to the job of letting us sit on a couch and look around in these worlds.\n\nMelody was in the back yard by the time I got home, also meeting Lindsey's mom, a Florida farmer, and to me reminiscent of Dawn's dad's side of the family in Pennsylvania (e.g. Aunt Betty). \n\nMelody has ventured pretty deeply into Southeast Asia in her day.  She's also veteran [of Burning Man](http://worldgame.blogspot.com/2012/08/factory-of-one-movie-review.html), and a vegan.  She was also one of the housemates here in Blue House for some months.\n\nMy cousin, the ER doc, shot down here in her new diesel Passat (VW) to some dinner and catching up.  She was finishing a gun safety class so we talked about whether my sponsors would go for such training.  I've been OK with it, citing William Penn who carried a sword for a number of years.  The ethics are much like those of the mom & pop martial arts shops, who say the true master never needs to resort to the melodramatic stuff.  InshaAllah you never use it for other than entertainment purposes of which medical doctors might approve.\n\nWe also discussed the unbelievability of role models such as House, M.D.  Yes, viewers know they're fiction, but just like [Mr. Rogers](http://en.wikipedia.org/wiki/Mister_Rogers%27_Neighborhood) had a problem with superheroes, so one might argue these fictive cop, doc and lawyer shows are a vicious racket.  Junior grows up in a bubble, suffocated for lack of reality.  Which I guess is where \"reality TV\" comes in, like those \"over the shoulder\" cop shows where the camera crew is \"embedded\" (or is robotic).\n\nHowever, leaving it to some schools to offer training in firearms safety etc., is tantamount to leaving other schools free to not so partake.  The luxury of attending a facility that is as gun free as it is second hand smoke free should not be out of reach.  Whole islands could abide by these rules, Okinawa for example, although it's hard to think of that many Asians giving up cigarettes.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}