{
  "id": "1584490840525433809",
  "title": "MLK Day (2018)",
  "published": "2018-01-15T16:12:00.001-08:00",
  "updated": "2018-01-23T18:07:05.147-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/25847991078/in/dateposted-public/)\n\nApropos of MLK Day, I was much impressed by Birmingham's Civil Rights Institute, a study center and archive, as well as an excellent museum. I was impressed by \"the ham\" (Birmingham) over all, nice to be there for a few days.\n\nBirmingham had some utopian aspirations and to some extent dreams came true, just we learn to take the future for granted, and what at one time might have been a stunning vision of a promised land, is just another day on Planet Earth:  great freeways sprawling every which way;  a proud university at the center of town; people from all walks of life expressing the human genome, without forced segregation; TrimTab beer.\n\nThe American Experiment, so-called, was a bold one: to forge a civilization from all the world's peoples.  E Pluribus Unum:  from plurality, unity.  The whole world came to know of this experiment and now we're all American in some sense, indivisibly planetary in our affairs and outlook.  People understand the ideals, even if skeptical personally, about their attainability or worthiness.\n\nSome commentators brand so-called \"globalism\" [as unAmerican](http://mybizmo.blogspot.com/2017/03/of-globalism-and-macroscope.html), whereas [in my view](http://mybizmo.blogspot.com/2016/11/thinking-globally.html) America was always about accepting our manifest destiny, as work-study student-faculty within a spherical Global U.  Our promised land, our Israel, is ball-shaped.  Lets accept what's self-evident, shall we?\n\nSpeaking of student-faculty, the scholarly Sam Lanahan came by this morning and gifted me with a really robust, [top-ranked juicer](https://flic.kr/p/FnyFNd), an appliance for turning fruits and vegetables into beverages.  I'm excited.  2018 is about focusing on health.\n\nThat's what we all need our freedom to focus upon.  Some of us don't have that privilege.  We're asked to sacrifice health for the greater good sometimes.\n\n[](https://www.flickr.com/photos/kirbyurner/24845201547/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}