{
  "id": "8535804096442568158",
  "title": "MLK / FBI",
  "published": "2022-01-18T09:59:00.005-08:00",
  "updated": "2022-01-18T10:02:18.576-08:00",
  "content": "The title refers to a new movie, which we rented from Movie Madness and watched on MLK day (yesterday).  The movie focuses on the FBI's surveillance of Martin Luther King and his associates, in connection with the former's paranoia regarding communism, a memeplex deemed controlled by the Soviet Union.  \n\nThe military industrial memeplex embraced the threat of communism as its nuclear material, that which would justify all that followed, by fueling fears.\n\nMLK was a product of his time and not really in a position to counter the psychosis of the over-simplifiers and their HUAC.  Weak thinkers such as Nixon would later make it clear how little structure or historical information really went into this toxic blend.  \n\nOne might blame Hegel in some ways.  \n\nAmericans just didn't know how to deal with their own European heritage and could barely help themselves when it came to staying out of elective wars they had no real business joining.\n\nGermany was seized with a virulent nationalism focused on a \"manifest destiny\" sensibility just as surely as any expansionist power.  When ideological ambitions express themselves in the form of contiguous landmasses called \"nations\" (to be drawn and redrawn) we get that political data layer the Fuller Projection tends to dismiss as irrelevant.\n\nThe upshot is a conquered people, with Americans these days subjugated by Eastern philosophy, as much as the neo-Roman religion (heavily nationalist).  By Americans I of course as much mean the peoples of the Americas, the West.  I don't mean Anglo-Euros who carry these meme viruses and have succumbed to them, becoming creatures of the soulless corporations (animated by law).  Some of them seek enlightenment and liberation, but most seem content with their programming.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}