{
  "id": "4513827234829934498",
  "title": "Momenta",
  "published": "2023-08-15T06:43:00.011-07:00",
  "updated": "2023-08-21T11:07:04.144-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53114913790/in/dateposted/)\n\nWe know the word \"memento\" meaning more like \"souvenir\" or \"reminder\" whereas I mean \"momenta\" in the sense of \"momentum\" yet pluralized. Mass in motion, basically, a phenomenon with some conservation properties. Momentum likes to be conserved, one could put it.  Sometimes, however, we say it's not, because \"heat doesn't count\" i.e. the ability to do any more work goes away after the explosion.\n\nThen we have the more subtle momenta of what I've called \"word meaning trajectories\", which in a rather concrete sense characterize the many commercial brands that experience boom and bust economies. A brand will veer, sometimes based on advertising. Did we read the market wrong? Or maybe we got it really right this time. And so on.\n\nFrom commercial brands we get to nation-states, the so-called sovereignties. Individuals seek out agents in any narrative, in hopes of moving said narrative forwards in a way that alleviates and/or avoids suffering by these individuals. \"Make the story be me-friendly\" is a prayer with which most will empathize.\n\nA keyword here is \"identification\" which comes up a lot in \"identity politics\". Who or what does one identify with and with what level of agreement? Anyone might step forward and claim to be a spokesperson for X, but that's why we have titles and credentials, to keep control over who gets to speak for whom. Words like \"legal\" get their momentum, their trajectory, from real special cases involving this principle of representation and identification, as in \"she is my legal representative\".\n\nIn coining a term like \"dymaxion\" like Bucky did, with a little help from his friends, one is throwing one's hat in the ring as an influencer. However coining neologisms is but one of many tools. More commonly one seeks, in media campaigns, to wire in associations, such that if one thinks about A, one is likely to move on to B, whereas B might not have been an oft chosen option, previous to a campaign.\n\nA lot of companies, starting with Cambridge Analytica around the time of the 2016 US presidential election, claim to be using Artificial Intelligence (AI) in coming up with strategies for swaying votes or repositioning political leaders. However, in this subtle world of spin doctoring, Real Intelligence (RI) is still regarded as more likely to succeed in coming up with winning spins. Using \"AI\" for marketing advantages is itself a case in point. I'm using AI too then (in addition), in not planning to be left behind in RetroLand.\n\nSpeaking of RetroLand: I hadn't been to Seattle Center in a long time and my narratives have become unsynchronized with various new realities. For example, the Experience the Music Project, and the Museum of Science Fiction, have been amalgamated into the newer Museum of Popular Culture. The institution has rebranded itself in a longer term form, with an easier to grok meme and mission. Pop culture encompasses anticipatory design science (future studies) as well as music mnemonics (where we've been, the way we were). The museum's momentum is largely preserved.\n\n[](https://www.flickr.com/photos/kirbyurner/53114993673/in/dateposted/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}