{
  "id": "2838936152132992202",
  "title": "Monday Night Circus",
  "published": "2016-05-02T22:00:00.000-07:00",
  "updated": "2016-05-03T06:28:35.936-07:00",
  "content": "My objective here was to throw something together and upload it to Youtube in a very short time, with minimum fuss and bother.  Rapid Product Development.  I was happy to see the HDTV pressed into service.  Well done.\n\nYes, I shot too much of the carpet, but then ever since the [carpet replacement](http://www.pdxcarpet.com/) at PDX International, Portland has had an eye for carpets.\n\nI found a royalty-free audio track (Retro 90s Arcade Machine) on [Free Stock Music](http://www.freestockmusic.com/) and, using  Camtasia with transition effects, had the video uploaded to Youtube, ready for sharing, within just 50 minutes, which time included socializing with peers.  I added the annotations in post production, via the Youtube UI (user interface).\n\nSheri wondered if [Shoop source code](http://controlroom.blogspot.com/2016/04/code-school-gift-shop.html) was in English, given it's natively Finnish.  It is, however I found some translation modules [allowing i18n](https://github.com/shoopio/shoop/blob/master/shoop/xtheme/locale/ja_JP/LC_MESSAGES/django.po) ([internationalization](http://worldgame.blogspot.com/2014/07/i18n.html)).  We were discussing hacking on eCommerce applications within the Code School ecosystem.  Given <guild /> is Python-centric, I'd been researching some of the Django offerings.\n\nMy study topic this evening, again [thanks to Ted Kosan](http://controlroom.blogspot.com/2016/04/work-study-notes.html), is the Semantic Web, which we might define, depending on ontology, as built atop XML, although that's more an implementation detail than a requirement. \n\nRDF is certainly URI-based (from the HTTP protocol) whereas HTML / XHTML integrates the necessary tagging elements (the markup).\n\nOne of the most [ambitious AI plans](http://worldgame.blogspot.com/2004/09/futurism-ii.html) built atop the Semantic Web is hosted [by Cycorp](https://en.wikipedia.org/wiki/Cyc), the company Ted points to as most aligned with [his dreams on Mathfuture](https://groups.google.com/d/msg/mathfuture/4dfVanOG36Y/KnWrDjVwKwAJ).\n\nXML is not going anywhere, however obtaining any universal agreement on how data should be represented is perhaps an over-ambitious attempt to duplicate what human languages do already, in our post-Babel age.\n\nThe \"cell-silicon hybrid\" is what features in my writings, and refers not to something in some far off science fiction future, but to an evolving synergy we enjoy today.  \n\nCells do get tired with age and there's this fantasy of shifting the entire burden of thought onto relatively long-lasting silicon.  However, nature has found a way to keep giving us fresh neural nets, well positioned to construct new models from scratch.  They're called children, and tend to grow up to assume some serious responsibilities, until they in turn get tired.  And so on.  Works well.  Silicon is so far not as agile.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}