{
  "id": "142989026206574281",
  "title": "Moratorium Proposal (Synergeo)",
  "published": "2010-06-08T16:48:00.000-07:00",
  "updated": "2010-06-16T21:32:09.281-07:00",
  "content": "I like the idea of [a moratorium on new PhDs](http://mathforum.org/kb/message.jspa?messageID=7100734&tstart=0) until we deal with the Bucky stuff with more integrity. It's a philosophy department thing. Unless you're up to date at least a little,  how can you be a \"doctor\" thereof?Princeton should announce this. Small grad school as it is. Turns out it's just a gesture, as it takes about 30 minutes to screen the concentric hierarchy in a way people get, especially with 4D IMAX [tm].I also think it'd be worthwhile to padlock all the public high schools for a day, another token gesture, underlining the fact that this funny business of denying students access to their heritage has gone on long enough -- so stay home and watch Youtubes, like what they show in the military (\"[off your duff math](http://controlroom.blogspot.com/2010/03/for-credit-curriculum-games.html)\").Operation Padlock could be carried out by the National Guard, as it's their job to protect security at home. The governors could order the action. Students would mostly love it of course, as it's another day off from the holding tank prison. Great recruiting tool for the Guard, probably double its popularity overnight, especially when people [understood the motives](http://worldgame.blogspot.com/2005/01/dark-side.html).We need to turn some North American bases into Reboot City operations, where people get some new skills, train in logistics. People will call these brainwashing camps (which they are already) but ultimately will feel more secure if there's some continuity with the decals. If we reskin everything to look \"UN\", the neo-Nazis will go crazy (as if they weren't already). These should be run by civilians though (as the military already supposedly is).Lets see which service, Army, Air Force or Navy (or Marines) is the first to have cool concentric hierarchy cartoons in its officer trainings, along with all the positive futurism attendant thereto. I.e. lets see which service is the least cowardly.My guess is the Navy will be first, even though the radomes were mostly an Air Force thing. Clearly you can't be a legitimate Admiral or General and not know about World Game etc. (unless you're in some mercenary-moron outfit, wearing a clown costume).Probably sounds weird for a Quaker to be wanting the military to shape up and make sense. You go with the army you've got...Also, nix on paying the debt for all those weapons. Those were LAWCAP's idea. Citigroup can pay for 'em with all that laundered drug money eh? Uncle Sam doesn't have any nukes either -- those are criminal and therefore belong to organized crime syndicates (terrorist networks). That's why we need the IAEA, FBI and other police, to put the spotlight on those criminals. Plenty of bad guys to go after.Kirby",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}