{
  "id": "2595509776206563269",
  "title": "More On Gun Control",
  "published": "2015-10-02T19:19:00.002-07:00",
  "updated": "2015-10-04T17:24:33.654-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhSGt4NpedE33Pz6UW6Hmw-MrRZ0XNJBM-Mw7cKH4UZOab6pNIcuc69DmaquCKKw1xnBXJwSi1lOpadLawPGC8ILnAXCC7AoPNr4m4fNp_4-aPboHjTNpXi4E1mwQb7neGHY5sH/s1600/No_guns-allowed.png)\n\nOn CBS tonight, in the wake of the Roseburg Massacre, some guy in a uniform was saying he hoped we would end these \"gun free zones\" so that ordinary people could defend themselves.  I wasn't sure if he meant on airplanes.  A bullet through the fuselage can be a bad thing.  What do air marshals do?\n\nBut in like a Disneyland (picture a theme park), where they hope you don't bring a gun, they could escort you out if they found one, with lots of devices doing screening, even on rides.\n\nA Donald Duck like creature (dressed up staff) might have a lethal something-or-other.  Spy cams keep a lookout.  Signs tell you the rules.\n\nLike I'm not saying staff engineers have to be disarmed.  This is private property.  Bring a gun here, and we'll... escort you out.  Customers are not welcome to bring their own firearms.  Leave them in the parking lot?  Much better at home.\n\nSo a \"gun free zone\" isn't really what the uniform was saying.  Some of the authorities are armed, but they're also carefully screened.  They don't sneak around collecting armaments and plotting revenge, like the profile student shooter, or the Unabomber, another coward.\n\nThey've also trained in how to use these weapons, when forcing everyone to do so is pretty severe.  Only if you promise to also learn a computer language (yes, with tests).  Tit for tat.\n\nI'm not for solitary confinement by the way, unless the prisoner begs for it while having viable non-tortuous alternatives, and even then only for intervals (not too long).\n\nI think establishments should be able to advertise \"gun free\", conferences too.  Make it a badge (gun with a line through it) and a part of the Code of Conduct.  It's explicit.\n\nThat way, if a gun clatters to the floor, it's an embarrassment, as it should be.  You'll be a hero for turning in an illicit carrier.\n\nIn some circumstances, you should only have a gun if you have a badge (of whatever description), not a new idea.\n\nI brought up these ideas on PSF-members, a non-public listserv, awhile back.  Engineers do think ahead, and not just at Disneyland.  I'm not saying any consensus was reached, just the topic was not verboten.\n\nA shortcoming of media debates is it's always about \"the right to own a gun\" as if that were the whole topic right there.  Owning a gun doesn't mean having the right to bring it to into my house.  Property owners have rights too.  Americans worship property ownership at least as much as gun ownership, so these two should be counter-posed if the \"debate\" is not just filler between commercials.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}