{
  "id": "4200169124987327811",
  "title": "More Curriculum Notes",
  "published": "2024-12-16T05:54:00.000-08:00",
  "updated": "2024-12-19T05:28:12.048-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/54204134943/in/dateposted/)\n:: photo by DBK ::\n\nWe have an army of geeks with M4 Mac Minis this Xmas, extrapolating from YouTubes, and a goodly number of them are running Blender. Some would like to break into Python teaching. I have some recommendations.\n\nIf you're a new kid on the block and want a ground floor entrance to an express freight elevator to the top, figuratively speaking, you might want to visit my latest Lesson Plan featuring S3, a number I was promoting to Epistemologists recently, at least to their admins.  S3 = 1.06066...\n\nPolyhedrons may be related to one another versus studied only as individuals. For example, how the cube (3) and its dual (4) both nest, as short and long diagonals respectively, within the twelve diamond faces of the rhombic dodecahedron (6), should not come across as ungraspable mumbo-jumbo known only to esoteric clerics.\n\n[](https://www.flickr.com/photos/kirbyurner/48904575438/in/photolist-q8vyLo-GNshah-QrfReH-231UJ5S-2csiBa8-2hvwJt9-2ifuQn8-2msgpP9-2mVNrUK-2mZv5LL-2nahrpx-2narEqo-2nas2eN-2ngptRX-2nsq3WJ-2pwyGXW-2qhdxrK-fwsARu-fwsE89-fwsLq7)\nV + F == E + 2\n\nWe're talking common knowledge on the level of ABCs. The dual of the cube being the octahedron.\n\nHowever just reading such stuff isn't to get the visualization necessarily and for that we could use Blender. I date myself with my POV-Ray based approach, but the final rendering step isn't as critical as the guts, which is where S3 comes in, in our computations of volume.\n\n[](https://www.flickr.com/photos/kirbyurner/49962483976/in/photolist-2j81MPw-2jDrsZn-2jDsfpX-2qqtfLs-9M9MUk)\n1, 12, 42, 92, 162...\n\nSince Piero della Francesca at least, in the 1400s, we've had a way to derive a tetrahedron's volume from its edges. Other such algorithms, starting from the six edges, have come along since. \n\nThese formulae need to make a come back, as short computer programs, as we present an alternative to the XYZ approach vs-a-vs the tetrahedron's volume in our new paradigm, the one with the unit edge D, the unit volume tetrahedron. \n\nWe may use the \"from edges\" approach instead, with S3 as a modifier, and/or use Gerald de Jong's method, which had no XYZ version in the first place.\n\n[](https://www.flickr.com/photos/kirbyurner/39391693474/in/photolist-q8vyLo-GNshah-QrfReH-231UJ5S-2csiBa8-2hvwJt9-2ifuQn8-2msgpP9-2mVNrUK-2mZv5LL-2nahrpx-2narEqo-2nas2eN-2ngptRX-2nsq3WJ-2pwyGXW-2qhdxrK-fwsARu-fwsE89-fwsLq7)\n\nWe have two principal targets after establishing the new volumes table: great circle networks and sphere packing. Of course the two interrelate and of course both have multiplicitous applications within geography, computer games, and crystallography, even psychology.\n\nWe spin our cuboctahedron and icosahedron, for example, to net great circle networks of 25 and 31 great circle networks respectively, and we juxtapose them. \n\nThe sphere packing starts with our D-edged tetrahedron itself (D = ball diameter). The CCP, with D-edged tetrahedral and octahedral voids, is our Matrix home base.\n\nHow we got here though, was over the S3 bridge, and in Silicon Forest Martian Math, in the context of Sapiens coming to better understand an ET intelligence.\n\n[](https://www.flickr.com/photos/kirbyurner/51804664503/in/photolist-q8vyLo-GNshah-QrfReH-231UJ5S-2csiBa8-2hvwJt9-8tm3iL-2ifuQn8-8xp1nN-2msgpP9-2mVNrUK-2mZv5LL-2nahrpx-2narEqo-2nas2eN-2ngptRX-2nsq3WJ-2pwyGXW-2qhdxrK-bH5gvP-c5RPLS-fwdt8t-fwsARu-fwsE89-fwsLq7-5QyKe7-5QyKsS-6n24Ja-7cXk2G-7jZLhp-8batec-8pNQou-8ryyt2-8ryEix-8ryECF-8teDJ4-8teEm2-8thDyL-8thDHW-8thE4q)\n\nThe Mac Mini army has the compute to bring this literature into the foreground, perhaps in the form of anime. \n\nSapiens and ETs meet on some Mesa and learn to collaborate on hydropower projects. The relationship is non-adversarial.\n\nThe lesson here is for those succumbing to phobias.\n\nHumans have a track record of working together, and the global grids are what we're working on now, much to the chagrin of the phobia-ridden politicians who can't envision a world they don't control.\n\nThe attack on Nord Stream was an expression of the fearful reflex-conditioning of the more robotic lower half of the Bell Curve (less mindful), pampered juveniles groomed to feel entitled to management positions.\n\n[](https://www.flickr.com/photos/kirbyurner/54201030604/in/dateposted/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}