{
  "id": "112317351118113761",
  "title": "More OSCON Brilliance",
  "published": "2005-08-04T21:05:00.000-07:00",
  "updated": "2006-11-15T11:43:44.658-08:00",
  "content": "Today's keynotes:The analyst, Nick Gall, showed us how the Internet models what long term investors look for in an infrastructure: an hourglass shape that makes innovation easy on top of a minimal structure: address, format, protocol. Containerized shipping represents the success of this approach as well.David Heinemeier Hansson: Ruby on Rails trades flexibility for liberating constraints; learn the conventions of the framework, and you'll find Ruby has taken a lot of the responsibility for making your life as a web developer a lot easier.The HP guy, Kartik Subbarao, explained how Venice models the ideal IT ecosystem, vs. quadrants Desert (closed source), Swamp (roll your own, maybe starting with open source, but failing to collaborate with the open source community), Ocean (completely open, all possibilities, no land). Case study: HP buys commercial support from Symas to coauthor OpenLDAP, an open source project, in support of its internal economy, thereby netting the benefits of commercial support and the participation of a global expert community.Geeks sit around with with laptops like musicians with their instruments. One of our sponsors this year: Gibson, the guitar company (I snapped a photo of Gibson's bizmo, parked out front).Next keynote by Robert Lang: a lecture on the history of origami (well developed by 1734). Akira Yoshizawa invented an instructional language for communicating origami (the http of the origami world). The speaker's Black Forest Cuckoo Clock was amazing (as were many of his others).Today's [computational origami](http://www.origamidatabase.com/) is not like the old stuff. Check out the insects! Applications: unfolding space lenses, solar sails, auto air bags, heart implants (e.g. stents). I went to the follow-up presentation, which got into a lot more detail about the mathematics involved (trisecting angles is easy with origami).And let me not forget the [Identity 2.0 guy](http://www.sxip.com/), who lives in Canada.BC, is over 21, and drives this fancy car -- or so he alleges (he provided no credential I could authenticate other than his obviously considerable talents as a presenter -- good enough for me in this case, plus I've run web audits since).OSU is FireFox central (bouncer load balances global distribution). The Mozilla Foundation embodies the open source model where organizations are concerned (there's also a subsidiary corporation). Aside: I think the Python Foundation might do more to emulate this model. Expect FireFox to keep getting better (check my post about XUL). [Mitchell Baker](http://conferences.oreillynet.com/cs/os2005/view/e_spkr/167) is one cool geek.Nathan Torkington is doing a wonderful job of emceeing this O'Reilly event, per usual. We're lucky to have him in our community.Interlude:Dawn picked me up out front in the Subaru (Razz) and we drove to Providence Medical Center, where she had a 5 mm mass removed for biopsy using a needle vacuum. I charged my laptop in the waiting room, and read some of that New Yorker article about the new Pope.We came back after the procedure and I showed her around, starting with the Google booth (good global data), and moving on through ice tea and ice cream stops, sometimes in the company of our old friend since CUE days, Jeff Zucker, a Perl saint and author of an upcoming book on the Perl DBI package. I also introduced her to Guido, Python's big benefactor, with whom I last conversed at that Thai food kiosk near the ferry stop in Gothenberg.IronPython:Now I'm in Jim's talk (Miguel is in the row behind me).  [IronPython](http://www.ironpython.com/) is promisingly fast. The Pie-Thon challenge (trying to get Python to run on Parrot, Perl's evolving engine) helped IronPython evolve, as Guido's benchmark tests for Parrot gave IronPython something to chew on. IronPython 0.6 was only 4% slower than Python-2.3 implemented in C. IronPython 0.9 is now out, and allows subclassing of .NET classes within the language, much better COM support.Jim demoed Avalon running from within a Python interactive shell. Miguel wanted to see the xaml-defined calculator buttons rotated by 45 degrees, using a list comprehension. Hey, it worked! Then he showed a GTK# GUI talking to the Microsoft Word dictionary. Finally, he showed us embedding a Python engine inside C#. I asked him to demo __add__ binding to the underlying overload of C#'s + operator (that worked too). The Visual Studio debugger transitions smoothly between Python and C# stacks (per my question: any debugger would have access to the same hooks in the .NET or Mono framework).Open Technology in Oregon:This presentation by the [Open Technology Business Center](http://www.opentechcenter.com/) was about bringing O'Reilly's OSCON back to Portland, based on Oregon's strong commitment to open technology, including increasingly in hardware realms. We got a rundown on some of the relevant businesses here, plus looked at a roadmap for going forward (a commercialization funnel).We need to also focus on the education, nonprofit and government sectors, for which open technology is vitally important, not just as end users, but as contributing innovators and field testers (Project Renaissance model). OSCON should not become exclusively captive to business interests. Apropos of this, the Government Open Source Conference (GOSCON) is coming to Portland in October, sponsored by OSU's Open Source Lab. A questioner (not me) brought up exactly what I was thinking: Paul Nelson's [K12LTSP](http://k12os.org/) and [Free Geek](http://www.freegeek.org/) are currently among the most important open source projects in Oregon.And After:Party @ Bar 71, deputized a member of [the Posse](http://www.possepdx.org/). Chatted with an OSL guy who was big in the rose business (as in delivery of flowers) because he needed to test some software he was developing for a company, and it actually worked. The company itself went bankrupt, but he wound up with a running business. Then some letter in the mail threatened to sue because he had illegal copies of stuff. Upon audit, he discovered no transgressions, then realized this was a bulk mailing. But he was scared enough to think open source must be the way to go, and he's not looking back.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}