{
  "id": "117721584469749590",
  "title": "More Tales of the Cell",
  "published": "2015-10-12T03:16:00.002-07:00",
  "updated": "2015-10-12T12:04:16.397-07:00",
  "content": "My third grade elementary school experience was in a British academy by the name of Junior English School.  I gradually got used to the new customs.  Changing schools is always a big deal.  I remember we learned to gather and press flowers in our science notebooks, drawing pictures of plant cell anatomy to go along with the specimens.\n\nPeople have discovered [a lot more about cell biology](http://worldgame.blogspot.com/2014/02/lifes-beginnings.html) since those days.  What would third grade look like today?  Or lets fast forward to eighth grade.  There I had the privilege, the luxury, of a real medical doctor for a biology teacher.  When does that ever happen?  We were living in Rome and as a US citizen, like me, Dr. Gillespie was not licensed to practice in Italy.  So why not teach eighth grade biology?  We were blessed.\n\nThe complementary actions of photosynthesis and \"mouth breathing\" respiration form the overarching sun-powered narrative.  Plants cover it all, both forming sugar and oxygen on the one hand (photosynthesis) while breaking those two down, into water and carbon dioxide, during aerobic metabolism on the other.  Not being photosynthetic themselves, animals eat plants for their hydrocarbons.\n\nIn oxygen-powered metabolism, hydrocarbons such as glucose get broken down, using the released energy to power the metabolism of each cell.  The cell's cytosol and mitochondria (in cells that have them) both participate in the breakdown, with the latter especially efficient at turning [ADP into ATP](http://controlroom.blogspot.com/2008/05/animal-electricity.html) via a nano-motor known as ATP synthase.\n\nATP synthase molecules are embedded in the mitochondrial inner membrane, between its more electron-rich matrix (in internal soup) and proton-rich encasing.  The protons seek equilibrium and rush to join the matrix, but in so doing are forced through a turbine-like structure that spins on an axis at high RPM, driving the formation of ATP from ADP, the addition of one phosphor to make primary fuel of the cell.\n\nThe space between the inner and outer mitochondrial membrane was so proton-rich in the first place thanks to the presence of oxygen, which sucks the electrons available from ATP-sparked glucolysis, the initial breakdown of sugar, through a sequence of molecular pumps that push protons (hydrogen atoms minus their electrons) out from the matrix. \n\nEven non-Eukaryota live on ATP, deriving it from a less complete breakdown of sugar, perhaps into alcohol or lactose.\n\nThe evolutionary narrative suggests the Earth's atmosphere was not oxygen-rich enough to support mitochondrial style metabolism until maybe 700 million years ago, at which point a new kind of cell emerged, the eukaryote, able to harness mitochondria as fuel cells, in turn powerful enough to sustain a nucleus with a bigger payload.\n\nA greater repertoire of coded proteins allowed for more differentiated intra-cellular machinery, organelles in other words.\n\nThe modern cell nucleus is a vast library for the gazillion proteins needed not just by the individual cells, but by the community they form, the creature or body.\n\nThe endoplasmic reticulum, continuous with the nucleus, provides a delivery mechanism, a secretory pathway, whereby cells may deliver specialized chemicals, for example insulin, throughout the body, by means of the blood stream.  The Golgi Apparatus receives nuclear byproducts from the reticulum, and helps label them for delivery elsewhere, with signaling proteins.\n\nThanks to the efficiency of mitochondria and ATP synthase in particular, juggling the vast amount of information in human DNA, is now a possibility.\n\nFollowup:\nCoffee Shops Network for [relevant visualizations ](http://coffeeshopsnet.blogspot.com/2015/10/stem-scenarios.html)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}