{
  "id": "3061470633772100943",
  "title": "More Training",
  "published": "2024-04-22T06:50:00.000-07:00",
  "updated": "2024-04-25T10:59:17.922-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53270711529/in/album-72177720307981496/)\n\nSo I'm back in propane-ville, by which I mean nomad land, except this destination trailer is very stationary and I'm not sure the propane is on. I'm fine though, with full connectivity and a heavy navy pea coat I got at Andy and Bax, the famous Portland army surplus store. Sy is fine too. She turned into a puppy briefly yesterday, cavorting and running full tilt.\n\nThey heft the bottle to see if there's propane left, which seems primitive. My evidence is that the burners don't come on, whereas on pervious visits, propane was working fine, but no hot water. The hot water issue turned out to be the in-tank heating element, and is not an issue this time. I showered yesterday after oiling all the wheel line sprinklers in preparation for replacement. Since my last visit, the farm has taken delivery of lots of wheel line segments, but \"the movers\" (the motors that advance the wheel line periodically) aren't here yet.\n\nThere's also a small electrical heating unit in Zone 2. However we're in burgeoning spring and a lot of heat builds up during the day. Oregon's far west climate is rainforest coastal and water intensive agricultural. This farm has water rights up to about two wheel lines at full throttle, which is not a limitation at the pump necessarily. Water is metered (measured, monitored). Not a new idea.\n\nYou might think that, as a Truckers for Peace guy (Trucker Exchange program, swap routes around), I'd be working on getting a license to drive an eighteen wheeler. However I dodged that responsibility by making the BizMo (van sized or smaller) a troubleshooting reconnaissance unit, giving real truck drivers a lot of advance notice about this or that situation, meaning opportunities and unexpected benefits, not always dangers (surprises don't have to be nasty).\n\nMy training seems more oriented towards remote base testing of stationary tech, not rolling stock. That doesn't mean I'm not on the road, but that I'm more a customer user-base driver than a construction team freeway developer, say working China to Turkey (multiple routes). The yurts I'm studying, SolarPunk projects, are off road and perhaps only reachable by electric ATV, with solar charged batteries.\n\nHowever in this case I'm very close to Springfield, Oregon, which is happy to be where the Simpsons is happening (the cartoon), you can read about whether why. I'm in a destination trailer adjoining a pole barn, but a luxurious pole barn, a museum of C6XTY and other Flextegrity items (as is my place to some degree).\n\n[](https://www.flickr.com/photos/kirbyurner/53058058648/in/album-72177720307981496/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}