{
  "id": "423505559794081963",
  "title": "More GeekSpeak",
  "published": "2007-10-09T13:30:00.000-07:00",
  "updated": "2007-10-09T13:30:46.465-07:00",
  "content": "I just got off the cell with Alexia, meandering across campus, developing her skills as an accountant (she's following in her mom's footsteps in that regard).  But our conversation eventually turned to the bigger pattern, of companies needing robust databases and lots of front end eye candy.Banded report writers, like in [Access](http://en.wikipedia.org/wiki/Microsoft_access), [FoxPro](http://en.wikipedia.org/wiki/Visual_FoxPro), [Paradox](http://en.wikipedia.org/wiki/Visual_FoxPro) and others, plus these drag and drop query designers, help end users stay in a productive relationship with their core concerns.However, once a given database reaches a certain threshold maturity, in terms of numbers of users, its criticality to the enterprise, you generally want a more austere industrial scale engine.Traditionally, those'd be relational, meaning tabular (rows and columns, like a spreadsheet).  However, as Python's flagship [ZODB](http://en.wikipedia.org/wiki/Zope_Object_Database) makes obvious, your Model needn't go the relational route, like if networked object storage works better.  Many European companies are ahead of the curve in this respect, but then it's not either/or.OK, that's the \"lecturer's version\" of what I started babbling to Alexia about.  I've also cc-d her some recent emails to Phyllis Shelton, Dawn's principal bookkeeping collaborator in the last couple of years.Our DWA is still very much a small, nimble business, an \"[agile](http://en.wikipedia.org/wiki/Agile_software_development)\" as some say these days (which is what [Python](http://www.oreillynet.com/onlamp/blog/2003/04/python_is_an_agile_programming.html) is too).[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgL2ShLZ88LaxdkTcCRXtO49m3kP-QoXbL6PUBBwfWYAeix9YPUw_FOid1stHwzOiDZhLpEIJCUH2wa6ZswAylhWu9uFNgwOBp50LmcxSOkgIlVrSN6HARKM87d6nzJt2JqEJqA/s1600-h/business_license.png)Alexia also mentioned something she'd heard on the radio about using fullerene ([Fn](http://citeseer.ist.psu.edu/389735.html)) to boost [solar panel technology](http://www.technologynewsdaily.com/node/7469).  I mentioned my friend Ed's focus on [its chemical naming](http://www.4dsolutions.net/synergetica/eja1.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}