{
  "id": "747740487001196687",
  "title": "More Quaker History",
  "published": "2021-11-24T22:22:00.012-08:00",
  "updated": "2021-11-25T12:25:06.220-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/51677972563/in/dateposted-public/)\n\nI've been fussing around in /cryptography lately, as eliteschool/Crypto, the Jupyter Notebook, was not clear on the AKS primality test, what it is.  \n\nIt's still not entirely clear on that, but more because it talks about something else, relevant to primes and composites, that I take to be relevant to the proof of AKS also.\n\nBut really we're focused on Pascal's Triangle (PT), as always in our Gnu Math curriculum.\n\nThat PT property is one you likely know, if you've been following Numberphile and other \"keep us current\" mathological type channels.  Category Theory...  \n\nThat the row number of PT evenly divides the members (other than 1 of course) on that row, if an only if that number is prime.  Skipping 1 of course.  We talk about -1 elsewhere.\n\nLike row 3, 1 3 3 1 defines the prime 3, whereas 1 4 6 4 1 fails the test (row number 4 fails to divide 6 without remainder).  The Jupyter Notebook features a PT generator, written in Python, and this test as a sieve or filter.\n\nOK, that winds up my warmup. We were talking about /Crypto, where prime versus composite reigns supreme (as a distinction), so now lets segue to Elizebeth Friedman.\n\nShe fell in with Shakespeare early in her career, where she sharpened her code skills and met her future husband.  They and their sponsor climbed a steep learning curve ladder and ended up becoming like another Bletchley Park eventually.  Elizebeth faced her own enigmas.\n\nIn my Quakerish curriculum we're linking her to Prohibition and to the early Bucky who socialized with Al Capone.  That helps sync up the timelines for for these several protagonists we'll be following.\n\nThe tie-back to Shakespeare is convenient, given our Memory Palace focus (\"the urb it orbs\").  Globe Theater architecture was about the microcosm, as well as the play within the play.\n\nI notice Github decided to break Jupyter Notebooks linking back to their own repo as the default option.  The benefits of cloning and owning the repo locally, versus viewing it online, has just increased.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}