{
  "id": "6176185036370446934",
  "title": "More Dots Connecting",
  "published": "2015-07-30T23:30:00.000-07:00",
  "updated": "2015-07-31T18:01:16.531-07:00",
  "content": "Yes, I literally get my history from bars sometimes.\n\nI was at Mulligan's tonight, with Patrick.  The beautiful and uber-competent Diana was behind the bar (someone I know through Steve) and poured my Guinness.  \n\nPatrick was smoking outside, despite the 90F degree weather, and we were joined by a young woman, training to be a public interest lawyer, who wanted to share about the USS Indianapolis.\n\nI listened with fascination as she and Patrick compared notes.\n\nThis ship was somewhat in the black ops category on that particular mission, delivering components of the atomic bomb intended for detonation over Hiroshima.\n\nAugust Sixth is coming right up, and this morning at Bread and Ink I was yakking with mom about upcoming ceremonies.  We think of August Sixth as [Disarmament Day](http://controlroom.blogspot.com/2013/08/a-bomb-day.html).  That may seem parochial to some readers.\n\nComing back from its mission, said ship was torpedoed and sunk quickly.  You can read about the [worst shark attack in recorded history](http://www.smithsonianmag.com/history/the-worst-shark-attack-in-history-25715092/) on-line.\n\nI'd left my camera at Patrick's, where I'd visited for a company all-hands (video patch in to [Sebastopol](https://www.flickr.com/photos/kirbyurner/sets/72157637435877044)).  We went back for it from Mulligans, then hopped a bus to Lucky Lab.  Another co-worker, Paul, expectantly waiting for us, learned of our recent adventures and conversations over a pitcher of Super Dog IPA (one of my favorites, right up there with [Hawthorne Best Bitter](http://www.wweek.com/portland/article-23874-beer_review_hawthornes_best_bitter_%28lucky_labrador%29.html)).\n\nThursday is game night at Lucky Lab, meaning board games are in evidence everywhere.  As a World Game player, I'd cop to being into gaming (game playing).  We just didn't happen to have a board.\n\nEarlier I was outlining a role playing game in computer circles for mom, using the analogy of Pragmatic versus Evangelical Friends (Quakers) the latter being more into Theology as a discipline, which should stand for \"any orthodoxy\".\n\nWe also talked about Howard Zinn and Noam Chomsky.  Mom sees Noam is a good role model for a long haul activist, which she is too.  They're actually both 86.  Zinn lived a pretty long time too, 87 years.\n\nThe more orthodox computer scientists treasure the theoretical purity of Functional Programming languages, of which [the LISP family](http://controlroom.blogspot.com/2015/07/ramping-up.html) is a model.  When MIT switched to Python for pragmatic reasons, some theologians felt that as a betrayal and sell-out to the Object Oriented camp, where state is more mutable and the code arguably more pragmatic.\n\nSpeaking of mutable states, when we got to Lucky Lab, board games all around us, I said one way of telling history is that in [using an atom bomb](http://mybizmo.blogspot.com/2009/12/freeman-dyson-in-portland.html) over two cities, the US actually lost WW2.  Only losers use nukes.  The Nazis had wanted to be an [uber-power](http://worldgame.blogspot.com/2015/07/on-super-and-uber.html) (Third Reich).  Was a superpower all that different?  [Einstein](http://worldgame.blogspot.com/2010/07/einstein-omsi.html) later said had he anticipated what the monkey-brains would do with the new physics, he'd [have become a watchmaker](http://www.military-quotes.com/albert-einstein.htm).  The real USA [fights back](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html), is anti-nuke weapon, [same as Iran](http://controlroom.blogspot.com/2015/07/deficiencies-in-english-language.html).\n\nOf course that's not the accepted narrative, and I footnoted that my world view was influenced by what we might call a \"[post-nationalist memeplex](http://worldgame.blogspot.com/2015/07/overlays.html)\" citing Grunch of Giants (by a US Medal of Freedom winner), meaning I had an easier time with \"bent\" history (another form of science fiction).\n\nOur public interest lawyer in training, at Mulligan's, was not one of those \"motivated by money\" as many want ads say they want on Wall Street (still true?).  Financial analysts (aka \"quants\") can get religious too, about their craft.\n\nWe talked about age a lot with the young woman (Patrick and I are both in our fifties) and a [Louis C.K.](http://mybizmo.blogspot.com/2015/07/cooling-my-heels.html) segment on that.  Then our discussion veered off into cannibalism and the original true story behind Moby Dick.\n\n[](https://www.flickr.com/photos/kirbyurner/19990937819/in/dateposted-public/)\n\n:: patrick @ work / all-hands July 30 ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}