{
  "id": "115809674499232932",
  "title": "More on Project Earthala",
  "published": "2006-09-12T14:30:00.000-07:00",
  "updated": "2006-11-15T11:44:04.914-08:00",
  "content": "From earlier today, responding to some talk about what a disaster global warming might be, in real human terms:Re: [wwwanderers] Global warming: practical approachThis is where I usually start saying biting things about Economics as a discipline, proposing that General Systems Theory (GST) is less likely to feed a collapse, because more science-savvy in so many dimensions (ergo less prone to breakdown).But that'd be for a whole 'nuther thread.Anyway, I do think the ongoing high price of oil will help with my horse camps in the Arizona desert, where we do these permaculture domes and pretend we're these hippie Quakers, except with Internet and flatscreens, and biodiesel dirt bikes.Oh, and we talk about [Synergetics](http://www.rwgrayprojects.com/synergetics/synergetics.html) like it was the Bible or sumthin' sometimes quoting chapter and verse -- i.e we talk like [buckaneers](http://mybizmo.blogspot.com/2006/08/buckaneers.html) (even eat BBQ sometimes).Most people just visit as tourists. We're kinda [cliquey](http://www.answers.com/cliquey&r=67) sometimes.KirbyThere's a pun lurking here, in that such ecovillage communities might likewise occur in South Africa, home to various \"click languages\" such as [Xhosa](http://en.wikipedia.org/wiki/Xhosa).As for the Project Earthala reference, I've got lots of other posts and allusions:  [[1](http://controlroom.blogspot.com/2006/08/project-earthala.html)][[2](http://www.sculptors.com/%7Ehyprmail/domesteading/9812/0467.html)]... [[3](http://www.grunch.net/synergetics/bworks.html)] (some samples).Other recent Wanderers posts focus on Chaco Canyon, and how global warming might not have been a big crisis/calamity for the people living through it back in the 1100s.Tourist traffic tapered off and people went on to other businesses.Civilizations, especially highly developed ones, don't always panic and fail when the climate changes.  Some smoothly transform.I also look at the case of Holland, which has a lot at stake where sea levels are concerned.  I think we should fight alongside the Dutch, if their homeland is imperiled, in as smart a way as our global climate models will allow (and then some).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}