{
  "id": "7742186067092424853",
  "title": "More from Synergeo",
  "published": "2008-04-20T19:38:00.000-07:00",
  "updated": "2009-06-23T21:59:10.080-07:00",
  "content": "Note: I've always classified Synergetics as not-Euclidean and I think Bucky did too, insofar as one requires a taxonomy.I go back to dimension theorist Karl Menger's \"[geometry of lumps](http://worldgame.blogspot.com/2007/08/small-world.html)\" essay, as another way to do axioms that'd break the Euclidean mold -- the very path Bucky chose, in making spatiality a primitive starting place, and [four-directional](http://mybizmo.blogspot.com/2008/02/quaker-geometry.html) in the sense of the tetrahedron being its primitive topology (if it has shape, this'll be simplest, in terms of dividing space into two volumes of complementary aspect, concave and convex).But then of course it's so obvious: no infinite planes, and when you zoom back on anything locally flat or straight, it's seen to curve -- definitely a strong sense of horizon in this one, whereas [Euclideanism](http://worldgame.blogspot.com/2006/06/more-philosophy-talk.html) permits these infinite parallelisms (inspiring of XYZ more than [IVM](http://www.grunch.net/synergetics/ivm.html), which is only special-case tunable, not really \"there\" in any physical sense (same as XYZ, but they still want to claim infinity on their side, I say let 'em, no skin off our noses)).Mostly geometry is used to get stuff done, and it's still as useful as always in that regard. Whether one \"believes\" in infinite planes or \"dimensionless points\" is sort of beside the point.These \"infinite\" attributes may be regarded as \"don't need to specify\" settings e.g. we need to talk about a flat surface, as thin as you care to make it, as expansive as you care to make it (\"don't care, say infinity\"), and now here's a point (call it A), no limit on how small you want it to be (again, \"don't care, wouldn't matter\").Axioms and definitions were a good way to \"get on with the show\" but then scholastics tend to come along and cruft up the discussion with questions of allegiance and belief e.g. will you pledge to support the Euclidean Chair or whatever in some university -- means you need to recite certain mantras. By this time, we're a long way from just getting stuff done, have entered the fantasy life of [a cult](http://www.grunch.net/synergetics/hypercross.html), like the Pythagoreans, with their degrees of insider, innermost circle, all that claptrap.How to turn geometry from being a fun useful tool, into a dreary \"belief system\": that's a lot of the [western civ](http://www.grunch.net/synergetics/psych.html) story right there. [Synergetics](http://usnisa.org/synergetics/) is Bucky's attempt to power wash some of the cruft off this very workable machinery, dispel some cobwebs. Not easy to do, but refreshing anyway, to see some shiny metal still under there, not rusted away.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}