{
  "id": "7157692054792067032",
  "title": "More on Digital Math",
  "published": "2009-07-13T13:00:00.000-07:00",
  "updated": "2009-07-14T21:52:32.961-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjrModhJmX2gkp8t4d4p5Ry-n8hbY3JG7xFyT-ODP0oYwszK8D-i0zXDG_4Va5j7nyTYYzJzsorhC_v-MYdX2qXrv-lsOM5SopL6l-7ELPDaw72pDbCYkVBvP9HRAIWihKMHzb0/s1600-h/600px-Geocaching.svg.png) :: [re geocaching](http://en.wikipedia.org/wiki/Geocaching) ::My little [essay below](http://mybizmo.blogspot.com/2009/07/dm-hallmarks.html) leaves out the whole \"math is an outdoor sport\" business.  What will that mean in practice?  Math teachers [talk about \"drilling\"](http://mathforum.org/kb/message.jspa?messageID=6781408&tstart=0#reply-tree) and \"arrays\" but unless this is a military academy or [dance class](http://www.youtube.com/watch?v=hMnk7lh9M3o), that won't involve much physical movement, of anything but [hands and eyes](http://mathforum.org/kb/message.jspa?messageID=6783034&tstart=0).Leaving so much physical coordination work to \"PE teachers\" and then cutting the budget for PE, means we have [a Wall-e type population](http://worldgame.blogspot.com/2008/06/wall-e-movie-review.html) after just a couple generations.  Factory-style, industrial age, mass education proved devastating to the average physique.  With all this talk of energy transformations [in Supermarket Math](http://controlroom.blogspot.com/2009/06/cooking-show.html) (solar energy to biomass especially), goes a consistent walk (as in \"walking one's talk\").I've got my eye on that National Guard property across from [Dignity Village](http://worldgame.blogspot.com/2009/01/metropolitan-talk.html) as a possible staging area, though that's [not set in stone](http://controlroom.blogspot.com/2008/05/teacher-training.html).  Once students have geo-caching skills, we might provide some safe areas, set aside particular park areas for practice.  Don't imagine escorting 30 or more kids every time, the traditional \"yellow bus\" experience.  Girl scouts provide a better model.The Japanese Language Circle happening across the room is prototypical:  about 10-12 people, inter-generational, in a coffee shop.  Other students, not a part of this group, sit around using wifi.Given food and beverages are permitted here, hunger pangs needn't detract from concentration, a common enough problem in USA classrooms, where an oppressed and malnourished majority has few opportunities to retrain without loss of \"campus services\" (= too few sysadmins with real skills -- a vicious circle).Let's face it, if you haven't taken a fresh look at [spatial geometry and computer stuff](http://worldgame.blogspot.com/2009/07/more-buckaneer-talk.html) lately, you're likely not re-employable in cutting edge [LCD advertising](http://mybizmo.blogspot.com/2009/06/glitz-n-glamour.html).  You'll need [GIS skills](http://worldgame.blogspot.com/2009/04/gis-2009.html) for government work.Given [the analog math track](http://mathforum.org/kb/message.jspa?messageID=6776228&tstart=0) barely supports any of this stuff, most colleges have become institutions for remedial learning, are still way behind on \"the bucky stuff\" (and Linus Pauling) even after all these years, resulting in a reverse brain drain of sorts, as students vote with their feet.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjpmHIfTmZN65X8C2Ko7ARncNDOoo9elNpT58FZNFBeN7pSoOgfCSpvFN5PRanHoNcyQsPmOFQquvZGxIXDi_zEz6Vu1uuCX7eLPP772CduVcRKZBYWhFIXABOiEsm-5AijuKfn/s1600-h/Sagecaslogo.png):: [re sage](http://en.wikipedia.org/wiki/Sage_%28mathematics_software%29) ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}