{
  "id": "6637696415266908805",
  "title": "More Musings About Television",
  "published": "2010-02-02T13:22:00.000-08:00",
  "updated": "2010-02-04T21:19:14.336-08:00",
  "content": "My best advice as a consultant has been to phase in some futuristic aesthetics through commercial advertising.  [I grew up watching Carosello in Italy](http://worldgame.blogspot.com/2009/04/reflections-memories-dreams.html) and came to appreciate the genre, of television advertising, as an art form.  When my friend Mahlon came over, one of our favorite activities was to make audio commercials by recording them to cassette tape.The visual vocabulary of the more 60-degree based synergetic geometry is well enough defined to generate any number of short scenarios, any of which might provide context, a backdrop, for placing some product or service.  Our computers get more of a workout doing these kinds of clips, and we get more experience fine tuning our message.The other suggestion has centered around reality television, not as a game of elimination, like Survivor, but as unfolding documentaries.  The Kennedy brothers [had the right idea](http://coffeeshopsnet.blogspot.com/2009/12/study-hall.html) when permitting ABC TV to videotape their handling of unfolding events in Alabama.  Governor Wallace was likewise accessible, giving valuable data for later analysis.Am I just describing TV news shows then?  Not exactly, as I'm imagining a dedicated crew that not only follows the action, but participates in direction, in decision-making.To take an example:  through local community access sources, one may obtain training and access to equipment, for not a huge amount of money.  Glenn and I signed up for last month's orientation but it was canceled.Portland's matrix of innovative art colonies and musicians, its [network of coffee shops](http://coffeeshopsnet.blogspot.com/2009/03/serving-buzz.html), frequented by various radical thinkers, might provide an interesting backdrop, as each episode followed the doings of some group or character.  Musical interludes might be interspersed.  In terms of \"underground cable\" this would be in line with what's already on the air.My concern though is that Portland is not sufficiently interesting to say Japanese audiences, other demographics who might really groove on the messages, both commercial and otherwise.  In fact, community television doesn't accept real commercials, so all these product placement ads would have to be faux, and that seems a waste of energy and resources.Better to have some real products and services, real companies putting their brands on the line.We could go out through Internet channels instead of community broadcasting (its not either/or).  Portland might be part of the mix, but only if the Japanese producers want to commit the resources, because they know best what would work with their target demographic.[Why Japan](http://coffeeshopsnet.blogspot.com/2009/02/outreach-to-japan.html)?  Japan is one example of a Pacific Rim economy.  The synergetic geometry I'm describing has had some [serious Japanese students](http://synergetics.jp/index.html), at least one of whom I've had the good fortune to meet, in both LA and DC.  I'm also wondering if the Coffee Shops Network concept might gain a following in a culture already so vested in Pachinko  (パチンコ), video arcades.Getting [lots of LCDs](http://coffeeshopsnet.blogspot.com/2009/05/more-about-lcds.html) illumined with colorful polyhedra, spinning, unfolding, refolding, exploding into modules, reforming, all with an isotropic vector matrix for context, seems like the kind of project a Japanese animation house might eagerly take on, especially with paying customers wanting to advance their brands with these aesthetics.My not-for-profit Portland Knowledge Lab model was about building up a vast library of mathcasts, shared assets, some of which might derive as spin-offs from these commercial activities.  Local area companies would co-sponsor and share resources.  Local schools might be among the most avid consumers of these collective resources.A lot of great video gets left on the cutting room floor (figuratively speaking) when the final commercial is less than a minute long.  Spreading more of the futuristic aesthetic on an open source basis, with low to no cost barriers to entry, is another way of jump starting or bootstrapping the market for civilian high technology we're hoping to sustain.No one is suggesting that XYZ 90-degree coordination is under attack and must soon surrender to some invisible army of \"[tetrahedralists](http://worldgame.blogspot.com/2010/02/reviewing-news.html)\".  Synergetic geometry might remain esoteric even while informing our imaginations -- more than our more conservative textbooks for awhile.Forays into alternative and/or radical non-Euclidean thinking is not everyone's cup of tea, nor need it become so.On the other hand, investors look for signs of conscious awareness in company management, and potential profit centers signaling their willingness to run with the ball, to serve as torch bearers, will likely have some marketing edge, both B2B and B2C.Yes, the flavor is admittedly somewhat counter-cultural, but since when did a culture advance without encouraging its own artists, writers, musicians, animators?  Avatar is now the top-grossing movie of all time, not just because of the special effects, but because it speaks to our situation.In sum:Let's serialize some reality based TV, complete with signature commercials, product placements, perhaps buffering the clips in partially public databases (e.g. Youtube, BlipTV).If we're using Portland as a backdrop, then let's branch out to follow the work of NGOs such as Mercy Corps... Northwest Medical Teams.  Observe local attempts to deal with homelessness and a depressed economy.Regardless of Portland's role, we need to galvanize the show with positive futurism and a spirit of multi-disciplinary collaboration.Regarding Portland in particular, it makes sense to focus on open source and making educational resources freely available.Invite various talking heads to provide an intellectual framework.Invite various kinds of audience participation.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}