{
  "id": "775916739700594432",
  "title": "More Science Fiction",
  "published": "2020-03-12T14:28:00.004-07:00",
  "updated": "2020-03-13T11:31:20.823-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/49652382418/in/dateposted-public/)\n\ncalculator of tomorrow: government issue\n\nWhen I try to imagine civilian socialism, versus the corporate military socialism we have now, I think of government issue smartphones and laptops to any students who don't have them. Use them from home. Other GI swag includes backpack and water bottle, first aid kits. Be prepared.\n\nFree education will show you how to use both, fight off malware and spyware. \n\nThe laptop comes with lots of great free open source stuff like the [DARPA supported](https://www.computerworld.com/article/2494665/python-gets-a-big-data-boost-from-darpa.html) Anaconda. You won't need a calculator now that you have [one of these](https://www.anaconda.com/distribution/). Calculators aren't forbidden of course, slide rules either (learn about logs).\n\nThe GI smartphones come with the apps you need to navigate government bureaucracies.\n\nSocialist bars charge only $3 a pint with no tips expected.\n\nAsylum cities, waystations for refugees, dot the globe, thanks to world organization.\n\nDo we still have a private sector? Of course. Mom and pop businesses, private banks, airlines, restaurant chains. We're less of a ghetto though, thanks to a lot of the smartest most compassionate people wanting to work in government.\n\nImagine a school that actually sets aside time to share about specific smartphone apps. The school's crypto-currency, good inside school, used by alumni too, works thanks to specific apps.\n\nVarious games (language games) pay out, in credits good against several catalogs.  Academic work has its immediate rewards, perhaps in the form of more time on the internet, slacking, exploring, checking out stuff.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}