{
  "id": "115923715019615557",
  "title": "More About Santa Claus",
  "published": "2006-09-25T19:39:00.000-07:00",
  "updated": "2006-11-15T11:44:05.688-08:00",
  "content": "He's been coming up a lot lately, [Santa has](http://www.grunch.net/synergetics/aphiloview2.html).One of our Wanderers isn't welcome in his daughter's home, or something like that, because he tries to disabuse his grandkids of any Santa Claus nonsense. He has that wound up with religion, and how \"all twelve\" (?) can't be simultaneously true.Today at the Bagdad, Trevor was talking about this artist who planted live crabs with Barbie Doll ™ parts strapped on, in a place where kids lined up and asked for stuff from Santa. The point was to subvert the department store's moneymaking, \"asking Santa\" being management's clever gimmick for getting customers in the right mood for shopping.This was considered a disruptive maneuver, even for an artist, but one bystander said \"I'm glad someone is finally doing this.\"I think it's the spectacle of luring we don't like (ensnaring, baiting and switching). But the truth about Santa Claus isn't supposed to be disappointing, even when we deliver the punch line, that mom and dad love you, as do your friends and relations, and they express their love through this multi-faceted story, which says more about their love than mere physical things under a dead or dying tree could really get across.[Telling stories](http://mybizmo.blogspot.com/2005/02/more-wanderings.html) is not in and of itself criminal, but the life blood of a culture. This is why we hate seeing children lied to, by this target of Fuller's Obnoxico meme.Like, I understand this guy's integrity, about Santa not being real and all that. But the rejoinder is \"reality isn't the whole story around here, and never has been.\"So what's so \"anti-science\" about this attitude? Science is for compentently managing the reality part, and we take that very seriously, don't believe in being stupid about it.We want awake and alert scientists, want to be them ourselves, doing intelligent (and we hope mostly safe) experiments that teach us important and valuable lessons.  Endlessly repeating the same mistakes is not what we signed up for.So let there be no doubt where I'm coming from at least: I think empiricism is a valuable ism.It doesn't follow that religion needs to get in the way of this pro-sciences agenda. On the contrary, many a religion is augmented with a set of sciences and vice versa.Our mythical awareness doesn't have to go to war with the literal truth if it doesn't want to, i.e. the operator in U = Meta*Physical (a Fuller School teaching) is meant to be both/and inclusive, not the sign of an internal contradiction.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}