{
  "id": "2867949247471650995",
  "title": "More Geek Anthropology",
  "published": "2013-03-16T14:58:00.001-07:00",
  "updated": "2013-04-23T11:19:05.080-07:00",
  "content": "We have a PhD student in the social sciences sharing some perspectives.  [Jackie Kazil](http://www.meetup.com/dc-pyladies/members/10391503/) runs WDC PyLadies with Katie Cunningham. \n\nShe looks at roles, systems of governance, workflow, ways of addressing public issues. Distributed governance. \n\nTribe, Chiefdom, State, Empire... an \"ordinal typology of political systems\".  So far, I'm not impressed with [these list maker](http://controlroom.blogspot.com/2010/10/wanderers-20101020.html) social scientists.  What happened to [Companies](https://us.pycon.org/2013/sponsors/) (are they chiefdoms)?  Crews (ala pirate crews)?\n\nShe thinks we're a State more than a Tribe.  Sure, I'd go with Nation too (already a lightning talk topic).  The PSF logo would be our flag (no special currency though). She doesn't know about Holden's \"Mighty Python Empire\" apparently.\n\nOur lunch table featured Pythonistas from Oregon (Eric and I), Brazil (Henrique), Italy, England... we talked about meat eating habits, Brazilian especially.  All you can eat Brazilian restaurants.  The guy from England hosts [meat.io](http://meat.io/) and lives in a Portuguese-speaking neighborhood in London.  Lots of meat lovers.  Nicolas Cage jokes were also [a topic](http://filmdrunk.uproxx.com/2009/03/breaking-news-nic-cages-hair-is-like-a-bird), and [animated GIFs ala Tumblr](http://tygerblog.tumblr.com/post/42681662398/black-and-orange).\n\nI went around collecting T-shirts and chatting with cute booth folks (many genders) at Hulu, Plone Foundation, Spotify etc. (this was before lunch).  Good catching up with Andy McKay.  He's with Mozilla now, supporting the App Store for the new Firefox phone (an HTML5 platform, its own OS).\n\nYes, I gave [my lightning talk](http://controlroom.blogspot.com/2013/03/pycon-2013.html) in the huge plenary room.  Not all the thousands were there yet, but the audience was substantial.  [I got some good laughs](http://pyvideo.org/video/1854/saturday-morning-lightning-talks-0#t=9m15s).\n\nThe genome analyzer people were here again, [Counsyl](https://www.counsyl.com/).  They must use a lot of Python.  Their operations is very automated, with FedExed blood samples coming in.  You need a doctor's perscription for this test as the results are medically actionable i.e. you may need to make some decisions.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}