{
  "id": "1113788883885541445",
  "title": "More Bizmotica",
  "published": "2011-04-24T09:17:00.000-07:00",
  "updated": "2011-05-02T22:41:35.100-07:00",
  "content": "A BizMo, some may remember, is a \"business mobile\", and that has various connotations, one of which is you're making some kind of positive contribution to an economy in that \"not yet retired\" sense.  \"Still performing a service\" -- that's the connotation of \"in business\" or \"working\" today, though \"going to school\" is acknowledged as a kind of work, hence work / study (i.e. the \"GU scenario\" -- GU = \"global university\").Wanderer NA and I checked out Movie Madness (she'd never been there) where I exchanged Fantastic Planet (animation) and Hitler's Last 10 Days (Alec Guinness), for another of Alec's, Horses Mouth.  You might call these homework assignments.  Right next to MM is a BizMo Food Court, with each bizmo a restaurant, with shared outdoor seating.  Willamette Week just did a cover story on these businesses, which are not really a new idea, and which have sprung up all over town, in food courts everywhere.  NA and I both had the chicken horseradish sandwich at EuroTrash.Food caravan bizmos come in various shapes and sizes, many still on the drawing board.  Were we to serve the schools with these festivals on wheels, we could add [the planetarium truck](http://controlroom.blogspot.com/2008/08/escaping-light-pollution.html) and some of the other education mobiles (lots of STEM and/or STEAM), tipping the scales in favor of study.  The military recruiters would want to join our circus, along with various gangland front ends, as humans tend to polarize into warring bands in some regions, which pass on their traditions.  We could have a traveling anthropology bus with some exhibits about that, as if it were news to anyone.Rather than emphasize the competitive aspect so much, I tend to think of bizmos in fleets, with control room dispatchers responding to request maps.  You tend to go where you're wanted and invited.  Like I felt welcomed in those venues last night, as another guest of a family.  I hadn't expected to find James.  [The Earth Day festival](http://controlroom.blogspot.com/2011/04/earthy-day.html) had its food booth aspects as well, and a carnival atmosphere.  The fair and circus come into play as motifs anytime you caravan these things, which conjures gypsies.  There's the romance of the road, the idea of sometimes sharing a journey.  However it's not like I'm inventing this life style in science fiction:  we already have the RVs and their RV parks.  Dave Ulmer has been tooling around with his version.  NA is on his mailing list and has been getting those pictures.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}