{
  "id": "4492451047028108087",
  "title": "More Adventures",
  "published": "2016-05-11T00:33:00.000-07:00",
  "updated": "2016-05-11T06:40:38.994-07:00",
  "content": "[I've continued bouncing around](http://mybizmo.blogspot.com/2016/05/recent-reading.html) in Adventures of Ideas.  Yes, Whitehead does mention the Quakers, in a tip of the hat sort of way, in the context of finding no improvements in Protestant flavored  Christianity over what came in the first four hundred years.  After that: variations on a theme.\n\nComing from Whitehead, suggesting all the pieces were in place that early is not a put down, but rather he's recognizing the mark of something enduring, with lots of inertia.\n\nThe book's namespace is somewhat unfamiliar, however his use cases mount up quickly and pretty soon we know what he means by a \"society\", which could be a society of cells, even those of a tree.\n\nHaving person-hood is one more attribute of only some societies, in Whitehead's namespace.  Then he uses \"occasions\" to mean what we might also call \"events\".\n\nNot unlike Heidegger, he dwells a lot on our relationship to something called \"the future\", vis-a-vis what we might call the \"unchanging past\".\n\nClearly occasions are invitations / openings wherein to help shape what's coming into being, within the constraints of an economy or ecosystem.\n\nWe bring the future to ourselves through our own agency to some degree, from whence comes our notion of freedom, bounded by what might be called our confinement, possibly pictured as some crystalline network of rules.\n\nThese rules \"control\" (govern) what occasions might occur, versus other events that might only be imagined.\n\nIf we consider these rules \"exceptionless\" then perhaps we could say their \"inertia\" is very great (without upper limit?).\n\nWe're underlining the \"gravitas of gravity\" in reminding ourselves of how exceptionlessly it applies.  The term \"gravity\" as used here is more as a proxy for \"all that holds sway\".\n\nOur freedom presses outward against this network of constraints.\n\nThese are more my thoughts, as inspired by reading Adventures of Ideas, than an attempt at a close paraphrase.\n\n\"Society\" and \"occasion\" were two of his words I got to thinking about, as we vectored back to PDX from STL on that commercial Alaska Airlines flight, operated by Skywest.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}