{
  "id": "1799021697857675995",
  "title": "More Place Based Sharing",
  "published": "2019-08-13T13:24:00.003-07:00",
  "updated": "2019-08-13T13:24:20.320-07:00",
  "content": "Does your place-based curriculum include sharing curated stories and exhibits with strangers who wish to orient themselves to your locale?  In recent videos, we've been exploring Hawthorne Boulevard between SE 39th and 50th.  In the humble episode above, we jump south to the next major thoroughfare:  SE Division.\n\nSome communities have hosted museums about their own roots for a long time, having enjoyed an endless stream of tourists, assuming \"enjoyed\" is the word.  Others have no such experience and upon facing the challenge, are not sure where to begin.  Where is our common history archived?  With the newspapers?  With City Hall?\n\nSometimes the visitors (so-called tourists) are invaders, planning to deprive the locals of continued access to life support in their region, in which case momentos of the indigenous culture may be on the list of things to destroy.\n\nHistory is a source of case studies.  I learned a lot from seeing life unfold in the Philippines.\n\nThe Oregon Curriculum Network doesn't have a budget for something like the Birmingham Civil Rights museum, an excellent example of a place based set of exhibits. \n\nHowever I'm more just into demonstrating the concept.  We have lots of local schools, each capable of hosting media in the process of sharing a place-based curriculum with the students.\n\nAs a local tourist, when you land in a new place, you might consider several institutions as sources of history.  They may actually have an agency geared precisely to the needs of tourists. \n\nHowever, to the extent that \"place based curricula\" catch on, one might expect the local schools to become sources of reference materials, in conjunction with libraries. \n\nA lot of these materials are online.  However physical galleries with exhibits may likewise be in the picture.  Check local listings.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}