{
  "id": "115370746081093444",
  "title": "More Brainstorming about EcoVillages",
  "published": "2006-07-23T19:23:00.000-07:00",
  "updated": "2007-10-25T19:31:13.527-07:00",
  "content": "Friend Wayne swung by today, using his special rig to on and offload his motorized wheelchair, himself in it, having shifted to and from a rotatable driver's seat in his van.  He had no trouble navigating our lengthy driveway (somewhat steep), and we sat on the back patio, which I'd doused with H20 (we're enduring a heat wave).Our home interior is not accessible to Wayne, at least not without splitting him from his chair and carrying him -- a process involving heavy lifting our household is not trained in doing.Wayne, in late middle age, long stricken with [muscular dystrophy](http://www.kidshealth.org/kid/health_problems/bone/muscular_dystrophy.html), a ham radio operator and geek, dreams of communities with floorplans he could thrive in.  That means room for hobbies, as well as wheel chairs.A big mistake they make with older people is making them leave behind their hobbies and skills, often a principal means of communication with an outside world (including a community of fellow hobbiests).  Wayne wants to keep operating his ham.I told Wayne I too day dreamed of prototype communities, each an experiment in different dimensions. Like some might be exploring extremes in weather conditions, while others were more known for their internal dynamics (outwardly: nothing special).We wouldn't guarantee ADA compliance to Wayne's level in all of the villages, but that'd be a dimension to go in with a goodly number of them, certainly.  Enter your search criteria, and see what comes up.  Zoom in for more details (and remember:  not every village is even open to visitors, at least not in all seasons).My advice to Wayne was to keep focusing on television, as a place to expect such prototyping to converge with reality TV. Speaking purely selfishly:  I'd like to be able to watch Wayne's progress, during times when he wasn't right there in front of me, like today. At least he's thinking of [starting a blog](http://www.bloglines.com/blog/Graceful-Not) (a practice I encourage among Friends, given our tradition of keeping journals).I told him about our pilot in CUE's heyday, directed by Melinda, which imparted TV-making skills to retired citizens, plus gave 'em a time slot on cable to share their handiwork.  My work at AFSC similarly coincided with a big push into television, this time with UV/LAAP youth in the control booth.I also suggested that some of his flexible floor plan ideas might have obvious application in the downtown skyscrapers, on those floors that scrap the cubes in favor of the lived-in work-studio dorm room approach, with shared facilities (recording studio, editing rooms, computer labs -- and of course cafeterias).Whereas the billions we spend on military projects have to be kept secret (or even top secret), by definition, civilian projects like Wayne's are amenable to a more open source treatment.Of course between the bright light of day and high def celebs, and the shades-drawn world of black budget secrets, lies a twilight zone of stuff we're still working on, and don't really want to be too public about yet.This is what niche market TV is good for, like underground comix.  We're not looking for big blockbuster sensations or American Idols, just real people with passion, movers and shakers like Wayne, ready to dive head first into interesting programming.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjrK22zE9EEdbTmldzWHhxAlqqBaLEqeOA7mZViZAvVVcA2ISWtID9FgriudER3dhOKeFC6aY-pnuf-B7DkSlVXnWtHE2hcZrPWs63auPAvhCc5nzZV0v78P7rJizo5_fjnbl97/s1600-h/wayne2.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}