{
  "id": "4343656972445196807",
  "title": "More Lobbying",
  "published": "2009-07-24T21:10:00.001-07:00",
  "updated": "2009-07-24T23:41:47.750-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/3751322190/):: usb building ::I ended up spending a wonderful afternoon with a retired government employee, also an old friend, from a political family from Montana, from whence Tara recently returned, soon to be on to a next adventure.I was field testing some of my lobbying lines (so on the clock), such as \"all public schools are charter schools\" (in the sense of \"having a charter\"), another way to break down this perception that just because you're newer and different, you're an alien interloper.Well yes, that you may be, but you have a right to a place in the sun nevertheless.  [This land is your land](http://mybizmo.blogspot.com/2008/09/nation-of-writers.html).  People under 40 have a right to start their own public schools, learning from [boomer mistakes](http://controlroom.blogspot.com/2009/03/pps-to-kill-lep-high.html), imagine that.We went to Jakes for the happy hour, had [real crawfish](http://www.flickr.com/photos/17157315@N00/3753687267/), exotic to both of us.I was being the \"ebullient vacuum cleaner salesman\", one of my characters, and yukking it up about [Ali G](http://controlroom.blogspot.com/2007/05/incompleteness.html).  This was more than a coincidence as I first found out about [Ali G.](http://mybizmo.blogspot.com/2009/01/dark-side-of-sun.html) at Jakes, [thanks to Wardwells](http://worldgame.blogspot.com/2005/12/charter-school-approved.html).If there's an opportunity to brag about knowing [Nirel](http://mybizmo.blogspot.com/2005/08/web-wrangler.html) and her family, I'm known to take it, plus Borat was my first MySpace friend (after that first default guy everybody gets).My next move was to discover at Living Room Theaters that U2 in 3D was not the Pixar 3D movie Up (duh).  I'd gotten those two confused somehow and maybe they canceled out, as I ended up back in my control room, hacking on stuff (my usual pass time).I loved having some fun in the sun though.I love bragging about my friends, which maybe gets me in hot water with girl friends especially, as I'll brag to them about each other, but not because we're in some kind of playoff or love tournament (that'd be too stupid, we're a team).My girl and boy friends (XXs and XYs) are all winners in my book, even if I'm not around to brag about 'em.  And don't get me started on my relatives, such characters!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}