{
  "id": "113683044628001853",
  "title": "Morning in America",
  "published": "2006-01-09T10:41:00.000-08:00",
  "updated": "2006-11-15T11:43:49.333-08:00",
  "content": "Derek and I sauntered up to the local bakery this morning (I had a muffin and more coffee). One of the regulars was showing off yoga poses he'd learned (crow, eagle, tree, etc.), to the possible amusement of passers-by (big windows).  I could do none of them, but felt inspired to do more aerobics.I'm envious of these elite few who enjoy affordable health care, careful monitoring and so on.  Our family physician, Dr. Lauren Roberts, is one of the best ever IMO (she saved my wife's life, plus helped deliver our baby), but she sees like 28 people a day.  Family practice MDs tend to be overworked, plus they don't see even half the people needing medical attention.Aside from [geography](http://controlroom.blogspot.com/2006/01/middle-school-geography.html), I'd say [biomed](http://mail.geneseo.edu/pipermail/math-thinking-l/2006-January/000949.html) is [the](http://worldgame.blogspot.com/2005/01/beyond-gene.html) professional walk of life to be in these days.  It has everything:  computer science, chemistry, physics, psychology, spiritual depth, opportunities for travel... A well-rounded biomed person has to-die-for job prospects.  And I'm including a lot of eastern stuff, like those mom and pop martial arts storefronts, which teach kids self-discipline and self-defense.I'm heartened to see the cop and lawyer shows making room for more doctor shows in the fantasy genre ([ER](http://www.imdb.com/title/tt0108757/), [House, M.D.](http://www.imdb.com/title/tt0412142/) and such).  Both cops and lawyers need medical science to do their jobs properly (DNA testing, [CSI](http://www.imdb.com/title/tt0247082/)-style forensics and so on).If we could find a way to combine doctor shows with a kind of high tech Peace Corps operation (with toys as fun as the military's), and make it [reality TV](http://worldgame.blogspot.com/2006/01/location-scouting.html) instead of just fantasy, I bet we'd get some high ratings.Grunch would have lots of opportunities for product placement, which is even better than commercials in some contexts, when it comes to inspiring [brand loyalty](http://worldgame.blogspot.com/2005/10/market-research.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}