{
  "id": "5919212682157929799",
  "title": "Mortgage Mess",
  "published": "2008-03-09T12:01:00.000-07:00",
  "updated": "2008-03-09T13:09:09.808-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjmk3yiET1R_Msts2a1CylzgUPFtRDWwgRRyChyphenhyphen8ub5OTf3QhUMCQLnXde30M9oeYk8AS6MBBcLhtwtv1sr-8f_KmSPez6H4ezCLxDVUdqK8OgLV97cnDLPhnJBXfB2OG544gEk/s1600-h/noguchi.jpg)Omitted from most journalistic accounts of the mortgage meltdown, is the fact that some well off North Americans no longer dream of McMansions, but have their hearts set on something from the pages of [Ecotrust](http://mybizmo.blogspot.com/2006/01/more-fragments.html), a very high tech fishing village, complete with broadband and real fishing.So yes, post Depression Era bulwarks against conflicts of interest, enormous temptations to cheat, were gradually eroded away, like dikes in New Orleans, leaving USAers with few protections against predators (Congress was in on the deal).  That's certainly part of it, and we've had no shortage of accounts taking this line.But since the 1930s and before, this culture has nursed utopian visions in which we get off the grid, or at least have more freedom.  [Mobile home](http://worldgame.blogspot.com/2007/01/cracker-dog.html) and [RV](http://controlroom.blogspot.com/2005/12/we-win.html) subcultures, plus the usual yachting crowd, have prototyped the lifestyle.  What's missing is much investment by aerospace companies, the ongoing status quo so long as [cruise missiles](http://worldgame.blogspot.com/2007/09/wanderers-2007918.html) appear the safer bet, [Airstream](http://mybizmo.blogspot.com/2005/07/jetblues-bizmo.html) an exception.So another part of the story is simply not wanting to admit failure.  The Vietnam generation wasted helicopters on military instead of civilian enterprising, and now we're all paying, with [squalid living standards](http://worldgame.blogspot.com/2006/07/repositioning-think-tanks.html), stuck with housing designs from the dark ages.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}