{
  "id": "5748140403026933154",
  "title": "Mr. Lonely (movie review)",
  "published": "2013-06-16T19:43:00.001-07:00",
  "updated": "2013-06-16T19:59:24.720-07:00",
  "content": "Per the \"Making Of\" movie in Special Features, on this DVD edition, [Harmony](http://mybizmo.blogspot.com/2013/05/gummo-movie-review.html) had wanted to make a film about communal living, but then also had this Mexican Michael Jackson impersonator kicking around in his head.  How could these fit together?\n\nThe Marilyn Monroe \"from the dead\" scene well captures the projection, of a girl idol whom in real life also died (suicide unless you're [a conspiracy theorist](http://mybizmo.blogspot.com/2006/08/blaming-castro.html)).  Her impersonator is true to the role, with Charlie Chaplin too jealous and brutish.  Michael was more kind and shy, and likewise projected upon.\n\nI noted how hammers were used and included that in [a subsequent post](http://groups.yahoo.com/group/WittrsEX/message/5049) to Sean's Wittgenstein list.\n\nI confess I dozed off during the sheep slaughter, whereas the slaughter of innocents (innocence) is somehow a theme.  I'd had a long day.  Some [great tree bark](http://www.flickr.com/photos/kirbyurner/9062180354/) in the park (communing with nature).\n\nThe impersonators congregate on this commune and stage a show.  The innocent sheep are a subplot that connect us to another subplot someplace else in the world where the Werner Herzog character is hoping to meet up with the Pope, thanks to a miracle.\n\nThat a Marilyn impersonator would stop a guy from using a fake rubber hammer to pound his own head is a gesture towards the masquerade carnival, the world of unreal identities.  There's a high level of faux (farce), a lightness of being.\n\nWhen an unreal identity encases a real one, might it take over?  Wrapping oneself in the mantle of a ready-made persona, that's what actors and actresses do, isn't it?  They play at playing themselves playing others.  Michael's agent is skeptical he'll ever be \"real\" (like casting one's sights too high).\n\nThe \"commune living\" scenario was very [R.D. Laing](http://www.youtube.com/watch?v=U8-UT3-0_Ms).\n\nWe each bring our own baggage, hopefully not too much of it.  Create something with the people there if you can.  It sometimes works.  That [Greatful Dead clan](http://mybizmo.blogspot.com/2012/10/remembering-dead.html) had a good ride.  Tribal villages may be hauntingly surreal and worth haunting if you have the chance.  Go in character.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}