{
  "id": "7289528366633788051",
  "title": "Museum Floors",
  "published": "2023-09-14T10:27:00.004-07:00",
  "updated": "2023-09-14T10:30:11.663-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgaDt-Q4iryf_VVMHuwaauwKZj6AthzT1KSlH2La5cNrWUJnUfSDjnzjBrQVNrAdC4Y4WbPC0MZuBN_fgl7m34-026SAYUKS0zlpPTWJTvp9dJ363VT7sYBluSOkfSzWtu55XE49ixEkQ0DILw0cKCSitx8NnLsrgmCu_GSvY_1qXLBnzEqshvb/s5258/switchboard_operators.jpeg)\nI'm back to my mixed use architectures, cruise ships a model, where living quarters need not be redundantly outfitted with kitchens in every unit. Kitchenettes maybe, like in some hotels, but the norm is to seek sustenance outside one's dorm and study space. This building is more like living on board a ship or even submarine, perhaps because it's literally floating or underwater, though neither aquatic environment need be presumed. An ordinary cityscape will do for context.\n\nThe Museum Floors contain exhibits, and one may find borrow and return opportunities, like tool libraries, where these tools might be vintage. A number of 386 PCs might be kept in working order, and people come through for some training on WordPerfect, and Lotus 1-2-3, just to experience an office environment their grandparents might have known. Watch some old black and white TV in other spaces, with vintage programming, perhaps assigned. I'm thinking of the Birmingham Civil Rights museum at the moment.\n\nPart of the point is to pass on the disciplines of curation, and also representation, as when building dioramas. I recall how the Henry Ford Museum contained a recreation of a teenager's room from like the 1970s. This was archeology already. Museum goers would marvel at the differences, but also the similarities.  Let's look at a model nerd cave from the early 2000s next.\n\nIt sounds like I'm only intending to feature the recent past, the memories of people living in the building. True, I'm thinking recent history is the easiest to curate, and then, depending on what subjects people study in this building, more special case exhibits might develop, about specific time periods and places, perhaps far away geographically, and a basis for student exchange.  For example if your Colorado campus studies Sumurai Era Japan, then you would expect to find a collection of tools, wearables, weapons, dioramas and re-enactment ceremonies (the Society for Creative Anachronism comes to mind).\n\nThese floors certainly don't have to be basement level, however it's sometimes fun to imagine them as such, as the past metaphorically provides a basis and support system upon which to build going forward. Our collective memory is our heritage, which is something we extend, adapting, and adopting, as we go.\n\nA lot of museum going may be accomplished virtually, no question. However there's much to be said for keeping some working versions of old appliances, even old telephones.  We need to be able to study their internals, for example, in order to better grasp the analogous technologies of our day.  What was telephony like in the days of switchboards?  Let's see what switchboards were like in the old days, not forgetting how a lot of these roles went to women.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}