{
  "id": "6300380252705530305",
  "title": "Music Scene",
  "published": "2009-06-20T18:01:00.000-07:00",
  "updated": "2010-12-05T21:42:29.909-08:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/3642641171/)Not being a veteran of the Portland music scene, I write more as the [on duty chauffeur](http://mybizmo.blogspot.com/2009/03/chauffeur-duty.html), restricting my intake to the one bottle of Sierra Nevada in this [BYOB music bar](http://mybizmo.blogspot.com/2009/05/lost-in-oregon.html) on Belmont named Duke's, with Duke being a friendly large canine, a kind of FOSS boss (\"free\" as in \"liberal\").The performers were mostly XXs this evening, with XYs on guitars and drums for the third set, a peppy punk band anchored by a \"serious girl\" in leotards -- and I say that [with respect](http://allaboutmadonna.com/madonna-interviews-articles/the-face-january-1985) (this is clearly a professional operation, even I could see that).This was where dancers from the audience started \"moshing\", which means crashing into one another in a controlled way, a style which takes practice if you don't want bodily injuries.  Our groupies, though XXL in some cases, were kind to one another and no one got hurt.Gem, star of the second set, sang soulful guitar songs, a mix of hers and well-known favorites, [including Mad World](http://mybizmo.blogspot.com/2008/06/summer-retreat-2008.html), a song Tara and I consider one of the more melancholy.  [Also Halleluja](http://www.youtube.com/watch?v=a6PQFOCGYdI), which took me back to [my young Friends](http://www.flickr.com/photos/17157315@N00/3161813600/in/set-72157612025462473/) in Camp Myrtlewood (land for sale in that area, [XRL anyone](http://mybizmo.blogspot.com/2008/01/xrl-in-switzerland.html)?  Joe is our banker).Indie Anna Joan, first set, has excellent stage presence mixed with plenty of raw youthful energy of the kind people turn out for.  Her lyrics are \"naughty\" by folk music standards, but those aren't the standards.  This is Portland, not the Deep South.  \"Everyone is stupid!\" was one refrain this audience could relate to (a guitar decal later:  \"America eats its young\" -- [a Funkadelic allusion](http://en.wikipedia.org/wiki/America_Eats_Its_Young)).On the other hand, she brought a West Virginia folksiness and friendliness to her gig that set the house at ease.  She set Duke's chew toy, [a buckyball](http://mybizmo.blogspot.com/2006/10/hexa-wuh.html), on her Yamaha and started bantering with me when I finally arrived, cursing me out (in a friendly tone) for missing her R2D2 song, which I was indeed sorry to miss.I'd been geeking out, [posting to Math Forum](http://mathforum.org/kb/thread.jspa?threadID=1958868&tstart=0), assuming musicians always start late, didn't yet know about the 11 PM curfew.  This was after a productive three day open source un/conference representing [4D Studios](http://myspace.com/4dstudios), a DWA spin-off (hypertoons etc.).Given my status as \"body guard\", Indie could play \"Savannah style\" (drinking while playing, later [slam dance](http://en.wikipedia.org/wiki/Moshing)) without worrying about driving home with her equipment.  Some of her other fans, including one from Germany, left right after her gig.  She already has a following, after just a few weeks in town.We had another Quaker in the audience, much younger than I (we know each other from Multnomah Friends), good to catch up a little.I'd recommend all three of these gigs: [Cuntagious](http://www.myspace.com/cuntagiousmusic), Gem, and [Indie Anna Joan](http://www.myspace.com/indieannajoan), to people looking to sample the Portland music scene.  I also recommend Duke's on Belmont (around SE 27th) as an intimate setting that's nevertheless pleasing to performers, as they've put some real thought into the stage and sound system.  It reminds me somewhat of [Someday Lounge](http://www.somedaylounge.com/), next to [Back Space](http://www.backspace.bz/) in NW (one of our [Esozone](http://esozone.com/) venues).Today I walked five kilometers for St. Andrew's Legal Clinic, a charity [Matt favors](http://www.flickr.com/photos/17157315@N00/sets/72157600269294969/).  I'll link some pictures from [the Coffee Shops Network blog](http://coffeeshopsnet.blogspot.com/2009/06/race-for-justice-2009.html) where I'm currently chief of marketing (another one of my hats).  Then I took [a nap](http://mybizmo.blogspot.com/2009/01/playing-with-dolls.html) with my dog, before heading out to [a Quaker gathering](http://worldgame.blogspot.com/2009/06/summer-solstice.html) at one of the clerks' houses, taking the 75 bus ([Razz deserves a rest too](http://www.flickr.com/photos/17157315@N00/3836220486/in/photostream/)).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}