{
  "id": "5568113184016189776",
  "title": "My Philosophy of Art",
  "published": "2012-09-15T10:04:00.000-07:00",
  "updated": "2012-09-15T10:10:09.739-07:00",
  "content": "Artists are hungry for feedback, even if not in the live performance business, and even if they don't read every review or reply. \n\nArtists will go to the museum or gallery featuring their work, and mingle, anonymously, listening for comments.  That's an accepted practice.  Movie directors, actors:  same thing (visit an installation incognito to get a sense of the ripple effects).\n\nIn this sense, an art installation or showing is like one of those psychological experiments, like that famous \"computer in a wall\" in a poor neighborhood in India, an experiment to see what street urchin kids would do, a somewhat Charles Dickens meets H.G. Wells story (of course they played with it, taught themselves skills). \n\nIn this sense, art is a two way street:  the artist shares with an audience, and the audience shares back, reflects, responds.\n\nInspired by Trevor Blake and his series of magazine covers ([Struggle!](http://www.flickr.com/photos/kirbyurner/5777119078/in/photostream/)), I want to make a glossy series of magazine covers:  Social Engineer.  Happy pretty people, in various (presumably work-related) settings, with titles of articles, a price tag.\n\n\"Does this really exist?  Haven't I seen this somewhere?\" -- a first audience reaction.  \"Is this what they read at Facebook?\"\n\nLooks pretty innocuous, like IEEE, but the name is provocative, as it's what they used to frighten children with:  this'd what it'd be like if the Communists took over (we'd have \"social engineers\").\n\nSo getting a read on the audience would help gauge the lasting impact of the Cold War (the lasting effectiveness of its propaganda).\n\nI wonder if Social Engineer should publish a special NATO edition.  Food for thought.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}