{
  "id": "4790404604691163802",
  "title": "Nationalism and Jobs",
  "published": "2015-03-15T20:53:00.002-07:00",
  "updated": "2015-11-26T21:09:57.881-08:00",
  "content": "Analysts often portray Russia as sharing the US aim of nonproliferation in Iran i.e. the prospect of nuke WMDs in Iran is in neither \"superpower's\" (to use the jargon) best interests.  In this respect, the US and Russia are allies, although Russia, a neighbor and contractor, is more vested in Iran having civilian nuclear power, having taken over completion of the Siemens plant (by now on-line for some years) with plans to add more.\n\nHowever the assumption behind these analyses is always that Iran secretly wants nuke weapons, despite their [low strategic value](http://mybizmo.blogspot.com/2009/12/freeman-dyson-in-portland.html) and despite the PR problems attendant thereon.  Nations with nuke weapons tend to be seen as cowardly and immoral.  India and Pakistan have recently lowered themselves, entering the circle of the depraved, as \"little Satans\" (the superpowers being greater Satans). \n\nIran has remained aloof, its good name not yet blighted by investments of billions in instruments of mass murder.  A \"holier than thou\" attitude pervades the Islamic world as a result.  Iranians feel morally superior to both the USA and Russia (according to recent polls).  Islam trumps Christianity and Judaism in the minds of many who keep score by who stockpiles what armaments.\n\nGetting caught with a nuke WMD program would actually expose Iran to disgrace.  Why trade away the [moral high ground](http://worldgame.blogspot.com/2004/11/wont-you-join-us.html) then?\n\nA nominally Islamic government has an opportunity to lead, rather than resist, the global effort to criminalize nuke weapons.  Pakistan has already sacrificed its historic opportunity to offer [moral leadership](http://mybizmo.blogspot.com/2015/07/more-dots-connecting.html) in this sense, by following India into the club of the religiously inferior.\n\nSo I might put it differently:  Russia and Iran have a shared interest in an endgame leading to no nuke weapons, a [Countdown to Zero](http://worldgame.blogspot.com/2010/07/countdown-to-zero-movie-review.html) as some call it.  They're on the same side in this respect, with the US choosing to project acquisition of nuclear weapons as somehow a desirable goal Iran must be pursuing in a clandestine manner.  For how much longer will the District of Columbia's narrative manage to hold water I wonder?\n\nGreek nationalism, and [nationalism in general](http://worldgame.blogspot.com/2010/07/einstein-omsi.html), are playing a more reactionary role than most analysts describe.  Thinking of either Greece or Russia as managed by \"leftist governments\" tends to ignore older divisions going back to World War Two and before.  Nationalism is what the EU hopes to overcome, with the federation of the various states in North America, since the Civil War, seen as a role model.  Tensions around the financial meltdown in Greece threaten the EU consensus.\n\nThe US, Germany and France sell major amounts of armaments to both Turkey and Greece, under the \"NATO\" cover / excuse, whereas Russia's arms client remains Iran.  What cuts across national boundaries is the Arms Bazaar which profits from nationalism in selling to all sides, either openly, or under the table in the case of imposed sanctions.  Keeping old fears alive, as well as inventing new ones, is a primary goal of Arms Bazaar advertising ([recruiting commercials](http://controlroom.blogspot.com/2009/12/disaster-relief.html) etc.).\n\nIsrael's munitions industry, for example, is likewise profiting from regional aspirations couched in nationalist terms, selling arms to many players, including the Russians -- looking for better drones -- and Turkey (a major US client as well).\n\nMuch of Greece's debt is owing to loans from foreign powers underwriting the purchase and stockpiling of weapons by that nation, the Iron Mountain development strategy, pretty much proved to not create much work for civilians, but a way to keep soldiers and mercenaries semi-employed under arms. \n\nWe should remember that the military constitutes a jobs program in all of these countries, both in the manufacturing sector and in the form the the military itself.  Males without recourse to a military lifestyle would resort to hooliganism and gangsterism, is the theory, or help lead a political revolt.  The [Iron Mountain solution](http://mybizmo.blogspot.com/2015/02/thirsters-2015226.html) is to provide ample toys for the boys, along with a regimented lifestyle (on base or off) organized by patriarchs.  The church, also patriarchal, is used to fuel patriotism and a sense of threat from without (\"heathen\", \"Godless\" etc.).\n\nTheorists, more than analysts, will bring up gender wars at this juncture and argue that patriarchy itself is confronting an existential crossroads (no need to say \"crisis\").  The mostly male hierarchies that benefit from the endless doling out of props for [the military theater](http://worldgame.blogspot.com/2010/11/omr-again.html) no longer earn the respect of many financially literate spectators, who see their way of socializing wealth (through the military jobs program) as transparently wasteful and inefficient, a game for losers at best.\n\n[](http://photos1.blogger.com/blogger/1134/545/1600/technogeeks.png)technogeeks of the world unite!\n\n(click for larger view)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}