{
  "id": "5033466421004788108",
  "title": "Necker Cube Guy",
  "published": "2016-08-10T19:18:00.000-07:00",
  "updated": "2016-08-11T09:33:56.187-07:00",
  "content": "[](http://photos1.blogger.com/img/254/1836/640/edapple2.jpg)\nE.J. Applewhite\n\nSpeaking of [trailer parks](http://worldgame.blogspot.com/2016/08/airline-talk.html), Ed Applewhite was an archivist by temperament, and on the lookout for such filing savvy in others.  That explains why he was such a fan of Bonnie Goldstein when she showed up, fresh from Allegra's dance curriculum.  Bonnie appreciated Bucky too, shades of Kiyoshi, plus was good at filing, which is more than just shoving documents and artifacts into a vault.  One looks for peer review, as well as [networking opportunities](http://wikieducator.org/File:Cuboctahedralpacking.jpg).\n\nFor example, BFI (the Buckminster Fuller Institute for which I was briefly webmaster), once sent me a box of physical models with spreadsheets attached.  This was my first introduction to the work of Steve Waterman, whom I never met in person, and his way of finding maximal convex hulls in the IVM, classically with a ball at the origin.\n\nI was just around then discovering convex hull algorithms ([e.g. Qhull](http://www.qhull.org/)) available for free download, and got busy prototyping what became a genre, that of [rendering Watermans](http://www.4dsolutions.net/ocn/wgraphics.html), including inside interactive Java applets, forerunners of today's Android apps.\n\nEd himself bounced a few things off me from his own archive, separate from BFI's, most notably the writings of this Florida guy in a trailer park.  Ed was testing me in a way, because at the heart of this guy's thinking was a Necker Cube, and \"aspect shifts\" is what Wittgenstein's Philosophical Investigations are all about, especially in so-called Part 2.\n\nEJA knew that (given my own quirky writings) and wondered if I'd pick up on that, or just convey the dour news that so-and-so was off the wall.  That's really the pot calling the kettle black, the height of irony, right?  Ed was surrounded by freaks of nature, and I was one of them, a Strontium-90 baby. I'd written him from a Florida trailer park too, no doubt, or at least from one in Apple Valley, North Carolina.\n\nAnyway, he liked what I was doing to merge Synergetics with Wittgenstein and told me so. We may use Synergetics as a source of new context managers one might say.  In the namespace of Synergetics, we don't \"cube\" when we multiply a number by itself three times.  The incantations are different.\n\nGetting how that could be involves like a Necker Cube effect, a shift in perception ([Quadray Coordinates](https://en.wikipedia.org/wiki/Quadray_coordinates) may help).  At least that's what it takes for some.  I've put the details [in plain old math](https://github.com/4dsolutions/Python5/blob/master/Computing%20Volumes.ipynb) for those just wanting to go by the numbers.  The Martian Math cartoons ([including hypertoons](http://worldgame.blogspot.com/2016/07/hypertoons-etc.html)) should make it all seem more intuitive.\n\nApplewhite tested me a lot in retrospect as I knew he pretty much had to, as someone up and coming in the [tiny circle of Synergetics scholars](http://grunch.net/synergetics/intro.html).  We all suffered from serious flaws in his eyes, but then so did he in ours sometimes, so hurt feelings all round.  He wasn't much like a cult leader, though he helped brew the Synergetics kool-aid.  When that Heaven's Gate Applewhite talked his followers into returning to Hale-Bopp, Ed quipped \"they got the wrong Applewhite\" (he'd written Paradise Mislaid).\n\nHe was used to it, being mocked for this or that, perhaps behind his back,  Goes with the territory (he'd been around embassies a lot) and he did his best to work on what he regarded as potential weaknesses.  I admired his industrious productivity. He managed to stay the [quintessential insider](http://worldgame.blogspot.com/2005/01/national-treasure-movie-review.html).\n\nIn general he got along with me really well and we were both disappointed when I had to say good bye in a hurry, thanks to [a medical emergency](https://www.bestthinking.com/thinkers/computers_and_technology/programming/python/kirbyurner?tab=blog).  We'd been scheduled to have dinner, as I was in DC for back-to-back events, a Fuller Symposium (Ed a panelist), and a Pycon (both at GWU).  \n\nI'm glad for his coming out to the left coast for that earlier visit with his wife June, and spending some quality time in Portland.  We'd also eat out around Georgetown, when I'd breeze through.  He had a lot of favorite restaurants.  One time I brought my friend Matt to his Georgetown apartment, whom he later meet again on his Portland visit, [along with Harold Long](http://worldgame.blogspot.com/2005/02/methodist-morning.html), who'd worked with Frank Lloyd Wright, the architect.\n\nThat was the time, when Matt and I stopped in, that he gave me a copy of his newly published four volume Synergetics Dictionary as a gift, which I then drove across country, meeting Amy Edmondson in Santa Fe along the way. Matt and I shared driving, taking my sister's car from Montclair, NJ to Whittier in Greater LA, via Nashville and the Texas panhandle.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}