{
  "id": "582237701708052566",
  "title": "New Circuit Designs",
  "published": "2021-12-20T21:09:00.010-08:00",
  "updated": "2021-12-20T21:23:40.753-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/a/AVvXsEjlA5q7y9MqWcv3IePFmOqDKKTwlhqk7mxd2wCP-hxF6qnTES3dLmfMC_ajvZfPPFsbclcroqnGlFU8c6x5LLfXw9CQA_RhaBf3QWd2a8sFwtY7ZWAs7h8r0dsGrOi8tEzbXyRuczKWO2p9J8MVd4rafc3D2OOL7Hm9cf2tOZJBCIAR8CDIUA=s180) Here's the deal:  the core geometry in the Bucky stuff was baked enough to go mainline forty years ago and nothing much has changed on that score.  \n\nHowever the context is not \"Bucky was right about everything\" but \"this is what the guy thought, a mover and shaker in this world.\"  Then we look at what \"mover and shaker\" meant in his case, and the thoughts. \n\nLinus Pauling:  to have great ideas, have a lot of ideas.  \n\nLots of historical data connects to his bio; he made it easy for us to cast his foreground (private sky) against a shared backdrop (world history as theater).  \n\nWe could start with World's Fairs (Expos) and talk about how the Congress opted out of hosting any more of them within the USA.  I was taking in another Youtube on that around 3 AM last night.\n\nWe might want one in the Shire anyway, no need for Mordor to get involved (we speak in code?).\n\nWe could start with the capsomere counts in the viral nucleocapsid, should it have an icosahedral one.  Sars-2 doesn't, as many do not. \n\nHowever the main thing is not to stop at domes and spheres, but to dive into the straight edged (hard nosed) concentric of polyhedrons as he conceived them, in a language game of his own devising.  \n\nThis was all ready to go mainline forty years ago (as already mentioned).\n\nSaid core geometry is Platonic and requires one major breakthrough insight, that our modeling of 2nd and 3rd powering didn't have to be expressed with squares and cubes.  \n\nIt's not that the right angle choice was wrong, as if Synergetics \"disproves\" our practice.  Practices weave into forms of life, and what proves them seaworthy is the test of time, which of course involves stresses.\n\nHigh school minus any Bucky stuff is not really American enough for my taste.  \n\nI'd expect our sprawling network to keep passing the torch, whatever that looks like.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}