{
  "id": "3495592017638468450",
  "title": "New Years Eve",
  "published": "2012-12-31T18:39:00.002-08:00",
  "updated": "2013-01-05T10:21:43.345-08:00",
  "content": "I'm cooking up a new batch of Together Friends lentils, having served them at the Solstice Party last week.  I been to the corner grocery store a number of times today.  It's a two floor store, maybe bigger than you're picturing, try Google Earthing the corner of SE Hawthorne and Chavez, Portland, State of Oregon.\n\nSpeaking of states and state relations, short of actually forming treaties, which is a right reserved by the DC diplomatic corps (no, not DC comics), there's studying one anothers' institutions, academically, anthropoligically, and if necessary undercover and/or incognito (you might think up some reasons for this).\n\nSome of Portland's school teachers have been sojourning in Finland lately, which is a northerly culture, meaning we look North over the pole.  Looking back at us:  Japan, Korea, China, a lot of Siberia, Russia, Scandinavia, the UK, Iceland, Greenland and you're back to Canada.  Cold country, though with global warming maybe not so much.\n\nI'm starting to hear more about Bucky's mysterious boat flippers, the ones that would flip their boats over, to make the hulls of their halls. Haul a boat (big boat) up on land and flip it up on a boat-shaped foundation and you've already got your essentially leak proof shelter.  Put it back in the water again when you're ready to move on.  This was the practice, according to storytellers, of the walrus-based ecosystem.  They were hunted much as the buffalo were hunted by the plains dwellers of North America, except over an open ocean.\n\n[](http://www.flickr.com/photos/kirbyurner/8346686280/)\n\nThe potluck will partially overlap with Wanderers, in terms of roster.  I may ferry back and forth, as plans materialize.  Nothing's too tightly scripted.\n\nI wish all road people well tonight, one when, historically speaking, poor judgements add up and karma rears an ugly head, sucking souls from the liquor filled veins of the victims, including many not liquor filled.  My thought is to take only back streets and go slowly, and not very far. \n\nOf course back in those walrus hunting days, the people didn't divide the planet mentally in the same way they mentally do today.  If the oceans develop more cities, beyond the ones we call ships, we might see countries growing there too, though I expect it will be mostly about networks from now on.  The contiguous landmass jig-saw puzzle piece just doesn't mean as much as it used to, though unobstructed travel without a check point is always nice and to be celebrated.  Hooray for the interstates (the check point free ones) in that respect, though toll booths are a kind of check point, and I'm not talking about weigh stations as quite the same either, more a sub-category.\n\nI think about the cult of freeway driving and North America and how appealing a freeway system through Iraq was looking.  The old Persia trade over land is still quite a reality.  Overland trucking is not some exotic just-invented idea where Afghanistan is concerned.\n\nWere the Harvard Business School or one of those to offer academic credit for programs in that setting, working with that infrastructure, I think that would help with civilianization of transit corridors, needed both on land and on sea if check point free trade (fast and inexpensive) is to stay a reality (which isn't to say there can't be substance control and monitoring, checking for illegal ivory).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}