{
  "id": "1212232422067157568",
  "title": "New Year's Day",
  "published": "2012-01-01T16:51:00.000-08:00",
  "updated": "2012-01-01T23:53:53.239-08:00",
  "content": "I've been channeling more of the day to day stuff to [FaceBook](http://controlroom.blogspot.com/2012/01/more-from-esozone.html) of late.  This may have to do with the thread I've been weaving on the Wittgenstein list, a thread I'm [about to extend](http://groups.yahoo.com/group/Wittrs/message/7146).\n\nAlexia, Alexia's David, Tara and I met at [Than Thao](http://controlroom.blogspot.com/2006/03/back-wired.html) for Thai food at our favorite Thai-Vietnamese eatery.  Fujin is our favorite Chinese and as neighbors we appreciate these families for the hard work that they do for us, day in and day out.  The cuisine was excellent as usual, with two of the dishes customized per customer requests.\n\nThe home crew was cooking up a storm when I left, with Lindsey on her drum machine.  There's been a bumper sticker in the neighborhood urging the rehumanization of music (\"drum machines have no soul\" it says), but I don't see it as either / or.  My basement is suitable for drum machine rehearsals, a lot of which are done on headphone.  Plus having a driving beat track already laid is what gives the keyboard track rails to run on, with the voice a more epiphenomenal track and last to be recorded.\n\nI outlined a number of policy goals for the near future on PHYSLRNR, which may have [a public archive](http://listserv.buffalo.edu/cgi-bin/wa?A0=physlrnr-list), not sure.  I joined that list on invitation of Bob Fuller.  I tend to focus my energy there in bursts, mostly lurking.  A \"policy goal\" is of generic significance in this namespace and might mean some ground rule about the house and grounds, or a planned scenario of wider scope.  My involvement in encouraging more inter-mingling in the context of performing useful social services is hardly new.  LAAP had a lot of that (that was our [AFSC](http://controlroom.blogspot.com/2011/12/afsc-banter.html) Latin America Asia-Pacific program, of which I was clerk for many years).\n\nThe various neighborhood households continue to weave a pattern with ours.  I only found out recently that the Lotts were helping take care of the cat, which has been turned loose to roam freely.  She's thrived so far, and has an entrance through the foundation to the music studio, still a base, though she's not really well trained enough for such an environment (somewhat feral and uncivilized -- this isn't Moon, who died some years ago).\n\nI'm supposed to start filing financial aid papers for colleges soon.  I was basically low ebb for two years, with the small business retired from much local contracting as I sought to honor bank obligations.  Carol paid the 'rent' in exchange for living here part time, a very generous contribution.  Walker donated the [maxi taxi](http://controlroom.blogspot.com/2009/10/subgenius-devival.html).  We lived out of dumpsters, figuratively speaking (OK, sometimes figuratively -- lots gets wasted in America) and depended on [Food Not Bombs](http://worldgame.blogspot.com/2011/07/fnb-urban-studies.html) to keep us afloat.  Those days are not over, even though I'm now getting regular electronic deposits from Sebastopol (see online c.v. for more details).\n\nThe [CSN work](http://www.facebook.com/PhiloBiz) is voluntary for all of us, which is in the nature of start-ups, plus this is an open source / transparent endeavor and so follows a different emergence pattern.\n\nOn my radar are Bob Fuller (in recovery) and his family, and Suzanne (also friends with Alex) who lost her uncle.  Our family lost Eve Lightfoot recently, the daughter of Elsie, my grandma Esther's sister and the mother of my cousins Alice and Mary.  In the Meeting, we lost Simeon Hyde, a stalwart supporter and leader within our Multnomah Friends.  We also remembered Bill Sheppard and George Hammond recently, wanderers and treasured persons among us.\n\nAt lunch today, I brought some pictures from our Parliament of World Religions trip in 1999 around this time of year.  We celebrated New Year's in Maseru, Lesotho.  Dawn did a workshop with the Dalai Lama in Durban.  He later joined the conference to deliver a keynote.  His Holiness also met with a bunch of us in the Cape Town parliament building, and was introduced by Deputy Defense Minister Nozizwe Madlala-Routledge, a Friend and our host at the time.\n\nI shared some good New Year's Eve time with another alum from the International School.  Ms. Tomasi (as she was then known) was not in my class and had been in the Philippines much longer when I got there in 1971.  She and I knew many people in common nonetheless.  Thanks to FaceBook, we were able to make time in our lives to visit Back Stage at The Bagdad and catch up and compare notes.  Expats from overseas school backgrounds should get together more.  We help the world stay a little less crazy in my view (and each other), not unlike [the Parliament of World Religions](http://controlroom.blogspot.com/2010/03/wanderers-2010316.html), yet even more eclectic.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}