{
  "id": "3761033428111617646",
  "title": "New Public Schools",
  "published": "2016-10-27T19:03:00.000-07:00",
  "updated": "2016-10-28T15:00:55.172-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/30532091046/in/dateposted-public/)\n\nHere in the US (a namespace) the attack against the whole idea of \"charter schools\" has reached [a fever pitch](https://dianeravitch.net/2016/10/21/jeff-bryant-the-charter-school-myth-is-in-deep-trouble/), and the fights are along battle lines I scarcely recognize.\n\nYears have transpired since I helped a Portland charter get off the ground, [one LEP High](http://controlroom.blogspot.com/2009/03/pps-to-kill-lep-high.html), on East Burnside.  More recently, I've expressed my interest in the [Nexus Academy model](http://worldgame.blogspot.com/2015/04/against-grain.html) in the State of Michigan.\n\nA recent editorial said the charters had failed in their promise to raise the test scores of poor kids.  Was that their goal then?  Was that the conversation?  \n\nI thought the purpose of all public education, charter and non, was to save US Americans from their own brutish ignorance, their natural state.  As babies we don't know a lot.  We need an education to use a phone, engage in business activity.\n\nPrivate schools share the same mission.\n\nWhen did we agree on standardized tests?  Which tests?  What if they're stupid?\n\nThis bold miss-assumption that we as a nation ever agreed to anyone's standardization plan is really jumping the gun a bit I'd say.\n\nSure we'd like to eliminate poverty, but to really do that, we'd need to be at least twice as smart about how we spend our money, and three times as smart about what money is in the first place.\n\nHow many public schools teach anything about bitcoin I wonder, or the idea of cyber-currencies more generally?  Or about encryption?  What standardized tests ask about those topics?  None you say?  My point exactly.\n\nIn any case, civilization requires torch-passing to be ongoing, a truism, which doesn't mean it's not true.\n\nLets imagine a future world wherein rich spoiled US Americans are even dumber than dumb, nothing like the world of now.\n\nCould charter schools spring up all about teaching [empathy and compassion](http://worldgame.blogspot.com/2016/10/ethnic-schools.html)?  Could we raise [their EQ](http://controlroom.blogspot.com/2016/10/wanderers-20161026.html) just a little?  Could any public school of any type take that on?  What if some group thinks it worth a try?\n\nWhat's fair about denying future generations the experience that comes with creating a new school from scratch?  Another public one, like the others.  Why should that right be denied?\n\nIs creating new public schools that are not charter schools ever done any more? Or are all the non-charter public schools that we'll ever have, right now with us today?\n\n[](https://www.flickr.com/photos/kirbyurner/29934532873/in/dateposted-public/)\n\nSuppose a small city had ten golden keys, surrounding counties a few more, and it was up to school boards to award these to eligible grantees.  You could hold a key for thirty years, then it went back in the pool.  You'd have your school.\n\nSchools are not the same thing as school buildings.  Any skyscraper in downtown Portland could host a school, and many do.  Code schools in some cases.  A university system might have the ten keys for code school endeavors.  Some code schools could be public, labeled either magnet or vocational.\n\nThe thirty year timeout interval was arbitrary, used to introduce an idea:  that schools could be made mortal right out of the box, and that their mortality is a good thing, a feature to be welcomed.  What a concept, right? \n\nA broadcasting license doesn't last forever either.  Some licenses need to be renewed.  If we posit a relatively stable population for our model City and want to give people in every generation the opportunity to create schools, then a time-out for existing schools makes sense.\n\nAs a popular teacher in school X, not taking new students four years out, a high school winding down, I might be in on the planning of the next one.  The \"blank canvas\" feel, the innovative talents unleashed, are welcomed.\n\nWe're not mourning for the fading of twilight schools. Having had a good run, we welcome change. We learn from every generation's mistakes, or certainly hope to.  Honesty about what those mistakes were is part of the process, nothing to do with shame or blame.\n\nBesides, a given school might standardize on something \"retro\", allowing thematic echoes of prior times.  Academia in the West tends to echo Greek and Roman patterns, and that's just the beginning.  In a city like Portland, West meets East.\n\nIn other words, there's plenty of thematic continuity irrespective of specific institutions, as well as opportunities to experiment with new and positively synergetic blends.\n\nIn this possible future, new public schools are simply that, neither \"charter\" nor \"alternative\" just of more recent vintage, like a car more recently off the assembly line.\n\n\"We don't make those anymore.\"  What a relief in some cases, right?  With more hard won experience, we have a right to expect some improvement.\n\n[](https://www.flickr.com/photos/kirbyurner/30480192581/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}