{
  "id": "1039516314377722018",
  "title": "Next Frame",
  "published": "2011-01-09T19:01:00.000-08:00",
  "updated": "2011-01-11T00:32:28.948-08:00",
  "content": "[Nick appears better](http://groups.yahoo.com/group/synergeo/message/64371).  We chatted about a wide range of topics today.  He didn't see why Internet access should even be an issue in this day and age.  Why do we settle for the problems we nurse along, specialize in not solving?  I'd been whining about my failing laptop, which shut down during social hour at the meetinghouse today.  I need to try rescuing some pictures at least.  I'll grab everything I can get.We're convening a first board meeting, in recent memory (I'm fairly new to this gig), to brainstorm more about the future of [ISEPP](http://www.isepp.org/).  I was exulting this evening about how Terry had managed to pull off the most stellar and illustrious lecture series in the history of the planet to date.  Jet airplanes were only recently invented after all, and a lecture series isn't quite the same thing as a circus, though such analogies are inevitable.  Stephan J. Gould, Jane Goodall, Stephan Hawking, Carl Sagan, Sir Roger Penrose, Susan Haack... James Burke.Yes, the OMSI pubs are way cool, as are the TED Talks.  We'd wanted to do more with streaming video.  The right people never came out of the woodwork I guess.  We do have an [inventory of some interesting tapes](http://controlroom.blogspot.com/2009/06/taking-inventory.html).Tara secured top awards, best speaker, top debater, at the Pacific University meetup this weekend (an overbooked two day event that ended up going seven rounds).  I slogged through multi-hour Quaker business meetings in the meantime, made endurable by the people in them.  I'm of course proud of Tara, as are the Friends.  I was bragging to mom on the cell today (as well as listing [my woes](http://www.flickr.com/photos/17157315@N00/5345138099/in/photostream/)).Portland has done some really stellar service, and our achievements should be more celebrated. I'm not sure [the new sitcom](http://www.youtube.com/watch?v=AVmq9dq6Nsg) is helping (I've yet to see it). Of course I've been indulging in such boosterism for years. Perhaps I'm fighting a deeply ingrained inferiority complex?  Having lived in many cities around the world, I think Portland deserves to capitalize on its successes, yet one of the memes is we're too lazy to amount to much.Synergeo is just a [Punch 'n Judy show](http://groups.yahoo.com/group/synergeo/message/64383) these days.  Why try to keep it serious when there's no hope of doing so.  Yet there's content to work in.  I'm being the dedicated scholar, scrounging up those passages from Synergetics like I always do, trying to prove to the world that our agenda wasn't all that off target.  Listen to Portland for a change?  Not that we're all into esoterica to that degree.  [My brand of geekery](http://mathforum.org/kb/message.jspa?messageID=7353844&tstart=0) is one of many on tap.I'd think a supranational looking for positive PR would be salivating for a slice of Portland pie. I've already stuffed these blogs with enough [science fiction](http://mybizmo.blogspot.com/2010/06/hunger-project-on-synergeo.html) to put my preferred future on the map.  Others have their own storyboards, which they're free to be up front about.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}