{
  "id": "6627205898584081474",
  "title": "No Macroscope?",
  "published": "2018-03-29T13:41:00.001-07:00",
  "updated": "2018-03-29T13:51:41.542-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/3292180674/in/photolist-5uinAK-e897Lq-6EhymY-61VhBL)\n\nWe have the telescope and microscope, have for decades (though both keep morphing), yet no \"macroscope\" is a household word.  Why?  What's a \"macroscope\" anyway?\n\nGoogle Earth has come about as close as anyone to declassifying a Big Earth animated globe thingy, but not in real time, as people aren't ready for \"everyone seeing everything\" through satellites.\n\nSome of us want to guard against poachers.\n\nThat was my big push with drones, and not as shooters.  Inform the authorities and set up whatever road blocks or check stations. If there's a way to save more animals, consider the options.  I digress.\n\nI never supported their use in warfare, though of course war is not about \"fair\" and no one asked my permission, one way or the other. I never called for their use against Julian either, even in jest.\n\nBuckminster Fuller suggested \"geoscope\" for the same thing, and got close in 1967, when the original US State Department proposal was for an unfolding geoscope that formed a Dymaxion Projection (same Gaussian as a Snyder pretty much but in a unique arrangement ideally suited to keeping contiguous landmasses contiguous).\n\nThose adjoined only by oceans get spread apart.\n\nThe Expo people decided that might be too cerebral and why not go with a giant geodesic dome instead, a smaller version memorialized at EPCOT in Orlando, decades latter?\n\nMontreal 67 was the Taj Mahal of geodesic structures.  No nation has had more self respect than Canada, when it comes to hosting such a bold architecture.  Makes sense:  Donald Coxeter.\n\nLater blueprints anchored a Geoscope in East River opposite the UN building, a convenience for those inside, and a tourist attraction.  The tensegrity moorings would have competed for attention with the tensegrity radio tower atop New York's newest trade center, had either project been completed.\n\nKenneth Snelson of Needle Tower fame (Washington DC) and many other tensegrity structures, had been approached about providing one as a finishing touch to the new skyscraper.\n\nActually, macroscopes do exist, for precisely the purpose intended, the display of global data.  They just don't enjoy the courtesy of an instrument name, such as \"telescope\" and \"microscope\" enjoy.  We're to get by with \"globe\" or \"planetary data display\" or some generic.\n\nThat's as of 2018 BCE in my specific locale (OR 97214), where I monitor only a subsample of how the world population speaks (by \"world population\" I mean to include those in low orbit aboard staffed machines).\n\nGlenn Stockton of Global Matrix fame keeps tabs on such literature and is well aware of the many authors and authorities involved in macroscope development.  Again, Google Earth is representative of the state of the art.\n\nBut in what ways has this asset been incorporated into the elementary, middle and high school grades?  The vector towards becoming a \"household word\" is through percolation within a curriculum.  Who looks at Earth?\n\nMore schools may be screening macroscopes soon.  The LCDs might not be interactive, but are instead preprogrammed to hop around, like a programmed Planetarium projector might do.\n\nThese are related devices (Planetariums and Macroscopes), as Christian Science Mapparium (Boston, MA) clearly demonstrates.  Observers stand inside the planet in question, with global data appearing as stained glass. Might pixels be referred to as \"stained\" when containing RGB \"dyes\"?\n\nLook for macroscopes in Dubai?\n\nThe Lower48 keeps telling itself it's the richest \"nation\" on Earth -- which is touching -- and we want these folks to succeed.  But lets be honest:  their budget for education is far outclassed by those working harder for their children.  End Timers have reason to be lazy, in proportion to the certainty with which they cling to those beliefs.\n\nI'm not claiming all North Americans are End Timers, let alone all in Lower48.  But those who are ready to see it all come to a full stop probably won't see the need for planners or futurists.  What's the point, right?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}