{
  "id": "4257052054359590302",
  "title": "Noodling and Doodling",
  "published": "2009-03-21T13:10:00.000-07:00",
  "updated": "2009-03-23T19:45:43.120-07:00",
  "content": "I'm sitting at the big table at Pauling House, yakking with Drs. Feinstein and Taylor, regarding the future of computer programming.I expressed my frustration with [this \"la dee da\" attitude](http://mail.python.org/pipermail/edu-sig/2009-March/009156.html) that any given computer language is a passing phase (a \"flavor of the month\"), whereas we're swiftly heading into a push button walk-away civilization, computers humming beneath the surface, [a few Morlocks](http://worldgame.blogspot.com/2007/11/fixing-g.html) in the tunnels, tending the pipes.  So why bother learning what's slated to fade away?On the contrary, I contend, we've made approximately zero progress towards removing human intelligence from the picture, nor are the smarter shops, like Pixar, even trying to make all cartooning [an AI project](http://mybizmo.blogspot.com/2008/04/philosophy-posting.html).  What would be the fun of making movies, if you didn't get to actually make them?  Human intelligence is [here to stay](http://mail.python.org/pipermail/edu-sig/2008-April/008504.html), serves a critical function.In terms of curriculum, there's this idea of \"hard fun\" (not an oxymoron).  The psychologists among us, looking for brain cycles in the fantasy lives, the daydreams, of their intended customers, [ala Smallville](http://mybizmo.blogspot.com/2005/09/wanderers-retreat.html), [Grey's Anatomy](http://www.blogger.com/%3Ca%20onblur=%22try%20%7Bparent.deselectBloggerImageGracefully%28%29;%7D%20catch%28e%29%20%7B%7D%22%20href=%22https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgf4MTVUAiIYyCeaQmGpLI9PaeK4h44CfJq2uxX39JPwNrnXqUASmGkCaaSCHZfaQWCnm3Y4R2pHZT6ZO77TtrxW3v2v8oklflMC52kUsiqzMNNpV2q_fs26NZ82U5v5ZIau2kT2w/s1600-h/dutch_masters.jpg%22%3E%3Cimg%20style=%22margin:%200px%20auto%2010px;%20display:%20block;%20text-align:%20center;%20cursor:%20pointer;%20width:%20200px;%20height:%20150px;%22%20src=%22http://2.bp.blogspot.com/_3IBfde2A9L8/ScVEaxo_6cI/AAAAAAAAC60/wkrD91IZS7U/s200/dutch_masters.jpg%22%20alt=%22%22%20id=%22BLOGGER_PHOTO_ID_5315730161973324226%22%20border=%220%22%20/%3E%3C/a%3E) etc. (i.e. in TV melodramas, [soap operas](http://mybizmo.blogspot.com/2009/03/high-school-melodrama.html)), may encourage vicarious living versus fantasizing realistically about one's own future.  Either way, you get audience engagement, provided the surrounding society nurtures escapism, other forms of anti-realism (important genres, I agree, right up there [with sports](http://controlroom.blogspot.com/2009/03/competitive-gaming.html)).Is it possible to doodle in computer language, just for the fun of it?  Storyboarding for television is a kind of programming.Yes, and it's a sign you're getting an education, when you want to play the \"language games of science\" (Bill Nye voice) just for the fun of it.  Chess is entertainment, not a chore (for some people), though in professional life, one sometimes has to \"slog through\" a \"[book of changes](http://osgarden.appspot.com/)\".Allen is off to Oregon City to lead a meeting of the L5 Society.  Shomar is here in the house with us, an honorary Wanderer.  We're looking forward to Patrick (a psychometrician) joining us later.  Buzz just walked in.  [Retreat in progress](http://worldgame.blogspot.com/2009/03/ostara.html)...Quakers (Friends) have a track record of improving conditions for mental patients, so the fact this was [Asylum Avenue](http://worldgame.blogspot.com/2009/03/congratulations-freds.html), because of Dr. Hawthorne's mental hospital, even before it gave birth to the Silicon Forest ([Doug Strain & Co.](http://mybizmo.blogspot.com/2005/09/planting-seeds-in-silicon-forest.html)), gives us lots to think about, in terms having a good neighborhood (97214).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}