{
  "id": "6372133345410518343",
  "title": "North Circuit",
  "published": "2015-04-19T00:41:00.002-07:00",
  "updated": "2023-05-11T11:35:43.133-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157649641476063)\n:: north circuit :: \n\nQuaker business took me to Tacoma Friends Meeting, originally constructed as a church more than a meetinghouse.  Friends shared the building at first, then purchased it, and still share.  I'd never been here before.\n\nAbout 25 of us met that April 11 from all over the region as what's called the Coordinating Committee for North Pacific Yearly Meeting.  Clerks of Outreach and Visitation, Peace and Social Concerns, Finance, and Information Technology ([a committee I co-clerk](http://controlroom.blogspot.com/2014/11/nypm-it-comm-business.html)) were among those present.  I sat next to Linda, NPYM Secretary, comparing notes on laser printers given her office needs a new one.\n\nOne highlight from that meeting, which I didn't include in my notes (filed on [npym-it-discuss](https://groups.google.com/forum/#!forum/npym-it-discuss)) was our brief discussion of David Chandler's work during the PSCC section of the meeting.  Rose Lewis is quite aware that the Multnomah Friends, like [Humanists of Greater Portland](http://controlroom.blogspot.com/2015/03/rethink911-hgp.html), have been grappling with a concern of [many Mormons](http://www.deseretnews.com/article/705295677/Traces-of-explosives-in-911-dust-scientists-say.html?pg=all) as well:  the lack of credibility in the NIST report on what really happened on September 11, 2001. \n\nThe NPYM PSCC is looking at ongoing Racism as a number one issue.  Multnomah's PSCC hosted [David's presentation](http://controlroom.blogspot.com/2014/11/wanderers-2014114.html) on April 12.\n\nI continued on north that day though, visiting my Uncle Bill (actually my grandmother's sister's child, both my parents having ended up only children; Carol had a brother who lived until his teenage years then was killed in an accident).  I was missing much of the rest of the meeting, however Clint Weimeister, our web wrangler, was also representing IT Committee so my continued presence was not strictly required.\n\nBill was turning 90 that Monday and I was eager to see his new digs, which feature a comfortable reading chair.  Bill is pretty interested in history and has written [a maritime history](http://controlroom.blogspot.com/2007/04/more-meetings.html) himself, of the submarine business in the Pacific Northwest even prior to World War One.  He had a history of the US Navy with a long passage about Quakers I photographed, their relevance having to do with ship-design skills.  Getting pacifists to buy into building warships required some [twisted logic](https://www.flickr.com/photos/kirbyurner/16909176047/in/set-72157649641476063) but such is in plentiful supply.\n\nI joined Bill for supper downstairs from his apartment and might a gentleman in his 90s of Chinese heritage who had learned English from Canadian missionaries.  Given his accent was understandable to American English speakers, he'd been assigned as a translator for the US military in Burma during World War Two. \n\nI pressed onward with my journey to a destination oft associated [with Thanksgiving](http://worldgame.blogspot.com/2007/11/thanksgiving-2007.html) in [these blogs](http://worldgame.blogspot.com/2009/11/tg-2009.html).  I was driving \"maxi taxi\", Lindsey's escape pod from Savannah, signed over to me as [part of our deal](http://mybizmo.blogspot.com/2014/11/recapping-story.html).  This 1997 Nissan Maxima is still going strong at well over 200K though sometimes the fuel mix is too lean and she conks.  She took me over the mountains to Terrabonne and thence to [Big Bear Camp ](http://worldgame.blogspot.com/2015/03/wqm-mens-group-2015.html)on the last long drive.  Lindsey herself is in Kathmandu Valley.\n\nLes showed me a genre of Youtube I'd not yet tuned in:  Korean eating shows.  A single individual anchors the meal, chatting with the viewers while consuming large amounts of food in a single sitting.  He also had transferred his love of flying, as a former ultra-light pilot, into an eye-in-the-sky DJI Phantom Vision+ 2, [a sophisticated device](http://controlroom.blogspot.com/2015/04/pov-game-of-fetch.html) with on-board camera.  The family is looking at colleges, Ruth being a few years younger than Tara.\n\nA highlight of the trip and a satisfying segue from watching Koreans eating, was our visit to a Korean BBQ in Lynnwood.  We cooked the meats right at the table, served with many side dishes.\n\nThe next day, I briefly toured the much expanded Angle of the Winds casino and hotel, where Les works in IT, on my way south back to Portland.  All in all, a productive experience.  Happy Birthday Bill.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}