{
  "id": "3349210710511497521",
  "title": "Not Following Detroit",
  "published": "2009-11-03T08:23:00.001-08:00",
  "updated": "2009-11-03T08:43:35.346-08:00",
  "content": "[ typos fixed, hyperlinks-enhanced version of a math-teach posting @ Math Forum ]On Sun, Nov 1, 2009 at 7:18 AM,Domenico Rosa wrote:> [Publisher enters new chapter in textbooks](http://www.boston.com/news/education/k_12/articles/2009/10/29/boston_publisher_enters_new_chapter_in_textbooks/)> Houghton sells $40m high-tech teaching system> By D.C. Denison, Globe Staff    October 29, 2009>Whereas I agree that the [mass published wood pulp textbook](http://mybizmo.blogspot.com/2009/06/saving-trees.html) is no longer the most relevant distribution system for curriculum content, there's a lot of political pressure in Portland, and Oregon more generally, to \"eat our own dog food\" as [an open source capital](http://controlroom.blogspot.com/2005/11/pdx-open-source-capital.html) (Christian Science Monitor, 2005).OSCON is returning next year (Open Source Conference) and we also have [OS Bridge](http://controlroom.blogspot.com/2009/01/os-bridge.html), all thanks to [the Silicon Forest](http://controlroom.blogspot.com/2009/05/silicon-forest-origins.html) serving as a champion of FOSS (or FLOSS as some call it, L for Libre or Liberal, as in Liberal Arts).This trend extends to empowering teachers to commit to Open Education standards, [ala WikiEducator](http://www.wikieducator.org/User:KirbyUrner) and so forth.  Initiatives like [Maria's Math 2.0](http://mathfuture.wikispaces.com/) will likely play a greater role in future curriculum writing than any dinosaur mass publishers \"back east\" (we tend to be snobbish out here, see \"[the east](http://controlroom.blogspot.com/2007/01/funny-story.html)\" as about 10 years behind the times, with California only 3 years behind).Math Labs may use mostly recycled hardware, hand-me-down machines from the corporate sector and government agencies, although some of the more well-endowed get grants for new equipment.  Mostly the money needs to go for teacher training, as math teachers especially are expected to have IT-related skills (lest their \"technology in the classroom\" rhetoric sound empty and hollow -- just knowing how to use a scientific calculator is no excuse for numeric literacy, or \"[numeracy](http://www.4dsolutions.net/ocn/numeracy0.html)\" any more).So I'm anticipating a lot of skepticism regarding Detroit's adoption strategies.  We'll expect to learn from Detroit's mistakes perhaps?Kirby",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}