{
  "id": "182469972092511106",
  "title": "Notes from Bizmo World",
  "published": "2018-12-07T10:17:00.003-08:00",
  "updated": "2018-12-07T10:34:31.279-08:00",
  "content": "Wow, they're not kidding at Steemit, when they say keep track of your own damn password. A lotta geeks dismiss that one, knowing reset with verification is a possibility, meaning you can just reset the password once you have the victim's cell phone.  Not so with this blockchainer.  You don't have the password in memory, which is too long to remember, and you don't get to reset it if you forget it.  You'll never access your account again, another waste of a great moniker.\n\nI was pdx4d.  They generate the passwords for you.  They look like bitcoin addresses.  You're getting warmer.  I did find where I'd backed up the Steemit address, having followed protocol.\n\nSteemit is but one of many social media the next geek generation has cooked up.  You weren't expecting the world to stop with Facebook were you?\n\nI'm using Facebook, as it's not either/or, but as a columnist in Bizmo World, I'm expected to keep pushing to a next horizon.  Have you signed on to Meat yet?  Just kidding.\n\nLets make it real here and talk about malls.  Sears Discount is suffering from low attendance, another reason to go in, great customer service.  They had their two models of microwave ovens at really low prices, but with a Walmart right next door (next store), that wasn't saying much.\n\nI came in like a robot, checked the LG, had my measuring tape, ended up with the Oster, about the same price but more swoopy or something.  Walmart had some other things I needed.  Then Fubonn, the Asian supermarket complex.  More ramen.  Kimchi.  Couldn't find the soy sauce, will solve it next time.\n\nPortland's 82nd Avenue, an Oregon State road, is our homage to freeway gentrification everywhere, except it's not the freeway, but the business route running north-south parallel to I-205, itself the business route branch-off of I-5, that goes through the center, branching to I-405 to the super-center.\n\nBy \"freeway gentrification\" I mean the strip mall culture of one-story restaurant franchises and assortment of big and little box stores, supplied by truck, the premier vehicle of the I-net, from a layer of warehouses around any hub city, especially those with ports.  Portland has humble freight traffic, and that keeps us connected in a global economy.\n\nYou may be wondering what bizmo rig I'm driving through all these parking lots and you'd be right to be wondering, since a bizmo log or chronicle typically features such a vehicle, with its quirks and problems.\n\nInstead, I'm in a four-door Nissan from the late 1900s.  Long time readers of these blogs may remember Razz, a Subaru, and Robin Blue even before that.  Cars get proper names much as we give variable names to other features in a program, including actors, agents, whatever observables.  Mars has a name.\n\nThe archetypal bizmo shimmers in the archetypal landscape, between the lines, as we're still busy constructing the lifestyle.  T4P only came along recently.  For now, I'm just blending in as one more noodle lover.  The Oster is working great, and sensed by itself when the baked potato had released sufficient humidity.  There's some real science going on in that appliance.  No Instapot yet, thinking about it.\n\nFubonn is on 82nd, like the two Walmarts I saw (the one I went into is further south, in Clackamas, whereas the second came after the Entering Portland sign, me coming north).  I go there more often, as it's closer and Walmart - Amazon might be my online supplier of delivered goods, where I'm not the one in the fossil fuel business.\n\nSpeaking of which, I have a work sponsor ready to heat more of my building so we've got a truck on the way on Monday.  I'm not a new customer, having been at my current location since 1995 or thereabouts.  Newly married with child.  We used to call Montag but their customer list was acquired by another company.\n\nThe microwave just decided to blow one day, kinda like mom's knee (though the latter had more of an excuse). The Magic Chef gave up the magic, after over a decade of service I'm reckoning.  My range is a Magic Chef too, avocado green like from the 1960s, came with the house. \n\nThe antique stove fits with my overall decor, which is likewise vintage, lots of vinyl paneling.  We had the wood paneling in the living room removed, along with the shag rug.  Pine floors.  Looks like a ski lodge where the wood takes some punishment.\n\nA skilled repair person could likely have identified a fried wire in the Costco-bought Magic Chef and made it good as new.  Our consumer culture encourages us to replace, not repair, these small appliances, though there's more of an aftermarket for the bigger ones, like washers and dryers.\n\nI'm not the expert.  I'm the consumer, and some consuming I did.  Thanks to my knowing how to teach Python, I'm able to afford a building with replaceable and irreplaceable gadgets and doodads.  Python and Martian Math as a combo.  That's another popular dish.  We're like a food cart, in a town of food pods (lots of competition).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}