{
  "id": "6246523204590033997",
  "title": "Nukes Suck",
  "published": "2018-05-10T16:00:00.000-07:00",
  "updated": "2018-05-18T18:14:50.987-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhErlj-mdDxYsmMEgjwuBiz1BOZxA6ygycnQKaIZzX5-MPuFphLchybew5JK7iD4PD1xdsUkhzt5hnBXSUdiiIDDH62N_P1tXpoV9ivGFBAHM2BE9Uc14taLn10GohowzFe3_VB/s1600/cartoon2.jpg)\n\nAs my long time blog readers know, I don't believe the Persians are hellbent on getting nuclear weapons.  On the contrary, the political rhetoric coming from these religious leaders as that holding such WMDs is highly immoral and unethical.\n\nThe US Christians don't usually say that.  Evangelicals tend to be pro atom bomb, as an expression of God's love for them.\n\nProtestants are especially bomb crazed and explosive ordnance, along with horror films, are principal exports of those infecting the urban areas, District of Columbia especially.\n\nLoving the bomb is right up there with meth and heroine addiction, or addiction to an especially reprobate form of kinky porn.  It's not in the DSM, but it should be, as a possibly treatable mental illness.\n\nA typical symptom of severe mental illness is uncontrolled projection.  If you secretly lust after so-and-so, then it may seem everyone around you is driven by similar secrets.  The lust for nuclear weapons becomes universal, in the mind of one who's been taken over by the meme virus.\n\nThat's what I see happening vis-a-vis the Persians (I don't say Iran because I'm not a big believer in UK imperial globes and their hastily drawn districts, silly anthems and flags, and nutty alliances between their \"royal\" spoiled families).  The nuke heads can't imagine losing the moral high ground, and compensate by playing king of the hill as they wallow in their addiction.\n\nI don't have nuclear weapons, never have.  I came to Nuthouse Earth in 1958 and found it to be a place of great potential, but fearful idiot warmongers have been making this place a hell the whole time I've been here.  I get it.  The species is deeply flawed.  Great religions have worked to address these flaws, with some success, but there's a ways to go.\n\nActually, human nature may not be the core problem.  Growing pains entail many changes and that's why we need finite life spans, so that humans replace themselves with humans able to come to grips with the new realities, whatever these may be.  Even if there's reincarnation, we get to shed a lot of the debilitating beliefs we build up over the course of a lifetime.  There's that reset button, for back to factory settings, with true learnings collectively preserved.\n\nIn our time, the UN General Assembly has bypassed the UN Security Council and come up with its own treaty banning nuclear weapons.  Of course the nuke heads are against this treaty, but they're dying of aging and making last gasps.  The youth are more realistic and understand their careers as weapons inspectors and environmental cleanup agents are beaconing.  Dealing with messes the nuke heads made is already full time work for many people.\n\nIran (there, I said it, when in Rome...) has much more to gain than to lose by choosing the moral high ground and helping the world rid itself of weapons of mass suicide.  The Iranian religious leaders have embraced the UN Ban Treaty and proposed the whole region be nuclear free.  The whole globe, one would hope, would move in that direction, as a matter of religious faith and respect for whatever deity or deities.\n\nGiven the religious nature of Iran's anti-nuke weapon position, discovering a secret program such as others, suffering from their horrendous addiction, have no choice but to imagine, would be especially devastating psychologically.  Such hypocrisy would be hard to fathom.  That's like when gay bashing pulpit imams are found guilty of gay affairs.\n\nA much more promising approach is for Iran to continue growing its alliances within the anti nuke weapon network, which includes the mayors of most cities.  Portland and Tehran are on the same page for example.  Oregon likewise suffers under sanctions from the dinosaur Federales and their military junta dictatorship.  We're friends with Iran.\n\nWhat we want to stop is all the ethnic warring, deliberately inflamed by so-called special operators who make it their business to sew discord and distribute outward weapons.  Some of these operators pretend to be working on behalf of some \"intelligence\" agency but we've exposed that form of corruption many times.  Any drug dealer and half-wit criminal can come on TV or Youtube saying they work for the CIA.  Some of these people then get paying jobs working in media.\n\nRemember, anyone who says \"our nuclear weapons\" or \"when we bombed Japan\" is likely an arm of some \"we\" that no longer has integrity or legitimacy.  These people need treatment, medical care, and are not ready for responsible offices or important duties.\n\nLastly, I don't want to promote ageism by saying older people can't continue to upgrade their thinking.  That's what American Transcendentalism is all about, what with its mind / brain distinction and focus on divine grace (intuition, Holy Spirit, zeitgeist).\n\nYour heritage as a human is to have access to continuing revelation.  So if you're already older than thirty, hang in there and remember to pray for wisdom.  Don't end up like the walking dead.  Become reborn, over and over.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}