{
  "id": "1244437274152324681",
  "title": "Objects First?",
  "published": "2010-01-27T23:09:00.000-08:00",
  "updated": "2010-01-28T20:16:05.077-08:00",
  "content": "We've had some recent discussions on edu-sig regarding an esoteric \"objects first\" approach to learning Python.Actually, what's more esoteric is the context:  a high school mathematics class.  Who would expect a computer language to have much traction in such a setting?However, assuming a few such exceptional courses, the next question is when to broach the topic of \"objects\".My bias has been to step back from \"computer languages\" completely and remember where the idea came from in the first place:  from ordinary language.Puppets, [cartoon characters](http://worldgame.blogspot.com/2009/02/regarding-objectifying.html), and yes, flesh and blood sentient beings, all may be contemplated in terms of a nominalist paradigm, wherein everything has a name, and those names serve to anchor both behaviors and attributes.How old are you?  Do you have a cell phone number or email address?  Maybe not.  Those would be attributes in any case.  From my posting (fixing a glitch):In sum, I think the best way to teach [about objects] is not as a strictly  computer science topic, but just a science topic more generally.Something  like full blown UML would be overkill, but if your job is to design an airport, or manage one, it makes perfect sense to ask  \"what are the objects I need to be dealing with, and what are their  attributes and behaviors?\"Runways, airplanes, control tower, concourse, baggage carousels,  parking garage, fuel tanks, snack and gift shops.... we don't have to  spend a lot of time on any one institution, and we don't have to write  even a single line of code if that's not what we're into.The idea is to have students look at a knowledge domain and start  analyzing it in terms of objects, as a prelude to problem solving.   Don't need a computer.Not every teacher will be comfortable with this approach.  The teacher trainings I envision, perhaps even in North America, go over these approaches as options, leaving it to teachers on the ground to configure their own curricula.  Download and customize, internationalize.Speaking of internationalization, Wikieducator is switching to a new WYSIWYG editor on February 6.  Some of us are testing it now, including by writing in Chinese.*  *  *On another topic, continuing the thread below, I'll report having supported all four nights of said Sleeping Bag Fundraiser.  The bags are on order under LW's auspices, are shipping to Laughing Horse.  I'm not on the distribution team and have handled no money.I'm grateful for what journal entries I've managed to contribute regarding these efforts.  Community service has a place on my resume.Supporting worthy causes, sometimes with a public record, other times not, is what Coffee Shops Network is/was all about.  As a volunteer marketing agent, at least for the idea, I'm expected to walk my talk.Philanthropy is everybody's business, even if one is living on the edge.*  *  *A positive future vision is worth keeping alive.  However, special effects, laser light shows, appealing Sketchups, only take one so far.At this point, a lot of us would settle for less mayhem.Many Chinese organizations are getting pretty good at disaster relief, are among the first responders anywhere.  Civilians need rapid deployment capability as much as anyone.A sane and productive culture, likely to experience market growth and attract new investment, is able to compete as an aid giver.  If your only export is pain, you lose.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}