{
  "id": "4203342084723745311",
  "title": "Occupy Portland (a flashback)",
  "published": "2018-06-21T11:22:00.005-07:00",
  "updated": "2020-11-18T23:30:16.613-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157696532818981)\n\nThe day after watching [Isle of the Dogs](http://controlroom.blogspot.com/2018/06/isle-of-dogs-movie-review.html), I found myself cycling down to a kind of Occupy in south Portland, where a group of campers was protesting against the concentration camps, organized by the Federales, for undocumented immigrants not going through proper bureaucratic channels, a rather hopeless labyrinth.\n\nWe see multiple languages in operation in that context as well, plus an agenda to close borders that were never closed, historically speaking.  The logic of the purchase of this territory from Napoleon requires a stronger literalness.\n\nWinning some battle with Mexico in another era never included Mexico's agreeing to foot the bill for a literal wall between the two jurisdictions.  That battle was only recently lost, and not by Mexico.\n\nNationalism (a memeplex) is working overtime to solidify itself, even as governments themselves are hollowed out by globalist networks working in concert.\n\nShoring up the nation-state system is the only way some supranationals see their way clear to keeping a hold on their own legitimacy.  How would they stay in business without strongly patriotic sentiments and a terror of possibly diseased invaders, infected with alien ideologies and religions?\n\nMelody and I visited the camp by bicycle, reminding me I need better nighttime lights, as we came back in the dark, stopping at Dots on Clinton Street for a single beer each.\n\nThe camp is at the base of the ICE detention center tucked away in a new area of town featuring high rise apartments and the cable car up to OHSU.  Getting there by bicycle is really easy, thanks to Tillikum Crossing.  I took lots of pictures.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}