{
  "id": "4875844826993065755",
  "title": "Odds 'n Ends",
  "published": "2009-10-06T11:17:00.000-07:00",
  "updated": "2011-04-19T21:17:43.974-07:00",
  "content": ":: LW @ Angelo's (10/3) ::We got the dishwasher fixed yesterday morning, thanks to expert tech support from Applicance World Services on SE Flavel.  We're really happy to [have that working again](http://worldgame.blogspot.com/2009/08/domestic-affairs.html).  Replacing the motor was less wasteful given the rest of it is still in good shape, $170 for the part (Kitchenaid lists this company on its website).Business meetings around [4D Studios](http://www.myspace.com/4dstudios) are all about microphones and how to split, edit, recombine the audio tracks (plus I've toyed with the [video feature](http://www.flickr.com/photos/17157315@N00/3986633314/) on my cigarette pack sized Olympus Stylus).  I suggested roping in the CTO but LW thought that might be overkill given we're still ramping up on Qbase.  TC might be holding a puzzle piece?CFO and I had a small repast on Hawthorne the other day, comparing notes.  She's out of town quite a bit, in cities I've never seen except in movies or on TV.I've noticed diversity-sig starting to come on-line and signaled other PSF members to consider joining, although with open archives, you needn't join to lurk.  This new Python group came on radar after alpha and [beta versions](http://controlroom.blogspot.com/2009/09/equinox-retreat.html) of a PSF diversity statement had already surfaced, following Guido's request that we have one.No, I've not seen the new Michael Moore film yet.I've been studying the MMM slate some more, some prompted by our need for a clerk [on QMP](http://worldgame.blogspot.com/2009/10/wqm-day-one.html) (looking to next year already) plus also wanting to sort out the liaison picture i.e. who's on first w/r to AFSC, [FCNL](http://worldgame.blogspot.com/2008/08/report-from-fcnl.html), [FWCC](http://worldgame.blogspot.com/2006/04/london-knowledge-lab.html) or whatever?  I've got the [BCFM](http://worldgame.blogspot.com/2008/05/adult-education.html) and NPYM positions with AFSC, but nothing going with MMM on that score.  Yes, an alphabet soup -- yet another namespace shared by Friends (RSoF).  If you poke around in these blogs or [otherwise cross-reference](http://worldgame.blogspot.com/2009/09/catholic-analysis.html), you'll find all these easy enough to decode.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}