{
  "id": "7927754866253259685",
  "title": "Of Globalism and the Macroscope",
  "published": "2017-03-14T20:16:00.000-07:00",
  "updated": "2017-03-14T20:23:29.092-07:00",
  "content": "I'm not sharing this because I agree with it, but because I think it \nbrings into sharp relief what the wall-builders are thinking: \"borders, \nlanguage, culture, that's what defines America, that's what defines \nevery nation.\"\n\nI'd counter that the Americas have never really experienced closed borders \nof the type the wall-builders envision. What the alt-right is pushing is\n an ideal (not yet real) form of nationalism wherein we finally do nail \ndown the vision and make borders impermeable (no, not like a cell wall, \nbut Savage uses that metaphor).\n\nKind of like \"being documented\": we have yet to live in a world wherein \neveryone is carefully documented, birth certificate onward, but we appear to be \napproaching such a world, given IT prowess.\n\nWe can imagine it and somewhat need that (universal documentation) to work \nbetter for the ideology of nationalism and its concept of \"citizenship\" to\n finally reach everybody, including nomads and gypsies.\n\nNationalists ardently wish for the nationalist ideology to finally become the \ndominant ideology, whereas I'm more thinking nation-states reflect a \nbygone Victorian Era imperialist world view of another day. That doesn't mean they can't or won't continue to provide core services.\n\nAn older globalism is getting replaced with a newer one, with more morphing to \nfollow (humans are reprogrammable, our saving grace), which neither abolishes ethnicity nor self esteem, nor pride in \none's heritage.\n\nOur telecommunications have a lot to do with it. It's \nnot telepathy, but it's close.  When nations got off the ground in Europe, around [the time of General Garibaldi](https://youtu.be/A2j_annBp6U), we \ndidn't have this layer yet.\n\n[We globalists](http://mybizmo.blogspot.com/2016/11/thinking-globally.html) just happen to see more clearly than ever that our species shares a biosphere and \nneeds tools (such as [the macroscope](http://www.research.ibm.com/5-in-5/macroscopes/)) to self organize. We're doing our \nbest, which may not be good enough, that always seems to be the story line.\n\nSpeaking of macroscopes, Glenn caught it right away when IBM embraced the term recently. For Glenn and I, the macroscope meme connects to the hexagons + pentagons pattern of the soccer ball, but perhaps with many more hexagons (higher frequency).  What if any such motifs IBM is considering we're not privy to. A lot of PR has been moving in that direction, sensibly.\n\nEdward Popko's [Divided Spheres](http://www.dividedspheres.com/) is a great primer on spherical surface subdividing.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}