{
  "id": "4569290566669300339",
  "title": "Of Mind and Body",
  "published": "2013-07-21T06:59:00.001-07:00",
  "updated": "2013-07-30T20:44:02.648-07:00",
  "content": "I got in a long talk with David Koski after dinner last night.  Annual Session is still going strong (I made it to both Open Mic and most of Community Night -- in time to see the Friend in Residence juggle (he's professional grade, can do five balls etc.)).  Great to meet someone who reads my blog at dinner, a novelist (I think of my blog as \"like a Russian novel\" sometimes -- so many characters).\n\nA night or two before, I'd been watching [this interview of Mike Judge](http://www.youtube.com/watch?v=khTqmN2Lths) by Alex Jones, the guy behind Idiocracy ([the movie](http://worldgame.blogspot.com/2007/04/idiocracy-movie-review.html)) as well as King of the Hill and Beavis and Butthead (animations).\n\nI found talking to Koski to be the ultimate contrast.  He's still fired up, in a comic book kind of way, (flashing on Crumb) but it's about such cerebral material: vZome and Zome Tool, the upcoming Bridges, dissections of the enneacontahedron and the five rhombic dodecahedrons within (was it five?).\n\nHe's also enthralled with that Archimidean set of Eureka! ratios:  [the sphere and cone in the cylinder](http://mybizmo.blogspot.com/2010/08/tabor-walk.html), with volumes 4, 1, 6 respectively (cylinder = two \"tuna cans\" marked by the sphere's equator, each of volume 3).  I imagine the animation, veering off into colorful geometry as David holds forth, passionate, weaving together stories with heroes and villains, holding our attention.\n\nDavid had just finished reading [Me & Lee](http://www.meandlee.com/), after I turned him on to [Mary's Mosaic](http://controlroom.blogspot.com/2013/05/murder-mystery.html) (thanks to Lanahan). \n\nIn my science fiction (fantasies about some future), there's more walking between centers, hikes through the woods, more like [that Girl Scout Camp](http://worldgame.blogspot.com/2013/05/wqm-spring-2013.html) but even more spread out.  This helps with staying in shape and burning calories (as well as not concentrating too much power in any one \"lodge\" or \"HQS\").\n\nHere at Pacific University, I have but yards between vast quantities of food, and my dorm room.  It's almost as bad as at home, where I can waddle back and forth from mentoring to kitchen.  I think of ways to change the environment, such that I keep burning those joules at a higher rate.  Sharing the gym membership helps a little.  Having the second bike stolen added delays.  Food Not Bombs is healthy living.\n\nSpeaking of which, Lindsey got a workout [pulling those two trailers](https://network23.org/lindseywalker/2013/07/20/food-not-bombs-east-of-82nd/) (I've done that, but only one or two times and for less distance), helping to widen our radius.  This neighborhood had probably never heard of FNB.  Tomorrow the world (no wait, we've already got that covered -- only thinly).\n\nOK, time for breakfast.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}