{
  "id": "4370813542321194936",
  "title": "Office Work",
  "published": "2010-12-10T18:55:00.001-08:00",
  "updated": "2010-12-10T21:13:53.016-08:00",
  "content": "As I was complaining to Patrick:Today I'm regretting not taking you up on some summer time offer to pour trailer park slop on my upper deck, which needs a new sealant. I just went up and relaid the tarp, in the faint hope that'll help.  The ceiling in my office, in the meantime, is cracking along seams (latex paint layer).  The electrical tape solution was ugly and pointless (the glue melts when damp).  This surgical tape solution, porous to let the blood through, might be just the ticket for now...The bookkeeper's computer is rebooting at will.  I took it outside for a dusting, but there may be deeper damage.  It reboots even from within BIOS.  Maybe a hard disk transplant into another skeleton computer would solve the problem.  I'd have to dig one up somewhere.  That's also the network printer controller...My equipment is out of date, as is my domicile more generally (1905).  In some experimental prototype community of tomorrow, [a leading buckaneer](http://groups.yahoo.com/group/synergeo/message/63777) wouldn't be some [Wall-e in a junkyard](http://worldgame.blogspot.com/2008/06/wall-e-movie-review.html), all intelligent life on vacation (Orlando?).I'm glad mom is doing OK in average 70 degree weather ([Whittier](http://mybizmo.blogspot.com/2007/12/whittier-usa.html)).  Tara was gung ho to hit [the debate circuit](http://worldgame.blogspot.com/2010/12/judging-day.html) again this weekend, but her team (and coach) need their rest.I'd gladly upgrade the Blue House to meet Global U codes (and help define them), but that'd require some planning and organization, both of which are in short supply in this day and age, at least where [radical math teaching](http://groups.yahoo.com/group/synergeo/message/63780) is concerned.Walker took off after dark for a remote tool shop on the outskirts of town.  Why do everything nocturnally?  My senses reel.The Dead Mathematicians Society (DMS) has been suggesting I give a talk.  I just submitted a proposal.My attempt to do multi-threaded COM was successful, but [the code is quite \"mickey mouse\"](http://mail.python.org/pipermail/edu-sig/2010-December/010139.html) as my scuba instructor Gill Gilleland was wont to say -- exMarine, professional recovery diver.Mark Hammond himself dropped by on comp.lang.python on response to my query, wow.I made some baby steps forward with OST as well.Writing to Nirel:As individuals we're brilliant.  As teams working together, you'd think we could do more. Anyway, that's how it seems tonight -- thinking about teams.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}