{
  "id": "7468392565659718304",
  "title": "Old Feuds",
  "published": "2017-11-10T01:04:00.001-08:00",
  "updated": "2017-11-10T01:15:36.265-08:00",
  "content": "Buried in some distant past already, the prehistoric origins of Scientology, in science fiction writings by the same author.  A shift of gear, a change in tenor (or tense), and a new religion pitched a big tent, its founder a legend in his own time.\n\nAs cultural historians have shown, the culture was hungry for healing, having been through some bruising battles, literally as well as metaphysically.  Civil Rights were hard won, as we feel more acutely when the clock starts running backward.\n\nA core tenant of Scientology goes back to P.D. Ouspensky and others:  taking the negative charge off of memories takes Work.  Maurice Nicoll, a Jungian Scots following in O's footsteps, capitalized Work the same way.\n\nThen est came along and reiterated various practices, though certainly not auditing and e-meters and without the business model of a religion.  Many in the Scientology camp felt compelled to think in terms of a turf battle.  That's one of the old feuds.\n\nA hit piece against Erhard by mainstream media, somewhat baseless, showed that money and politics were hard at work, seeking to keep some trends in check.  Bucky was fighting alongside Erhard around then.  You might wanna dig into that story sometime, if curious. \n\nAnother feud is between the reverent and irreverent more generally.  As one who grew up reading MAD Magazine as an alternative to Meeting for Worship (I'd go both ways), the irreverence of the Church of the Subgenius was sure to resonate.\n\nI'm glad the Kickstarter project, to get the documentary out there, got funded.  I pledged my $30.\n\nAs these blogs disclose, I did volunteer work for the Centers Network around the time I enrolled in est, in my Princeton through St. Dominic years.  My friend Ray Simon was a big fan of Hubbard and Erhard both.  I've told that story.\n\nNot just the struggle for Civil Rights across \"races\" but across generations.  Did these adults who thought a certain way have the right to derail young lives by sending kids to fight in the jungles of Southeast Asia against their will?  What was the rationale?  To fight for freedom? \n\nMuhammad Ali shows up, along with Malcolm X and Father Divine, as a bridge figure, taking us closer to MLK's dream of a post-apartheid America. \n\nThe Jungians have their own leading towards pacifist strategies.  Unlike Quakerism, the Jungian tradition is more a profession than a religion.  These two strands intertwine nonetheless.  When I'm tempted to feed into religion, I'm reminded of my existing outlets.  Praise Bob.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}