{
  "id": "4676965706488063708",
  "title": "Omniversity",
  "published": "2009-09-02T18:58:00.000-07:00",
  "updated": "2011-10-08T19:55:01.232-07:00",
  "content": "I'm saying \"omniversity\" to poke fun a little, as it sounds like a Fullerism, something [a Dymaxion Clown](http://worldgame.blogspot.com/2008/11/ieee-presentation.html) might come up with, right in there with \"syntegrity\" and these other neologisms -- you know [the neighborhood](http://worldgame.blogspot.com/2005/12/omnitriangulating.html)?The idea of a global university, as another metaphor for Spaceship Earth, has its advantages, in terms of making Food Services into a problem for administrators.  If you're faculty, you'll have to teach about [why it's all broken](http://controlroom.blogspot.com/2006/05/general-systems-theory.html), for so many classmates, barred from their Commons.  Then there's all that Hogwartsy flavoring, a sort of lingering \"eu duh Britannia\", a quite charming and debonair perfume.Tag and I dropped by Wanderers somewhat impromptu, to find the assembled elders huddled over an Apple sampling \"white\", \"brown\" and \"pink\" noise respectively.  Some website.  Tag got us checking out Fulla, a fork off [the Barbie source code](http://mybizmo.blogspot.com/2009/01/playing-with-dolls.html), though toy world doesn't mirror geekdom 100% (FOSS means \"fart\" in Arabic, is another problem, though I've come back with \"stinker\" as a potential positive -- no way to avoid name collisions, up to the user to have namespaces handy).Today I journeyed through AAA world to [Nissan Nation](http://www.flickr.com/photos/17157315@N00/3881834057/), took my work / study gear, watched 'em take maxi taxi through two recall procedures, plus swap in a new starter (why she got towed, though she ran great [through DEQ](http://mybizmo.blogspot.com/2006/07/deq.html) yesterday).Tag has the brilliant idea to reawaken the Jeha ([or Juha](http://www.amazon.com/Tales-Juha-Classic-Humor-International/dp/156656641X)) literature, which connects nicely to [Trickster](http://mybizmo.blogspot.com/2008/06/summer-retreat-2008.html), Joker, [Coyote](http://worldgame.blogspot.com/2008/02/coyote-academy.html) and [Heyoka](http://en.wikipedia.org/wiki/Heyoka) literature over here.  We'll be able to dovetail our stories better.  I'd never heard of Jeha, whom you could compare with Scheherazade in some dimensions, in terms of there being a compendium of twisted tales.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}