{
  "id": "1226886485851531071",
  "title": "OMSI Science:  On Race",
  "published": "2012-10-09T02:08:00.000-07:00",
  "updated": "2013-10-07T23:51:06.961-07:00",
  "content": "[](http://www.flickr.com/photos/kirbyurner/8072654002/)\n\nThe two guest speakers were from Willamette University, where Alexia went for awhile, exploring options such as Japanese.\n\nThey've taught as a pair and bring different perspectives to the issue of 'race' and 'racism'.\n\nDr. Emily Drew is a sociologist and Dr. Chris Smith is a population biologist, more into the physical genetics rather than the ethnic constructs.\n\nEvery ethnicity has its idea of other ethnicities.  The \"race\" theme couples with US history pretty closely.  Study the history of the \"race\" concept in the Americas, and many doors will open.\n\nWe saw slides of an early census of 1790.  Are you (a) white free male (b) white free female (c) non-white free (d) slave?\n\nDr. Drew understood \"race\" in the ideological sense of supporting Ben Franklin's contention (apparently not satiric -- that would have been more Twain-like) that \"whites\" were [the top race](http://worldgame.blogspot.com/2005/02/methodist-morning.html), and that thinking in racial terms is mostly buying into a namespace that's been rigged to advantage some minorities / ethnicities more than others (it'd be hard to deny that). \n\nDr. Smith saw the genetic underpinnings of human differences, which map to geography really well.  He's suspicious of \"race\" though, because as a short-hand, the \"races\" are awkward pigeon-holes and could lead to making bad medical decisions.\n\nThe specific ideas we have about \"races\" (the stereotypes) are too often misleading to be very scientific though.  Like this idea that only blacks have sickle cell anemia -- an urban legend.  \n\n\"Race\" as a concept, is mostly partially overlapping urban legends, with enough truth in biological terms (people do differ, and you can trace DNA sequences in family trees), and enough inertia in socialogical terms, to keep it alive and kicking as a meme.\n\nActually, neither speaker used the term \"meme\".\n\nI've done lots of thinking and writing on this topic of \"race\" for many years, including recently, so I felt somewhat [party to the discussion](http://mathforum.org/kb/thread.jspa?threadID=2407857).  I didn't ask any questions though.\n\nSteve H. had not been to [an OMSI Science Pub](http://www.omsi.edu/node/3666) before.  He's of the Yorkshireman race.  I keep hoping to introduce him to Brian S. who bears some family resemblance, at least in terms of accent.\n\nAn older theory held that Homo Erectus gave rise to modern hominids in some linear then forking pattern, with the fork into races happening some millions of years ago.\n\nMore recent studies suggest an \"out of Africa\" migration only some hundreds of thousands of years ago.  These homo sapiens encountered other brands of hominid, including Neanderthal, which it now looks like may have been integrated into the \"new model\" (sapien) gene pool in some ways.  Dawn always thought so and would have loved this part of the talk. \n\nThe fact that indigenous Himilayans have genes for dealing with relatively low oxygen, similar to the way we have skin color genes based on the spectral challenges of our ancestral environment, suggests I might not be so far off base in my speculations that one day we'll have undersea hominds able to live more like dolphins.\n\nAt the very least, as people select for better skiing bodies, so may they select for better swimming bodies.\n\nOr maybe that's all too naive, now that there's some possibility of genetically engineering some changes, not waiting for natural selection to optimize the old slow way.\n\nOf course I don't get to know how it turns out from this perspective, as a 1958 - 20?? figure.  As mortals, we only get to pop up the periscope for a short period, assembling all the puzzle pieces we can.\n\nDefinitely we need to always do the detective work to figure out who stands to gain from one \"theory\" or another.  Real science should not inhibit \"follow the money\" style anthropology, a kind of investigative journalism with more philosophy, more distance.  Keep an eye on the agenda.  Does it involve \"white supremacy\" of some kind?  Not that only \"whites\" can be racist.  That meme virus is widespread.  The US is [a racist society](http://mybizmo.blogspot.com/2009/03/more-on-race.html) (according to the four criteria presented).\n\nI don't know how far back we should push any kind of maritime savvy, on the part of these hominds.  That's probably the kind of question I would have asked.  Did Homo Erectus ever take a ferry of any kind?  We hominids always walked a lot, but did we float, even navigate?\n\nRiding other animals (e.g. horses), when did that start?  At different times for different peoples. \n\nAn ethnicity may be defined in many respects in terms of how it casts and treats other animals, not just other human beings.\n\nOMSI has an exhibit on Race even now.  I feel I've probably seen it before, or maybe I just saw part of it.  Anyway, I'll be heading down there one of these days to check it out. \n\n[](http://www.flickr.com/photos/kirbyurner/10102256786/)\n\n\"races of man\" on a timeline \n\nat McMenamins E Broadway Brewpub",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}