{
  "id": "7290867796298715558",
  "title": "On a First Day",
  "published": "2019-04-07T09:57:00.001-07:00",
  "updated": "2019-04-07T10:10:41.015-07:00",
  "content": "The downstairs office doubles as a guest room for Carol, who is more than a guest (she's my mom), whereas the back room with all the telecommunications doubles as a guest room.  That leave's the daughters' bedroom upstairs, vacated by both, to serve as a full time office (there's no bed).  I feature it in my taxes, if that still matters.  It used to.\n\nSaid Carol wants to meet and greet an old friend moving to Portland, however her sleep schedule is such that making it to Multnomah Friends is far from easy.  At the moment, the jury is still out.  We've missed the main worship, which starts in four minutes, but then there's still social hour.  This is Meeting for Business day, meaning they'll be having a potluck.\n\nMy long term guest Lindsey, since departed and part time in Nepal, pioneered using the half finished basement as digs.  The telecomm office was leaking back then (literally), as you'll find out if you explore my Flickr album.  We both had our relationships with other people.  Having a floor between us worked well.  Later Jen moved into Carol's office.  She lives in LA.\n\nBoth Jen and Lindsey, and later Melody, were my housemates when Occupy rolled around.  I'd lived with several housemates in college, and afterwards. That Harrison Street resembled my previous lifestyle (e.g. 2 Dickinson Street, Princeton University) is perhaps not all that surprising.\n\nOur kitchen had long been a hub for Food Not Bombs, more for auxiliary storage than front lines prep (church kitchens are much bigger).  During Occupy, Melody and Lindsey help FNB establish a serving site, which later moved when all those paper plate and disposable utensil people showed up.  I never moved to a tent, and instead maintained my logistical role as a food deliverer.\n\nIf you've curious about the Occupy chapter, it's documented in detail from my unique perspective in these blogs.  As for the global phenomenon, I don't know that there was one.  Attempts to connect Arab Spring to what was happening on Wall Street, in Portland, in Syria... I wasn't one to see those as tightly connected.  I had my OPDX point of view.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}