{
  "id": "18224424122394995",
  "title": "On My Radar",
  "published": "2021-07-18T14:45:00.003-07:00",
  "updated": "2021-07-18T21:47:42.068-07:00",
  "content": "Yes, in claiming to have a \"radar\" (not really a claim, more semantic heritage, an allowed metaphor) I'm thinking of Krystal and Saager, whom have kept me company, unbeknownst to them of course, through a first chapter of Covid.  \n\nNorth Americans called it \"lockdown\" and I thought that too extreme, as in most zip codes we were free to move about, albeit with fewer places to go.  More a \"lockout\" in that we were kept out of businesses (bars and restaurants, libraries, anywhere \"inessential\").  Paris was more heavy handed than New York City by a long shot, or so was my impression.  \n\nSaager and Krystal were the stars of The Hill channel's Rising, and then moved on, rather recently, to start their own channel.\n\nYoutubers are the new rock stars, joining together and splitting up, just like the bands of old, and making music together, in duets, trios, perhaps in solo.  Hey, I'm one of them, way off in the weeds somewhere and barely looked at, given the esoteric content of what's on my shelf.\n\nI spent the morning gawking at the floods in Belgium-Austria-Germany along those major river basins, all swollen with torrential rains.  I'm also following societal meltdowns (ostensibly state failures) in South Africa (Durban especially), Cuba, Lebanon and of course Haiti, where a foreign mercenary force murdered a president.\n\nI'm watching Boomers and Millennials debate about who's to blame for the falling living standards, if that's what's in the cards.  I'm tracking TYT breaking away from anti-imperialist channels (Jimmy Dore's a flagship), in the ongoing oligarch-funded think tank wars.  I catch excerpts of Joe Rogan from time to time.  I tune in debates about Critical Race Theory.\n\nFor my day job, I continue hammering away at my example high school curriculum.  The feedback I got on NCTM Math Forum, at least from some corners, was the work that I do is terrible.  My detractors do not necessarily admire Jupyter Notebooks regardless of who is authoring them.  \n\nBut they also may have a beef about my content.  I keep hearkening back to a specific \"Zen garden sculpture\" (one of my names for it), a set of nested polyhedrons, almost a logo for a School of Thought (invisible college), with its own relationship to the various think tanks.\n\nBack in the day, I used to express worry about the \"cannibalization\" of Synergetics.  The cookbook Synergetic Stew had been disturbing on that score.  However as time went on, I came to see this sculpture (with moving mechanisms) as akin to a beating heart, which could be surgically disentangled from the rest of Synergetics and held aloft by an accomplished doctor.  I would try my hand in that role.\n\nI'd tell the Millennials that Boomers were too quick to dismiss the Bucky stuff, nor are most Millennials passing that torch to the GenZers.  How many does it take, to pass it on?  \n\nAnthropologists know the pattern:  grandparents (an older generation) bond with the grandkids (a younger generation) while working parents, the middle generation, stay focussed on their careers.  \n\nBoomers are looking back, GenZers ahead, with Millennials mired in their own fleeting now moment, on the treadmill (referring to the gym or to work), racing in the maze (the \"rat race\" we've called it).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}