{
  "id": "2276546244016770144",
  "title": "On Race Again",
  "published": "2017-01-30T16:24:00.000-08:00",
  "updated": "2017-01-30T16:35:27.012-08:00",
  "content": ":: stand-up philosophy by Wes Cecil ::\n\nWhat I wrote on Facebook: \n\nReally enjoyed this, because he's doing philosophy and standup comedy at\n the same time. Gets my attention. Yay, my discipline gets into the \nnightclub scene (reminds me of Tom Lehrer).\n... and in a follow-up comment:\n\nThe End of Racism by Dinesh D'Souza is pretty on target in arguing many anti-racists miss a golden opportunity in buying into \"race\" as a tenant of their own belief systems, such a foggy and ill-designed concept as Wes Cecil takes up in his mocking philosophy talk. However, given how deeply engrained is the thought pattern, I have to accept that most Americans (at least) are terminally racist (will take belief in races to their grave) and it will be up to future generations to look back and dissect these beliefs in a more clinical postmortem manner.\nBut then as some of my friends point out, Dinesh has gotten in trouble with the law, and was a big Trump supporter, anti-Hillary. So does that mean races are real?\n\nThanks for the update about D'Souza, got me checking his website too. \n\nI do believe in ethnicity as meaningful. I notice racists have a hard time naming the races. The idea of races pre-dates genetic science, which has only further undermined the idea. Certainly \"Anglo-Saxon\" is not a race. Or maybe some think it is, as there's really not much agreement on what the races are in the first place, assuming they exist for the sake of argument.\n[Quoting](http://grunch.net/synergetics/terms.html#race) from my Synergetics on the Web (1990s): \n\nWestern science originally portrayed race and class as characteristics \nof a person's blood which, as such, could be subdivided in proportion to\n a person's ancestry, \"blood\" being treated as a mathematical quantity, \ncontributed in equal proportions by one's parents. Hence such terms as \n\"octamaroon\" (one eighth black). Whereas \"class\" is no longer regarded \nas a genetic entity, \"race\" has remained a popular concept for grouping \ngenetic characteristics, even if the link to blood is no longer made. \nLike anthropologist Ashley Montague, Fuller felt the concept of \"race\" \nhad outlived its usefulness, that the cross-breeding of the world's \npeople, especially evident in North America, was exposing the old racial\n categories as mere snap-shots of genetic traits thrown together by the \nexigencies of time, but available in any number of permutations from \nthat vast grab bag of traits known as the human gene pool. In the Fuller\n lexicon, a racist is perhaps most straightfowardly defined as someone who believes in races.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}