{
  "id": "794718857537102575",
  "title": "On Saying More with Less",
  "published": "2018-09-07T12:02:00.002-07:00",
  "updated": "2018-09-08T00:12:34.313-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/43634729695/in/dateposted-public/)\n\nI hiked up Mt. Tabor this morning, which sounds impressive, however I might have used the word \"stroll\".  Some steep parts.  I almost turned around at the Narnia Lamp Post, but then decided to press on.\n\nComing down, I came across some interesting construction site activities involving a crane lifting heavy objects onto a flatbed truck.  I paused to take pictures.\n\nWhat was going through my mind a lot was how I could write some new essay on Medium about Wittgenstein's philosophy of mathematics and quadrays, a coordinate system apparatus I've been yakking about since the 1990s.\n\nHowever, around noon, before beginning said essay, I did a quick search and found these two postings, both with hyperlinks of their own:\n\n[On Ludwig Wittgenstein's Contribution to a Pragmatic Philosophy](http://www.grunch.net/synergetics/lw.html) (April 3, 1997)\n\n[Investigations into the Linear Algebra Concepts used in the XYZ and Quadray Language Games](http://www.grunch.net/synergetics/quadphil.html) (November 20, 1997 Last updated: October 1, 2005)\n\nWow, that's a lot of what I'd planned to write today.  Do I really need to write it all again?  Probably not.\n\nA better use of my time might be to hack in to those ancient web pages and add some new hyperlinks to them, to more recent writings.\n\nI found my materials using Google, just searching on Synergetics Wittgenstein as my two keywords.\n\n[Ravasio](http://controlroom.blogspot.com/2018/09/close-encounters.html) writes in her autobiography about finding out these high tuition schools for which loans are needed, not bothering to share [New England Transcendentalism](https://medium.com/@kirbyurner/american-literature-101-224489c26f19) in the form of the Fuller corpus.  The math goes there too.\n\nAcademia will learn to \"get off it\" with the Bucky stuff, or it won't.  I'm thinking I won't lift a finger, as I want to see wheels turn without my input.  My goal is to publish less, not more.  Time to [wrap it up](http://controlroom.blogspot.com/2018/08/archiving-stuff.html).\n\nSure, I'd help as a consultant on the 3D movies about the Concentric Hierarchy etc., but for those to happen, the Global U would need to strengthen its curriculum.  There's a chicken and egg vicious circle here, or maybe a \"down the drain\" vortex? Time will tell.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}