{
  "id": "114392531418522847",
  "title": "Once There Was...",
  "published": "2006-04-01T13:41:00.000-08:00",
  "updated": "2006-11-15T11:43:55.037-08:00",
  "content": "I had the distinct privilege last night of being one of the chosen few to see Johnny Stallings in action, in a play of his own devising.A loner with a penchant for books develops a local reputation for being the wise old hermit. A younger man, well played by Rollin Carlson, beset with the usual questions about reality and finding one's way in life, seeks him out, hoping to gain some wisdom.Dialogue ensues, plus mundane eating, drinking, shaving, sleeping, reading -- and watching projected videos, which may be accepted as metaphoric for the inner life of either character (the hermit reads Harlequin type romances for kicks, along with the more intellectual books, which is the only time we venture into R-rated material).The venue was intimate, with three rows of chairs (stepped, visibility not a problem), maybe 12-15 across in each row, and pretty much full for this penultimate Friday night performance (tonight is the last gig of this run).The set consisted of four principal stations: an outdoor bench, back to the audience; the eating and drinking table; the hermit's sleeping space; and a cooking and shaving spot. The small theater restroom was actually used as such in one scene, while the back of the garage door (not designed to open these days) completed this intimate model of Plato's Cave.The piece is clearly autobiographical in some respects (the hermit makes an income as an actor part time, sometimes playing [all parts in King Lear](http://worldgame.blogspot.com/2004/10/king-lear-play-review.html)) which is why it was such a joy to see Stallings himself act his character (some of his stories are likewise nested and/or recursive).The script involves any number of outlandish stories, with the loner breaking the ice and the visitor-guest gradually catching on, getting more comfortable, helping himself to the food (while offering to be useful).The loner is clearly amused by this visit, but isn't attached to it going longer. He does work hard at supplying useful teachings, doesn't shirk his duty as the older and wiser gent. The storytelling provided a useful framework for getting to know his customer -- I'd say the loner made very efficient use of his time, even while claiming to be \"doing nothing\" for a living.It's not clear from the ending if the visitor ever leaves (in one of the embedded stories, the acolyte never does), but one presumes he probably does after awhile.Relevant:[Oregon  Live review](http://www.oregonlive.com/entertainment/oregonian/index.ssf?/base/entertainment/1142042167108650.xml&coll=7), by Richard Wattenberg, March 13, 2006.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}