{
  "id": "46657342896265251",
  "title": "One Wonders...",
  "published": "2022-06-16T17:33:00.002-07:00",
  "updated": "2022-06-16T17:39:24.619-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhWffD3no8a9Q3PzBCVoQchjMAW9DQfnpjKbPSo25cuZJOJPMSvUfM-VITHjN4VkzfsFEnnIr9-emquViY6BtCzB6xa60VEWKJdpkLsFi_4Z_F_1a6raOknRU1BQxsHb_YbeY39meMmxiZvr4ROExBpI7p4L5Lh7Fz0so0mfxp_AsVZG0F-YQ/s1286/trimtab_s3.jpg)One wonders at how alike are Elon and Donald (Musk and Trump respectively).  Neither comes across as brilliant in any conventional sense.  They're both intuitive weirdos, channeling the Zeitgeist, telling powerful echo chambers what those chambers most want to hear echoed.  They're like sonar.\n\nOne wonders how far the Hillary camp was planning to push Russia as a scapegoat, even if she had won the election.  Ukraine has been seen as a top prize by New American Century types for awhile. \n\nThe FBI, having helped their queen win, would have proved unaccountable and could have smeared Trump with Russiagate lies ala British intelligence indefinitely, either way, just to make an example out of what happens to upstarts.  The CIA, in the meantime, was quick to inform the Russians what was going on (according to some officers, not necessarily chief ones).\n\nI got the sense at a pre-covid OSCON that Cal Tech California engineers were lining up to blame Russia somehow, for any grid problems, including fires.  We were supposed to forever buy a brand of science fiction, based around CrowdStrike type narratives, wherein hidden actors performed as gremlins, worse then elves.\n\nI think the public sees through these shams faster than supposedly clever people can concoct their new prevarications.   Bottom line: we're getting the point where if lying and fooling the public is a big part of your long term strategy, your people will start to bail, because other gigs won't ask that of them, even if the payoff is less in the short term.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}