{
  "id": "6758470411493950365",
  "title": "Open Bastion News",
  "published": "2015-05-04T20:55:00.002-07:00",
  "updated": "2015-05-05T07:20:50.575-07:00",
  "content": ":: [secret society party](http://worldgame.blogspot.com/2011/02/open-secrets.html) ::\n\nHaving relocated here in 2011, Steve Holden is heading back to his native British Isles.  We'll see more of him.  He's load balancing.  That means moving a giant couch down three flights and up two, through twisted topologies.  Like City Museum, St. Louis.  Did it make me smarter?\n\nHe grew up sampling Oriental food, lets call it for fun, including Pakistani, any \"ani\" (Hindustani), in that catch-all.  So Dwaraka has always been a comfort, food from home.  We stuffed ourselves there tonight.\n\nT-minus only a few hours until departure.\n\nI spun up a dyno in Heroku yesterday, with Django both in the cloud and local platform, git going back and forth.  The tutorial walks you through it.  Connect that to this simple model and the API below, and you get the idea (an RFP in the making).\n\nGood job Lew adding that picture of the ESI chapter in meeting house history.  I got to the meetinghouse without taking Claratin first, and paid a high price in terms of sneezing.\n\n:: hanging in Stark Street meeting house, formerly ESI :: \n\nSteve produced quite a few successful conferences.  Djangocons.  Apachecons.  These are not all that easy to pull together and destination hotels appreciate those with a magic touch.   I got to watch over Steve's shoulder on a few of these and learned a lot about that territory.  Steve relied a lot on an Orlando based team for logistics.\n\nI'll be keeping souvenirs from the Open Bastion, which had offices in the same complex and served as summer work for Tara among others.  Steve gave a lot of people interesting rolls, the hallmark of an effective community organizer, geekdom being a community of sorts, if Middle Earth was.  Not always that friendly.\n\nI'm still processing my experiences at the USDLA conference, and my excursion through Earlham.  Future posts will be referring back to those recent times.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}