{
  "id": "7846537129780481643",
  "title": "Opting Out in Cascadia",
  "published": "2019-06-19T00:08:00.000-07:00",
  "updated": "2019-06-19T01:15:31.427-07:00",
  "content": "I get around to talking about the BDS campaign versus Iran, eventually.\n\nI'm not some official ambassador from Cascadia.  I'm merely voicing my view that the population sample I'm in touch with is not at all on board with any kind of war against Persia.\n\nOn the contrary, Portland and Shiraz have been looking at becoming sister cities.  That conversation continues, as far as I know.\n\nWe have some real history with Iran, in terms of personnel.  I'm thinking of [Peace House](https://controlroom.blogspot.com/2013/02/report-from-afghanistan.html) in particular.\n\nSomehow the \"BDS\" meme got hijacked to where some people think it has to mean something [relating to Israel](https://controlroom.blogspot.com/2005/12/thinking-globally.html).  I don't deny that some activists, based on perceived success in South Africa, in moving us beyond Apartheid, tried a similar strategy with regard to some Israeli companies.\n\nAlthough I worked for AFSC in [some chapters](https://worldgame.blogspot.com/2007/05/more-basement-archeology.html), I never stopped buying from Hewlett-Packard (big into biometrics used for border policing).  That's because I don't have time to do the research, and I'm just the one guy.  No one cares what I do.  Even I don't that much.\n\nHowever, the practice of BDS against Iran, Venezuela, Russia, is pretty virulent, and hypocritically sustained, even while Israel loudly proclaims it's somehow a primary victim.  That's not believable.\n\nSanctions against Iran, with the threat of pre-emptive attack based on some flimsy shim-sham reasoning (cite the attack on Iraq, or Gulf of Tonkin), vastly outstrip, in scale, the tiny boycotts here and there, of miscellaneous goods from the squatter settlements.\n\nMy angle on Gaza is let's evacuate the place.  Rich people want the beach front property and don't care how many die to free up the real estate.\n\n[Remember that ghetto](http://www.addictedtowar.com/docs/panama.htm) in Panama the Apache helicopters went after?  I presume that was likewise all about land values, clearing out the slums in a demonstration of lethality.\n\nHumans are in the way. Nothing to do with nations or religions.  Everything to do with having fat bank accounts and a nice place in which to retire.  Caracas and Panama both look appealing, in addition to the Gaza strip.  More Miamis.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}