{
  "id": "872662095178353084",
  "title": "Oregon History and Steam Power",
  "published": "2015-01-06T06:57:00.002-08:00",
  "updated": "2020-08-11T12:22:44.494-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157649745018668)\n\nDr. Carl Abbott of PSU's urban studies program delivered a next-in-series presentation on Oregon's history at McMenamin's Kennedy School last night.  The theater was packed with some standing or sitting on the floor.  People were eager to learn this information, which is not usually shared on television.  The [Oregon Encyclopedia](http://www.oregonencyclopedia.org/) and [Oregon Historical Society](http://www.ohs.org/) are sponsoring this ongoing series of talks. \n\nRiver boats helped network and grow the cities and towns together along the Willamette and Columbia Rivers, and Portland came into the foreground early as a port city.  St. Helens was an early rival, as was Astoria, and even Milwaukie.\n\nHowever the plank road out to Washington County and a newspaper gave the city its sustenance and identity.  Milwaukie had the shallow sandbars around Ross Island to contend with and Astoria was still too far from the inland action.\n\nTrains supplied the next layer of infrastructure, replacing wagon trains.  At the local level this helped economies like Hood River's as trains now hauled produce from that ecology's lush orchards.\n\nPortland joined the transcontinental network with much fanfare (parades and speeches) in the mid 1800s.  The city far outgrew the others in the state and only now in 2015 are we seeing some signs of better balance, with Portland still the biggest, but not dwarfing the others so completely.\n\nCarl did not have time to explore the road networks in detail, nor the building of [the dams](http://worldgame.blogspot.com/2009/01/columbia-gorge-recent-history.html) and [the consequences of electricity](http://controlroom.blogspot.com/2007/08/ieee-picnic.html) for the region.  He was looking mostly at 1850-1950 whereas Oregon's importance as an electrical power source was a story for later.  Aluminum factories and later server farms would take advantage, with California plugging in [via HVDC](http://worldgame.blogspot.com/2014/10/recent-meetups-in-portland.html).\n\n[Sam Hill](http://controlroom.blogspot.com/2008/08/escaping-light-pollution.html) features in the road building story, as does [Columbia Gorge](http://worldgame.blogspot.com/2010/08/source-to-sea-columbia-river-swim-movie.html) tourism, photographers especially, which Carl alluded to in his \"weekend corner\" description of a scenic area suitable for weekend drives.  Carl did mention Les Schwab and his signature chain of vehicle maintenance facilities.\n\nThe audience asked lots of questions.  I attended with Denny, a member of Multnomah Meeting, like Carl is, resuming his life in Portland after a stint in Shanghai.   Many other Quakers were there as well.\n\nCarl\n tells me Dan Pope from the U of Oregon will be covering more of [the Silicon Forest chapter](http://controlroom.blogspot.com/2009/05/silicon-forest-origins.html).  They're doing a chronological series and Carl \nwas doing mostly steam and some fossil fuel, with electricity to follow.\n  I have a standing engagement first Mondays with Dr. Bolton, also of \nPSU (emeritus) so may not make another of these.  I'm glad I at least \ngot to this one.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}