{
  "id": "7510314326788024350",
  "title": "OSCON (Tutorials Day 2)",
  "published": "2014-07-21T09:47:00.002-07:00",
  "updated": "2020-06-27T12:11:40.563-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/14691146026/)\n\nNotes from [Playing Chess with Companies](http://www.oscon.com/oscon2014/public/schedule/detail/34642) by Simon Wardley.\n\nEveryone brings their biases to OSCON and I'm not talking about prejudicial bigotries towards specific genders or ethnicities, I'm talking about special interests.  I'm in Playing Chess with Companies this morning.  A Leading Edge Forum (CSC) guy is leading us.  He likes data, and kitten pictures.  How do companies play chess?  Many just fly blind, neglect mapping, hence this workshop. [#Gamefication](http://coffeeshopsnet.blogspot.com/2009/11/meetup-on-games.html) would be a tag for this talk.\n\nMost companies forget about the \"why?\" of their strategy beyond imitating others they admire.  Companies you should emulate, like Kodak and Atari (he's showing some old book titles).  The premise: if X does A and succeeds, then you Y, if you do A, will succeed.  He's reading his slide, but in this case that's smart as he's mocking the jargon, generating business-ese much as that paper-writer does works in postmodernism.  [Funny](http://www.atrixnet.com/bs-generator.html).\n\nAs I was saying... biases.  For example, I come from a medical research background, not as a researcher, but as a data harverster, cleaner and storer, a collector or curator one might say.  That's akin to the medical records problem, however our needs were aggregate / statistical and so could be shared in a more \"anonymized\" form as case histories.\n\nDiagramming by value chain gives way to diagramming an evolutionary path i.e. the value chain is evolving in what it looks like, what it produces.  Stacey Matrix:  the axes are close and far from certainty.  Ubiquity and Certainty increase from genesis through \"as a service\" with competition a prime driver, in both demand and supply. Practices co-evolve as well:  Novel, Emergent, Good, Best.\n\nThe Air Force FIST mantra is akin to the Unix philosophy: have many simple components that do their jobs well and in an intelligent / intelligible manner.  Value chains with an evolutionary curve provide the strategy maps.  Scenario planning, comparison, communication:  these are among the benefits of value adding over time, assuming evolution from genesis (birth) to maturity (automaticity).  Red Queen effect:  the needing to evolve just to stand still relative to the surrounding ecosystem.\n\nInertia builds up owing to past success, then comes the punctuated equilibrium and a time of war, then new wonders.  [Kondratieff Curves](http://www.financialsense.com/contributors/christopher-quigley/kondratieff-waves-and-the-greater-depression-of-2013-2020) again -- I learned about those from other futurists.\n\nGood speaker in that he recaps his slides, lets them appear again and again at different speeds.  Very effective.  Five stars for this guy.  He worked for Ubuntu in 2008, hired by [Mark Shuttleworth](http://worldgame.blogspot.com/2006/04/at-summit.html).  Makes sense.  It was Canonical versus RedHat in some ways.  Ubuntu is now huge in the cloud.\n\nOpening versus Patenting to speed up or slow down.  FUD also slows (negative feedback, \"demonization\" or raising concerns about a future model).\n\nA bias here is we want everything invisible to become visible:  not true.  They try to sell us wars we don't want so sometimes applying the brakes is a valuable technique.  But brakes over here == rapid innovation over there.  Obsoleting war in its conventional outward forms, in favor of a more psychological dynamic (more inward) might be considered a Quaker goal, providing a \"why?\" motivation for our [Countdown to Zero](http://controlroom.blogspot.com/2010/12/countdown-to-zero-game.html) actions.\n\nInnovate, Leverage, Commoditize:  Amazon's EC2 catalyzes the genesis of Big Data in the custom built zone, which enables Amazon to fast-follow the early adopters with a Big Data EC2.  That's like hitching your star to value adding \"geniuses\" (the genesis minded).\n\nI'm sold on the idea that box and wire diagrams are far less informative.  User Need versus Supplier Need is something I still need to wrap my head around.  You can easily mess up your map if you don't know how to draw one.  A spectrum: Agile in-house, Six Sigma commoditized outsourced. \n\nFor a workshop exercise we mapped a Tea Shop, which at our table was like the Starbucks of tea shops, a Tea Shops Network complete with LCDs sharing inspirational programming.  One of my table mates is Mormon and doesn't drink caffeinated beverages, but herbal teas are OK -- but not if derived from a black tea base, as these Choice organic tea infusions seem to be.\n\n[CSC](http://worldgame.blogspot.com/2013/08/visiting-open-bastion.html) seems to downplay its Computer Sciences Corporation moniker (I'm just poking around the websites).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}