{
  "id": "4905560639640947275",
  "title": "OSCON 2018",
  "published": "2018-07-16T08:23:00.001-07:00",
  "updated": "2018-07-19T20:32:27.664-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/42553705485/in/dateposted-public/)\n\nI'm with my flock (geekonius) having strong coffee in the convention center, badge around my neck, awaiting a tutorial.  Open Source Convention is a no nonsense affair, a well oiled machine, thanks to California showbiz, meaning the event logistics business, Sebastopol a hallmark.  I refer of course to O'Reilly, a former company of employment, though I wasn't working in the home office.  That was some years back, when an experimental code school tested the waters, toe in the pool.  Quite the shark tank, we found out (long story).\n\nO'Reilly was prescient, even when we closed (not for lack of business, let me tell you), in seeing Jupyter Notebooks would be big, which they are.  However I don't think any of us were envisioning the hype around DL / ML would take off the way it did.  That's Deep Learning / Machine Learning. In fact, my upcoming tutorial is on TensorFlow, with which I'm a white belt.  I've been working out over in scikit-learn and feel ready to set foot in this Dojo.\n\nThe school was originally established to teach calculus, spinning off from Dr. Jerry Uhl's operation, University of Illinois. However that turned out to be a rather esoteric business in the midwest and the dream of California induced a morphification into the new code school, with calculus still in the picture, and indeed a whole university.  However establishing a new ee-dee-yu (edu) from scratch is way harder than creating a dot com.  Try creating a new dot gov for a sense of what it's like.  Speaking of which, O'Reilly did inspire memes in government.  I went to a GOSCON right here in Portland in fact.  You'll still find Ignite Syllabus and such, based on our Lightning Talk format.\n\nI joined the school after all this change was well under way.  Although I never got to meet Jerry Uhl, I felt initiated into the world of Champaign-Urbana, home office for Wolfram, with which the school had at first been intimately connected (during the calculus chapter, with Mathematica the workout bench).\n\nMy registration came with a bus pass.  I live in Portland, so this is one of the conferences I hope to get to, as a way of upgrading / updating my state of the art.  Pycon was here for two years, a blessing as well.  Pycon roves around whereas OSCON moves far less frequently, in terms of venue.  In the meantime, Portland has been changing a lot itself, becoming more a jewel of the Pacific Rim. We have a cable car now, an overhead tram.  Compared to the ones in Switzerland, its trajectory is approximately horizontal.  However that's still a legitimate use of the technology.  We have a hospital complex on the upper end.  Portland is about health care, as well as free software (free as in freedom).\n\nSpeaking of Pycon, I shared [the headline news](http://worldgame.blogspot.com/2018/07/headline-news.html) in my other blog about the transition in power within the PSF, the intellectual property owner for Python and its trademarks.   Guido announced he was taking a vacation from his role as BDFL (Benevolent Dictator for Life), deliberately creating a power vacuum.  He's feeling pretty confidant about the future of the Python language and wants to spark more creative ferment in governance.  Dictators rarely have an exit strategy.  We're grateful to Guido for having one (part of his being benevolent).  He's not giving up being influential.  He has the juice, or what we Quakers call \"weightiness\" (a metaphysical attribute not connected to literal poundage).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}