{
  "id": "3320052848314138488",
  "title": "OSCON 2011 Continues",
  "published": "2011-07-27T10:57:00.000-07:00",
  "updated": "2013-03-14T17:16:14.875-07:00",
  "content": "No bizmos at OSCON [this year](http://worldgame.blogspot.com/2005/08/oscon-day-2-wanderers.html).  Maybe someday we'll get one into the exhibit hall, a small version, but an open source one (open hardware, not just software).\n\nThe keynotes today were somewhat ironic, with Microsoft seeing the cloud as another \"commercial software\" environment, with Windows Azure the latest back end.  \n\nThe announcement that it supports PHP, other open source, was perhaps underwhelming, somewhat like announcing a car with an \"ignition key\" as a feature.  \n\nThe next public splash came from Nebula, with the CEO whipping up enthusiasm for and industry-supported convergence of [OpenStack](http://openstack.org/) and [OpenCompute](http://opencompute.org/).  The goal:  generic cloud services built with open hardware and software at the core.  Was it a coincidence that Al Gore appeared in the promo, and a forklift was used as a prop to wheel out a rack?\n\nF151 was a deep silo discussion of CONNECT and Aurion, presented by the Alembic Foundation. CONNECT is a project to facilitate the exchange of medical information (HIE).  Hey, the guy said \"default\" -- that's the first time I've heard anyone mention the WDC-based soap opera going on these days.  It's buzz word city in here.  Not clear to me Lower48 are where it's happening these days, where electronic medical data is concerned.  Too bureaucratized, even though we're talking big money. Count me a skeptic.\n\nChairman Steve gave awarded [the Frank Willison award](http://www.oscon.com/oscon2011/public/schedule/detail/21310) to Georg Brandl.  I brought Naga, the PSF Snake, on the Max.  After the keynotes she went straight to [the DemocracyLab booth](http://www.flickr.com/photos/17157315@N00/5987657253/in/set-72157627166240377), remembering Deb Bryant (she's on Mark's board).  The Perl Foundation was immediately adjacent, so she next jumped over there and gave [a ride to the camel](http://www.flickr.com/photos/17157315@N00/5988220546/in/set-72157627166240377/).  Chairman Steve has [a debate later](http://controlroom.blogspot.com/2011/07/perl-world.html) with one of the Perl avatars.  Both write curriculum for O'Reilly School of Technology, so it's somewhat a punch and judy show.  We're all family here.\n\nThe talk on NORC's study, done for the US Congress, on open source EHR systems used in safety-net health-care clinics (so-called) was illuminating.  The clinics tend to get more deeply into using their systems as a function of both needing and wanting to customize them.\n\nR0ml took up the topic of internationalizing source code, one of my pets.  He conceded at the beginning, somewhat sarcastically, that \"everyone should learn English\", satirizing the predominant Anglo imperialism (paradigm).  He used Portuguese as an example of another source code language for Python.  I already know from chatting with my Brazilian friends that top-level names, minus keywords, built-ins and standard library, are already in Portuguese in many a Python program.  \n\nI introduced R0ml to [Henrique](http://controlroom.blogspot.com/2013/03/pycon-2013.html) in the Expo Hall later.  I also went back to the Perl booth where Michael of Food Not Bombs was hanging out.  Mention of FNB brought up an interesting opportunity to compare notes, as the Perl guys were from Orlando.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}