{
  "id": "7781067909901009557",
  "title": "OSCON 2015:  Wrap Up",
  "published": "2015-07-24T11:20:00.000-07:00",
  "updated": "2015-07-27T14:49:19.581-07:00",
  "content": "Buying the keynotes and talks as a post production recording actually costs money, as a way to recoup, so if you find a vintage year (they're all vintage) for cheap, say at Good Will, you'll know it's a good buy.  We also stream live, so if you time your life to watch the keynotes, they're available for a window.  OSCONs provide telling snapshots of the swiftly evolving IT world from year to year.\n\nNow I'm back in a second floor ballroom, Oregon Convention Center.  TriMet is doing maintenance today, on the Max track itself by the look of it.  I came on the Hawthorne bus (14) through downtown and switched to Max, getting as far as just over the Steel Bridge, Memorial Colosseum area.  The walk from there is quite short, plus shuttle buses were provided (I walked).\n\nSo did you see George Dyson, historian, talking about Imitation Game?  He wanted to remind us that Turing was very much a team player and quite popular with his group, not uncomfortable around women or socially awkward in the ways depicted.  In other words, he was not the endearing dweeb played by a good actor, a character more of the movie-makers' invention.  The movie never claimed to be a documentary right?  People need to be reminded about genre.\n\nThe Uber geek, Raffi Krikorian, a polished speaker, wanted us to understand how \"choosing your team\" is \"choosing your architecture\" in large degree, if only implicitly.  Engineers use the tools they know best.  So build eclectic full stack teams, and keep them smaller (two pizza rule) rather then letting them grow out of control.\n\nThat's the way to manage teams: around micro-services, the wave of the present-future, now that so-called monoliths have been tried and understood.  That's not to say \"no more monoliths\" only that if others want to use your monolith, they'll probably want it containerized within the cloud.\n\nAs any geek will tell ya, the philosophy of doing one thing and doing it well is baked into GNU and before that Unix, so micro-services is less a new dogma than data centers hitting their groove, finding a scale at which the concepts apply.\n\n\"Interoperability\" will keep coming back as a buzzword.\n\nFinally, for a last keynote of the morning session, we enjoyed a retrospective of milestones passed, by a precocious thirteen year old girl from LA.  She gave us the benefit of some wisdom, about not judging a container by its color, as well as a peak into her busy inner life.  She'll have a resume to die for at this rate... already does.\n\nI've come to a final talk entitled:  A centralized team in a decentralized world:  Engineering tools at Netflix by Mike McGarr (@SonOfGarr).  He presents clearly and memorably.  Recommended (if you find OSCON 2015 for sale some place).\n\nJust like an airplane experiences thrust versus drag, lift versus weight, engineering tools give us  innovation versus change, customers (like lift), the need for support (weight).\n\nCustomers, in this scenario, are Netflix engineers.  [Netflix sits on Amazon](http://aws.amazon.com/solutions/case-studies/netflix/) a lot, Asgard being one of the open source tools it supports, watch for Spinnaker.\n\nNetflix has its own culture (Freedom & Responsibility):  senior engineers, high trust, context not control.  Somewhat like doctors in a practice I imagine.  Highly aligned to business goals, yet loosely coupled, the teams get behind microservices just like that Uber guy said.  This leads to strong subcultures within the organization, reflected in hiring.\n\nEchoing Amber, software engineers need to give undivided attention to coding on occasion.  That means rotation in setting a watchman.  Let someone monitor feedback letting the others bliss out.  Not having a ticketing system was a weakness.  My workplace uses JIRA.\n\nAll this thinking aobut Netflix gets me thinking about \"hypertoons\" again, polyhedrons of scenarios (as edges) with switch points (nodes).  The nodes are smooth segues and switch points.  Player heads navigate the hypertoon, feeding [the reveries on CSN LCDs](http://coffeeshopsnet.blogspot.com/2010/04/smart-bar-lcds.html), and elsewhere.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}