{
  "id": "5562488145713412487",
  "title": "OSCON Day Two",
  "published": "2012-07-19T11:05:00.001-07:00",
  "updated": "2012-07-19T20:00:25.384-07:00",
  "content": "Steve and I left the car on Senate Street and Maxed it, arriving before the doors opened.  O'Reilly knows attendance at an early morning plenary will be down the 2nd day, so the walls were rolled in, curtailing the space, yet still it was huge, bigger than many churches, if not cathedrals.  Yet here we were, the bazaar economy.\n\nMark Shuttleworth did the best keynote in the sense of most technical, introducing Juju and the direction Canonical has taken with their new desktop.  I went up to him during Office Hours (an Expo Hall service) and thanked him for the boost he gave to curriculum writing / programming, including mine.  The opportunity to hang out [with Alan Kay](http://worldgame.blogspot.com/2006/04/at-summit.html), Guido etc., in person, for [three days in Kensington](http://worldgame.blogspot.com/2006/04/home-to-pdx.html), was fantastic.  That was some years ago.  He again mentioned his early fascination with Smalltalk based Squeak as a trailblazer environment.\n\nThe Cloud business is an evolved reiteration of the ISP business, with customers wanting more control over what's on their servers.  Juju is about porting ecosystems of connected applications between systems and designing their API interconnections using \"charms\".\n\nMy Quakers have converged at annual session by this time.  Although [I'm an AFSC rep](http://worldgame.blogspot.com/2011/10/thinking-about-afsc.html), I'm leaving it to Eddy Crouch to run the interest group and help manage the NPYM / AFSC interface.  Getting more Quaker services into the Cloud, education-related, sounds like an interesting project.  That might just mean a bookstore, branching out into access to archives.  History, timelines, biographies, scanned minutes, records, journals... a kind of archive.org for Quakers?  New branches could start an instance this way, by customizing templates.  New classes of Friend... (in the sense of types or species)... we shall see.\n\nI'm in HP's sponsored talk on its Cloud services at the moment.  They've moved into the data center business more, following Amazon and others.\n\nThe Facebook keynote was also good.  The fact that so much hardware is still closed design has led to the same basic wheels being re-invented over and over with lots of incompatible variations.  Secrecy begets duplication and meaningless resource-wasting inconsistencies, such as train tracks with different gauges.\n\nOpenStack on the software side has its parallel initiatives on the hardware side.  Facebook is supporting that.  Standardizations begets savings.  It's the old pendulum, between a tightly knit civilization and a more every-man-for-himself Wild West kind of place.  Oscillations occur.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}