{
  "id": "241796708988700884",
  "title": "Our Hero Mr. Ed",
  "published": "2012-04-25T14:05:00.000-07:00",
  "updated": "2016-03-13T19:25:38.827-07:00",
  "content": "We were inner circle among inner circle last night at [Jack London Bar](http://www.facebook.com/JackLondonBar), a bar beneath a bar near 4th and Alder downtown.  Gus Frederick of Silverton was giving a far more refined and fleshed out talk regarding [the Homer Davenport scenario](http://www.ochcom.org/davenport/), beginning with his mystical mother, who had premonitions of his genius as a future cartoonist (and died when he was 3), followed by a succession of Gump-like events, except this guy was more bell curved another way.\n\nIn these circles, animals besides humans are held in high esteem.  We don't just appreciate our pets, they're family sometimes.  Such was Homer about chickens (fighting cocks especially) and horses (Arabians above all others).  They ran his life, one could say, and helped give him material, as the non-human world is a constant satire regarding our own.  Such an animist was the world's most highly paid political cartoonist at one point, a Hearst figurehead and friend.\n\nWhat is the statue of the girl on the bow of old pirate ships called? \n\nThe statutes very from ship to ship, but general its just called a figureheads. Thank you for using ChaCha!\n    Answered\n\n         by [Jeanette F.](http://www.chacha.com/guide/mommanette)\n\n     - 304 days ago at 6:14pm on Jun 25 2011\nHomer was one of the cool people, in [with Mark Twain](http://mathforum.org/kb/message.jspa?messageID=7804834), who thought the aggressive thrust against the Filipinos, later repeated in Vietnam, was vicious and stupid.  America is home to a lower strain that expresses itself through naked imperialism.  These lowlife way over-compensate for their inferiority complex, and we all pay the price.\n\nHe also was friends with Theodore Roosevelt, having helped get him elected with some memorable cartoons. TR lent enthusiastic support to Homer's dreams of important Arabian stallions to North America, and in this exercise he succeeded.  Homer was personable, affable, befriendable, and became the toast of the Bedouin during his stay with them.  Upon this basis, Oregon continues to build a diplomatic safe corridor, uninterrupted by the forces of disquiet and [shallow discord](http://mybizmo.blogspot.com/2006/02/islamic-cartoons.html) (not to be confused with Deep Discord and primeval chaos, which has been discovered to be innate and [protective](http://controlroom.blogspot.com/2012/04/exit-through-gift-shop.html)).\n\n[Mr. Ed the TV star horse](http://www.youtube.com/watch?v=y_PZPpWTRTU), was a direct descendent from one of these imported Arabians, on his mom's or dad's side I forget which, the slides will tell. {Mom's side, from Wadduda].\n\nGus's talk was scholarly, entertaining and well researched.  Another storyteller from Silverton,  Gordon Munro, who has likewise specialized in stories about Homer, regaled us with three or four after the intermission.\n\nI got there and back by bus 14.  Steve Silverman and I talked about chickens, which turned out to be apropos.  Many other Wanderers were present, including Nate, Jon Bunce.  I took advantage of the occasion to notice [we were in ToonTown](http://controlroom.blogspot.com/search?q=ToonTown), as the slides readily make obvious.\n\nMatt Goening was on recently, according to Glenn, finally admitting to Oregon's being the Silverton, but then joking he says that about all the Silvertons.  That's where The Simpsons (simpletons) are from.\n\nThe Quaker threads, which converge with Wanderers and Subgenius for me, have been flying by thick and fast. I'll do more to chronicle later, with the benefit of hindsight.\n\nLifting from the thick traffic, this from Tom Head:\n\n\"Also, people who could not attend tonight might be interested in the links to \"Speak Truth to Power\" at [http://afsc.org/document/speak-truth-power](http://afsc.org/document/speak-truth-power) and to Dan Seeger's talk \"Quakers and African Americans approach the New Jerusalem\" at [http://afsc.org/friends/quakers-and-african-americans-approach-new-jerusalem](http://afsc.org/friends/quakers-and-african-americans-approach-new-jerusalem).\nAs you can see, more of that [Bayard Rustin theme](http://mybizmo.blogspot.com/2012/03/remembering-baryard-rustin.html), so prominent at the AFSC meeting at HQS the other weekend.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}