{
  "id": "5803205470675378049",
  "title": "Out of the Clear Blue Sky (movie review)",
  "published": "2014-11-11T22:44:00.000-08:00",
  "updated": "2014-12-25T18:51:09.548-08:00",
  "content": "I picked this up from Movie Madness to continue on the topic of 911, taken up [at Wanderers last week](http://controlroom.blogspot.com/2014/11/wanderers-2014114.html) by David Chandler.  He invited myself and a friend to watch it at his house, given his own focus on this topic and the fact that we're all friends anyway, through Quakers.\n\nAs I expected from reading the dust jacket, this is not a film about the whys, hows or wherefores.  It's about a group of families connected to a company that lost all 650+ co-workers who went in to work that day at North Tower, right near the top, where one could feel the building sway and see water slosh back and forth in the sink.\n\nWhen the plane hit, all access to the ground was lost and the physics was lethal.  The CEO, who was enjoying his son's first day of kindergarten, understood the situation and grappled with it as best he could.  At first he was the human face of the 911 victims, but then the media turned on him when rumors spread that his company was not planning to make good on its promises.\n\nThe arc of the film is a lot about the exoneration of the CEO, who lost his brother in the attack, as well as about the nightmare the victims have endured since 911.  The film makers also lost family members and friends in the attack.  The suffering of the victims is mixed with that sense of the surreality of these horrific events, a reminder that reality need not be believable.\n\nDavid thinks any notion I may have that these buildings could have been pre-wired for demolition for benign reasons, namely to get rid of them when they proved to be white elephants, is highly unrealistic and thinks it far more likely that the wiring was premeditated and coordinated with the airplane attacks.\n\nThat's assuming a demolition occurred, in addition to the airplane hits, which many architects and engineers argue is likely, given eyewitness accounts, analysis of the video, and of the chemical residue from the dust.\n\nAdding a button to the picture and a decision to press it, does not in itself point to who the decider was as a matter of logic, at least not in my mind.\n\nI'm willing to add a button (e.g. to explain WTC 7's fall \"at the speed of gravity\" -- not 40% slower as the draft NIST report alleged) but that's about as far as I go in my own analysis of what happened.  I have no special insider knowledge I'm withholding at this time.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}