{
  "id": "5717677905806455003",
  "title": "Pacific Northwest Social Forum",
  "published": "2014-09-27T17:58:00.001-07:00",
  "updated": "2014-09-28T13:15:03.511-07:00",
  "content": "I'm in no position to write any comprehensive review of this event.  Good job Food Not Bombs on the lunch.  Carol (mom) was especially keen to go as she'd been to the Social Forum in Detroit and been on organizing committees for Forums before this one.\n\nThis year the plan was to fragment the global event among several cities, so that more people from diverse locales could maybe make it to one of them.\n\nThis was not the same church as where we have the ISEPP lectures.  First Unitarian is not First Congregational.  Both have ample facilities, with the Unitarians also having Eliot Center, the site of many a social event in Portland, including [some Barcamps](http://mybizmo.blogspot.com/2010/10/barcamp-4.html) I've attended (that's a computer thing, not a camp for bartenders).\n\nIbrahim was the one panelist I could claim to know by name.  He came up to Carol and I later and introduced himself in a friendly way.  I reminded him he knows Lindsey (housemate), who would have dug this event; she's still in Nepal.\n\nThe Luchini family was in high gear with both parents leading breakout sessions.  However it's not like I was able to recognize many faces.  Portland is a small city, but not that small.  More it was the issues, causes and agendas that I recognized.\n\nUsing the term \"capitalism\" to encapsulate / name a broken operating system, buggy and disreputable, is part of the common core vocabulary, though I wouldn't call this an unexamined nomenclature.  During questions to the panelists, the door was left open to embrace aspects of the \"current system\" but given the heterogeneous makeup of the group, having a common vocabulary is an asset and after cost / benefit analysis it seems \"capitalism\" is indeed the common foe.\n\nSomewhat ironically, I'd scheduled the middle of the day to photograph houses on the market for some people looking to move to Portland and so was out and about playing the language game of home ownership after lunch.  Then I settled down on the back deck with Nietzsche, Godfather of Fascism? to read some of the anthologized writings therein. \n\nEnglish must be versatile and fertile enough to come up with other isms, for those wishing for neither social-ism nor capital-ism.  Those can't be the only two choices.  This book Quakernomics I've been reading suggests capitalism is not intrinsically oppressive, if placed at the service of alternative value systems.  Maybe.  Why call it \"Quaker capitalism\" instead of just \"Quakerism\"?\n\nWhy not just advertise an openness to a plethora of small scale experiments (no \"winner take all\" rules need apply), with some doubling as a basis for video programming, such that onlooker-viewers may judge for themselves what's an appealing lifestyle?  We already do that a lot already.  Let's do it a lot more.\n\nWe (humanity) can practice hundreds if not thousands of isms and individual humans need not see themselves as trapped by any one of them, anymore than bees are trapped by flowers (unless they're flowers of the insect-eating variety).\n\nEngineering subcultures are not by definition the enemy so much as potential infrastructure providers, stage crews, for giving the various isms space to flourish and recruit.  Architecture is a branch of engineering in this vocabulary.\n\nAren't religious communities \"socialist\" in that the devotees of whatever flavor share assets / property?\n\nBut in that sense isn't an aircraft carrier shared property as well?  Who on board has title?\n\nA captain of a ship is so often not its owner, nor are the admirals typically in owners of their fleets, or why would socialists have them?\n\nPolitical terminology is full of holes.  Why stake one's life on such hole-ridden texts?\n\nThe capitalist in me says risking everything to defend \"capitalism\", one ism among many, is not a good business investment.  Isms come and go.  The 1800s need not dictate the terms of our debates going forward.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}