{
  "id": "6863061817286900032",
  "title": "Paradigm Shift",
  "published": "2018-03-20T11:27:00.000-07:00",
  "updated": "2018-03-20T11:39:24.202-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/39098593240/in/dateposted-public/)\n\nThis is the one to read after Cryptonomicon, which is historical science fiction.  This newer one, The Theory that Would Not Die, is availing itself of a lot of the same information.  As author Sharon Bertsch McGrayne points out:  a lot of this wartime business didn't start to trickle out until the 1970s.  The people who participated were forbidden to share their experience, for \"national security\" reasons.\n\nThe premise of the recent movie Churchill, was that Winston had huge doubts about the wisdom of D-Day, and took comfort in the idea that the weather might be on his side.  He tried his best to talk Eisenhower out of it.\n\nAccording to this recent history of Data Science, Eisenhower possibly had access to deeper secrets from the UK's own Bletchley Park than Churchill did, and knew, from intercepted and decrypted communications, that Hitler saw a Normandy landing as a likely bluff, and wanted his generals to gird for the \"real thing\" should it happen.\n\nThat told Eisenhower his deception was working.\n\nI knew a guy who'd served under General Patton in the UK, where the goal was to appear to be amassing a large army, such that aerial surveillance would be fooled.  The Germans would think those were tanks, but they were closer to inflated balloons.  The Churchill movie doesn't talk about all this.\n\nI remember when this older guy I knew, a WW2 veteran, finally felt free to share his experience:  the New York Times had published a story on the fake army just that morning or thereabouts. This was way back in the 1980s.\n\nAlan Turing, on the other hand, was never allowed to talk about his critical role saving Britain.  Churchill was very keen to have all evidence destroyed.  Exactly why again?\n\nWhy do politicians have the power to order mass destruction of anything, anywhere?  Because we authorize them to do so?  So we can scapegoat them later when things don't go as planned?  Yeah, something like that.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}