{
  "id": "5062701485854384291",
  "title": "Parallel Processing",
  "published": "2018-07-08T08:58:00.001-07:00",
  "updated": "2018-07-17T16:27:58.494-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/42332790424/in/album-72157695209731812/)\n\nI got some flak on Facebook from one of my friends, wondering why I bother to curate Youtubes like that, using one social medium to access another.  Think of stamp collecting.  The latest series had to do with rebuilding Aleppo, the grand mosque there.\n\nChalk it up [to cyber tourism](http://worldgame.blogspot.com/2018/07/cyber-tourism.html) and wanting to \"go there\" with my friends.  This blog or journal was designed as the log book for a crew on the road, doing useful stuff like helping rebuild Aleppo.  Crews want to look back and tell their kids what they helped rebuild.\n\nBizmos have their fans, some of whom channel them funding to catalog order this or that artifact.  We see the transactions in the bright of day a lot of the time (bizmos leave audit trails).  [Electrons move](https://medium.com/@kirbyurner/electrons-rule-ac5f19d2996d) from here to there.  The crew will return in a future episode to help the locals install this pump.  Hospitals get stocked this way too.  Schools.\n\nAt the other end:  people in coffee shops, but maybe not that into coffee.  I'm borrowing from romanticized Paris, where we posit existentialism was born in meme form, only to percolate through coffee shops to show up on bookshelves, further catalyzing osmosis.\n\nCSN doesn't assume \"existentialism\" is the philo du jour, yet draws in those scholarly fumes, mixed with Borges, Arabia, Alexandria.  There's a look and feel conducive to study.  In that atmosphere, you also have arcade games (we call them that for a reason) whereby becoming a champion may be of service to one's favorite crews in the field.\n\nA team of three is cruising from Kabul to Istanbul and stops off in Shiraz.  Here we find some drawings by a street kid that lead us to this clutch of artists making some highly interesting models.  This crew specializes in mathy art, ala M. C. Escher and many more.  Think of that conference Bridges, which said [\"my\" A & B modules](https://worldgame.blogspot.com/2005/12/incomprehensible.html) were for the birds.  And tweeting I did:  let's 3D print these things, Makers!\n\nActually [my art work](https://mybizmo.blogspot.com/2014/12/convergent-friends.html) was called Holding It Together in a Cyrillic language, and features six beveled faces of a cube pulled inward and held by tension on six cables to a smaller tetrahedron inside.  No glue.  If the faces are closed, there's a ship in a bottle feel to it.  Tension compression.\n\n[](https://www.flickr.com/photos/kirbyurner/16140315443/in/album-72157654417641521/)\n\nДержись!\n\nAnyway, that's the science fiction backdrop against which this journal is written.  Then we need Control Rooms to help dispatch and coordinate the bizmos.  This would not be efficient without the caravans and convergences.  Health care teams can't all squeeze in one vehicle.\n\nControl Room is a sister blog, suggesting the role.  I worked for Clackamas County in [dispatching driver fleets](http://mybizmo.blogspot.com/2006/01/fragment-of-day.html), an early template for the Uber model.  People bring different experiences to the table.\n\nA lot of Africans are asking for borderless driving.  I was negotiating with some nationalists the other day, suggesting we could have a balance of Berlin Walls and lengthy queues, versus wide open areas in which distance driving was a given, a freedom.  No road blocks with checkers.\n\nThe thing about Africans is most were never consulted regarding the map of nations to begin with, so they're freer to start fresh with an unmarked globe, only to mark it up with other markup.  Substance control check points, like freeway weigh stations, need not be barriers across a road.\n\nPicture a cargo container with QR-code and RFID getting off loaded in North Africa and making its way inland.  The sensors it drives by register its progress and GPS is involved.  People know the contents and blockchains know how to move tokens around.\n\nKeeping a cargo container on schedule factors in ample time for the driver to find this a doable lifestyle (citizen diplomats need to compare notes at truck stops, sharing news and views, for the health of the economy and Pareto optimizing).\n\nRemember drivers might hand off trucks.  Sometimes the drivers linger, enjoying coffee shops, taking classes for credit.  Sometimes its the truck that stays behind, on a charging station.  No one said a driver has to drive more than five hours a day.  Maybe some do but the rule books is flexible.\n\nIf you wanted to do some substance control, this might be the place, at the stopover, where electric tractor truck A switches its pulled container to electric tractor B.   Batteries may not support the long hauls characteristic of peak oil.  Tractors queue longer as well.  Drivers jump from rig to rig.\n\nSome Bizmo fleets work the same way.  A lot of the customization (e.g. favorite tunes, dashboard instruments) get stored in the cloud.  I tool around town in this mobile office charged near the airport, only to turn it in three days later.  I'll be continuing my work in another city, taking meetings where I need them.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}