{
  "id": "3151471519489124795",
  "title": "Peace Program Meetup",
  "published": "2019-05-14T22:47:00.001-07:00",
  "updated": "2019-05-15T12:46:54.395-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg8CBUb3PTtaZ3AZtqvtirYd1aVdHhsufiEHGY1SLSkQ9Bk9k5efOha-RZyMEdAkFMwilSFBz6-IudNbIkpWeBRYor-D32XlIyOZFbTcIkpV87GdT89rd5VS5HAF9rEenwFAY0I/s1600/2987034913_4728c1e8f8_o.jpg)\n\nBy \"Peace Program\" I'm not referring to AFSC's, which closed shop in Portland awhile ago.  That particular 501(c)(3) has had to morph over the years.  I used to serve as one of those flown to Philadelphia every year, for the annual meeting.  In my case, the Yearly Meeting footed the bill, but in other cases, the Quaker delegates get reimbursed.\n\nI'm referring, informally, to the Linus Pauling Center for Science, Peace and Health, on Hawthorne Boulevard, and the talks that it sometimes hosts.  Yes, ISEPP is another 501(c)(3) I've served with, my wife the bookkeeper before that.  A well-known and much beloved lecture series, organized and staged by Terry Bristol, funded by generous donors, kept Portlanders way more in the loop than one might presume, for an \"out west\" town.\n\nDr. Peter Bechtold is outside both those circuits (Quakers and ISEPP) yet he appears at the Linus Pauling House rather regularly to update us on what's going on in the world.  Oregon / Cascadia, in joining the Union, surrendered its foreign relations (one might call them) to those writing the official narrative of the country in the District of Columbia.\n\nPeter knows officialdom quite well and is highly traveled.  He was showing a map of Libya when I walked in, then Sudan, then Iran.  He's been studying these places for decades, has briefed diplomats and two star generals.  He's been a fixture around the State Department, and later Portland State.\n\nMy closest connection to Portland State was through Dr. Charles Bolton, still active duty when I moved back to Portland in the 1980s, and lived in his basement.  He later became an emeritus and loved to overlook the Columbia Gorge from his two story \"cabin\" (small house), across from Hood River.\n\nThat was one of the best view properties to which I've ever had frequent access.  The deck of Don Wardwell's Meliptus scores highly as well, at the other extreme (right on the Columbia, versus high above looking down).\n\nTo summarize, Bechtold is frustrated by how our Lower48ers just don't have much sense of history, or geography (they go together) and that leaves them naively vulnerable to others' agendas.  I'd agree, but also point out that Lower48ers have abdicated responsibility (one could put it that way) by giving moneyed interests a simple API (as we geeks say) in the form of the USG control panel.\n\nIf you know how to pay to play, you'll get the USG to do some awesome things on your behalf.  Most Lower48ers wouldn't know where to begin in that regard.  It's not their game.  They get to watch on TV as spectators.\n\nCase in point:  some \"bitch boats\" (paraphrasing candidate Gabbard), pimped out by the prez, are currently heading towards Persia for the express purpose of stirring up trouble.  The civilian bozos have war on their minds and hope to pin the Pentagon in some wrestling position, where lighting a fuse is the only way to save face.\n\nPublic opinion has to be properly prepped first.  Which takes us back to Dr. Bechtold's thesis:  that we're a nation ever willing to be hoodwinked.  Been then, we're completely out of the loop anyway.  Portlanders haven't favored any of the District's great adventures since and including the Vietnam experience.  This wasn't Nixon country.  We boasted moderate Republicans, perhaps a vanished species I don't know.\n\nOf course I'm oversimplifying.  Oregon's rural areas have a different take on world affairs.  They don't get to go to ISEPP lectures, or talks like the one tonight, which is too bad.\n\nWe always thought radio and television would do a better job of turning the airwaves into more of a public university, but the licenses mostly went elsewhere.  Universities got a few low powered stations is all.  But of course now we have the internet, and new forms of curriculum sharing.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}