{
  "id": "5632506651116835681",
  "title": "Peruvian Beauty",
  "published": "2007-06-06T08:01:00.000-07:00",
  "updated": "2007-06-06T09:08:28.227-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgMqHqrpkDHvRXPAbLoFZK0UG9mYn0ynyGRFSBSyok2-D72n4xD013vqoxQbQvPblwXye_NOCtZkoK4JTPJH8nMTy_GFXbjcBeFYVcFTTNR-cz9xDtgF0pZLkJcIeoA5DjjFyTw/s1600-h/yvonnecholito.jpg):: legally off leash @ laurelhurst ::Yvonne, one of [WILPF](http://www.wilpf.org/)'s galavanters, brought this Peruvian beauty home in a box under her airplane seat, having salvaged him from a junk heap.  Les gave Sarah the alias \"Mexican street dog\" (plus I call her \"fruit bat\"), who happened to be with me that day, so Sarah got to play with Cholito.  They'd likely have very smart cookie pups, but Sarah's been bred to not breed.  Anyway, they made a cute couple, despite the age difference (a spread of about 16 dog years).Here's a cool word problem, suggested by a Wanderer who really wanted to know.  Dogs age more quickly than humans, another way of saying they have shorter life spans.  The rule of thumb equivalence is one man year is seven dog years.  Given that, if a dog is born later than a man, the dog's age will eventually catch up to the man's age, given both live long enough (extrapolate as necessary to find an intersection).  Then you give two dates (man birthday, dog birthday) and ask \"when will they be the same age to the day?\"  That day, the guy wanted to have a party with his dog, which I thought was a sweet gesture.  We helped him figure it out.  Sometime in September, but I forget what year.The [Phi Guy](http://mybizmo.blogspot.com/2007/04/phi-guy.html) said we have Fibonacci to blame, for all those story problems they give us in math class.  He was the source of those Madlib templetes about Farmer John and his fence with perimeter X or whatever the hell.  But then he had sources.  [Liber Abacci](http://www.britannica.com/eb/topic-338942/Liber-abaci) wasn't just out of the blue.Here's another template.  At Pioneer Century the other day (a cycling event), I decided to reboot my handlebar trip computer.  Upon reboot, it stopped at a number, I think 206 or something, and I was thinking \"hey, what's that number doing there, let's get rid of it\" upon which I started decreasing it to zero, stopping at 143 with the thought \"hey wait a minute, I bet that's an important number.\"  Later that day, I started noticing my number of trip miles was (a) way more than or (b) way less than the mileage on my peers' odometers.  Also my speedometer's speed was (a) way more or (b) way less.  Hint:  the 200+ and 143 measure wheel diameter.Of course you might nail down the numbers a bit more and have your students write little computer programs to do the conversions and/or find the dog-owner birthdays.  Make 'em into web services why not?Answer key:  (a) way less (b) way less.  Because I'd decreased my \"virtual wheel diameter,\" I was credited with less distance, hence less speed, per N revolutions.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}