{
  "id": "3354285256849119975",
  "title": "Philosophy Posting",
  "published": "2008-04-27T15:13:00.000-07:00",
  "updated": "2009-01-19T00:04:17.156-08:00",
  "content": "To some Yahoo! eGroup:Followup re Russell, Linguistic Turn etc.So in the interim since my last post I've traveled around quite a bit, find that I'm not alone in sharing this vision of a curriculum newly revamped by the open source assets aka collateral we've been building up over the last decade or so.How Wittgenstein fits in is when explaining to career math teachers how this is not the same as New Math, although yes it seems similar, because in the Russell-Whitehead-Wittgenstein era it looked like everything was boiling down to Sets as integral to some grand unification thing happening in Logic (ball gets rolling with Frege especially).With the benefit of hindsight, I'd say a lot of talent developed in that era got siphoned off by [the AI movement](http://worldgame.blogspot.com/2004/09/futurism-ii.html), which predicted some kind of new mechanized intelligence, which we got actually, in that now an entry level home computer comes with maybe 3 gig RAM, a terabyte hard drive, and who knows what else -- lots of futurism came true in these devices.  But no [AI](http://www.imdb.com/title/tt0212720/) to speak of, with programming being a very human activity, interface design an art as much as a science and so on.  The \"[ape class](http://www.imdb.com/title/tt0063442/)\" mammal proves once again that we're versatile, adaptive, so here for the long haul, actually looking forward to peaceful coexistence with our iPods, not some immanent takeover ala [Terminator](http://www.imdb.com/title/tt0181852/) or whatever.I'd say a lot of philosophers got hoodwinked by the AI dream and ended up wasting a lot of our time.  On the other hand, [Alonzo Church and the lambda set](http://en.wikipedia.org/wiki/Lambda_calculus), authors of LISP, Scheme and so on, took off from that [Bertrand Russell type stuff](http://mathforum.org/kb/message.jspa?messageID=6191674&tstart=0) and moved us in many promising new directions.  The dream of mechanized languages, ala Leibniz and later [Ada](http://www.grunch.net/synergetics/adaessay.html), is alive and well.  Wittgenstein's concepts ala the PI are helping us think about \"namespaces\" and so on -- a way to protect against \"name collisions\" of the kind that have always plagued any philosophy insufficiently aware of its responsibility to sustain its own context (many just use the prevailing cultural backdrop, and so may not transmit well downstream, whereas [the PI](http://www.amazon.com/Philosophical-Investigations-3rd-Ludwig-Wittgenstein/dp/0024288101/) is clearly a book for the ages).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}