{
  "id": "8673609278525781008",
  "title": "Philosophical Remarks",
  "published": "2015-12-15T18:11:00.000-08:00",
  "updated": "2017-07-17T19:59:04.891-07:00",
  "content": "Drat, I was up all hours sampling documentaries (browsing; always my habit), and missed getting the garbage out in time.  I was awake early enough, but too preoccupied with nursing duties to remember this was Tuesday... I'm care-taking for a dog, on her last legs.\n\nAnyway, last night I came across the above (amidst some Mars rover and giant black hole videos).  Lots of fun \"making math [look cryptic](http://controlroom.blogspot.com/2008/12/exxon-math.html)\" -- the language of high priests no doubt, like the ones at CERN.  I'm a Mario Livio fan, glad to see him [in action again](http://coffeeshopsnet.blogspot.com/2009/02/glass-bead-game.html).\n\nPhi and Fibonacci numbers -- a favorite topic.  [Pascal's Triangle](http://mybizmo.blogspot.com/2006/09/focal-points.html) is also good (they're connected).\n\nThe mathematician who wonders if he's being radical in saying the universe is mathematics, versus the mathematics being just an attribute of same...  when do they ever interview philosophers on whether grammar really matters that much.\n\nSaying it is mathematics sounds dizzying in its implications... a sense of wonder / vertigo is sometimes welcome in documentaries, I don't deny it.  The thrill of a new way of looking.  Grammar (in Wittgenstein's sense) is all part of the math.\n\nPhilosophical investigations:  explorations in the geometry of -- the grammar of, shape of -- thinking (concepts, fitting together... or not).  Will we condescend to see topology in the plot structure of a novel or film?  In what dimensions, these meanings?\n\nSaying nature is mathematics, not just a user thereof, might help bring the humanities into closer association with computation.  The book of nature:  a running program (event driven?).\n\nFunny how when they turn to Pythagoras we're into the nightclub scene, and jazz.  Not that I have a problem with that.  I liked the mathematician-musician they interviewed.  Talented, and with a message:  studying is hard work.\n\nI'm just thinking how Disney applied a somewhat similar spin, way back when, in the 1960s.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}