{
  "id": "5119363043912956273",
  "title": "Philosophizing",
  "published": "2017-05-07T00:13:00.004-07:00",
  "updated": "2017-05-07T00:46:08.905-07:00",
  "content": "I'm likely offending some of the more idolatrous, with this Pastafarian sermon, one might call it, on Synergetics no less. Cinco de Mayo was a productive day for me, in terms of getting out three videos for the Synergetics 200 playlist (on Youtube).\n\nIn Western Civ at least, the sciences purposely developed a certain edginess with respect to religion, as a matter of asserting a human freedom to speculate.  Thinking outside the box may seem a threat to in-the-box thinkers, though more likely they'll take no notice.  I make reference to Descartes' apparent worries, that his discoveries outside the recognized canon of authorities might get him in trouble.\n\nDr. William Martin, whom I also mention in my talk, had just given a cogent lecture the night before, about how cell-based autonomous programmable life forms could have developed on the sea floor and in the crust.  He sees the chemistry as hardwired to move in that direction, given the right preconditions.\n\nThe black smoker type vents were maybe not as prototypical of the earliest RNA World apartment as the undersea vents later discovered and named Lost City by the community.\n\nSulfur, hydrogen, carbon dioxide and oxygen all play a serious role, with catalyzing metals helping organic reactions flow towards life forms.\n\nOn the other hand, scientists would likely find Fuller's U = MP too much the transcendentalist fantasy, regarding some aspect of being that's weightless, non-energetic.  We've been pretty strict of late about keeping \"meta\" away from \"physical\" -- although \"metadata\" has not been a problem.\n\nAny talk of some \"metaphysical\" aspect of Universe sounds too ghostly to be a science, to postmodernist ears.  All the more reason to usher philosophy back into the picture.\n\nIn addition, Synergetics seems atavistic for its fascination with polyhedrons.  Didn't philosophy outgrow such toys long ago?  Many grownups seem to think so.  Polyhedrons feature at best in recreational mathematics, as hobbyist devices.\n\nThe basic process in Dr. Martin's view is for cells to break free of their towering infernos, or incubators more accurately, they'd need to incorporate the catalyzing metal function, which is to maintain voltage pressure across a membrane.\n\nProtons (hydrogen ions) want in, driving the ATP generator, ATP Synthase.  Those ATP pathways may seem too complex to be that old, but are really no more elaborate than RNA itself.\n\nAnyway, complexity arises more spontaneously than earlier mathematics seemed to permit.  Positive synergy is better understood.\n\nYes, these narratives are speculative theories, incomplete, and may be wrong, Dr. Martin was up front about that possibility.  We cobble together the most credible story we can, given what we have to work with, is the attitude.\n\nWhat repels these scientists most are those closed, irrefutable dogmatic stories that harbor no self critical counter-intelligence to speak of.  Such stories seem too brain dead to be trusted really. \n\nIt's the freedom to keep saying \"we're not sure yet, lets not pretend we are\" that scientists fight for, whereas such \"not knowing\" may leave others uncomfortable.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}