{
  "id": "8999503012169549466",
  "title": "Physics Youtubes",
  "published": "2016-02-13T18:53:00.000-08:00",
  "updated": "2016-02-15T09:50:12.641-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/6082451621/in/photolist-dMGmVw-agu9Xx-8xp2z5-8vatB3-8ti2xi-8thDyL-8oX85J-6Wcvue-5QyKim)\n\nAfter staring at divided spheres all day, as in carved into triangles (windows), the concept of flux, charge flowing, blowing if you will, like the wind, lends itself to different pictures, than one of squares. \n\nSquares are less happy on spheres. \n\nThe lines of latitude and longitude are not about making squares, much as we might kid ourselves.\n\nOliver Heaviside, same as in [Heaviside-Gibbs](http://www.famousscientists.org/j-willard-gibbs/) (they collaborated), gets credit for the cuter form of Maxwell's Equations. \n\nCharge density is the explosive content, which adds up to what emanates through all those triangles (Coulomb, Gauss).  Curl (swirl).  Magnetic flux (Faraday). \n\nNo accident early derivatives were named \"fluxions\" by Sir Isaac.\n\nHere's an excerpt of something I posted to [The Physics Learning Research List](https://groups.google.com/d/msg/mathfuture/syi-0CdicbA/jVPNZEhnAwAJ) (PHYSLRNR-LIST@listserv.buffalo.edu), replying to my own post in this context.  One typo fixed (\"tries\" -> \"trees\").   \n\nDate:  Fri, Feb 12, 2016 at 9:12 AM \nRe: entropy video\n\nI\n think polling educators in a subject regarding publicly / freely \navailable teaching materials on that subject is a great way to foment \nproductive dialog.  \n\nI know Entropy is \nuber-basic to the core concepts the Physics curriculum wants to \ncommunicate effectively, so why not sample specimens on that topic in \nparticular?  \n\nWhat\n I've noticed is that in contrast to the magnetic field concept, which \nstarts in many cases with the whole Earth being magnetic, there's no \ngeneralization regarding the Entropy of the planet (Earth).  Is it (A) \nincreasing  (B) decreasing or (C) the question makes no physical sense.\n\nWe've\n talked about photosynthesis as a means of mass impoundment i.e. the \ntotal weight of trees as fixed hydrocarbons (water and carbon both) \naccounts for a lot of mass in the biosphere, but then the biosphere \nitself is but a thin film of negligible mass. \n\nIf\n one were arguing whether Earth was gaining or losing mass on balance, \nI'd hazard (A) gaining, because of infalling space matter, however \nminiscule.  More matter is coming in than leaving and that's what \nmatters, or am I wrong?\n\nBut what about Entropy?  It's not a physical quantity but a measure in a phase space.\n\nClearly\n Earth is *not* an isolated system, quite the opposite:  it's plugged \ndirectly into a star for fusion power energy.  So there's nothing in the\n equations of thermodynamics that says Earth *has* to be gaining Entropy\n right now, at this point it its existence.  So I see where (B) \ndecreasing *might* be a sensible answer.\n\nIn any\n case, the contrast is stark:  those topics with a \"whole Earth meaning /\n interpretation\" such as \"magnetic field\" immediately use the whole \nEarth as an example to anchor the concept.   The Youtube videos are \nnotoriously silent on this question of the Entropy of the Earth, that I \ncan find, implying (C) the question makes no physical sense.  Too bad if\n so.\n\n[](https://www.flickr.com/photos/kirbyurner/24140203359/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}