{
  "id": "113112434154798608",
  "title": "Physics Emergent (ISEPP lecture)",
  "published": "2005-11-04T09:31:00.000-08:00",
  "updated": "2006-11-15T11:43:47.081-08:00",
  "content": "Physicist and Nobel laureate Dr. Robert Laughlin delivered the kickoff ISEPP lecture at the Schnitz last night. He projected a series of hand drawings (he's pretty good -- plans to take up color in a next life if he gets one) and talked about The Frontier (archetype) in science: yes there is one, but a lot of times we look for it in the wrong direction.The word \"law\" has two connotations in English: physical laws that set the stage, and social agreements that govern the acting. Laws of the first type get ascribed to God, at least in Judeo-Christian thinking, and so we get the picture that God supplies the foundations or fundamentals, and complex life forms such as ourselves build atop this set-in-stone framework.However, what's becoming more apparent in science is that physical laws may be emergent in the sense that their formulation and description only makes sense in the context of complex aggregates, assemblies or \"piles\" (Laughlin showed a pile of apples -- the picture had other plot elements I won't go into). The phenomena these rules describe simply vanish at more inward levels. So we get this hierarchy of \"grammars\" [my word choice].Later, after dinner at the Heathman, I stepped out from behind the camera to propose this analogy: say a novelist is bound to follow all the rules of grammar [I'll add proper spelling], but in order to sell books, knows to incorporate suspense, to follow other rules for strong plot development; nothing about the rules of grammar predict or force a novel to be any good (that's up to the writer) i.e. these higher order rules are emergent.Laughlin found this a pretty good analogy with the following caveat: he doesn't see any need to complement the mindless automaticity of quantum mechanics with some new principle of Agency (the writer). He's OK having his Universe run on autopilot, with emergent/synergetic behaviors, yes, but still a machine in the final analysis ([Occam's Razor](http://en.wikipedia.org/wiki/Occam%27s_Razor) at work).One practical consequence of emergent law (in physics, not just in biology and society) is we can't advance science through thought experiment alone. Measurement remains a primary source of new discoveries, and this feeds our appetite for new and better instruments (e.g. earth-focused satellites). Our sphere of scientific relevance, at any [frequency](http://www.grunch.net/synergetics/omnihalo.html), is bounded by our ability to measure.For this reason, Laughlin sees string theory (about the very small) as only quasi-scientific, given it hasn't yet given us doable experiments that would make it falsifiable. A lot of cosmology (about the very large) is like that too. A chief purpose and benefit of such twilight zone science fiction is it helps us raise funds for new machinery so that the horizons of real science might be expanded to new frontiers.Speaking of Nobel laureates, we remember Dr. Richard Smalley, a co-discoverer of fullerene, who died recently. And speaking of scientists who have died recently, we remember Dr. George S. Hammond, chemist par excellance, and a Wanderer.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}