{
  "id": "6474719296583319562",
  "title": "Pixel Fault",
  "published": "2007-05-09T14:22:00.000-07:00",
  "updated": "2007-05-09T14:22:53.306-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi_SPUYKWg6VtPehtvdE24_mXuv0ZXR7lyEIGmrnDQa8sQ0exU3hkZSjp95M1hIxD2yEeAa45hFUkncb2DNmFlh5bHCdIe6rKkXyRMCzkteo4S7c3xBWtDQTa6uOzyFWTKe_C7e/s1600-h/pixelfault.png) I noticed while doing the recent [Sky Camp post](http://controlroom.blogspot.com/2007/05/sky-camp.html) that the pixel fault in the viewer, a persistent green dot, isn't the only problem with my Olympus 720 SW. I first noticed that flaw when trying to shoot (as in photograph) a racoon ahead of me on the sidewalk, while walking home some candles, which I dropped, breaking 2/3rds of their glass encasements, thereby missing my racoon shot (it scooted away).But the flaw I've more recently noticed is in the pictures themselves, and that's worth fixing under my soon-to-expire warranty, hence my trip to the UPS Store on Hawthorne just now.The way to test for a high civilization, fragile, ethereal, is to exercise its circuits, so no, I don't feel \"guilty\" attending to one pixel among many in my camera, when Darfur so much demands our attention.That's a false either/or, but does remind me of Princeton's philo guy Dr. Kaufmann, raggin' on Dr. Kant in that lecture, 'cause the latter was supposedly bellyachin' about some exotic chocolates he'd craved that never arrived, whereas what was really goin' on, 'neath the surface, was people sufferin' and dyin' (probably drownin' mostly -- some shipwreck at sea).I was exulting with my new optometrist the other day about how wise were those Victorians, or whatever we call 'em, for pouring so much intelligence into Optics, such that today we not only have eyeglasses and contact lenses, telescopes and microscopes, but also ray tracers, render farms. Optics was one of those problem domains within reach of that era's materials science. Investing lots of work in a robust and practical theory has paid off many times over, starting with prolonging one's ability to read, even the small print.And in that tradition, I take my pixel faults seriously. How this culture values its hard won skills and kudos around the Optical Sciences remains a kind of barometer. And it's not just the visible spectrum we care about. The electromagnetic spectrum is a wonderful shared bonanza and Mother Nature doesn't begrudge us our accessing it.But attentiveness is required, given how we use it in common. We're not supposed to just fall asleep at the switch. So again: let's take our technology seriously enough to attend to it, and keep it in good repair and/or amortize it accordingly, which means to really retire stuff when it's no longer safe to keep it operational -- maybe it has a next life in a museum or something, but don't be afraid to expire what's been on the books for too long.I'm also having tremendous déjà vu around this whole \"return camera to fix pixels\" scenario, except I don't think it's déjà vu when it actually did happen, is it? I believe I undertook a similar excercise with the Fujitsu, around two cameras back. I guess I've cared about my pixels for awhile.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}