{
  "id": "880767761350607954",
  "title": "Place Based Education",
  "published": "2009-06-30T18:12:00.000-07:00",
  "updated": "2009-07-02T14:04:48.383-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/3682024559/)I've been suggesting we try the Philippines for mom's elective surgery, not covered by Uncle Sam but the medics think it oughta be dealt with, could maybe go [with Victoria](http://worldgame.blogspot.com/2008/12/swiss-christmas.html), still have the total come out less. Of course if we could get one of those new Swedish policies... or maybe those are illegal if you're a USAer, can't remember all the details right now. A pipe dream at the moment.It's too late for [spring cleaning](http://controlroom.blogspot.com/2007/04/spring-cleaning.html), yet that work proceeds apace, albeit slowly. I did the [Edward Scissorhands thing](http://mybizmo.blogspot.com/2006/06/doing-nothing.html) a few times around the yard, making it all a tad less gothic, though in Portland that tends to be [an accepted style](http://www.flickr.com/photos/17157315@N00/3492234048/in/set-72157617563312284/) (Pied Cow a [good example](http://www.flickr.com/photos/17157315@N00/3239528251/)).  We had an all clear dining room table last night, less like Great Expectations than usual (no mice skittering, no pythons chasing 'em (Barry lives in a snake aquarium)): catfish for Carol and I and yes, corn on the cob for all of us, now that Tara has a [Dr. Joe brand](http://controlroom.blogspot.com/2006/11/halloween-2006.html) smile, an excellent outcome.July 4 plans are somewhat up in the air, as to details (not in broad outline), plus this week is already being busy. Portland doesn't really slow down much in summer, though it \"shifts gears\" I would say. We're happy about our Blues Festival coming around again, a signature aspect of our American heritage, just the right notes for an Independence Day bash. Maybe [NSK](http://www.nskstate.com/state/index.php) will send us a card or something.  [USIA](http://dosfan.lib.uic.edu/usia/) could respond.I've been talking up \"[place based education](http://worldgame.blogspot.com/2009/01/columbia-gorge-recent-history.html)\" again, all the rage [among charters](http://mathforum.org/kb/message.jspa?messageID=6770390&tstart=0), has to do with customizing curriculum content to reflect local time and place, for example who are your neighborhood association presidents, your school board members, what voting districts do we have, [who represents](http://worldgame.blogspot.com/2005/08/bridge-pedal-in-rear-view-mirror.html) each one and so on. This might cycle by on an LCD somewhere, along with student placed ads to buy/sell/trade bicycles. Additionally, we want to show about infrastructure, such as Bull Run and the tank system it feeds, but that could be more [an OMSI experience](http://mybizmo.blogspot.com/2007/03/human-subjects.html) and might involve actually going to the place, e.g. Joe Miller's, overlooking said reservoir (lots of history attaching).Another thing we'd do is spend a lot of time flying over the earth using one of those [KH-derived](http://worldgame.blogspot.com/2005/08/more-from-oscon.html) Virtual Earth services, especially locally, as young teens are interested in getting around, should know north from south, east from west, west from north... and so on.  It's embarrassing when tourists come around going \"where's Atwaters?\" and the guy at the bar goes \"no such animal\" and yet it's right in the neighborhood.  That's because news of change needs to propagate, and the schools don't engage in that enough, thinking \"the local scene\" is for somebody else to teach about, and then they complain when the kids tune out.  Go figure.[](http://www.flickr.com/photos/17157315@N00/3676113279/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}