{
  "id": "2270530957094817130",
  "title": "Playing World Game",
  "published": "2021-02-16T12:39:00.004-08:00",
  "updated": "2024-07-15T08:19:19.994-07:00",
  "content": "How does one play it, this World Game thing I've been talking about?  Even the subtitle of my [Grain of Sand blog](https://worldgame.blogspot.com/) is Kirby Plays World Game.Well, I'd say Natasha here in this Youtube is a player, in that she's sharing about growing up in her hometown. I just came across her channel recently, starting with the one where she takes us on a tour of her dorm block in her language school.  She's on a seventh floor sharing the space with her sister, likewise a language student.Natasha had elected to learn Japanese, however owing to a teacher shortage, she was assigned Chinese instead, and English.  Her English is already quite good, which helps her join the world of traveling Youtube bloggers, the new citizen diplomats.That sounds like a more exalted title -- \"[citizen diplomat](https://controlroom.blogspot.com/2024/07/attitude-tuning.html)\" -- but its in some ways redundant.  As a player, you'll likely speak up for, most identify with, a subset of the total team.  This will help others communicate with you, through a somewhat standardized API.  You identify with some country, nation, camp, tribe or company and thereby serve as a representative or ambassador therefrom.  Perhaps your nation is one of the diaspora nations, not on any UN-approved map at this time?Speaking of maps, Fuller's Dymaxion Projection was generally devoid of political data, sticking nominally to temperature (global average). The map was positioned in this way partly because of its role in the space of citizen diplomacy.  Were Bucky to have published a veridical political map, he would have had to copy an authority, such as the United Nations, or maybe would have planted his own flag in some way, by drawing different borders. Either way, he would have taken a position on many political issues, simply by showing borders.Rather than get involved in such border disputes, Bucky made it so that any nationalism worth its salt is concerned with the welfare of the entire game board.  He would supply and artifact, neutrally devoid of political data, and leave it to the individual players how they wanted to value-add.Parochial adherence to some specific jurisdiction could be seen as negligent. Looking out for the welfare of a people, was tantamount to taking the welfare of all of the peoples into account.  We're a single unified ecosystem, a planet, with or without competently designed systems on the humans' part.  And that's where World Game comes in, and playing with competence.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}