{
  "id": "6505180119520524969",
  "title": "Political Radar",
  "published": "2018-02-17T13:57:00.002-08:00",
  "updated": "2018-02-18T11:05:38.548-08:00",
  "content": "I'm keeping an eye on my political radar, but when it comes to putting out blips of my own, I'm finding Facebook most congenial.  Twitter too.  These platforms are ideal for PR, and [PR is what I do](http://mybizmo.blogspot.com/2016/07/idiocracy-two.html).\n\nOf course Twitter is infested with bots.  There's an API to tweet from your programs.  Who wants to hire some poor stooge to make stuff up when you can just have a rotating queue.  Let C-level executives commit, just like Trump does, if you don't delegate to your CMO.\n\nAlong those lines, I'm not seeing where PR firms based in Russia get off the hook in having their operations exposed, but then we also found out about Bell Pottinger, the UK-based PR firm that colluded to \"sow discord\" just as IRA (Internet Research Agency) is accused of.  Quoting [an earlier blog post](http://worldgame.blogspot.com/2018/01/wanderers-2018131.html):\n\nThe idea of Russians buying ads on Facebook doesn't bother me even a \nlittle.  The British do it too, which bothers me a little more.  I don't\n trust British suspicion of the Russians usually, as it relates back to \ntheir inheriting Roman Imperialism, a meme virus.  Americans were \ninfected with that too, and tend to crow about it as a chief asset.  \nJust look at DC's architecture.\nAnyway, the idea that nations seek to influence election outcomes does \nnot disturb me.  It's a tiny planet and we all have a stake in the \nvarious outcomes.  The sooner we acknowledge what goes on, and stop \ntrying to deal with it by criminalizing it, the better. \n\nAs thought-leader Kyle Kulinski ([Secular Talk](https://www.youtube.com/user/SecularTalk)) points out, one man's \"collusion\" is another man's smart business plan.  There's no law against making friends with friends of the enemy, unless one has such complete control of the law that one is able to legislate permanent \"good guy\" status.  That's the tautological underpinnings of jurisprudence:  protect the jurisdiction of the jurists.  Give judges the right to judge.  Romans could tell us all about it.\n\nMy theory, which traces back to a little reported story, is that Protestants in particular are feeling an existential threat from three sides at least.  Firstly, one of their chief Bible thumpers switched sides to Eastern Orthodox (the under-reported story). Secondly, the Second Coming of Christ (SCC) doesn't appear to be happening in our lifetimes (not a new problem). Thirdly, secularism isn't vanishing either.\n\nThe strategy has been to pursue the main corporate PR initiative of the last century:  link Christianity to both Capitalism (the dream of instant riches) and Patriotism (the willingness to die for capitalists) by injecting In God We Trust language and giving it a patronizing spin.  The heinous crime of the ages has always been heresy, and without calling it that, there's still a strong urge to demonize.\n\nSpeaking of powerful symbols, why was KKK cross-burning never seen as a desecration of the Cross?  Burn a flag and you're disrespectful. Burn a cross and you're a good old boy.  Makes no sense.\n\nAnyway, the Russians seem a powerful threat because of Eastern Orthodox Christianity.  Israel is not a threat because it's expected to play into the Book of Revelation and help make End Times happen.  The Middle East is a tinderbox people want to ignite in hopes of ending the world.  You might think such people don't exist, yet the mentally ill have always been legion.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}