{
  "id": "252216359551204014",
  "title": "Portland Doings",
  "published": "2015-10-29T16:50:00.000-07:00",
  "updated": "2016-12-19T08:36:19.292-08:00",
  "content": "Carol is being recorded downstairs, where I've cleared out of the living room.  I've been camping out in the [Steve Holden Chair of Computer Science](http://worldgame.blogspot.com/2015/09/another-study-period.html), keeping the dog company while I [promulgate Martian Math](http://controlroom.blogspot.com/2015/10/martian-math-storyboards.html).\n\nToday I have lunch with some friends.  This morning:  my walk, meeting up with Glenn.\n\nIn case of a major earthquake, we can expect liquefaction of the muck under the fuel depots along Hwy 30, west side.  The heavy equipment is mostly in SE.  If the bridges fail, we'll be in trouble.  Fortunately we have one of the best gravity fed water systems on the East Side.\n\nOh wait, they're planning to disconnect that and make us dependent on electricity.  The best earthquake backup system is to be purposely disabled by \"city fathers\".  As Glenn put it, Portland is built atop ignorance.  Just look at those homes on stilts in the West Hills.  He wrote about all this in the Southeast Examiner.\n\nI've been debating Vote By Mail with a former PSF elections maestro, still [active in e-Voting](http://controlroom.blogspot.com/2015/05/voting-machines.html).  My concluding comment:\n\nSome N8V reservations e.g. Warm Springs, have only one post box in a radius of 40 miles. Getting to a \"polling place\" (USPO) is well nigh impractical (there's no home pick up or delivery on the rez) but then \"as a zip code\" the N8Vs know they'll continue to be punished regardless, as that's the white man's way, i.e. their votes count for nil as it is. \n\nWhen it comes to fairness, I think that's as scarce as [ U-235 or whatever ] i.e. there's not much of it in human affairs, never has been, but \ndemocratic models do help us remember it as a liberal value.  Thinking about \"free and fair elections\" helps us create more fairness, even if \nwe have yet to have a national election, in the US at least, that would truly count as either.\n\nIt's easy to judge in hindsight right?  No election was fair when blacks couldn't vote.  No election was fair when women couldn't vote.\n\nSince those two prohibitions were rolled back to some degree, other barriers to voting have crept in, and if blocking voting doesn't turn the tide, there's always rigging and miss-counting.\n\nWe need a lengthy documentary series on the history of voting and democracy, don't we?  An [old theme](http://worldgame.blogspot.com/2004/09/regarding-usa-public-schools.html) in these blogs.\n\nThe Mayor, Charlie Hale, has decided to not run again and instead focus on strategy.  He's right that many key decisions need to be made during the remainder of his term.  He sounded in full possession of his faculties on NPR the other day, quoting Monty Python a few times.\n\nNPR is reassuring us that even though they didn't pick Boeing for the latest boondoggle, the Pentagon is still engaged in prime contractor irrigating in our region, per usual.  They spin that as \"good news\" somehow, not sure how.  Jobs I guess?   Is that a bribe?\n\nCertainly it's not about keeping our edge in engineering as the military is prohibited from accessing our best science (any military, except when it comes to health care for the injured) -- a truism, as the best science is not about killingry (duh).\n\nWe were hearing [on the radio yesterday](http://www.npr.org/2015/10/28/451146230/missed-treatment-soldiers-with-mental-health-issues-dismissed-for-misconduct), about how the US discards its own soldiers left and right.  One DUI and you're discharged, without honors, denied benefits, after sometimes decades of service, and even if you have injuries (especially if you have injuries). \n\nHuman resources are treated like so much garbage, collateral damage, so the war machine can afford to keep running.  Use 'em up and spit 'em out.  America eats its young.  \"The true costs must never be admitted let alone paid\" is the business model.\n\nLike the Taliban, the US Army vets could use more professional, less backward, [outside medical services](http://variety.com/2014/film/reviews/cannes-film-review-of-men-and-war-1201187762/), like from Doctors Without Borders.  The secret tape recordings of Army psychiatrists prove they harbor and protect quacks, a kind of terrorist.\n\nThe leadership provided by Judeo-Islamo-Christian cultures is somewhat pitiful isn't it, witness the Middle East.  All they know how to do is fight, right?  The Middle East is hardly a poster child for the so-called \"prophetic\" religions.  New Yorkers are more law abiding.  [Bishop Tutu](http://worldgame.blogspot.com/2009/05/time-for-reconciliation.html) made this point.\n\nWe already knew that about quacks in psychiatry from the torture-authorizing BS artists in the civilian rank and file.  That whole branch of the medical profession (psychiatry) is fighting for respectability at this point, given it can't seem to disown its own bad apples.\n\nIn Asylum District, \"crazy\" as in \"bat-shit crazy\" is becoming a badge of honor almost.  What they call \"sanity\" in military doctrine never seems to set much of a standard.  Helicopter gunships get involved, and sanity is out the window, once again.  I'm glad the Pacific Northwest makes other investments.\n\nAt lunch we talked about Heidegger quite a bit.  I went home resolved to Google up something interesting.  I liked Richard Rorty's summary at the end of this BBC documentary (above).  He, along with Walter Kaufmann, were two of my teachers at Princeton.  Rorty actually read my thesis.  This documentary [on Ho Chi Minh](https://youtu.be/IHv3nQovuik) was interesting too.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}