{
  "id": "113276703021324432",
  "title": "Posting via Satellite",
  "published": "2005-11-23T09:36:00.000-08:00",
  "updated": "2006-11-15T11:43:47.604-08:00",
  "content": "Again I've joined my fellow North Americans for ritual travel and [consumption of mass quantities](http://www.imdb.com/title/tt0106598/). Aside from the jam up around [Lynnwood WA](http://www.ci.lynnwood.wa.us/Content/HomePage.aspx?id=1), the driving was pleasant enough. We retrieved Dawn from her retreat center (a five day, no talking, meditation around [metta](http://www.ethnicityonline.net/buddhism_glossary.htm#m)), and continued on through Seattle in the [HOV lane](http://www.wsdot.wa.gov/hov/) (the [express lanes](http://www.wsdot.wa.gov/regions/northwest/traffic/expresslanes/) also saved time).I helped Tara stuff an MP3 player with some favorite tunes before we left, plus she had a hand-drawn coloring book from Micheal Sunanda (in Costa Rica these days) but once we slowed to around 15-20 mph she got bored and started categorizing trucks by wheel count (most had 6 or 18, a few had 22, one had 34).Last night, Les showed me some pix of [Tsingdao, China](http://www.timeanddate.com/worldclock/city.html?n=649), from whence he'd recently returned. I encouraged him to upload a short clip of a local traffic pattern: a bus turns onto a four lane [thoroughfare](http://www.answers.com/thoroughfare&r=67) and simply chooses the nearest lane -- against oncoming traffic! Tsingdao has seen an explosion in vehicular traffic in the past few years (several doublings) and many of the [new drivers](http://www.dmv.org/) learned their skills second or third hand.Another story: back when command economists were at their apex in China, wooden fishing boats were banned, the theory being that upgrading to metal hulls would force modernization. However, the traditional craft were built to last and now, a half-century later, a few have come out of retirement, long after the upstart metal ones have turned to rust. But these relics of a bygone era are themselves in disrepair, as many of the supporting practices, such as cultivating trees in pre-designed shapes, have been unlearned.Les has a long history working with watercraft, so of course the boat stories especially interested him. He also tried many of the local foods (caterpillars and such). This was his first trip to China (with a multi-hour [layover](http://www.answers.com/layover&r=67) in [Seoul](http://english.seoul.go.kr/) each way), a big eye-opener for him, and a wonderful adventure.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}