{
  "id": "3571660948885905325",
  "title": "Power vs Work",
  "published": "2024-02-15T08:30:00.000-08:00",
  "updated": "2024-02-16T18:55:23.057-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72177720314743537)\n\nOne of the themes in this and its sibling blogs is \"the meaning of work\", which already connotes we could swap in \"job\" for \"work\" and the meaning would stay similar. However, I mean to include the physics meaning, which puts \"work\" and \"energy expenditure\" on par with one another, as potentially synonymous.\n\nThe physics \"work\" meme relates to \"power\" rather straightforwardly, at least in the Newtonian lexicon: Power = Work per Time (W/t or Wf where f=1/t). \n\nContrast this meaning of power with the one that \"corrupts absolutely\" when overdone. \n\nIn the namespace of good and bad (language games taking up the morality of X), we're at best ambivalent about power, in that it's likely to be abused. But then one way to counter abusive wielders of power is to empower those they oppress. So \"to empower\" is a good thing? But by growing into your power (becoming empowered), you've joined the dark side? By definition?\n\nThe physicists do have a moral bad guy however: entropy and/or noise, otherwise known as heat and calculated as a form of disorder. Given this much potential energy (funding) one should be able to accomplish these tasks (work to be performed), but then devil entropy always seems to take his toll, as half the energy (we hope less) is wasted.\n\nAny action may be profiled as accomplishing so much work (getting results) at the cost of some amount of waste (off task energy expenditure). Action, in the Newtonian sense, is momentum for a distance traveled or mvd. Action per frame of time = energy. \n\nSome amount of action per a given time frame expresses an energy amount. That amount of energy may store up in the bookkeeping sense as \"energy potential\" (potential energy) i.e. as \"pent up kinetics\", as in a loaded firearm, primed explosive, or charged battery.\n\nIs an empowered person a productive one? If the power is really getting work done and not just adding to the ambient noise level, then maybe so. But then who gets to judge what work is on or off task? Perspective matters.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}