{
  "id": "110755476068370395",
  "title": "Power Skating with a CEO",
  "published": "2005-02-04T14:23:00.000-08:00",
  "updated": "2006-11-15T11:43:42.271-08:00",
  "content": "So the CEO in this case is \"Power Boat Don,\" behind-the-scenes benefactor of The Wanderers, a Portland-based think tank to which I belong. He earned that nickname by taking us out, as individuals or in small groups, on the Columbia River, aboard his restored, mint condition, vintage power boat.\r Many CEOs don't use their boats. They buy one for status, as something to mention in cocktail parties, to prove their prowess. But actually putting out to sea is a big hassle, and not so much fun as golf, and so many a power boat just sits in the marina, under-used and under-loved (boats like to go boating). Anyway, Don loves his boat, and puts up with his cell phone, and uses the Columbia as his scenic headquarters for brainstorming about the future.\r Don is pretty smooth on roller skates (he can go backwards for example). He found me last night, lacing up my rented pair (size 14), at this rink in Oaks Park, not far from Humphrey Bogart's wife's ashes (or so Trevor informs me). This time slot was set aside for mature adults, and indeed most of them were more mature than I, and better at skating.\r Graying couples floated effortlessly, arm in arm. Khaki panted gentlemen (Intel engineers?) zipped past, leaving me figuratively in the dust (the rink's wooden floor is actually quite shiny and particle-free). A full scale wurlitzer was pumping out the tunes. This one guy circled the floor in an arms-out position, a soaring eagle (he even looked a little like John Ashcroft).\r One lady coasted up beside me and said she was glad to see she was not the only newbie in the rink. I nodded with a wry smile, and that little gesture almost tipped me over. But I kept my balance throughout the ordeal, not wanting to appear a disaster on wheels in the eyes of these seniors.\r Don and I repaired to a sports bar afterwards, to MacTarnahan's and a shared burger (they're really big at Stanich's, so one is definitely enough for two). We went over some of his notes about Wanderers, agreeing about our group's enormous potential, not to mention the many dreams already realized.\r One of my hopes was he'd be available to offer out-of-towners a spell on his power boat. Given Don supports Terry with the [ISEPP lectures](http://worldgame.blogspot.com/2005/01/beyond-gene.html), this invitation might be extended to our big name speakers (many are on a tight schedule but still find time for fun -- Don shared about Stephen Hawking enjoying a ride in a sea plane over Seattle that time).\r However, I can imagine other lower profile guests, affiliated with Wanderers but without their names in lights on the marquee of the Schnitzer, yet nevertheless appreciating the view from our CEO's Columbia River vantage point. Don sounded quite open to this proposal. He's very generous with his time, an asset way more valuable than money.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}