{
  "id": "6125238506764788538",
  "title": "PPUG 2008.10.14",
  "published": "2008-10-14T19:51:00.000-07:00",
  "updated": "2018-10-31T14:03:49.395-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgd6QFJSvZxwYlTfJButKzVc2tBMDpVn5ZP7uVtQBSRLGCnZx2-DGscHTtywsASRZCi64PkGjeNWl2UTpv_OeiCRVA3XsU8p2TyLuFQkbcica1rLQTTLWYf5vi6-5bnsr1KeDfa/s1600-h/advert.png)\nI'm [here at CubeSpace](http://worldgame.blogspot.com/search?q=CubeSpace) learning about the newest Pythons.  Jason has a green console for 2.6 and a scarier red one for 3.0, the backwardly incompatible one (scream!).  Right now, we're getting a demo of the new fractions module, way cool.\n\nJason kicked off the evening with attrgetter, one of his favorite microfeatures.  He's right, it's nifty and cute.\n[My lightning talk](http://www.4dsolutions.net/presentations/Py3K.pdf) was sponsored by Fine Grind Productions, a [new mathcasting brand](http://mybizmo.blogspot.com/2008/04/corporate-structure.html) I'm marketing, in association with a neighborhood coffee shop looking into the open source subculture as a possible source of future bookkeeping tools, ala my [Wild West high definition visualization libraries](http://worldgame.blogspot.com/2007/11/fixing-g.html).\n\n[Sometime in the future](https://wanderers.pbwiki.com/CoffeeShopsNetwork), when you buy that Cup o' Jo, you'll see [where your pennies go](http://controlroom.blogspot.com/2007/10/thoughts-about-bookkeeping.html), some percent to Mercy Corps, some percent [to AFSC](http://worldgame.blogspot.com/2008/05/adult-education.html) or whatever (depends on the shop).\n\nI'm spoofing the apocalyptic mindset, ala Y2K, suggesting we write a PEP for a new snake dance called The Writhe.  I suppose this is one of those \"you had to be there\" jokes.  My audience seemed receptive.  Watch YouTube for examples.\n\nNow we're looking at a talk [about multiprocessing](http://www.flickr.com/photos/17157315@N00/2942949601/) (import Process), thanks to Adam.\n\nGoogle's Blogger is down at the moment, inconvenient but I'll live.  I hope Jody isn't bored out of her mind (I'm sure she is, I didn't mention it was OK to use a laptop while others are presenting -- considered rude in other subcultures but not [in geekdom](http://worldgame.blogspot.com/2008/07/more-geek-anthro.html)).\n\nShe'd never seen CubeSpace before, so maybe this was worth her time, hope so.\n\nI should have used [this blog entry](http://mybizmo.blogspot.com/2008/05/chinese-names-in-python.html) in my slides, instead of the one I did, as the I Ching module I wrote works in earlier Pythons (talking about Unicode). [Later moved to Google App engine, then it went out of date with changes to the latter's API].\n\nThe open source coffee shop project has merit, maybe we'll take it somewhere.  Glitzy LCDs are a part of the plan, though they could be subtle, low key, depending on existing theme and decor.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}