{
  "id": "1828051918952050270",
  "title": "PPUG 2009.8.11",
  "published": "2009-08-11T22:13:00.000-07:00",
  "updated": "2009-08-12T10:15:49.915-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjTbtHOkranI21ED3biwZC5Su1blRd04u9fEE_9CPmRRiAB5NA0qZhr8sA6Kvu0m7tm8ysK4i11c9XsP2kRsLIBr1taYTPeqfe33bPHMCZuX3X5uWVkcKGKlESVfg1sb9OXFcYv/s1600-h/bug_detector.jpg):: bug detector ([from Flickr](http://www.flickr.com/photos/fotoopa_hs/3103153894/)) ::We're on top of the world tonight, at Webtrends, top floor in a downtown Portland sky tower.  This company obviously treats its people well.  Michelle of Emma (her company) is treating us well as well, showing up with large numbers of gourmet Hot Lips pizzas and premium beers.I'm glad I didn't eat supper, as this is definitely the real deal.The FM radio stations are fussing about the cloud cover. Tonight, the Perseid meteor shower reaches a climax but no one near Portland is going to see that. We've had clear skies until today, when it's overcast and rainy.You'd need to drive out the gorge anyway, to [escape light pollution](http://controlroom.blogspot.com/2008/08/escaping-light-pollution.html), but this weather means there's no viewpoint within a convenient driving radius (as a family, we tried Rooster Rock one year, somewhat disappointing).We're like 40 people here tonight, including one child (she's part of the videotaping crew), at least as many as at [the Ruby group](http://worldgame.blogspot.com/2009/08/relationless-dbs.html) the other night. I'd call this a party, although the chatter is unrelentingly technical, with some lore mixed in.My meeting with Patrick Barton earlier today focused on [simulation games](http://www.superstructgame.org/) as key to recruiting intelligent players into policy-making.  If you want to build customer loyalty around your power company's development strategy, then have them appreciate the world you face, including [their own role](http://controlroom.blogspot.com/2007/09/more-curriculum-writing-re-mvc.html) in that world.Patrick, an [accomplished psychometrician](http://worldgame.blogspot.com/2005/10/market-research.html), is persuaded that simulations often more effectively communicate about complex, nuanced systems than any number of research papers, though it's not either/or. Kids probably learn more about urban studies from playing Sim City than from most textbooks, for better or worse.We're not talking first person shooters here -- more like Civilization (Patrick had just been playing it, sampling the state of the art).The military has budget for such games, aimed at recruiting, why not civilians too?  Are we serious about nation-building, or just giving lip service?If your rural high desert academy sells power to the grid from its wind farm or micro-hydel, then let's visualize that as a part of the game. If you're a water bureau encouraging conservation, share a relevant simulation with the schools.Just before this meeting I was at Laurelhurst Rehabilitation Center visiting TC.  This is one of those \"as good as it gets\" care centers, where most of the overworked staff don't themselves get any health coverage as a part of their low-wage jobs.Meeting Tom's basic requirements, e.g. pain meds on time, has been an uphill slog.  Most people are less effective self advocates (especially if sedated), don't like to be squeaky wheels -- and so fall through the cracks sometimes (the system encourages this).Speaking of health care, North Americans were going berserk on TV about it, indulging in what passes for political debate around here.  Intelligent discussion is not what the public airwaves are about -- more like cartoons, corporately sponsored lunacy (i.e. entertaining fluff).  At least it's participatory.  The town meetings have been well attended.[Mindfulness and consciousness](http://www.freelists.org/post/wittrs/Conscious-vs-Mindful-brain-function-vs-mind-function) are separable concepts (per another filing today).As AFSC rep and liaison, I've been getting some readings from various points within the organization, helping me grok what some of the issues are.  I'll write more about that in some other post.  Carol (my mom) is on the board, so between the two of us, we get some good overview.Michelle did a short talk on [the optparse module](http://docs.python.org/library/optparse.html) (I remember exploring that on Amtrak's Coast Starlight for amusement, some years ago).  She has a nice loud voice and cheerful demeanor.  It's no wonder she's our leader.  Her example code spits out a \"Python meeting date\" given a -m month and -y year.  If you don't want to go, use the -e option and the Python Oracle provides an excuse.[Adam Lowry](http://adam.therobots.org/) is giving [a full-fledged talk](http://adam.therobots.org/2009/8/12/testing-my-patience), originally a candidate for OS Bridge.  This is about automated testing for Python projects, e.g. unit testing, functional testing, and web testing.The Standard Module's unittest module is fairly minimal.  It's a good place to start but gets difficult.  A [3rd party module called nose](http://somethingaboutorange.com/mrl/projects/nose/) is Adam's preferred solution. [py.test](http://codespeak.net/py/dist/test/test.html) is also worth considering.  Nose sniffs out any callable (e.g functions or classes) that matches a simple pattern (has the string \"test\" in it etc.), allows for setup and tear down.  [Doctest](http://docs.python.org/library/doctest.html) is somewhat limited.  Nose will work with it though.Fakes, dummies, stubs and mocks provide simplified behaviors, basically simulate working components.  For example, the decorator [@mock.patch()](http://labix.org/mocker) will replace a callable with some other callable.  We call this \"monkey patching\".  mox replays / verifies against expectations.  Suppose you want to simulate a database failing or other glitch, without actually forcing that behavior for real.  Testing libraries put your code in a simulator, apropos of the above.Could high schools have simulators, like OMSI has?  Patrick and I were yakking about teaching driving skills, but you could use simulators for other purposes as well.Now we're [looking at Twill](http://twill.idyll.org/), a tiny language for primitive web testing.  [Windmill](http://www.getwindmill.com/) is probably better than Selenium according to Adam.  This is if your project has Javascript and requires in-browser testing.Hey, check out [Igal's write-up](http://mail.python.org/pipermail/portland/2009-August/000806.html), quite succinct and not \"all over the place\" like mine.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}