{
  "id": "2780440723408681326",
  "title": "Pre Primary Politics",
  "published": "2023-06-26T16:50:00.012-07:00",
  "updated": "2023-07-05T14:31:38.951-07:00",
  "content": "I think Marianne is on track with her rhetoric, in terms of preserving a sense of continuity, to the extent that's possible in the United States of Amnesia (Gore Vidal's phrase).  \n\nShe's like most DCers (although not a DCer herself) in wanting to start the NATO war narrative on February 24th, 2022, when the lid got taken off a situation that was already quite kinetic.  The shelling of the Donbass had to be admitted as world historic.  \n\nNot everyone agreed on the tale to tell, leading to some serious bifurcations in the storyteller tree.\n\nThe hype around presidents has become farcical, with the candidates expected to promise way more than that office might constitutionally deliver.  Citizens with no imagination for democracy fall back on monarchical tendencies mighty quick.  That's the reflex base humanity has the most experience with.  \n\nDemocracy is science fiction, or might as well be, from the standpoint of how we're accustomed to behaving.\n\nIn that sense, I think Marianne is playing her cards correctly, in wanting to dial back expectations.  Americans should not assume such an entitled position, as one time victors in wars long ago.  \n\nIn these new chapters, history gets hammered into shape from a wider (more spherical) set of angles.  We get a more unshielded view of the inner workings.  It's more like having X-ray vision, and seeing more clearly where the bodies are buried (so many!).  We see a lot more of those skeletons, lurking in their respective closets, hoping to stay secret.\n\nThanks to a juvenile fascination with an imperial presidency on the part of the populace (neo-Romans in large degree), those posing to become president have to genuflect to this President on a Pedestal so many Americans carry around as egoic-iconic, closet monarchists that many of them be.  \n\nMarianne is no exception.  She doesn't have permission to just be herself, while running for the right to staff the White House with a lot more of her people.  That means she too has to pretend she has a magic wand.  \"Look, I can make all your debts go away and make your rent or mortgage affordable again.\"\n\nWhat democracy requires is a great deal more time spent on study, which is where a UBI might come in handy.  However giving them time to appreciate their real situation, with its quasi creaky UBI, is what the pandemic did already, thereby sowing discord around whether working from home might be OK.  \n\nThat wasn't supposed to become such a hot topic, messing up the real estate market big time.  Before the middle class goes down with all hands, it's making a stand in the suburbs, defending what was sold, not that long ago, as the American Dream.\n\nThe good news is many more democratically minded than ever are doing their homework more assiduously.  \n\nThe Pizzagaters have entered adulthood by now, and realize it's not enough to just give lip service to \"doing your own research\".  Its time to wise up.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}