{
  "id": "3567772393465992804",
  "title": "Presidents Day",
  "published": "2009-02-16T18:01:00.000-08:00",
  "updated": "2009-02-17T08:21:23.079-08:00",
  "content": "Tara returned from [her ski trip](http://worldgame.blogspot.com/2006/03/like-narnia-in-pdx.html) today, a Quaker event.  Now we're watching Simpsons, Alexia visiting, a day off for her too.  Julie is keeping me up to date [about mom](http://controlroom.blogspot.com/2009/02/family-bulletin.html).I've been networking with \"the professoriate\" today, got a wry one from Dr. Richard Hake, Emeritus Professor of Physics, Indiana University, about the quirky Math Forum archive, appreciating [my pithy synopsis](http://coffeeshopsnet.blogspot.com/2009/02/about-constructivism.html) of the constructivist meme (an abbreviated account to be sure).What really surprised me (pleasantly) was [this esoteric Java site](http://ring.perisic.com/), brought to my attention by one of the authors.  That's very close to the stuff I serve, albeit in Python and at a lower grade level, along with my [Vegetable Group Soup](http://www.4dsolutions.net/ocn/flash/group.html) in Flash.  Both Cryptonomicon by Stephenson and In Code by Flannery fit into our syllabus around here.I wrote [a long autobiographical piece](http://mail.geneseo.edu/pipermail/math-thinking-l/2009-February/001296.html), taking up bandwidth on math-thinking-l, focusing on [my New Mexico connections](http://worldgame.blogspot.com/2006/12/winter-in-santa-fe.html).  That got IEEE guy bandit yakking about his friend Glen the [Aikido guy](http://www.northbayaikido.org/) in Santa Cruz, reminding of me of [Ron Marson's TOPS](http://worldgame.blogspot.com/2008/10/claymation-station.html).There's a need for \"flight plans\" in [this airspace](http://www.mail-archive.com/edu-sig@python.org/msg04902.html), or we'll just waste energy dodging each other. Why not fly in formation?  What a concept!My thanks also to John P. Dougherty, Computer Science, Haverford College, for the kind note. \"And we also enjoy using Python in our CS1/CS2 sequence, so far so good\".[Dr. Chuck](http://www.dr-chuck.com/), good at branding, sent me the latest draft of his O'Reilly book [on the Google Appengine](http://www.appenginelearn.com/).  I've learned a lot from studying it, wrote a little demo of this nifty new service called [OS Garden](http://osgarden.appspot.com/).  This work goes back to my internationalization work, which I've been pitching to clients as a \"next big thing\" in some sectors, old hat in others I realize.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}