{
  "id": "2995571195820357763",
  "title": "Princeton Chatter",
  "published": "2018-06-06T14:51:00.004-07:00",
  "updated": "2018-06-16T22:43:40.434-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/41036734020/in/dateposted-public/)\n\nI set myself up for a battery of medical office visits and tests, all the same day.  What better time to catch up on Princeton Alumni Weekly? PAW we call it.  Clever.  Tigers...\n\nThe cover story of the June 6 issue features Olga Russakovsky, a professor looking at the issue of bias in Machine Learning.  If those gathering the data were racists (believed in races), chances are the machines will find those patterns all over again, thanks to the labeling.\n\nThe article Why America Stumbles... on page 19, seemed an example of how bias equals inertia.  Rick Barton looks at Syria, but not from an existential point of view.  \"Does Syria exist?\" is not in question, even though its sovereignty is violated daily.\n\n\"Does the USA exist?\" would be another question to ask, regarding this post Constitutional Banana Republic that took upon itself to bomb Syria recently, with great fanfare, in an effort to prove itself the Final Authority, complete with Nikki Haley's \"dead baby\" performance in the UN.\n\nFrom recent revelations about how Netanyahu of Israel (so-called) has been trying hard to start a war with Iran (Persia), the US (i.e. DC) complicit, we see that [a certain cabal](http://controlroom.blogspot.com/2018/05/judgement-day.html) is eager to set that tinderbox called Mesopotamia alight, and by extension the world.\n\nApparently the feigned chemical weapons attack in Britain was intended as part of the same war plan.  Get everyone hating the Russians, accuse Assad of chemical weapons use in April, and then go on the offensive, with the public eager for a big show.  That almost happened.\n\nFortunately cooler heads prevailed.  We know the hotheads are busily at work on their next subterfuge. \n\nAnnouncing the end of the Nation State Era has become an exercise in self and species preservation at this point.  Clearly the puppet masters are eager to pull whatever strings they believe they have.  Telling uncomfortable truths is better than sounding phony all the time.\n\nHowever Princeton Alumni Weekly is not prepared to be on the cutting edge, except insofar as its president reminds us on page 2 that universities often outlive nations.  That much is true.\n\nSo do they read Grunch of Giants in the Woodrow Wilson School?\n\nI agree with Chelsea Manning's recent remark in Berlin, that we're all machine learners.  We modify our existing belief systems in light of new data coming in -- or we don't.  We're all implicitly Bayesians, with brains reprogrammable by mind.\n\nContinuing revelation is a reality, the most sobering reality we know.\n\nSometimes belief systems freeze up and become specimens in some World Game museum. PAW is like that in some ways.  Stick to belief systems the alumni are comfortable with.\n\nIt's not that I expect the peoples of Spaceship Earth to spontaneously start up a new chapter by all gravitating to the same page all of a sudden.  There's some eternal truth in that Tower of Babel myth.  We never all had a chance to agree on those Nations in the first place.\n\nIt's just that it's a Small World After All, at the end of the day.  Universities know that better than most sometimes.  Congratulations to Maya Lin on the new installation.  I look forward to visiting it, maybe for my fiftieth reunion in 2030?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}