{
  "id": "8882709292417312695",
  "title": "Privatizing Public Parks",
  "published": "2013-06-28T14:19:00.001-07:00",
  "updated": "2013-06-29T11:39:03.830-07:00",
  "content": "[](http://www.flickr.com/photos/kirbyurner/5031900343/)\ncity contemplates padlocking public facilities to placate vocal private home owners\n\nFree access to Colonel Summers during posted hours, to the rain protection structure in particular, may soon be prevented if neighbors to the park are successful in privatizing this public property.\n\nA vocal minority would like to lower property values for others by behaving as if they lived in a gated community with the right to control public access, a short radius from downtown in a major metropolitan area, with public parks zoned for public use.\n\nThat includes sharing the roads, not just the parks, with cyclists and pedestrians, with people looking to get out of the rain sometimes.\n\nAt the other end of the spectrum are the more enlightened capitals, which keep municipal restrooms open, well lighted, spic and span during posted hours, with attendants as necessary.\n\nYes that costs money and yes that's what public funds are for, not locking restrooms and gating kiosks.  Civics 101.  Yes trash accumulates.  Pay to have it removed.  It's a park.  Remember \"park\"?\n\nThe city's plan to kill its own parks is of course counter-productive as it lowers land values for everyone to have a city that's unintelligently managed and advertising that fact by [padlocking the bathrooms](http://www.flickr.com/photos/afscportland/9096632775/) it can't manage to operate.\n\nUgly porta-potties replace stately FDR era public works, more evidence of an Idiocracy in charge, squandering our collective inheritance.\n\nProtecting urban ecosystems and subcultures from gentrification and conformity is part of no one's job description.  This is how wetlands get paved over and intellectual hubs get destroyed.\n\nSummers has been [a switchboard](http://worldgame.blogspot.com/2010/09/switchboard-activity.html).  Food Not Bombs uses it to serve healthy vegan food to triathletes and marathoners.  A youth-knit subculture that helps keep communities in touch runs through here, connecting the Americas by bicycle.  It's a migration stop for exotic species -- of human.  Some of them make noise.\n\nEnlightened neighbors would (some do) feel blessed and privileged that their park is valued and used in this way.  It's not a boring deserted vacant space, a park in name only.\n\nIsn't this close to Hawthorne and Belmont, reportedly cultured?\n\nDoesn't Portland have a reputation for weirdness, self-cultivated, business supported?\n\nCan one have the talk without the walk?  Isn't that called hypocrisy?\n\nWhat a great way to bring death and rigor mortis to a neighborhood.  Run [a pogrom](http://controlroom.blogspot.com/2006/10/american-pop-movie-review.html), by hijacking the city to play the heavy.\n\nI've spent a ton going back and forth between that park an the nearby Barley Mill as well as eating for free, or serving my friends.  That's my playground too, a favorite destination by bicycle, sometimes Tri-Met.\n\nForgive me if I sound pissed.  Lets say I despise bullies, especially / including the ones who hide behind the mask of anonymity.  We all know that bullies are the worst of cowards.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}