{
  "id": "7286863238813292912",
  "title": "Process Work",
  "published": "2018-06-02T19:00:00.000-07:00",
  "updated": "2018-06-02T19:08:10.080-07:00",
  "content": "At the Pow wow [pic.twitter.com/YfKEwHcOZp](https://t.co/YfKEwHcOZp)\n— Kirby Urner (@4DsolutionsPDX) [June 1, 2018](https://twitter.com/4DsolutionsPDX/status/1002680858455695361?ref_src=twsrc%5Etfw)\n[ if the picture isn't embedded that's because your browser is being strict about blocking 3rd party URLs from unfurling, which is your choice if you know how to toggle browser settings (otherwise it's their choice) ]\n\nOne of my presents, for my sixtieth birthday, was some workshops at the Process Work Institute in northwest Portland.  The details of what goes on in some of the sessions is confidential, but I think it's safe to say that citizen diplomacy is a theme, even if we don't call it that.  Arny (Arnold Mindell) calls his process Deep Democracy.  Students connect from all over the world.\n\nI tweeted up a storm as I was riding buses 75 and 15 to the venue.  The Global Matrix meeting at Glenn's pad had featured beer and pizza (Nirel was doing watermelon), and with some minutes to spare I dropped into a very local yokel joint on W Burnside, the opposite of upscale fancy, for a low cost Rainier, tallboy can. \n\nThe upshot is I was somewhat relaxed and sleepy at the workshop, which is not all together inappropriate given the emphasis on staying in a day dreamy state even while navigating in CR (consensus reality).\n\nTourism gets a rep for being purely recreational, even though travel is a form of work.  People come to Portland from all over the world to pursue their careers, but that may count as \"tourism\" if there's no obvious business paying expenses. \n\nWhen soldiers do their tours, in the line of duty, that's not considered tourism either.  How about when our family went to the Parliament of World Religions in Cape Town, and my wife did a workshop with the Dalai Lama in Durban?  Was that tourism then?\n\nSomeone from Cape Town was in our car going back to Asylum District.  This was her first time at PWI, but she wasn't new to process work.\n\nThe reason I ask is because citizen diplomacy is exponentially more doable given telecommuting and given businesses have as a part of their agenda a commitment to team building and staffers getting along.  The \"melting pot\" may not be a zip code so much as a virtual space in Cyberia.\n\nChoreography matters.  People want to see big organized dances, be those military parades or the Olympics.  We become persuaded of our ability to synchronize, as a species.  That's political capital for other ventures.  Or psychological energy, depending on your shoptalk (vocabulary, namespace).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}