{
  "id": "6992433040098463777",
  "title": "Public Schools Overseas?",
  "published": "2007-01-04T13:36:00.000-08:00",
  "updated": "2007-01-04T21:28:05.939-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgoz0jpSGud3Z4mRL1tWhoRRsghQvb3OQRRqacdxwzwvMJKAWvmXpbI4-EoI-Fv4hVypjAj9zRqne2PA5FM4bD__KU4F5_Z2gwop_K463v2Oz-1Iz1Hmx2Kli_zcuM0xNYEbhEq/s1600-h/tarapython.jpg)Tara with PythonSocorro, New Mexico photo by Richard Sonnenfeld Expats from whatever nation face the quandary of needing to prepare their kids for success in the home country, while meanwhile availing of this opportunity to absorb native memes, native culture.So, for example, here in Oregon you'll find a lot of Japanese students cramming to pass those exams they'll face back home, while meanwhile trying to learn English and Americanize to some useful degree (many future career paths are open to such \"dual core\" students).My wife and I were just having lunch at K2, an excellent Pakistani type restaurant near the Pauling House and I shared this fantasy of opening a USA public boarding school in Thimphu or Bumthang or some such place.Partly, it'd be for American kids, not even necessarily from expat families, and partly it'd be for a subculture within Bhutanese society that wanted to Americanize to some degree.  But instead of enrolling in some distant Columbia School of Journalism, as did one of the [Kuensel](http://www.kuenselonline.com/) editors (cool guy!), they could start right at home, seeing if this seemed a promising way to go or not.Other nations could likewise have their public schools, like the Swiss, already a presence, with a [bakery](http://www.virtualtourist.com/travel/Asia/Bhutan/Restaurants-Bhutan-BR-1.html) and everything.Given recent history, however, with Bhutan wanting to steer clear of arrogant superpowers, it's more likely that Canada would get there first.  Already, [WUSC](http://www.wusc.ca/) volunteers have the benefit of Bhutanese sojourns, while the Peace Corps has far less of a presence, if any.At least, that was the status quo when my parents were there, and I never criticized it.  I think Bhutan was wise to take a wait and see attitude vis-a-vis those USAers.That being said, I think high integrity USA type schools overseas, offering free choices to both  locals and USAers alike, is a good idea in principle.  We already have them for embassy kids, other expats, but here I'm proposing going a step further, and opening up these academies to  stateside families, perhaps as a boarding experience, and on the public dime, because it's in our long term national interest to do so.Or is the goal to keep making enemies hand over fist?  Definitely the USA has been good at that lately, what with these ugly and irresponsible \"Warlords R Us\" magazine covers.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiNjqXCuzsO0gdokcDq6pYkoIzNrT3d58jt9lyU8zev9b1XXutl-GTmhppvysTuQ1jb5raOKOCKGz0IStuwn_52ERGQhhSEGSz1BRljA0IbULKn_kR5ZApYsZ92QUnG74fuv7rW/s1600-h/popMechMagCoverX51.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}