{
  "id": "5468944204205098121",
  "title": "Puttering",
  "published": "2008-07-21T22:50:00.000-07:00",
  "updated": "2008-07-23T16:07:06.654-07:00",
  "content": "I'm back in the saddle (new office chair, from Office Depot), reconnecting with my Portland matrix after a few days [in Corvallis](http://worldgame.blogspot.com/2008/07/quaker-portal.html).Nick is heading the other way, having tended to the flora and fauna in our absence.  I took him to Fry's in Wilsonville so he could check out the latest in tiny laptops, maybe for a next Europe trip, and so I could begin acquiring [parts for KTU4](http://worldgame.blogspot.com/2004/12/welcome-to-my-world.html), a next office monster (plus I bought a Cosair flash drive, 4 GB, for just $23).Today's big investment:  a Diamond branded version of [ATI's Radeon 4850](http://www.tomshardware.com/news/amd-ati-radeon,5514.html), 512MB etc., sold at a discount, plus rebate (about $150 all told).  My bookkeeping and other projects will be happier with more throughput.Why not just use the PCIe slot in KTU3 you may ask?  Well believe me I thought of that, but this lower end HP Pavilion a1630n has only a 300 Watt power supply with no PCI power connector.   So for now I'm sticking with Nvidia GEForce 6150 LE, the mobo chipset, running at 85 hertz.  Should I get a [PCI power adapter](http://www.newegg.com/Product/Product.aspx?Item=N82E16812189120) and try the new ATI anyway?  A new power supply might be a better idea.The annual open source circus is in town (OSCON) meaning people to see, parties to join.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjvaKDxEp1Xbf15bwnqKWvNznhMRg37XbmSMlWxP6KD2hgHdXwcDAsRWpnKD7ze_ELImkNUnwz1O6dhsJ5VyfC2pphENnx1YAryP_amcVs2GApPirkuAmixawgWneaBHqU67gDiWQ/s1600-h/anna_inanna.jpg):: Anna and Inanna (cool hat) ::Later:  I had a good time showing [Steve Holden](http://holdenweb.com/) around Hawthorne, including the Linus Pauling House, where I introduced him to Patrick Barton.  Steve and I then joined Andy Baxter (with Google Australia), [Duncan McGreggor](http://oubiwann.blogspot.com/) ([divmod](http://divmod.org/)) and the Martelli family ([Anna](http://c2.com/cgi/wiki?AnnaRavenscroft), [Alex](http://c2.com/cgi/wiki?AlexMartelli) and Inanna) for excellent food at the [Montage Bistro](http://www.montageportland.com/), 301 SE Morrison.  Good call Alex!Don and Glenn went to hear Mark Shuttleworth's talk; I'm looking forward to their reports, plan on catching [his keynote](http://worldgame.blogspot.com/2008/07/business-buzz.html) tomorrow evening.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}