{
  "id": "7201395886937607167",
  "title": "Pycon: Looking Back",
  "published": "2017-05-22T11:01:00.001-07:00",
  "updated": "2017-05-22T12:07:25.793-07:00",
  "content": "[Pycon](http://worldgame.blogspot.com/2017/05/pycon-begins.html) was very sciency this time, and I'm plenty glad about that. We're up to developing 3.7 around now, with a lot of emphasis on asynchronous capabilities.  That's event loop programming, not unlike event-driven GUI programming, indeed it's the same (to some degree).\n\nMost the examples seem to focus on network probes, and how those might take forever.  An await state keeps something trying, working to fulfill some promise, complete some task, even while other coroutines get on with their business. \n\nThe paradigm of multi-threading is germane, it's just Python takes responsibility for expressing how the players should share, leaving the operating system to think in terms of a single process.\n\nOne of the keynotes was an astronomer, another a nuclear physicist engineer, studying the complete fuel cycle, from cradle to grave.  We flashed on pictures of space telescopes, like the Hubble, [the Hubble itself](http://worldgame.blogspot.com/2010/04/python-gig.html) (still operational in 2017), and considered how Python is a boon to the scientific community.\n\nI got to meet with the SciPy / Cuba guy, Olemis Lang.  He's facing some of the same logistics encountered [by Steve Holden](https://www.flickr.com/photos/kirbyurner/albums/72157679832806496), former PSF chairman and conference organizer (starting with Pycon itself). I'd be his sidekick through some of these events, taking in the business in a more [backseat driver role](http://mybizmo.blogspot.com/2011/09/my-character.html).\n\nEd Leaf and I reminisced [about FoxPro](http://controlroom.blogspot.com/2014/10/reminiscing-about-conferencing-software.html) quite a bit, another coding language community that went through phases.  \"Every language has its story\" I remind my \"Python radio\" audience (really more like TV).\n\nJeff Elkner of edu-sig came through as well.  This was during booth and poster time.  CS is now well-established throughout the states, lets assume, at the level of standards (what Jeff has been helping with, in Virginia especially), but on-the-ground implementation is another story.  Urban versus rural: it makes a difference.\n\nBridging to the agricultural sector(s) is a big part of what open source is all about these days, because agriculture, bar none, is a science, from population genetics to pathology (we also compared notes with Sheri Dover, also a scientist by training, and code school insider), to business management.\n\nIf interested in the Cuba stuff specifically, remember [python-cuba](https://mail.python.org/mailman/listinfo/python-cuba) is an open archive, [as is edu-sig](https://mail.python.org/mailman/listinfo/edu-sig). Some years ago, Pythonistas came to the realization the Cuba could be another Python hub, given proper care and nurturing by the various users already there.\n\nPython use is skyrocketing thanks to a vibrant ecosystem and ways of making science journal articles come alive with Jupyter Notebook versions. Share the data, share the process, with your peers.\n\nMostly I served as sidekick to Dr. Charles Crosse, a physicist by training, adventurous and risk-taking by temperament, with experiences as far off the beaten trail in Guyana as it's possible to get (a world of river rapids, crocodiles, anacondas...).  He'd served in the Peace Corps in Kenya before that.\n\nHis infrastructure for governing access to elective cyberspace, based on fulfilling requirements (buying time), was completely working as a prototype.  He'd ported some puzzles from SugarLabs. Reading assignments complete with fill in the blank follow-up / recalls could be generated on the fly. We did one on Isaac Newton, as a test.\n\nThe gist:  a server in France provided \"bird feeder\" credits towards keeping the router open for other purposes. Developers, supported by consciously allocated subscriptions or purchases, build these life-giving games (we're talking about cyber-lives, time on the Internet, not miracle cures, not snake oil), whereby students net metered credits, the currency of \"staying on-line through this particular router\".\n\nOf course it's easy to bypass a router, a Raspberry Pi in this case, but that's all family politics. Once a given router is accepted as a valid player, according to whatever rules, one has incentive to rack up higher scores.  I see plenty of applications to Coffee Shops Network, which features charitable giving games, a casino to benefit the deserving recipients of winners' winnings.\n\nThe job fair booth people have to answer whether their place of work allows remoting in from places like San Antonio.  Do they have telecommuters?  I was tied to the poster, complete with working Pi and slaved tablets (representing metered clients), so took my job booth pictures mostly during setup, when I was free to roam.  I fetched Charles a couple turkey sandwiches before they all disappeared.\n\nMy transition to post conference mode involved taking the Max downtown with Charles for a hand off to Luciano outside the Apple Store, after which I Maxed it back to maxi taxi and headed for the FredMeyer rooftop parking slots.  David Koski was there on Hawthorne at Fresh Pot, embedded in Powells, across from Bagdad.  He was touring in the area.  We walked backed to the car through Freddies, purchasing coffee and shaving cream.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}