{
  "id": "2601725111733429987",
  "title": "Pycon 2012 Day One",
  "published": "2012-03-09T14:15:00.000-08:00",
  "updated": "2012-03-13T09:07:36.047-07:00",
  "content": "US Pycon 2012 help define the life of the Silicon Valley today.  That's what our second keynote speaker said, some kind of venture capitalist (Paul Graham, Y Combinator), though not with much experience in the medical field by his own admission.  His list of [ten possible startup ideas](http://www.paulgraham.com/ambitious.html) was interesting.  He's in a mood to compete with universities, give them a run for their money.\n\nPaul steered clear of my philanthropic games with profiles, an open business model, possibly because it's not really in startup phase as a concept -- the ideas are all ancient (\"potlatch economics\" an influence).  I imagine the specifics of game design, coffee shop floor plans, locations, aesthetics, gift shops (Avalon another influence), will emerge in different frequencies (tied to ethnicity).\n\nStormy Peters from Mozilla challenged the developers in the room to keep the Internet open and free, by which she meant opening sharing how personal data is used.  Transparency doesn't necessarily mean a lack of privacy, but does mean a more equitable sharing of what's being collected in some cases, especially where the general public is concerned.\n\nI just came from the PSF members lunch in Magnolia Room.  Michelle was there, the first member I've sired, having been nominated and elected in relatively recently myself.  I sat with Eric Jones of Enthought out of Austin, and a guy from Google / Amsterdam responsible for deploying Python on Google's machines.  A guy from RangeSpan was there as well.  This was just one table of a great many. \n\nThe PSF has way more corporation members than the AFSC does already.  Both are non-profits with international reach.\n\nI'm hitting some of the most introspective talks meaning focused on the language itself.  [Raymond Hettinger](https://us.pycon.org/2012/schedule/presentation/399/) looks a lot like George Clooney I think. \n\n[Jack Diederich's Stop Writing Classes](https://us.pycon.org/2012/schedule/presentation/352/) was awesome, as was [Interfaces and Python by Eric Snow](https://us.pycon.org/2012/schedule/presentation/126/).  Sorry [Jeff Rush](https://us.pycon.org/2012/schedule/presentation/45/) was out sick.  So was Jesse a lot of the time.\n\nQuite a few new babies this year, some of them with us.\n\nThe imams and rabbis I attended to were looking at the depths of the language.  Learning how to create synthetic functions, classes and even modules on the fly:  the subject of Walker Hale's [meta-programming talk](https://us.pycon.org/2012/schedule/presentation/380/). The previous talk [on writing decorators and context managers](https://us.pycon.org/2012/schedule/presentation/131/) was also helpful to me in my work as a teacher.\n\nThese talks should be coming out on video later.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}