{
  "id": "5207719790857667224",
  "title": "Quaker Geometry",
  "published": "2008-02-26T09:21:00.000-08:00",
  "updated": "2015-11-05T13:37:05.252-08:00",
  "content": "[ quirky: making XYZ vs. [Quadrays](http://en.wikipedia.org/wiki/Quadray_coordinates) seem like a bone of contention among religious denominations, a different angle for sure! -- KTU ]\n\nSo most Anglicans, if pressed for how many directions in space, will think back to schooling and some chatter about three dimensional.  \"If by directions you mean dimensions, then space has three\" the proud Anglo might say.\n\nThe graphic behind this is the [six-sided die](http://worldgame.blogspot.com/2007/10/ppug-cubespace.html) or hexahedron aka \"qyoob.\"\n\nAlternatively, take three BBQ skewers and intersect them in a mutually perpendicular arrangement, binding at mid-points with leather thong or whatever.  Stabilizing the tips with fishing line might be good, in which case you'll get an octahedron of sorts.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg8yGotsoRn2e-oW0CTu-lOBYwTKAmAyWscrGTF2FzWH45GOWUyQAEgKs7B8XFS-CzdglUlOVU3yzbub8UwbWUV-Sc5c3fByKM-q0muMK0c6-Q5ZngGzSSIDDcIckDgm4WRGbF3/s1600-h/6spokes.gif)In Quakerdom, some of us learn from Lakota about the four directions, typically designed for planar applications (the Lakota being a plains people), but with a corresponding four sided, four tipped arrowhead, or tetrahedron in Greek.\n\nTo morph the four-square into an arrowhead-tetrahedron, skew it and crease along the short diagonal, then fold the tips to within unit-edge distance ([Richard Hawkins](http://www.newciv.org/Synergetic_Geometry/) and I implemented this transformation in [ClockTet](http://www.grunch.net/) awhile back).\n\nYou can see why the \"4 directions of space\" answer might be appealing:  a minimal four vectors splay outward from a common origin, dividing space into four identical quadrants.  The Anglican cubists introduce three more negative vectors starting with their positive three, creating an 8-fold partition for their so-called Cartesian coordinate system.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgADeEpxSuZpHnXqV3h50lFuieqYLN09zdrIfNKWzDOlN692wqQICQQ9A-yyKf_88KXJ6awY2JU3gzKwWctF_nqMpSTQ4ziwGMram7QLit1FCfjevqYJU8Q7XAv6Okz9dIj-AQ5/s1600-h/4spokes.gif)Using [quadray coordinates](http://www.grunch.net/synergetics/quadrays.html), or Chakovians, as they're sometimes called, we address all the same points with only positives along each arm, starting from (0,0,0,0) at the origin, thereby saving the negatives for some inside-out dual or mirror space.\n\nOf course nothing prevents us from [inter-converting](http://www.grunch.net/synergetics/quadxyz.html) 3D XYZ coordinates with their 4D IVM counterparts, nor are Quakers raised without the usual XYZ savvy.  These language games are not mutually exclusive obviously.  Like, the calculus cookie doesn't now suddenly crumble, any more than it already did.\n\nAnyway, we teach multiple meanings of 4D in some of our schools, gleaning from such excellent books as The Fourth Dimension and Non-Euclidean Geometry in Modern Art by Linda Dalrymple Henderson ([ISBN 0691101426](http://www.amazon.com/Fourth-Dimension-Non-Euclidean-Geometry-Modern/dp/0691101426/)).\n\nLike Coxeter's adding a fourth axis, turning a cube into [a tesseract](http://en.wikipedia.org/wiki/Tesseract), was not the same move as Einstein's when adding a fourth \"time dimension\" (see Regular Polytopes [page 119](http://controlroom.blogspot.com/2006/08/more-dimension-talk.html)).  Our Quaker 4D, inherited from American Transcendentalism and medicine wheel shamanism, is a move by yet different rules again.  That's why Anglos call it \"maths\" (plural form), because of all this diversity lurking just beneath the surface.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}