{
  "id": "7457647872445709848",
  "title": "Quaker Communications",
  "published": "2015-04-24T10:02:00.002-07:00",
  "updated": "2015-05-03T10:15:53.486-07:00",
  "content": "The bold faced quotes come from:\n\nFRIENDS AND EMAIL: Guidelines, Concerns and Reflections, offered by the Committee on Ministry and Counsel of Claremont Friends Meeting, revised and approved in CFM Meeting for Business on 27 January 2013.\n\nMy thoughts are interspersed.  An earlier version of this posting was share via the npym-it-discuss listserv.\n\n===\n\nEmail is a poor medium for corporate discernment.  Lines on a computer screen or down-loaded page cannot convey the full range of communication —facial expression, tone of voice, body language, etc.  Thus emails can easily be misunderstood.\n\nThe thing about written communications, of which emails form a subset, as well as books, pamphlets, scrolls, documents of all kinds, is they allow us to interact with people who may have recorded their views long ago and now don't get to have facial expressions or body language.  John Woolman,  George Fox...\n\nTelephone communications privilege the still-living.  Organizations with strong staying power do not dismiss the elders / ancestors so easily i.e. we still read and attend to past writings.\n\nFace-to-face meetings are even rarer and even more of a privilege.  I really appreciated our getting together in Tacoma on April 11, but then that cost huge amounts of time and fuel.  Any lean / efficient organization with a dispersed crew cannot rely on such expensive events occurring often.\n\nMy day job is the same way:  our crew is all over the country and we're lucky to see each other but once a year.  I'm at Earlham College at the moment thanks to my company paying my way to-from St. Louis for a conference, which we use as an excuse to also meet as a company.  I came out a week early and rented a car on my own dime so I could drive to Richmond IN to visit my daughter.\n\nMy day job involves having Skype open so we can have a scrolling chat window, plus we have voice meetings, like conference calls, every week.  I meet with my super by voice once a week as well.  I can do my work wherever there's WiFi.  We use email a lot, including to / from groups (named CCs).\n\nThe telephone is a 1900s invention that revolutionized everything and Friends now take conference calls for granted.  They may be less experienced using written communications, but journaling used to be a primary way for Friends to communicate across time and distance.\n\nI recommend that Friends seriously encourage blogging as what we used to call journaling or keeping a journal.  These were kept with the idea that others would read them.  Friends stay accountable through journaling, a form of written communication.\n\nWhat I don't appreciate about the one-sided Guidelines is the disadvantages are primarily a result of unskilled use (we don't get better but with practice) with the conclusion that skillful / sensitive conference calls should take priority where corporate discernment is concerned.  This assumes high level phone skills.  The guidelines stack the deck:  experienced phone users trump inexperienced writers.\n\nNo individual takes responsibility for this view.  It gets encoded as some Meeting's guidelines and before you know it, those attitudes and biases will have spread to other Meetings, unchallenged and anonymously promulgated.\n\nIf more of this debate were done by journaling (in the blogosphere) we would see more clearly who was behind what viewpoint.  Quakerism is not about hiding behind masks of anonymity.\n\nWhenever possible, corporate discernment should be conducted face-to-face, or when that is not possible, by means of sensitively-managed telephone conference calls.\n\nI completely disagree with this conclusion and think the authors of this document spend way too little time discussing how the shortcomings of email, such as misunderstanding the writer's meaning, or not being able to open attachments (phone calls don't have attachments), may be addressed.\n\nIf the meaning of someone's communication is unclear, ask for clarification. Get into a dialog.  Others may jump in.  The process is asynchronous and allows for reflection and consideration.  It's also more accountable.  \n\nSo in my view listservs are more ethical than conference calls on many levels.  \n\nThose dismissing emails and listservs in favor of conference calls should not be given free rein to dictate these views as somehow already a fait accompli in our Faith & Practice.\n\nBackgound:  M&O clerks in the NPYM region are preparing to have a conference call on this issue which may lead to strictures (\"guidelines\") that put a damper on listserv use, whereas I think Quakerism is happier with the written word than with ephemeral telephonic vibrations in the ether, not anticipated when [Quakerism](http://worldgame.blogspot.com/2015/05/quakers-what-do-we-offer.html) was forged.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}