{
  "id": "8351432352670489553",
  "title": "Queen of the Desert (movie review)",
  "published": "2018-04-06T16:45:00.001-07:00",
  "updated": "2018-04-08T13:18:52.023-07:00",
  "content": "I took in this masterful piece of storytelling at Glenn's place.  He had it checked out of Multnomah County Library.  Nicole Kidman plays Gertrude Bell, and creates a haunting tale of a big soul, another Tara in her world (this one of camels and pyramids, and Lawrence of Arabia -- set somewhat the same time as Wonder Woman, [the big movie](http://mybizmo.blogspot.com/2017/06/wonder-woman-movie-review.html)).\n\nGertrude felt horribly penned in by British domestic society and begged her dad for more adventure. Good patriarch that he was, he found her a situation in Tehran, where she fell in love with the culture, and the third ranking secretary (male persuasion). Her dad was not about to give his property to that gambling house (they wished to marry) and the situation deteriorated (neither was fully a master of their own destiny, but then who is?).\n\nFlash forward, and Gertrude is amongst the Bedouin.  She has the truly healthy and in no way twisted ethic of the anthropologist just hoping to understand her / his fellow man.  She knows at some level that she's helping to stabilize the situation simply through the force of her own integrity.  The men respect that and understand she's playing as they do, for high stakes and respect.\n\nWerner Herzog employs either cranes or drones we don't know, perhaps all mysteries were revealed in The Making Of, but on this date and time, I needed to withdraw and continue with my overall mission.  That includes another rendezvous, and then more thinking about Machine Learning in tandem with Synergetics.  Glenn was all about Bayesian geostatistics this evening, flipping through the latest Nature.\n\nI think of my mom and her sojourning with Coptics, south of Cairo.  Women with big souls often are first over the walls, you could say riding broomsticks, but why not also with respect.  Women are not some lesser species, after all.  Not that this needs reiterating in polite company.  Feel free to resume enjoying your desserts.  Coffee anyone?  I think I'll have one.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}