{
  "id": "2091330944703819598",
  "title": "Queued @ Math Forum",
  "published": "2007-08-20T12:09:00.000-07:00",
  "updated": "2007-08-23T11:26:38.335-07:00",
  "content": "[ math-teach turned into a moderated list in the Summer of 2007, so the data structure known as a \"queue\" became more self evident ][                 More Prototyping (gnu math thread)](http://mathforum.org/kb/thread.jspa?threadID=1610399&tstart=0)Posted:                 Aug 20, 2007 3:05 PMPer Summer of 2007 developments, we're consolidating around MVC as a useful abstraction.  That's [Model, View, Controller](http://worldgame.blogspot.com/2007/08/model-view-controller-mvc.html).'Model = global climate model' in many a namespace, with a public increasingly wanting to know how the [Renaissance in geospatial](http://controlroom.blogspot.com/2007/07/geospatial-and-open-source.html) is going to impact their lives, for good or for ill.  Views = ugly, unless you study design principles, such as well captured in Tufte or other masters. Controllers = any Logic amenable to machine execution, which is most of 'em by this time.In the 8th grade, we associate Algebra and Modeling, using Sims type analogies to explain arrows and boxes, ala MIT's Forrester studies, other simula such as Dom Rosa oft criticizes -- but which we have need of in the adult world, so someone should learn the ropes, no?Algebra has the advantage of remaining invisible to the naked eye, unlike Polyhedra, which sometimes get confused for the real thing, and so should be relegated to the category of Views perhaps.  The \"connecting around in all circumferential directions\" characteristic pertains even invisibly however.By 9th grade, we're ready for [Vector Algebra](http://www.4dsolutions.net/ocn/numeracy1.html), a small tweak to make our set members more graphical.  We have closure under addition.  It's also easy to adopt various forms of \"multiplication\", some of which disclose properties of the underlying manifold (field properties).We're laying a groundwork, in other words.  The controller language is whatever comes with the teacher.  Some come shrink-wrapped in Perl, others in Ruby.  Just because the machinery is discrete doesn't mean we can't [model Calculus](http://www.4dsolutions.net/ocn/catenary.html).By 10th grade, we're doing Polyhedra, following a lot of the same Euclidean templates as before, with regards to proof by deduction, mathematical induction.  We do more with Euclid's Algorithm for the GCD, including extended.That's because we're aiming to cover RSA by the end of 12th grade, with branch points available in the 13th to cryptography, Internet security, other important careers.None of this is all that new, minus the headline, which is agreement around MVC as an important design element. That gets us access to such topics as SQL and GIS/GPS in a hurry, meaning back to that geospatial and all those simulations of the global climate that so concern us.Kids need to be able to track what the adults are focusing on.  That's a moving target.  One cannot afford to always recycle yesteryear's curriculum, that much is clear.Kirby                                       Posts:                      3,828                                                                      Registered:                      12/6/04",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}