{
  "id": "3799352748395862320",
  "title": "Radar Blips",
  "published": "2017-06-04T23:01:00.002-07:00",
  "updated": "2017-06-14T07:56:44.941-07:00",
  "content": "In case you're a long time reader of this blog, or a relative newcomer with a Sherlock Holmes bent, wanting to piece it all together like a Russian novel of interweaving scenarios, let me look at some loose ends.\n\nThe pristine wood hull motor boat that featured often in blog posts and pictures, especially in warmer weather, is still with us, but under repair.  A boat seeing as much use as that one, way above average, incurs wear and tear. The only real question is whether anyone around is skilled enough and has the time. Don and Barry have been on it.\n\nAlso speaking of Barry, his big project to keep himself in shape and amused was to convert a legacy motorcycle, a big one, into something two-wheeled yet enclosed.  The prototype has been test driven, however the loose end is I've not been present to photo-document anything.  It's front-heavy on steering and a next iteration is planned.\n\nFormer housemates have been meeting among themselves, crossing paths at different times. Jen has moved to California with Yarrow, growing up.  Melody drove down there and visited.  Maybe Lindsey got there later?  I'm not in her loop.\n[](http://mybizmo.blogspot.com/2017/06/wonder-woman-movie-review.html)\n[Speaking of Lindsey](http://mybizmo.blogspot.com/2017/06/wonder-woman-movie-review.html), a looped through her music on Facebook again, spiraling through some of her showtime posters.  She was a keyboardist / singer with a big love for her drum machine.  With me as chauffeur, she could pull off real gigs.  Archive.org has her at the Egyptian Room in Portland (long gone).\n\nMy two daughters are both working hard in their respective roles.  We've been sharing developments on email with Carol (mom) and my sister Julie.\n\nToday we had some tense times downtown thanks to various rallies and counter-rallies.  We seem to be forgetting the past and dooming ourselves to its repetition but then history doesn't repeat, not really.  OK somewhat it does.\n\nPatrick bounced down there on foot, busing back.  We're both yammering about Python this week, in a code school setting.  I'm studying his textbook, to which I contributed, plus we both learned from Steve Holden, author of an earlier curriculum we both used, when mentoring for O'Reilly School (since closed).\n\nSpeaking of Steve Holden, you'll find where he bounced out to the West Coast for meetups and business, but he's a citizen of the UK and has lived there for some time.  We see each other on Facebook and like that.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}