{
  "id": "1259456213697959202",
  "title": "Radical Women",
  "published": "2009-09-26T15:31:00.000-07:00",
  "updated": "2009-09-28T11:53:06.414-07:00",
  "content": "I chauffeured LW to this meeting of [Radical Women](http://www.radicalwomen.org/), mostly not planning to say anything, just eat (a potluck, she made fresh cabbage and [corn bread](http://www.flickr.com/photos/17157315@N00/3957147885/)), however I did sign on to the queue on invitation i.e. some of the leadership expressed curiosity about a possibly male viewpoint.I spoke briefly about [my diversity work](http://mathforum.org/kb/thread.jspa?threadID=1989029&tstart=0) with Python Software Foundation.  Most of the conferences in this subculture consist predominantly of men, yet those women managing to penetrate the clubhouse tend to hold leadership positions i.e. there's a meritocracy at the center that's mixed gender or even tilted towards women (thinking about computers more generally).My daughter texted, hoping for more budget for her speech and debate costume.  So far, my offers to perform front lines teacher training duties have met a brick wall, while the chauffeuring pays but a pittance.  However, not wanting to be any of the characters in a Dickens novel, scroogey or otherwise, I trucked my ass down to [In Other Words](http://worldgame.blogspot.com/2009/08/education-planning.html) and accessed my bank accounts over encrypted wifi, transferring a few dollars [from DWA](http://worldgame.blogspot.com/2007/04/boring-tax-story.html) (the business) to Tara's charge card.  On the way, I stopped by at PCC, Cascadia Campus, and studied [its diversity literature](http://www.flickr.com/photos/17157315@N00/3957923736/), always on the lookout for examples, given [the PSF work](http://mybizmo.blogspot.com/2009/08/diversity-training.html) I mentioned.My working hypothesis is many of those in the free and open source software community haven't taken the time to become politically conscious.  They've been too busy nerding out to really get a grip on these codes, notoriously crufty and difficult to operate.Given Portland is a relatively small town, it'll be interesting to discover what kind of overlap exists between political awareness groups such as Radical Women, and the [FOSS bosses](http://coffeeshopsnet.blogspot.com/2009/06/os-bridge-conference.html) who also happen to be female, although I'm also alert to cross-enrollment among men.  It's not like I'm keeping detailed lists or anything.  Nor was I intrusive with my camera, knowing better than to take a bunch of mug shots on a first visit.My hypothesis suffers a glaring weakness however in that free and open source software is all by itself a political movement.  FOSS ala GNU is all about engineers (mixed gender) retaining control over their work, not surrendering to lawyer controls.  [LAWCAP is crumbling](http://worldgame.blogspot.com/2006/07/movie-sunday.html) as a result (hardly news), [with GRUNCH](http://www.grunch.net/synergetics/usaos.html) on the rise.That's rather esoteric shop talk however, which even most geeks haven't digested to any degree.  This doesn't stop us from forming strategic alliances however.  For example, given the highly socialized nature of the military, the [communal ownership](http://controlroom.blogspot.com/2008/12/iron-mountain-revisted.html) of power tools, its not surprising that destructivists and constructivists have some common ground to build on, even if engaged in somewhat different styles of engineering.  Hence [Python + DARPA](http://worldgame.blogspot.com/2006/01/kaa-meets-tiger.html) = [CP4E](http://mybizmo.blogspot.com/2007/01/cp4e-versus-olpc.html) was a sensible equation in one of our earlier chapters.When we went around doing introductions, I mentioned my earlier work for AFSC as [a contributing editor](http://mybizmo.blogspot.com/2009/06/prisoners-for-pelau.html) for Asian Pacific Issues News (APIN).  That brought me a lot of reading about military bases and the service industries surrounding them, a focus of the Radical Women's Manifesto, which I bought for $8, along with a more insider pamphlet focusing on recent debates with the ISO (not to be confused with the standards body by that name).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}