{
  "id": "1370015985542815197",
  "title": "Raining Pumpkins",
  "published": "2024-11-02T12:23:00.000-07:00",
  "updated": "2024-11-11T04:57:00.996-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEitwZObgFonzsguvCTb8THPusb1IQgTQHtwvqVZOewwbY_BK5s7B_7ZbyKiEP59_4zTYMuMW_jUHzhQw9b-pVTJyunpD2Ygy95gA5Ms2kzbWzfOWGCnJh5QO53SiFhbhwfp77F_boiJJSsLfyY98DOWivRG4hIBgVxQeEYVwHPeZVZOEOiGEQP4/s611/Screen%20Shot%202024-10-29%20at%208.39.51%20AM.png)\nIn line with my keeping my curriculum quirky and idiosyncratic (weird), words used by detractors as well as friends, I'm allowing more autobiography, which is to personalize, to \"icosahedronize\" (add to dictionary). There's nothing amiss in being special case unique and indeed any other way is missing something.\n\n\"Allowing more autobiography\" where? In this specific case I was thinking of my Github repo, School of Tomorrow, where I engage students with a variety of topics, from Python to Occupy Portland (OPDX) to our Mazeway of Polyhedrons. I just coined that here: \"mazeway\" thumbs up, sounds theme parky.\n\nI link Occupy to Dr. Graeber and the N8V critique of Anglo-Euro-speak: that it's way too unimaginative when it comes to (a) pictureing lifestyles and (b) assuming one size (\"way of life\") must eventually fit all. Is the Earth a backdrop for some epic Capitalism versus Socialism extravaganza? Not exclusively. Live that melodrama if you like but don't pretend the rest of us don't have other core concerns. Like, we don't see the world in those terms, so sorry,  did you think we should?\n\nWe might wanna bring back Ancient Egypt with contemporary characteristics. In Egypt. Who is \"we\"? Not me specifically as my Sands of Time clock is running low and we haven't even done a WestWorld yet, except on TV.\n\nI also link OPDX and the Elk Statue (undergoing renovation) specifically to the Bonus Army demonstration between the wars. Penny pinchers in Congress wanted the budget for pet projects whereas no one saw a way to deal with bitter veterans. Smedley \"fighting Quaker\" Butler was one of them, looking back on a life as a war racketeer, and realizing,  as Eisenhower warned us later, that war is an end in itself, not a merely a means, to supply chainers.\n\nSmedley was in DC to see the Bonus Army, camped out in Hoovervilles, getting smacked down by General MacArthur, of whom he took a dim view. The war mad Manifest Destiny types ruined the American Dream for most of us, while trashing the smashing their way through the Philippines, Indochina, Central America, Eastern Europe, the Middle East. \n\nThe pressure to spray out weapons is intense, with shareholder-backed pensions depending on it. Some boomer doomers fear dying off in droves if they're any less grim with their Genocide R Us grim reaper policies. Not that they won't die off in droves anyway, as it's getting to be That Time for them, given the Bell Curve.\n\nSpeaking of the Bell Curve, last night I demonstrated a basic Galton Board to my data science students, along with a simple Python program for simulating balls falling left or right, through rows of pegs. Most random falls will end up in the middle, but randomness allows for outliers and the pseudorandom integer generator I was using is certified to be that normal kind of random.\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjCMhnhzvGkgi3LQFWhpcTaM-OqRdkInelxOHII-i4HM3rB0H9HxM1Zp9Z_WoV9BYsshmEgfmYQ6v5qy-HAKkTkO4mPe6VvpbnOEPFC1BifyPRk19jem87eg1OyQWO_tyamOhrdsag7CvhOnF2r11HXMypwjcOJq0yMIjLUwl0emLIlO4CQgXf5/s578/Screen%20Shot%202024-11-02%20at%2012.21.17%20PM.png)[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgs_-a262bEayXsL1XtuNeAUVk3VDm_oc3fCUMxhyNHLej14QUWT8uEyiwlKJDjR0ZjqYmkJDZyxFJ_RZ0IeP-OWhg4jJ7VYj4RTu0I99FNJ2ywbWZahItzjNNvu3usNxK72dA8x7LPCHt4lbfpV-Ppx4pKzMLOTQ8FIo9T2ytmVKVKnwz0drMH/s578/Screen%20Shot%202024-11-02%20at%2012.21.47%20PM.png)Bell Curve Dynamics\nSo what's up with the bacteriophage? That's our icosahedral and cuboctahedral numbers [entry point](https://oeis.org/A005901), talking nucleocapsid and Jitterbug, as well as our War of the Worlds and Wells meets Welles, [YouTube link](https://youtu.be/nUdghSMTXsU) in [the Codacombs](https://controlroom.blogspot.com/2024/04/catacombs.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}