{
  "id": "5912334799151023452",
  "title": "Rainbow Gathering (musings)",
  "published": "2011-07-19T01:41:00.000-07:00",
  "updated": "2011-07-21T22:22:26.584-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgxTQ_pqsb6RtR6DB3s8lOuzhURepaZXDCq05fnBLKM6zASPIuaaTMAE__Vw6IdW_grgonjyc3nudSf4U2pSw4acc1hOpjpfHpx6gzeAZKIXQKPTl9JiXq8cll6XJxJQBs12YWA/s1600/teslaturbine.jpg):: bioneering project by jim murosako ::I didn't go to this Gathering, but many FnBers did, and I'm pumping them for information.  Satya's group walked the whole way there.  The aftermath, involving cleanup, is a kind of Part 2.  I got reports about the trash, the detritus, from that many people camped in the forest for that long.  The reports make it sound a lot like the [Gathering of Western Young Friends](http://worldgame.blogspot.com/2007/06/more-meetings.html) but on a much larger scale.Expanding FnB as a way of training cooks, improving coordination and logistics, using food about to go to waste anyway, seems like a good idea.  I'm surprised how below the radar it stays, given so many chapters.I wonder about this Quaker network of safe houses or whatever it is.  [LW](http://controlroom.blogspot.com/2009/08/walking-with-walker.html) and my friend, another chef, are thinking about scoping out more of Yamhill county.  I sent an email ahead, to one of the property owners.  There's no substitute for reality.  Dreams without substance accrue no inertia.I was thinking back to my research into Unicode and OLPC today.  Sinhalese and Tamil were on my screen at CubeSpace, seems a long time ago by now.  I alluded to that chapter in [my recent post to edu-sig](http://mail.python.org/pipermail/edu-sig/2011-July/010405.html).  The entire thread is interesting I think, relates to diversity (I have related threads going on both Diversity and PSF-members).Should Global U students travel more?  Many of the more conscious and aware types, such as those in my current household, think a lot about peak oil. We mostly walk, bike, take the bus, though I gladly do chauffeur duty (company car) for the 82 year old.Adding more electronics and doing more virtual meetups still seems like a realistic way to go.  But again, there's no substitute for reality. Sometimes one really needs to go to a place, to broaden one's perspective.We should probably run these conveyor belts faster, get more turnover going.  But that takes software.  I've imagined CSN as a supportive business, but one can't live on coffee shop fare, if that means your standard airport concourse coffee shop (which CSN shops are not -- some may require membership).  One needs to have substantive protein.  Lyrik does a lot of its own baking.  Jody may have known about Calibri's operation but I was too new to CSA (community supported agriculture) to grok the background story.The idea of a disaster relief corps is already well established with AFSC.  Of course the vast majority aren't Friends, but you may still find a lot of your own plans and dreams mirrored, just in a different namespace.  Happens all the time.Should we take applications?  Who else wants to join our Global U project?  Metaphorically, it's what we're already involved in (Global U = Spaceship Earth), but on the ground you have all kinds of resource and personnel allocation strategies.  LW used to read resumes a lot, back in Savannah.  She might help select her own replacement for when the time comes to change the scenery (scene), not saying I'm bound here either (turnover is a fact of life).[Alex](http://controlroom.blogspot.com/2011/03/wittgenstein-movie-review.html), newly a US citizen, said photography and cinematography were discouraged at the Gathering, so I may not find as much on Flickr as I'd hoped.  Burning Man, in contrast, is well covered by photography.As I was mentioning tonight, if the goal is community, then your designers need to know right away if you're accommodating the very young (newborns) and the elderly.  There's a tendency among the young to think in terms of their generation as the anchor.  However, many of these communities would likely happen more quickly if [the seniors](http://mybizmo.blogspot.com/2011/07/seniors-musings.html) saw them as a solution as well. Segregation by age has its consequences.Lots of anthropology branches off from these rather scattered remarks.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}