{
  "id": "3302703336131845136",
  "title": "Ram's Head",
  "published": "2008-09-24T15:06:00.000-07:00",
  "updated": "2008-09-24T21:54:28.644-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhMY2UTEXNVkklrT52mNibAbGT52kE8m90qBRR-KsbS9wQQMs2wNjrgwNqJgMqVKjtssn_CEVez2sMepHlpBYekPsVX91VO4SYi44axh6y4TxFvX_h6pAs-jLRGaRcvbJjLTQcT/s1600-h/hawthorne.png)Our projects are going pretty well these days, despite some delays.  I'm celebrating with a pint of Hammerhead at one of these McMenamins establishments in NW Portland.[Gordon](http://mybizmo.blogspot.com/2007/08/making-rounds.html) is taking up Java, finding earlier readings in Python a boost, while Susan resumes piano teaching.  Buzz is enjoying O'Reilly's Safari service, which I highly recommended: like being in Powell's Technical, yet accessible on road trips.  David is making progress with his science fair software ([ISEF](http://mybizmo.blogspot.com/2008/06/summer-retreat-2008.html)).At Wanderers this morning, we talked some about Scientology over bagels from Noah's, heard the story of a young [Nirel](http://mybizmo.blogspot.com/2005/08/web-wrangler.html) coming close to exchanging her umbrella for Dianetics that time, in lieu of cash.  Her dad counseled against doing so.  I mentioned visiting their booth at the Parliament of World Religions in Cape Town that time, pretty much the extent of my dealings with that outfit.We also talked about the fluid financial picture.I kept disappearing to do work, got [Razz](http://http//mybizmo.blogspot.com/2006/09/razz_07.html) through an overdue oil change at Jiffy Lube with the $10 discount, with Thai food at Thanh Thao to follow.[Bill](http://controlroom.blogspot.com/2007/01/wanderers-2007131.html) and I zoomed in on these locations from within Google Earth, running on my Ubuntu Dell laptop (same one I'm using now).  We also checked out the Vatican.OK, time's up, gotta run!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}