{
  "id": "1353272903079155577",
  "title": "Raspbian Affairs",
  "published": "2016-09-03T00:44:00.001-07:00",
  "updated": "2016-09-04T18:09:23.007-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/29251687341/in/dateposted-public/)\n\nI'm heartened by various blogs telling of [the Raspbian subculture](https://www.raspberrypi.org/) getting shared.  The Raspberry Pi is not exactly on offshoot of [One Laptop per Child](http://worldgame.blogspot.com/2009/01/saving-children.html) (OLPC).  On the contrary, it's not a laptop, just a relatively inexpensive machine with an ARM chip and GPU that doubles as the boot code runner.  I'm not the expert, more a hobbyist.\n\nIf you've checked [@4DsolutionsPDX](https://twitter.com/4DsolutionsPDX) you'll find where I was politically active around Measure 97, a ballot measure in Oregon designed to administer some stimulus (we don't use the word \"shock therapy\") to Oregon's failing schools.  This might have been a last ditch effort, time will tell.  However, the obstacles are [not primarily monetary](http://mybizmo.blogspot.com/2016/08/drug-pushers.html).\n\nGiven the \"stay home and learn\" movement has gathered some steam (pun intended), I'm expecting more of a boom in the personal tutoring business, often a virtual gig.  I've participated in these kinds of interactions myself.  I'm sometimes tutored, not always in the teacher role.  My sense is a 50-50 mix works through adulthood: 50-percent student / 50-percent teacher.  Stay limber in both roles.\n\nThe \"device wars\" cannot be solved with United Methodists taking the brunt. They owe a lot to Texas Instruments, at least in some zip codes.  Why put them in a corner with [the #CodeCastle concept](http://controlroom.blogspot.com/2016/07/base-10-ghetto.html)?\n\nI'm taking pressure off UMC now that I better understand the ecosystem. [https://t.co/jsliTJYMSu](https://t.co/jsliTJYMSu) …  Sometimes we need to respect inertia.\n— Kirby Urner (@4DsolutionsPDX) [September 4, 2016](https://twitter.com/4DsolutionsPDX/status/772445850266054656)\n\nQuakers have fewer ties.  I think I've been blinded by the obvious in some ways.\n\nThese powerful Raspbian devices, if [openly flaunting](http://controlroom.blogspot.com/2016/09/sky-pi-channel.html) their relevance to math learning, will not be accepted with open arms in many schools, where entrenched interests call the shots.  They'll be perceived as a threat. We need to stay polite and [conforming, non-confrontational](http://worldgame.blogspot.com/2016/06/pandering-to-muggles-editorial.html).\n\nTherefore I'm recommending going with the flow, buying the TI calculator for math tests, and studying the Pi stuff in a PWS (personal work studio) [if you can find one](http://controlroom.blogspot.com/2016/08/refugees-camping.html).  Not the Pi stuff necessarily (a fun option), more the GNU World, including serious \"hard fun\" coding, with Euclid's Method and all the rest of it (SQL... regular expressions).\n\nMaybe learn about RSA from some old Linux hobbyist magazines to get the flavor, or look for [translated Manga](http://worldgame.blogspot.com/2016/09/gateway-to-asia.html).  Stores around Portland have made those Linux mags [harder to find](http://mybizmo.blogspot.com/2016/08/suicide-squad-movie-review.html) lately, and if that's happening in Portland you can bet the dumbing down is even further advanced in the heartland.\n\nRemember, if they really wanted you to have the skills to which they give lip service (e.g. \"learning to code\"), you wouldn't be commanded to buy a Texas Instruments graphing calculator.  You might be introduced to the Anaconda distro instead (from Continuum Analytics), and Jupyter Notebooks.  Not that it's either / or necessarily.  Maybe your school has both the [delta and lambda tracks](http://controlroom.blogspot.com/2016/04/a-pep-talk-of-my-own.html).\n\nRemember to look up Mathematics for the Digital Age sometime, by the Litvins (Skylit Press).  You already know about [Hacking Math Class](http://worldgame.blogspot.com/2016/06/pycon-2016-concludes.html), the Pi based classic by Peter Farrell.  Both high school level.\n\nFortunately, we have Champaign-Urbana and the University of Illinois, and of course Wolfram, to keep at least a few lights burning in that neck of the woods.  North America may indeed be dark with ignorance, but the Internet is ablaze with lots of new and interesting information.  Raspbians find one another.  Ubuntu is real.\n\nYou'll find Wolfram Language on many Raspbian distros, such as on the Jessie distro I'm using (runs Docker).  Yes, it could be faster, this is a training wheels computer in some ways, but that's better than no bicycle at all, right?  The process is one of bootstrapping.\n\nMaybe you'll have several cloud computers in addition. Your school might spin those up for you, customized per course.  We did that at the [O'Reilly School of Technology](http://archive.oreilly.com/oreillyschool/index.html), simulating a client-side Windows pointed at a Linux server (a typical setup back in the day).\n\nI'm still to this day [using Eclipse](https://flic.kr/p/KQjLv5) for [my tiny Flask application](http://controlroom.blogspot.com/2016/08/dissecting-flask-app.html), even on El Capitan.  What can I say?  It grew on me. I came to [like the dog food](https://en.wikipedia.org/wiki/Eating_your_own_dog_food) we served.\n\n[](https://www.flickr.com/photos/kirbyurner/29242014346/in/dateposted-public/)\n\nSimply having a WiFi cafe on the premises gets us devices, smartphones, laptops... we'll see about LCDs.  IoT is not only TI vs anti-TI.\n— Kirby Urner (@4DsolutionsPDX) [September 3, 2016](https://twitter.com/4DsolutionsPDX/status/772112433183727616)\n\nThis is the coffee shop: [https://t.co/0oaRq6yAEE](https://t.co/0oaRq6yAEE) Looking forward!\n— Kirby Urner (@4DsolutionsPDX) [September 3, 2016](https://twitter.com/4DsolutionsPDX/status/772113651159343104)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}