{
  "id": "3692332347303178678",
  "title": "Re: Concealed Weapons",
  "published": "2012-12-30T00:10:00.002-08:00",
  "updated": "2013-01-08T11:33:54.297-08:00",
  "content": "Clearly the Quaker policy would be biased against bringing weapons of any kind into a meetinghouse.\n\nThe Code of Conduct would be similar to those adopted [in theme parks](http://mathforum.org/kb/message.jspa?messageID=7941628) and universities.  Private property rights apply.  But are these respected?\n\nAnother approach might allow for concealment, a private matter of conscience.  Showing a concealed weapon in the meetinghouse would constitute a kind of indecent exposure however.\n\nHaving a gun clatter to the floor would be at minimum a social embarrassment, a wardrobe malfunction.  Even just letting one be seen in one's purse would be inappropriate.\n\nIf it went off (when clattering), reckless endangerment charges would apply (at a minimum).  Law enforcement might be called.\n\nUSA folk do not always respect property rights, including \nthose of other sovereign nations, and may wish to openly flaunt what \nthey consider to be protected civil liberties.\n\nIf a member of the public wants to make a 2nd Amendment argument and flash a gun in its holster, while insisting on entering, this might trigger Friends to proceed calmly to the nearest exit, fire drill style.\n\nThe building could be vacated until such time as the integrity of the space had been restored.\n\nI don't see that Quakers should be obligated by the surrounding society to provide lockers or hat check type services for gun toters, although I could see some hotels doing this.  Other hotels might advertise a Code of Conduct that say no weapons allowed (a market niche).\n\nAdding TSA style screening to Quaker meetinghouse entrances would be expensive and unwieldy.  Nudist colony Quakers would have an easier time of it.  Quaker meetups of two or more are easier to arrange with the new apps.  Compromised meetinghouses a less of a strategic problem.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}