{
  "id": "6518212597055239189",
  "title": "Recapping a Story",
  "published": "2014-11-23T10:53:00.002-08:00",
  "updated": "2014-11-25T21:46:19.698-08:00",
  "content": "When Lindsey Walker was with IT for CSC for GulfStream, a subsidiary of General Dynamics, she had the savings to (a) follow the band [Weezer to Japan](http://www.rsvlts.com/2013/11/01/iconic-concert-weezer-across-the-sea-live-in-japan-2005/) and (b) scope out Portland for its reputed Portlandia scene (this was before the TV show).  She ended her IT lifestyle in Savannah and made a bee line in her Nissan, with Titty the cat, to Asylum District (Hawthorne) there to start a new life as a rock star and revolutionary.\n\nIn the meantime Tara and I had done some desert driving lessons that ended when [Razz the Subaru](http://worldgame.blogspot.com/2012/04/gotta-have-coffee.html) bumped over some floor-piercing rocks.  Walker had forsaken driving as something less ethical folks do and become more ascetic, a cyclist and pedestrian.  Result:  given I had a spare space and she had a spare car, tit for tat:  she got the space, I got the Nissan. \n\nI'd also been experiencing [dire straits](http://controlroom.blogspot.com/2009/12/dire-straits.html) in the wartime economy (fewer good options for civilians) and welcomed Lindsey's exciting foray into pioneering an ascetic lifestyle.  She got us into the [FNB network](http://worldgame.blogspot.com/2013/12/ongoing-logistics.html) at a critical time when free food in exchange for labor and logistics, was a welcome opportunity.\n\nFast forward:  Lindsey discovered Newar Buddhism through the one temple in that tradition anywhere in the Pacific Northwest, and it just happens to be around the corner from the [Linus Pauling House](http://mybizmo.blogspot.com/2010/02/exchange-with-japan.html), through which Lindsey and I first met, thanks to Patrick.\n\nLindsey is now interested in becoming a serious student of the Newar Buddhist tradition, with another year of training in Nepal to follow her recent three-month sojourn there.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}