{
  "id": "2111971801108411374",
  "title": "Recent Studies",
  "published": "2019-05-06T17:54:00.002-07:00",
  "updated": "2020-04-27T23:46:23.320-07:00",
  "content": "Leela is crashed on the couch, napping, here on a visit.  She used to live here, with a different name.  The new name is part of her business persona, as a kind of yoga teacher.  I refer to as a religious studies major, which she is, in this recent story on Medium.\n\nI'm hitting the limits of an older version of OS X, wondering if I really need the latest Homebrew in order to get the latest MySQL.\n\nWhat will the newer version do that I need?  I'm just a code school type teacher these days.  For the kind of stuff I'm doing, the older version should be sufficient, if I need it at all.\n\nSeeking relief from my upgrade woes, I went back into perusing Youtube.\n\nI've got a Jerry Kroth video playing in the background, [introducing his new book](https://youtu.be/CGO5aNx2hos), about crop circles.  \n[Dr. Kroth](https://www.collectivepsych.com/),  Associate Professor Emeritus (UCSC) is not afraid to venture beyond the fringes of accepted and/or settled science.\n\nHe's into spinning some theories, asserting some of these patterns need to be decoded, as they allude the specialized science.  One of these patterns, he claims, is a diagram of Vitamin A.\n\nAre the aliens trying to be helpful, drawing attention to Vitamin A deficiency around the world?\n\nHe just put the new Youtube up today, and the Youtube recommender flagged it, given I've watched his stuff before.  \n\nThis morning, as I fixed breakfast for Carol (recently turned 90), I took in [a PBS documentary on Andrew Carnegie](https://youtu.be/RVKIAUPImJg).  The movie explores his relationship with labor unions and workers more generally.  Lots of details, talking heads.\n\nConnecting these dots a little more, Kroth is one of those in academia who looks into UFOs as well. He goes in the same Venn Diagram circle as Daniel Sheehan in that sense.  Dr. Sheehan has his \"octave of world views\" wherein we progress to encounters with alien intelligence.\n\nThat same Venn Diagram circle might encompass the Thrive subculture, [led by Foster Gamble](https://controlroom.blogspot.com/2018/09/close-encounters.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}