{
  "id": "6572741864273125035",
  "title": "Refugee Science in NYT",
  "published": "2018-07-05T16:55:00.001-07:00",
  "updated": "2018-07-06T18:05:49.900-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/41397779400/in/dateposted-public/)\n\nThe New York Times has been giving column inches to an important branch of planning in our world today. Given mass migration patterns, humans are settling in camps.  Sometimes these camps become the most salient features of a given geographical region.  However, well before then, the signs and trends deserve and require concerted attention.\n\nWhen does Health and Human Services work with United Nations agencies on various camps?  Asking Mexico to fund a wall was pretty stupid, but having an international community work on camps is not.  Before risking any HR process devised by DC's Beltway defense contractors, sometimes of limited imagination, you might want to find a Rehab Campus on friendlier turf.\n\nI'm no expert on Drug Wars politics, where Drug Wars stretch back in time to Opium Wars and British mercantile enterprises versus Mandarins.\n\nThe idea of \"customs\" implies some shared ethic regarding substance controls, and a lot of the earlier consensus reality has broken down, with a new one yet to emerge.  I've looked to the Thirteen Grandmothers for guidance, and instructed my Coffee Shops Network baristas (a front line) to keep an open mind.\n\nFor those just tuning in, CSN is about risk-taking for charity, and channeling cyber-currencies towards worthy causes.  Perhaps conventional currencies will likewise have a role?\n\nThink of Video Poker as sponsored by Oregon State.  Your losings are the State's winnings.  Imagine instead that were you to win, you would have philanthropic powers to channel the winnings.  Psychologically, this model introduces far less cognitive dissonance, which may explain all the \"likes\" we're getting on Facebook.\n\nSuppose you're really great in video game X, written in Rust, and want to commit your winnings to Refugee Science.  You understand these families need educations and want to see scholarship rewarded with redeemable coupons.\n\nStudy microbe biology, get a microscope.  Become skilled in some way, in response to positive reinforcement.  Educators around the world already understand this model, and therefore appreciate the positive role of blockchain technology.  Kids earning high grades have the potential to help their families.  Kids earning low grades still get to eat.\n\nSome of our prototype circuitry, in particular Netdispenser, failed to gain the blessings of EFF.  On the other hand, Freedom Toasters and TuxLabs have already made the grade, at least in an African context.\n\nGame developers who help refugee kids get some traction, through One Laptop per Child or whatever, are in themselves a worthy cause.  CSN supports their valiant efforts.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}