{
  "id": "3563447038132796835",
  "title": "Remembering The Dead",
  "published": "2012-10-24T22:16:00.000-07:00",
  "updated": "2012-10-25T08:45:29.927-07:00",
  "content": "[](http://photos1.blogger.com/blogger/1134/545/1600/bluesforallah.jpg)album cover, Blues for AllahGrateful Dead\n\nMy thanks to [Deb Bryant](http://controlroom.blogspot.com/2010/10/meetinghouse-again.html) for reminding me of her friend [Rosie McGee's](http://www.rosiemcgee.com/) reading at Barley Mill this evening.  For those of you not so familiar with Portland, [The Barley Mill](http://mcmenamins.com/BarleyMill) is a birth place of the [McMenamins brew pub network](http://mcmenamins.com/) that now spans at least two states.  It's also something of a temple to The Grateful Dead, a famous band associated with the advent of the psychedelic Aquarian Age.\n\nThe day started more prosaically, with [Patrick](http://www.flickr.com/photos/kirbyurner/7595031550/) coming by in handyman mode to maybe help with the clogged upstairs tub.  He correctly diagnosed and solved the leaking sink problem and in the process we were referred to another product by the hardware store lady that indeed unclogged the tub (I'd tried other liquids but this one had the right mojo apparently).\n\nI'm listening to The Dead now on Spotify, trying out their premium service.  I went to the Spotify meeting at [the last US Pycon](http://controlroom.blogspot.com/2012/03/occupy-silicon-valley.html), as Spotify is using Python a lot.  Some of my favorite artists are not yet sharing by this infrastructure, which one might characterize as a negotiated / legal version of Napster.  iTunes helped pave the way.\n\nThe negotiation includes what consumers want, are willing to pay for, and are able to get illegally if the cost is too high.\n\nThe Dead were always progressive about digital rights and contributed to the free / open source rhetoric when the latter was still in its infancy.  Whereas I was only getting covers for Pink Floyd and The Beatles on Spotify, I'm listening to bona fide Dead as I write this.\n\nRosie wasn't just your stereotypical \"groupie\".  She was an integral part of the Jerry Garcia family, which was a traveling circus and production crew of considerable ambition and skill.  She helped with a lot of logistics, travel, loved the behind-stage world, and never lost her fluency in French (Rosie was born in Paris, moved to Portland later, went to Washington High School).\n\nCarol is using O2.  The concentrator came hours after her discharge, with the hospital providing two tanks.  A full recovery is expected.  Pneumonia (bacterial).  We've been getting visitors.  Friendly Care has been supportive.\n\nI treated Patrick at Oasis for his competent and cheerful contribution to our household's plumbing health.\n\nSomeday, your dwelling machine will come with CAD drawings on a DVD and you'll have no trouble knowing where all the pipes go, and/or tubing, wiring and so on.\n\nHaving construction adopt the standards of aerospace was the huge jobs creator Bucky Fuller tried to get going all through the 1900s.  The engineers were better at weaponry though and had a sure client in Congress.  The sheltering challenge was left to architects.  The technology advanced slowly.\n\nLiving standards have stayed artificially low, given the human IQ is not what it could be (by \"IQ\" I'm including qualities like \"compassion\" which the Dalai Lama underlines as what's missing more than raw intellect).\n\nThat doesn't mean a revolution in shelter technology can't still happen.  Patrick looks at the challenge from the perspective of energy infrastructure (power grids, smart meters etc.).  Glenn thinks in terms of a \"global matrix\" of such grids.  Welcome to 97214.  We think globally a lot, and can't help but act locally.\n\nBlue House is also being crewed by [Melody](http://www.flickr.com/photos/kirbyurner/7862408476/), [JenQ](http://www.flickr.com/photos/kirbyurner/7960384300/) and [Lindsey](http://www.flickr.com/photos/kirbyurner/4184042038/) these days.  While I was at the Hackathon and Wanderers last night, Lindsey was serving for Food Not Bombs near City Hall, and performing her music.  JenQ helped prep.  This is from the Saturday market haul that provides for several servings throughout the week.\n\nYesterday's Oregonian's food section was on food waste, a topic we discuss a lot [at FNB](http://worldgame.blogspot.com/2012/04/spring-cleaning.html) (though of course FNB was not mentioned), and arsenic in the rice supply, which is written about in a typical \"taking it lying down\" mode (Chicago Tribune the source) -- no outrage, just \"limit how much poison you feed your baby, doctors advise\".  Crazy world eh?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}