{
  "id": "4867136300679619049",
  "title": "Remembering Baryard Rustin",
  "published": "2012-03-02T15:41:00.003-08:00",
  "updated": "2015-01-31T12:42:07.875-08:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/6957542385/)\n\nThe family story here is that my dad was struggling with the mandatory ROTC program.  He'd helped staff a troop ship to Japan and stuff the year before, but now he was in his junior year at University of Washington and having moral qualms. \n\nBayard Rustin came to Seattle to talk about conscientious objection and that helped crystallize a lot of Jack's ethics.  While he stayed quiet about religion most of the time (he was a rather quiet man, though not out of shyness), he soon became a Quaker.\n\n[The documentary about Bayard](http://www.flickr.com/photos/17157315@N00/6957543373/in/photostream/) was really good.  Lots of excellent archival footage, good editing, clear sound -- a professional job, and a valuable review of the civil / human rights movements.  The Rufus Jones room was packed.  The panel discussion afterward was quite intelligent and featured Walter Naegle, Rustin's partner later in his life, and Hal Weaver.\n\nMy question was [about Freedom House](http://en.wikipedia.org/wiki/Freedom_House), in the news lately vis-a-vis Egypt.  This brought up some discussion of what groups were getting CIA money at the time, leaving open the question if Bayard was aware of some connection there.  I also wondered if Bayard was friends with [Kiyoshi Kuromiya](http://www.grunch.net/synergetics/kiyoshi.html), also a gay rights activist and an associate of Martin Luther King\n\nThe occasion here, in part, is the AFSC Board has recently restored Rustin's name to [Speak Truth to Power](https://groups.yahoo.com/neo/groups/SYNERGEO/conversations/messages/20211), a publication he'd helped write.  His name had been removed earlier because Quakers were having a problem with [his gayness](http://www.youtube.com/watch?v=jbc2NaLuv1A) back then.\n\n[](http://www.flickr.com/photos/17157315@N00/6811433626/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}