{
  "id": "3613832505375882784",
  "title": "Remembering New York",
  "published": "2010-02-20T19:42:00.001-08:00",
  "updated": "2010-02-21T00:33:27.158-08:00",
  "content": "From some back office email:For my part, I've been mostly [piloting a high school course](http://mail.geneseo.edu/pipermail/math-thinking-l/2010-February/000543.html).  I  was a full time high school math teacher, before working at McGraw-Hill in computer literacy texts (did some other stuff in between).LOGO and BASIC were where the junior high market was heading (1980s), not anything I had any control over or any say in.  I was low on the  totem pole, evaluating others' submitted texts and rolling my own for possible future textbooks.Publishers hedge their bets by exploring in-house a little, trying to  stay ahead of the curve.  Not saying they do a lot of this.  Depends who they bring on, plus 1980s was a heady time.  [Hugh Kenner](http://www.independent.co.uk/news/obituaries/hugh-kenner-730480.html) was writing a regular column for McGraw-Hill's BYTE:  Eliza versus Racter (early conversation bots) was a memorable one. My office mate Ray Simon and I tracked Dr. Kenner [in other contexts](http://worldgame.blogspot.com/2007/11/about-branding.html) as well (a talented writer, famous James Joyce scholar).One of my tasks was to show off LOGO as more general purpose, without relying on the turtle feature as much.  I'm reminded of Daniel Ajoy's work.  He went much further in this direction (I know him from edu-sig).One could argue I should not have been wasting my time with LOGO, should have been tasked with showcasing LISP or Scheme.  Take it up with my bosses.I had some cherished reforms of my own I'd have liked to introduce (more emphasis on world geography, cartography is a mathematical discipline), but the drum beat was California and Texas.These were the big markets and we would jump through their hoops.This was all before much electronic publishing and the subsequent breakup of monopolistic empires based on the economics of wood pulp.Back in those days, a lot of us thought computer programming would be sweeping into the schools thanks to the PC revolution.To some extent it did, but scientific calculators had claimed their place in the sun, and in math class at least, more or less monopolized as the only technology in the classroom -- right through the free software revolution to this day in 2010.  Who could have guessed it?I'm talking somewhat parochially in any case, as not every economy is taking this same route.  Some are leapfrogging the calculator era, jumping right into computers.  South Africa is an innovator, not just copying or importing reforms.I don't think Papert or anyone else anticipated the Lego Mindstorms phenomenon, which took the LOGO lineage back to its robotic roots.Papert did a good job of explaining his vision, his dreams, but then what happens next is not so predictable.By the same token, Albert Einstein was not \"the inventor of the atomic bomb\" even if his clear articulation of mass-energy equivalence is what got that ball rolling.Personally, I'd consider the rise of procedural programming far less of a disaster than nuclear weaponry nor would I lay it at any one person's feet.I don't blame Bill Gates for the vast army of Visual Basic programmers trying to use .NET on Windows, even though his knowing BASIC was one of the early dominoes.  Who predicted .NET back then?Why not be charitable?On the topic of .NET, what's the status of IronScheme I wonder, and does it run on Mono.  Let me go Google...  Found the stub on Wikipedia.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}