{
  "id": "9031236275162566282",
  "title": "Rendering Unto Caeser",
  "published": "2022-04-19T12:45:00.001-07:00",
  "updated": "2022-04-27T14:38:01.484-07:00",
  "content": "Tax time tends to be problematic for Quakers, especially the relatively well off ones, and these are numerous, given the conservative investment and savings strategies of their ancestors.  Paying lots of money into Empire coffers looks bad on one's resume.  \n\nOn the other hand, one wants to do social good, so one goes the route of the big money people:  earmark for charity, so that your own judgment stays a part of the picture.  Fund the NGOs you choose (many of whom get government contracts, so one ends up on the same side of the fence in many cases).\n\nI'm a big believer in institutional wealth, and not sticking out like a sore thumb as one of the affluent.  On a battleship, or say a pirate ship, maybe everyone feels rich and that they're cooperatively sharing responsibility for a socially owned asset.  \n\nSome would call that military socialism and indeed, many a career military office has never had to find a job in the private sector.\n\nIndeed, unless one knows how to keep mobilizing wars, it's hard to stay employed as a full time soldier.  Job number one is to make wars seem not only necessary, but admirable.  Cheerleaders line the sidewalks and encourage those marching towards destiny with brave resolve.  We've seen it a million times, in the movies if not in real life.\n\nI dutifully paid my taxes but realize I haven't tied up all the loose ends, such is by filing by business tax exemption with the city (a formality for small timers with no employees I think they told me). I go to H & R Block for tax advice.\n\nSo like this Bizmo idea, where we have this fleet of utility vehicles helping out with the Trucker Exchange Program, gathering intelligence on the routes and facilities.  They have other uses too, in terms of recruiting for universities or other academic programs that include bizmotica.  Ecologists in the field already have their mobile lab trucks.\n\nWithout being the personal owner of such a fleet, without being the Elon Musk of Global Data, I could see tooling around in an institutional shared asset.  Or call it non-military socialism. Think of the various port authorities and the airport and harbor facilities these maintain.  These are not private sector institutions with oligarchs at the top, unless we're discussing the case of Robert Moses or some other outlier.\n\nRobert Moses, for those who don't know his story, figured prominently at the beginning of the freeway era, which was all about providing vast numbers of private cars, most of them suburbia based, with access to, and parking within, central business districts (CBDs).  In Robert's case, the CBD was NYC itself.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}