{
  "id": "6287217233184057789",
  "title": "Renewing Old Ties",
  "published": "2007-01-31T17:15:00.000-08:00",
  "updated": "2007-01-31T21:52:37.992-08:00",
  "content": "Laura Martin phoned last night. Her mother's memorial service last year helped me reconnect with [Tom Connolly](http://mybizmo.blogspot.com/2006/07/deq.html) and Alice Prideaux, for which I'm grateful.Laura was trying to track down Ross Mackinney, son of the late [Anne Friend](http://www.wfsi.org/news_and_events/memoriam.php?person=40), and treasured member of our Gathering of Western Young Friends [back in the day](http://worldgame.blogspot.com/2006/09/more-about-quakers.html). I promised I'd search the web (Laura, in Port Townsend, has no computer). So far, I've managed to find this engaging bio of the guy:\nRoss Mackinney: Ross has been juggling, telling stories, and studying folklore since his youth. He began performing profesionally in 1979 and received a BA in \"Communication of Oral Tradition\" from San Francisco State University in 1985. He studied Celtic Folklore at UC Berkeley, and in Whales, where he found opportunities to perform at local festivals and for the BBC television and radio. Back in the States, he joined the Missoula Children's Theatre and spent two seasons bringing a one-week theater workshop to children ages 5-15. The tours stretched from Alberta to Arizona, reaching 41 communities and putting over 2,000 children on stage. Since 1988, Ross has taught juggling, drama, and speech to students of all ages in addition to his performing career. He currently holds a masters degree in Speech and Communication. [source]\nI feel blessed to have partially overlapped such individuals. [The Men's Group](http://mybizmo.blogspot.com/2006/03/mens-retreat.html), Wanderers, [BCFM](http://worldgame.blogspot.com/2005/10/wqm-fall-2005.html), have all fed my soul. And let's not forget [Camp Myrtlewood](http://campmyrtlewood.org/) itself, John and Margaret, the Snyders.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}