{
  "id": "112810993302781467",
  "title": "Rethinking the CyberBookMobile Concept",
  "published": "2005-09-30T13:06:00.000-07:00",
  "updated": "2009-07-13T14:04:57.587-07:00",
  "content": "Based a lot on Ulmer's reality check, I'm recognizing my state of the art bizmo fleet is going to need better infrastructure. I just don't have the skills necessary to operate a rig like Dave's -- would need a crew of grannies to keep it long haul operational.Per my alternative model lifestyle, I'd be less inclined to hold tightly to one bizmo of my own, and more thinking to check one out from a garage closer to a point of interest. After mission control uplinks my mission, I'll swoop into Town A and do some of the requested curriculum stuff, leaving behind a local school faculty thinking more about sphere packings, hypertoons, Pythonic mathematics. Lone Ranger type stuff (\"nicely done Kemosabe\" -- like when Don deftly parks his Meliptus alongside the Island Cafe).This is a healthy memepool for sure, but should be no one's exclusive diet, nor is it, even for me. However, my bizmo will run software uniquely customized for my brand of scholarship and teaching/outreach -- not because I'm all that tied to a specific bizmo, but because the basic design is highly configurable through downlinking OS level stuff and/or special purpose applications.On the outside, different bizmos may have different decals (I'm hoping we'll be seeing some from Google, whether I'm a driver or not). Those with the same decals will likely be running a lot of software in common (reflective of whatever corporate cultures, e.g. Mentor Graphics).The decals themselves may be swappable, in the same way a Tri-Met bus, though advertising its route with lit signage, is perfectly able to run a different route on another day. In my case, my decals (e.g. 4D Solutions logo) might follow me around, maybe in the form of a rear view mirror dongle or glove box credential. The same physical bizmo might return to the same electronic gate on consecutive evenings, and gain access the one night but not the other, because the decals, running code, crew and driver, could have all changed overnight, not a big deal.Basically, a geek checks the thing out of the garage, and then sucks down her favorite kernel (one of several), possibly similar to what wuz running in her last bizmo, or maybe in one she's nostalgic about (like running Win98 in 2020) but now the target points are different, so a different garage was accessed (same deal with the rental cars: return at the airport, like to PDX or whatever).On another note (and speaking of The Island Cafe):  last September 19 was [Talk Like a Pirate Day](http://worldgame.blogspot.com/2005/09/talk-like-pirate.html), and by nightfall, we had a full cast of free spirits in properly piratical attire, right down to the plastic parrot this one guy had. A boat sailed to and fro in the channel, setting off a miniature ceremonial cannon, reminding me of the curious opening to The Confusion, sequel to Quicksilver in the 3-part Baroque Cycle by Neal Stephenson (Jules, Don's grandson, Nirel's son, is another [Stephenson](http://www.nealstephenson.com/) fan).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}