{
  "id": "2153414487692208715",
  "title": "Rethinking Equity",
  "published": "2015-04-29T07:05:00.000-07:00",
  "updated": "2015-04-29T15:47:04.575-07:00",
  "content": "I'm in a talk entitled Rethinking Educational Equity in the Digital Age, which will focus on Albion School District, I'll find out where that is.\n\nSomeone from DETC (now DEAC) is here, who Debra (our school principal) caught up with a little on Monday at the Awards ceremony (we eventually decided not to continue seeking DETC accreditation in order to free up more resources for our pioneering work, which does not fit any cookie cutter mold).\n\nAnother attendee works with tribal schools in the area, meaning the N8TVs, who also connect to overseas universities, being sovereignties in their own right.  We're a small, intimate group.\n\nThere's a tendency to dump technology into a school and leave it to the locals to figure out what to do with it.  Laptops and tablets are exciting, but when the mindscape is impoverished, taking advantage of the tools is far from an automatic process.  Intuition supplies the real upgrades, combined with practice, trial & error.  Error is expected and a part of the feedback cycle.\n\nThe introductory Youtube was uncited, I wonder if I can find it anyway.\n\n[Albion](http://bridgemi.com/2014/03/part-3-selling-consolidation-are-albion-and-marshall-a-model-for-other-troubled-districts/) is in Michigan with 55% drawing down less than $33K.  We're talking about Flint and so on.  Much of the car industry died a flailing death around here.  Nearly 1 in 4 of Michigan children lives in an impoverished household.  A proud school district divvied up the schools, moving 9-12 out of Albion, leaving only K-8 to take advantage of the Title I grants as a feeder.  Marshall High is mostly privileged, with kids bussed in.  K-8 inherited the building (with a swimming pool) that used to be Albion High. \n\nESEA passed in 1965 by the Johnson   Dinner as well as lunch is offered, as many kids would prefer to stay at school versus return home in the evenings.  Families may prefer that too.  They have a Prometheon board, a music lab, underwater robotics, slate tables, drones, video editing and conferencing equipment. \n\nSTEM is a focus, with \"STEM Geekends\" a kind of Saturday Academy.  Parents get involved in this sometimes, joining the kids in playing with all these great toyz.  Many kids who wither in the classroom, thrive when allowed to develop skills.  One of the 8th grade girls, with \"issues\" being stuck in a chair, became the video conferencing avatar.\n\nAny student who completes grades 6-8 at Albion also has a ticket to Albion College.  That works as an incentive. \n\n\"Education is the pathway to opportunity\" according to a prevalent ideology, advertised as a gap closer.\n\nGeeks are attracted to work in schools with lots of toys.  Getting some server racks in the school, and allowing multiple operating systems for those eager to dive into C language underpinnings, is what Earlham College offers.  That's prototypical of tomorrow's high school perhaps.  With distance education, it's easier to bootstrap the student body.\n\nDistance Education allows over-achieving kids, frustrated with being held back, to move a lot faster if given the opportunity to do so.  A primary function of classroom based learning is to discourage both ends of the Bell Curve and pander to the middle.  The curricula they need are out there.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}