{
  "id": "2781185271735968246",
  "title": "Return to ICU",
  "published": "2011-01-07T22:38:00.000-08:00",
  "updated": "2011-01-07T23:24:28.897-08:00",
  "content": "I got a cell call from Gideon this morning that Dr. Consoletti was truly ill, and going by train to Portland.  My instructions were to get him to the ER right away, and that I did.  He's getting good quality professional care from Providence, one of the best hospitals around.Quinn, a Chinese medicine teacher, was on the phone with the ER doc (Dr. Goldstein), and later met with him in person. No one was in disagreement.  The question to Nick was whether he was willing to fight for his life with them.  He's greatly in need of some sleep, but ICU is more about keeping people conscious, at least under these conditions.  I'm not a medical doctor and spent much of the time eying the computer equipment, judging their aesthetics.  Pretty functional.  Getting more compact.Nick has been hitch hiking for longer than most people in this galaxy.  He's been given rides by Carlos Santana, Gregory Bateson, Jerry Garcia, even Krishnamurti.  He worked with Ervin Laszlo's Club of Budapest as in intern with The Union \"without walls\" Institute and attended Schumacher College in England (David Bohm was supposed to be teaching that semester, but his health was failing -- Nick did his thesis on \"Bohmian Dialog\" which emerged from meetings between David Bohm and Kirshnamurti).  He's wandered Europe as a busker, playing the dulcimer and other instruments. He's a scholar and a gentleman and well known to friends of Bucky Fuller.Quinn likened him to Forrest Gump as we talked later at American Dream Pizza.  I went back to say g'night.  Quinn will visit first thing in the morning, me later.Tara, away at [a debate tournament](http://worldgame.blogspot.com/2010/12/judging-day.html), made finals (she usually does, as one of Oregon's finest debaters, objectively speaking).  I've been working on a design pattern I call Combing Medusa's Hair that I could use some more help with.  Medusa is a reference to an old asynchronous listener, a precursor of Twisted (these are Python language resources).  The hair-like threads represent many spawned processes. This is for COM objects inside a working model truck dispatcher, mostly implemented in VFP.I'll have more to include about Nick and his adventures as events unfold. I ask you to hold him in the light.  It's touch and go for the guy.I've notified several key Wanderers (Nick is one, if anyone is) and left voice mail for Gideon with an update.  I need to contact [Johnny Stallings](http://worldgame.blogspot.com/2004/10/king-lear-play-review.html). Quinn is also spreading the word.Nick has enriched my life with many lasting and nurturing relationships.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}