{
  "id": "1914354341748090626",
  "title": "Returning to Portlandia",
  "published": "2014-08-05T11:55:00.000-07:00",
  "updated": "2014-08-05T12:21:44.635-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/14815207376)\n\n:: picking up mom at Wayne State after the WILPF conference ::\n\nHertz really came through for us.  [The Mazda 2](http://worldgame.blogspot.com/2014/07/visiting-heartland.html) was about the smallest car I could get away with given mom's walker needing to fit in the back, plus luggage for three people, but we were traveling light and the car proved peppy and up to the job, of traversing I-75 and I-70 both ways, from Michigan to Indiana, for a total of four times at about twelve hundred miles all told.\n\nWe got to Detroit airport (Wayne County International) in the pouring rain, though the return lot was sheltered.  Glenn, a paratrooper from the 101st airborne, based at Fort Campbell under General Westmoreland in the Vietnam era, graciously took us right to US Airways (merging with American) rather than have us take the Hertz passenger bus.  He was my idea of a good chauffeur.  I was saying all this to the Hertz feedback form on the web, suggesting a new \"car with driver\" rental service, but the web form just took me to an apology about the feedback form not working -- after entering reservation number, confirmation number and everything.  So it's Hertz IT that's suffering.  Glenn, on the front lines, is doing his job well (and thanks to Melvin the bus driver too, when coming in).\n\nBest Western was a comedy of errors.  The housekeeping service verified I hadn't checked out just because the room was bare (I'd taken my things elsewhere for washing), plus the cables on the desk were an indication I was still there, plus I walked in with leftover Thai food for the fridge and verified I was still an active guest.  OK, so then why did they take those vital cables from me and lock them up, and not tell the night manager?\n\nThe desk manager next morning knew about my fussing and said cleaning would unlock them by 10 am.  But by then I'd already (a) replaced the micro-USB at WalMart, needing to charge my phone and (b) bought and returned a Samsung cable, hoping the iPod one was compatible (I didn't even open the box, after Googling up the expected answer:  no way) so I (c) found a Samsung cable on-line for much cheaper.\n\nThat's not the end of it though.  I came back that night and yay, the cables were returned to my desk, but I'd just pushed open the door, my card-key no longer working.  Kinda scary to have unkeyed access to all my stuff in a dark room.  Yes, dark.  No lights, no TV, no clock... no power.  The night manager went to some breaker box and tried throwing switches, no dice.  Lets move me to a different room.  Good thing my smartphone has a flashlight.\n\nLastly, although the morning manager assured me the tub would send water through the overhead shower component, I didn't find pulling down on the O-ring in 227 actually doing anything.  The next room, 314, had the toggle on the top, and that worked well.\n\nBreakfasts were fine and the high speed Internet was reliable.  Also Best Western IT works better than Hertz's, as my survey / feedback form to the \"mother ship\" recounting these stories, took the data just fine -- or so it seemed as an end user.\n\nUS Airways did a marvelous job getting us home, though Phoenix ground personnel get the standing ovation, for getting mom pushed to A10 from A-whatever, two different concourses even if all labeled A.  We only had about 50 minutes to make it happen.  I took all the bags on her walker and pushed alongside, moving quickly.  People with walkers and wheelchairs can't use the moving sidewalks.  The electric carts were already booked up helping other people.\n\nPDX Airport was a bit of a let down, which surprised me, as it's highly rated and respected.  But apparently even though they charge a gate fee to US Airways for that after 1 AM flight, they're too cheap to man the exit on that whole side of the airport.  Sure, the baggage carrousel is way at the other end too (number 9) but does it have to be?  Why not let E-side people get their bags at 1 or 2?\n\nMom has a walker and walking from the very end of the E concourse, all the way across the airport to the C exit, down to 9 (by which time the bag was already on the \"unclaimed\" cart) was somewhat of an ordeal especially because it was so late at night.\n\nTired passengers, made to walk the extra mile, because PDX is too podunk to keep one of two major exits from the restricted area operational.   Asymmetry at work.  \"If you take flights arriving after 1 AM, you should provide exit services until at least 2 AM\" would be my memo to the Port of Portland (TSA has nothing to do with it).\n\nYes, a wheelchair was offered but under normal circumstances the walker is all she needs.  No one warned us about the extra mileage we'd be expected to put on.  The longer walk affected all passengers, not just us.\n\nLike I said:  [first world problems](http://controlroom.blogspot.com/2014/07/replacing-broken-camera.html).\n\n[](https://www.flickr.com/photos/kirbyurner/14835884554)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}