{
  "id": "417071202278469412",
  "title": "Revaluation of Values",
  "published": "2021-11-06T11:06:00.002-07:00",
  "updated": "2021-11-06T11:13:46.265-07:00",
  "content": "What did Nietzsche mean by a \"revaluation of values\"?  He didn't mean we should sit around passively awaiting the new code of conduct or whatever.  The work is a personal interior undertaking, the kind of work no one seems to get paid for, yet desperately needs to get on with.\n\nTake \"empathy\" for example, sometimes defined as \"putting oneself in an other's shoes\". Normally this is seen as a positive, whereas \"jealousy\" is the name of a sin, not a virtue.  To bring \"empathy\" and \"jealousy\" closer together might seem more like opposing proton beams, bashing the grammar.  Precisely. Philosophical investigations resemble the work of CERN at some wavelengths.\n\nFor me to really wish for your lifestyle, I need to imagine it.  I'm jealous of your shoes, more comfortable, more durable than mine.  You have stuff that I want for myself.  I can imagine myself going through the day as you, happier and more satisfied than I am in my own life.  That all sounds like empathy to me i.e. I'm putting myself in your shoes to the point of wishing I were more like you.\n\nNow we might trace all the caveat neutrinos emanating from this opposition.  Lustfully imagining oneself as another, directing that much libido into a fantasy life, is a root symptom of so many pathologies, whereas working on developing empathy and compassion is more generally seen as a cure.\n\nLets define narcissism as deep empathy with one's self.  You have a lot of compassion for yourself, and in a \"me against the world\" model, this is as it should be.  The healthy ego basks in its own source of warmth and doesn't need the company of others to stay strong.  However this also sounds a lot like the description of an egoless person, if such exist.  Is your classic narcissist on the verge of enlightenment, needing only to see self sufficiency as a divine duo, a state of grace?\n\nAgain, mixing \"good\" with \"evil\" values in your investigations, exploring the new polarities and tensions that result, is the form of exercise.  Consider it character building.  Consider keeping a journal, perhaps even online.  Quakerism traces to some of the same roots as Emersonianism, which I speculate would be found in a Mithraic context, pre-Christianity.  Thus Spake Zarathustra suggests such uber points of view.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}