{
  "id": "4875487940385486969",
  "title": "Revectoring",
  "published": "2009-08-27T01:12:00.000-07:00",
  "updated": "2009-08-27T02:33:29.776-07:00",
  "content": "Even as Wanderers is mostly guys, my digs on Harrison Street are frequented by mostly gals these days.  We had five females as guests in the course of the day, complementing the ones who live here.  The occasional male visits too, like Trevor recently, so it's a good balance overall, gender-wise.  The Python is male (Barry), the chameleon too we think (Melvin).I've been meaning to get an URL back to [Gregor's post](http://mail.python.org/pipermail/edu-sig/2009-August/009488.html), about [Wittgenstein's architecture](http://www.spiluttini.com/nextroom.php?id=1681) in Vienna, with [my reply](http://mail.python.org/pipermail/edu-sig/2009-August/009489.html), posted on the [Wittgenstein's Aftermath](http://seanwilson.org/wittgenstein.discussion.html) list.  That'll likely happen soon, interspersed with the \"brain talk\".There's lots going on with the digital math track, including around translation and propagation, but it's too unfinished to share much about yet.I sent AFSC a bunch of stuff relating to a \"starvation = torture\" campaign we might anchor, in collaboration with local Friends.  We have John Calvi joining us for a Friend in Residence program extending through Quarterly Meeting this time.I proposed a list called snakepit@python.org in our fruitful discussions on diversity@python.org.  This list would serve as a playground for pirate hackers, gypsies, witches, other brands of FOSS boss who prefer to be deliberately provocative as a part of being responsibly direct, even when engaging in diplomacy (this in contrast to bending over backwards to never offend or insult).  We'll see where that goes, to /dev/null most likely -- I have limited clout on the diversity list, where Aahz makes the rules, not me.I talked to Farmer's today about replacing the company car, having received a FedEx about the settlement.  Razz was a great vehicle.  My thanks to the Subaru company (Fuji Heavy Industries) for producing a robust and reliable product.  Yes, it's OK to share the \"taxi\" among partners (like band members) provided they're all properly licensed to drive in Oregon.  The policy covers the car and whatever driver, not just the title holder e.g. 4D.  I should visit DMV soon, then talk to Bob again (my agent).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}