{
  "id": "8134602641077396964",
  "title": "Reviews on Amazon",
  "published": "2014-10-09T07:44:00.004-07:00",
  "updated": "2014-10-09T07:47:06.951-07:00",
  "content": "[](https://www.blogger.com/null)\n\n[](http://www.amazon.com/Quakernomics-Ethical-Capitalism-Anthem-Economics-ebook/dp/B00DAJ7LWI/ref=cm_cr-mr-img)\n\n[Quakernomics: An Ethical Capitalism (Anthem Other Canon Economics)](http://www.amazon.com/Quakernomics-Ethical-Capitalism-Anthem-Economics-ebook/dp/B00DAJ7LWI/ref=cm_cr-mr-title)\n\nPrice: $9.99\n\n[](https://www.blogger.com/null)\n\nDid Quakers practice \"Total Capitalism\"?, October 9, 2014\n\nVerified Purchase(What's this?)\n\nThis review is from: [Quakernomics: An Ethical Capitalism (Anthem Other Canon Economics) (Kindle Edition)](http://www.amazon.com/Quakernomics-Ethical-Capitalism-Anthem-Economics-ebook/dp/B00DAJ7LWI/ref=cm_aya_orig_subj)\n\nVery cool that the author focuses on The Iron \nBridge as an entry point, a science fiction novel about a time traveler \nsent back from a future that's decided humans had industrialized too \nearly, before their thinking had matured enough to handle it (witness \nthe World Wars the followed).  In this future, the planetary ecosystem \nis messed up beyond repair.  Industrialization must be delayed.  So she \n(the time traveler) is to sabotage the Iron Bridge, built by industrious\n Quakers who treated their workers fairly well.  Hence the book's claim \nthat Quakers not only practiced \"total capitalism\" (from foundry to \nfactory to wholesale to retail) but did it in such away as to give \n\"total socialism\" a run for its money, i.e. they treated their workers \nrelatively well.  Quakers reach an apogee in power and influence around \n1781 when the bridge opens.  Given their socially unpopular positions in\n the US, anti Indian Wars and anti slavery, their Quaker utopia \n(Pennsylvania) is already on the wane, but that's another story.  This \nbook is more about the UK and the difference Quakers made there.\n\n[](http://www.amazon.com/Divided-Spheres-Geodesics-Orderly-Subdivision-ebook/dp/B00BC9N3MK/ref=cm_cr-mr-img)\n\n[Divided Spheres: Geodesics and the Orderly Subdivision of the Sphere](http://www.amazon.com/Divided-Spheres-Geodesics-Orderly-Subdivision-ebook/dp/B00BC9N3MK/ref=cm_cr-mr-title)\n\nPrice: $55.46\n\n[](https://www.blogger.com/null)\n\nA Well Rounded Primer, June 12, 2013\n\nVerified Purchase(What's this?)\n\nThis review is from: [Divided Spheres: Geodesics and the Orderly Subdivision of the Sphere (Kindle Edition)](http://www.amazon.com/Divided-Spheres-Geodesics-Orderly-Subdivision-ebook/dp/B00BC9N3MK/ref=cm_aya_orig_subj)\n\nThis handsome, beautifully illustrated primer is\n authored by a career geodesic dome engineer with a sense of the big \npicture, including the history.  I found plenty of mathematical trail \nheads leading off in various directions, all worth exploring, with a \ncore of spherical trigonometry.\n\nYes, my own writing is in the \nbibliography, which may color my opinion, but to me this just means \nEdward Popko (whom I have not met) was extremely thorough and really did\n his homework for this tome, including exploring a lot of obscure \ntopics.  Amy Edmondson's [A Fuller Explanation: The Synergetic Geometry of R Buckminster Fuller](http://www.amazon.com/gp/product/061518314X/ref=cm_cr_asin_lnk) is likewise cited, helping weave together a story that is still unfolding today.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}