{
  "id": "2359044759535591711",
  "title": "Riddled With Holes",
  "published": "2013-11-01T17:51:00.001-07:00",
  "updated": "2013-11-03T09:32:52.537-08:00",
  "content": "The way Fuller presented his philosophy was as mostly space but then also framed windows in a kind of spider webby networky sense, gossamer, ephemeral, ectoplasmic (ghostly shmear).  Windows being the O in V + O = E + 2, O for Opening.  Like left by bullet holes.\n\nStar Wars adapted Earthian war movies, adapted from war itself, to an alien environment (long ago, far away) but kept the \"war torn\" or \"battle-worn\" look.  Things were dented and dirty, not pristinely shiny as if just off the showroom floor.  That touch alone gave it a flavor of realism that movie-goers relished.\n\nI'm not saying Star Wars was the first or only pioneer.  [Aliens](http://www.imdb.com/title/tt0090605/?ref_=nv_sr_1) was banged up in its own way.  Science fiction as a literary form has always had that broken and bruised look.  Movies maybe took awhile to catch up?\n\nAnyway, Synergetics is like that, some kind of bullet-ridden battle star, definitely a spheroid.  He's been polemical this Bucky, and look at these scars here.  Wow, pretty rugged.  There's grudging respect.\n\nBut also outrage, like David was pointing out, [the 1950s table](http://www.rwgrayprojects.com/synergetics/s09/figs/tb6310.html) with some early Synergetics Constant stuff.  What's up with that Dodecahedron of 12 Hexagons?  Say what?  It's a communist er capitalist er insect people plot, to put stupid mistakes like that in the public record and let them stand.  How could a mistake like that get through the editors?  Makes Bucky look bad, like he can't count [fingers and toes](http://mybizmo.blogspot.com/2007/12/quaker-preschool.html).\n\nI'm arguing there weren't that many layers of editor and Synergetics is both meticulous and \"thrown together\" as Cosmic Fishing shares the tale.  There isn't that editorial oversight you might enjoy if settled in and enjoying a well-diagrammed workflow. \n\nThink of Donald Knuth, for example.  I just got his four volumes in the mail.  He's been meticulously organized.  Fuller was just dragging papers around in his suitcase and relying on Applewhite for the meticulous part.  I'm not saying that was in any way unwise, as EJA upheld his side of the bargain and then some, but it's not the controlled processing of errata we might have had, and still may have. \n\nBob Gray did a superb job of getting the opus reliably transcribed.  Version control going forward? Big project.  Notice I haven't stepped forward.  I just [got on Github](https://github.com/4dsolutions/BookCovers) like yesterday for the first time.\n\nSynergetics is also wildly speculative.  Linus Pauling got that way too.  You've got a front row seat in high stakes poker and you just throw down the hand you've got, in hopes of winning at least something.  Pauling's proposal for DNA was [inside-out impossible](http://worldgame.blogspot.com/2013/05/brilliant-blunders.html), a freak, but with that many horses in that many races, how might we not have a freak or two?\n\nLike where he compares a T-module to a Meson on something like that.  He's shoving chips on his quanta modules having some future in some quantum mechanics but how do you \"shove chips\" in 1970 without just speaking nonsense? \n\nPerhaps nonsense was a best option; the author of Finnegans Wake certainly seemed to think so.  Here's a literary figure with a tiger by the tail, a fun new geometry, and he's determined to make the most of it.  \"Evidence of partying\" the police report might say later.  But can you blame him?  He confesses to being pee-in-the-pants excited sometimes.  He got passionate about this stuff.\n\nBut that doesn't excuse all the mistakes and transgressions does it?  Not in my own case either.  I shouldn't act like I'm apologizing for Bucky when I have my own harrowing Kafkaesque case to be concerned with.  But then \"apologist\" or \"disciple\" have never been my chosen terms.  I'm definitely a fan of certain people, where \"fan\" connotes \"from afar\". \n\nI'm a fan of [Katie Couric](http://worldgame.blogspot.com/2009/06/mortal-coil.html), [Walter Kaufmann](http://mybizmo.blogspot.com/2008/02/philosophy-101.html), [Stuart Kauffman](http://controlroom.blogspot.com/2009/04/reinventing-sacred.html)... [Alan Watts](http://worldgame.blogspot.com/2013/10/satori.html), lots of people, some of whom I've actually met.  Bucky was somewhat in that category, though like Kiyoshi I was experiencing metaphysical eddying.  I think I've talked about [his experiences before](http://www.grunch.net/synergetics/kiyoshi.html).  The collective unconscious is a busy place, lets put it that way.  Friends are people I'm fans of but get to spend more time with, Sam Lanahan for example.\n\nWe kept a low profile this Halloween.  Steve had had knee surgery.  The Barton kids are still young enough, and their porch is just right.  Glenn came by.  Thai food was enjoyed.  Trick or treaters got their candy and maybe shook the fake hand.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}