{
  "id": "741548516229042887",
  "title": "Rights, Then and Now",
  "published": "2008-01-12T13:45:00.000-08:00",
  "updated": "2008-01-13T15:16:35.902-08:00",
  "content": "Our first successful test of the new MMM projector in its home setting included showing a first segment of [Eyes on the Prize](http://www.pbs.org/wgbh/amex/eyesontheprize/), a PBS documentary about the post Civil War civil rights movement in the United States of America.From watching this film, I learned that Rosa Parks and friends were able to boycott public transit for so long because the families that depended on them would chauffeur them by private car.  Basic childcare, daycare, gardening, chaperoning, needed to occur, lest that famous Southern lifestyle fall apart for lack of a supporting cast of extras (this was pre Pixar).Judging from the front page of today's Oregonian, something similar may be shaping up in Oregon, as Americans without club membership in the USA are soon to be denied their driving privileges.For many [Norte Americanos](http://controlroom.blogspot.com/2007/12/map-psychology.html), this move is effectively shooting themselves in the economy (whatever body part), as those same non-members were the only backbone left, in terms of getting the basics accomplished (mostly construction, maintenance, remodeling in the cities, agriculture i.e. food supply in the rural areas).So will we see the emergence of privately dispatched bus systems based around unmarked minivans, shuttling non-member former drivers to and fro?  Hey, maybe the DMV could do it, or TriMet around Portland.More chance to listen to headphones, watch podcasts that way.Anyway, it's quite possible.  On the other hand, people might not be that smart, fail to organize, and let the economy go more completely down the tubes.As an observer of social trends, I'll get back to you on what happens.Doing my part for the economy, I went over to Sears at Lloyd Center today and purchased a brand new [Kenmore](http://worldgame.blogspot.com/2005/10/market-research.html), complete with tax credt (ODOE CF-01 for [premium efficiency](http://worldgame.blogspot.com/2005/01/mornings-meditation-energy-slaves.html)) and service agreement.  I also deposited some off-setting earnings through a partnership account.Tara is back from DreamQuest.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}