{
  "id": "8424540502383598919",
  "title": "Road Trips",
  "published": "2016-04-01T11:43:00.002-07:00",
  "updated": "2016-04-04T23:03:02.917-07:00",
  "content": "Carol is on the move again, having completed the Left Coast circuit.  She and Ellen Thomas are tackling the Right Coast now, trending inward (I'm actually not sure of their itinerary, just glad we've got our Verizon, with lots of coverage).\n\nWhy it's called \"left\" is highly conventional as from the inside of the Earth, as in The Mapparium ([a walk-in globe, one of the first](http://controlroom.blogspot.com/2005/02/mapparium.html)), we could see [the Catalina side](http://controlroom.blogspot.com/2006/02/back-from-catalina.html) as \"right\".\n\nThis \"looking out from the center\" is the \"Geoscope\" idea, an extension of planetarium technology but as much for sharing biospheric data as stars capes.\n\nI'm prepping for a trek north that in olden days would have taken long days by horse and buggy.  The motorcar option [really opened up](http://worldgame.blogspot.com/2016/04/americana.html) under Eisenhower, which followed Roosevelt (FDR) with public works galore.\n\nWe may have a hard time remembering those days (I have to fake it, born in 1958, soon after the dam at the Dalles opened).  The war toy biz is still impressive, in terms of energy expense, but that's closed off to most viewers.  Heavy construction is still in evidence but how much is devoted to infrastructure?\n\nThe Bureau of Public Roads (semi-fictional) took care of a lot of deferred freeway maintenance under the economic stimulus administered by the Obama administration, not unlike one of FDR's attempts to galvanize through public funding.\n\nI drove long stretches of I-70 appreciating the upgrades going on, lane repaving etc.  If we're to continue with truck-based transport, however fueled.  That was during a St. Louis visit (cite of car rental pickup).  We were attending a Distance Education conference (USDLA).\n\nBy \"prepping\" I mean taking some down time, hiking and taking in some instructive videos.  That would include the Poverty, Inc. thing.  Walker came by, moving up our Friday tea date, and we shared some of the same observations.  We thought the Flossis would like it.\n\nThe film is an open letter to Bono almost, exposing the evils of dumping in the guise of aid.  The thing is, it's complicated, as the film itself points out:  not all NGOs, or [even Gongos](http://foreignpolicy.com/2009/10/13/what-is-a-gongo/), are created equal.  Just like in the private sector.  Businesses differ in how they do business.\n\nHey, don't let me overwhelm you with my vast experience.  I'm just another guy in a time tube.  However I have seen quite a bit, thanks to an itinerant family and a career that gained me entre into quite a few lines of work, including cardiology and land use planning.  I continue to be interested in maps and visualization systems (especially for global / planetary data).\n\nI got to sit in on interesting meetings in my day, sometimes opening my mouth (expected), other times not so much.  I'm fine with sitting in the back row at Wanderers meetings, for example.  Other times I get to present.\n\nThose protesting the dumping do have alternatives in mind, which sound very Reaganomic in sentiment, so I can't imagine much objection from the horse owning crowd.  Being one's own boss in a company of one's peers is a dream come true in capitalist heaven.\n\nHaitian businessmen want to build, sell and install their own homemade solar powered street lights, which are not inferior.\n\nNGOs come along with tons of free stuff and avalanche an economy with excess, keeping prices higher at home (desirable) and getting the write-off.  Call it a subsidy, call it whatever, it's the reverse of an import tariff, it's selectively wiping out small competitors.\n\nThe film's recipe for success is not one most NGOs would object to:  the rule of rules.  The flip side of that is simplicity called \"corruption\" but that's where an anthropologist's work begins.  Those with no organized network are easier prey, and herding is a natural instinct.\n\nMaking a movie to express a viewpoint is a coherent strategy, well done by [Yes Men](http://worldgame.blogspot.com/2015/06/yes-men-are-revolting-movie-review.html).  The documentary is an appropriate vehicle for dueling views.\n\nYoutubes come with varying budgets and production values, but people who have something to say just need inexpensive recording equipment to have input.  Lindsey and Jordan proved this locally with some excellent footage.\n\nWriting up how it actually works (descriptive) is often more valuable than imposing a new rule system.  Adjustments in something already working, however \"corrupt\", is often sensible and, as important, doable.\n\n[Corruption](http://worldgame.blogspot.com/2015/09/investigating-how-things-work.html) is a feature of the narrative, the accounting system imposed.  I'm not saying that to \"justify\" what's criminal, just treating every broken institution as a crime scene is not always the most productive approach.\n\nI'm paid up [with AAA](http://mybizmo.blogspot.com/2005/12/another-nsr-from-aaa.html) and may cycle back to Jiffy Lube for fluids top-off prior to the upcoming road trip.  Owning a car is far from free.  Other DVDs are going down.  Amino acids.  PDB files.  I use another local mechanic as well.\n\nI've been agreeing with the [veterans / alumni on mathfuture](https://groups.google.com/d/msg/mathfuture/egRRjpxrgwI/VSV6c0cACQAJ) that a code school needs advice from surrounding technology-intensive communities who might want to send talent scouts to our meetings, or accept interviews.  That'd be OHSU in our case, among others.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}