{
  "id": "6877898421730986151",
  "title": "Rocky Horror Picture Show (movie review)",
  "published": "2017-07-18T09:50:00.000-07:00",
  "updated": "2022-01-10T12:22:18.640-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/a/AVvXsEhKK_Og26erEk1VZ8nLUi2vZVz5pqtn35uJ-fG7imUjwyWqxjgHY6ylV0suT8bQ8keRCZ17Zxsn66ERX2MpXHrCHYTeWo0_8P84TT29KpR4r1wy2o1Zb6TEl3E9hV6n3NiCx2Q2-wd3F8zxBDMaPG19yRCsLsLGL3smycEAj6O2ZKbnEin79A)\n\nI've seen very little mention of the geodesic dome, featured as a part of the spooky castle above, where Rocky Horror Picture Show was originally filmed.  Much could be made of this link to another counter-cultural icon, from a domain of sexual mores breaking out of their bounding box, thanks to ETs.\n\nThe point was to visit Clinton Street Theater where teens, mas o meno, have been doing the audience participatory version of this cult film for some twenty odd years, starting midnight on Saturdays.  The torch gets passed, one generation to the next.\n\nGetting picked as a cast member means knowing the right people, in addition to exhibiting some talent to entertain. Participating in a RHPS is something of a rite of passage.\n\nI went with a professor of gender studies and international development who'd never seen the film, turned off by the word \"horror\", a genre she doesn't enjoy.  The raucousness of the audience overwhelmed the soundtrack and she came away with a garbled version of the plot, but that's easily rectifiable with later study.\n\nI like pointing out that Tim Curry has a later role in the movie Kinsey, where I plays an ironically prudish professor. One of the best ways to study a culture is by delving in to its sex ed, but then don't make the mistake of thinking education == academia.  All media have an educational role.\n\nMy first induction into this cult came way back in my Princeton years, in the late 1970s, much closer to the time when this film, originally a stage play in England, where that castle is, first came out. \n\n[](https://www.flickr.com/photos/kirbyurner/35921129496/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}