{
  "id": "537596398399949108",
  "title": "Round Robin",
  "published": "2022-06-27T21:30:00.000-07:00",
  "updated": "2022-06-28T10:08:06.451-07:00",
  "content": "I like the country bumpkin sound of \"round robin\" -- or perhaps this is a more genteel kids' book by an Englishwoman. What I'm thinking though, is \"operating system\" and time sliced attention.  The idea of slices or intervals in particular.  The scene:  it starts and stops.  On to the next frame (sequence).\n\nFor my part, part of my tour are my own pages on Github and how ship shape are they.  Today, I was looking at VolumeTalk.ipynb, one I've touted here and there, only to notice many unexecuted code cells.  When I dredge up the localhost original, and re-ran it, the code cells were inconsistent with expected results. I was stumped.\n\nAs I posted later to Synergeo, the issue was with the E module and my failure to input its six edge lengths in the right order, to any of the volume-from-edge computing algorithms.  Once I switched edges e and f, the volumes popped back into place, with the E mod's equal to 2nd root of 2 times (1/phi) to the 3rd, all over 8.  Yeah, funny.  About 0.041731316927773675 with the option to run it out further.\n\nYou may be thinking \"no one in the world cares about what you call E modules, so this is all very Yellow Submarine, very Nowhere Man\".  I get the sentiment, however \"no one\" is an exaggeration given I'm someone and I care.  Plus I know of a bigger fan base that appreciates my gold mining in Synergetics, or maybe minting, as D.B. Koski has been more the miner, of golden mean based relationships.\n\nThat I was able to afford enough attention, is not something I take for granted.  Earlier, I was taking an applied mathematics practice test, doing pretty well.  As a curriculum developer, I get saddled with doing assignments made in other shops.  Indeed, there will always be way more of them than I, so it should come as no wonder that I spend at least as much time learning as teaching.  Ideally, I'd be able to afford a lot of learning time.  That's something I look for in a job.\n\nA real scheduler is sensitive to all sorts of priority cues, and no, I'm not the expert.  Operating System Design was not one of the courses I took at Princeton.  \n\nHowever I get it about Operations Research (a context for PERT analysis) and how that fed the timeshare model.  How do we efficiently virtualize the experience of working with a mainframe, such that each user gets the experience of running a virtual mainframe?  You have cylinders, you have tapes, you have printers.  A round robin like process keeps each user in the loop with a responsive set of GUIs + APIs.\n\nTurning back the clock by several orbits, I'd likely be in the basement of Princeton Inn, abutting the golf course, a short walk from the Dinky, the short electric train out to the mainline, the Northeast Corridor for Amtrak and Conrail, next stop Trenton, to the south (Princeton Junction is its own station).  \n\nI'd be typing in APL, A Programming Language. This is the 1970s and IBM has gone gaga for APL, engaged in two way conversation. I'd later follow Kenneth Iverson onto J and even had the benefit of his corrections when I web-published Jiving in J.\n\nLogo would be similar, and likewise my dBase (II, III and IV) and its signature \"dot prompt\".  \n\ndBase II became Foxpro, and I became employed, as a Visual FoxPro (VFP) developer, for quite some time (many years).  I'd written some FORTRAN for my main client before that.  This was back at CUE (Center for Urban Education).\n\nAt OSCONs, I'd meet people from like HP and OpenStack who really did understand schedulers in the computer science sense.  \n\nFrom there, it's but a short jump to an appreciation for news cycles and public attention, and managing the carnival or theme park or whatever.  Not that anyone really does manage the circus, just we have many partially overlapping circuses being managed, each one a Greatest Show on Earth.\n\nThe point of view of the OS designer is one of maximizing efficiency while giving each user a sense of privacy, as in security, and reliable performance.  \n\nUser processes are administrated by a combination of human judgement and automation, with each user process getting its allotment of storage and CPU time.  Let us pray admin is appropriately transparent, and breaches in security are both reported and rare.  \n\nThis was the UNIX architecture, but also that of OSes in general.\n\nThere's still room for human admins to mess it up.  However much is automated.  \n\nThe solo human operating a laptop is typical, even if, upon zooming out, we see that human + computer as a component within a much larger circuitry, which it is, as a node in a network.  The parallel computing that goes on daily is what keeps the world turning, so to speak.  \n\nA world turning is another picture of an operating system getting work done, by turning slowly around its own axis. Or picture an IBM Selectric ball for your type head.  Something spherical leaves trails that seem linear, even if not exactly straight.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}