{
  "id": "113865188797668958",
  "title": "Rural Oregon",
  "published": "2006-01-30T00:17:00.000-08:00",
  "updated": "2006-11-15T11:43:50.440-08:00",
  "content": "If you're a tourist in this state, I recommend you get out of the big city (not that any of them are all that big, by world standards), and explore the rural highways.In particular, I would consider [John Day](http://www.grantcounty.cc/) a destination, and the [nearby museum](http://www.pioneer-net.com/%7Evproctor/).  Take care when exploring the Painted Hills, not to disturb the ecology (a \"look don't touch\" kind of place).When studying the [fossil beds](http://www.nps.gov/joda/), you'll learn about many departed species, such as the [oreodont](http://images.google.com/images?q=oreodont), a great lover of [cookies](http://www.nabiscoworld.com/oreo/memories/default.aspx) (just kidding).As you drive through this topography, notice the large farm-based economy.  Horses and cattle abound.  Hay gets rolled up in wheel-shaped storage units.  A lot of heavy machinery gets the job done.  Oregonians are pretty industrious (we even build [covered bridges](http://coveredbridges.stateoforegon.com/)).Thanks to this scene, you'll have many opportunities to sample fresh produce.  If you've always wanted to try horseback riding, Oregon may be the state for you.A lot of our sports are at least mildly dangerous you'll notice:  sailboarding, kiteboarding, skiing, mountain climbing, ... gambling. Opportunities for getting into trouble abound.South Africa is kind of like this too.  When our family tried riding ostriches that time, we understood the \"use at your own risk\" [signage](http://www.answers.com/signage&r=67).  Fortunately, none of us got hurt -- that time.So, if sampling activities, be a realistic judge of your own talents and limitations.  There's no shame in starting slow and easy, staying well within your own comfort zone.In sum, if you have a challenging goal in mind (e.g. to reach the summit of Mt. Hood), plan on taking your time getting properly trained and equipped.  Don't take short cuts, when it comes to your own personal safety.You're a tourist, remember, not [Indiana Jones](http://www.imdb.com/title/tt0082971/).Background reading:[Saving the Salmon: A History of the U.S. Army Corps of Engineers' Efforts to Protect Anadromous Fish on The Columbia and Snake Rivers](http://www.nww.usace.army.mil/lsr/REPORTS/save_salmon/salmontoc.htm).Somewhat unrelated reading:[The Mysterious Smell of Moon Dust](http://science.nasa.gov/headlines/y2006/30jan_smellofmoondust.htm?list760659)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}