{
  "id": "8946567718100263352",
  "title": "Safe Campus Cities",
  "published": "2019-08-05T07:52:00.000-07:00",
  "updated": "2019-08-05T14:09:23.649-07:00",
  "content": "Any talk of holding or detention centers (on what charge? for what offense?) sparks worries that cross the road to ignite corresponding concerns in our plans and storyboards for campus facilities aimed at accommodating people with only a few assets.\n\nIf you have a lot of assets back at home, you're not expected to store all these on campus, unless your goal is to contribute to the pool of recyclables.  Let people mix and match.\n\nLarge open spaces for assembly scare people, although the sound stage motif is very common. Corporate events, such as celebrating a new computer language, may use a sound stage and go for a \"rock concert\" look and feel.  Any lack of large open spaces for assembly also scares people.  You need those.  Thriving communities have those.\n\nWe're clearly entering Christopher Alexander territory in looking for the pattern language of the campus.  Occupy went here, exploring for models.  We didn't have a lot of [pods to play with](https://coffeeshopsnet.blogspot.com/2011/10/cubbies.html), wired to both receive and transmit.\n\nI'm aiming for the \"comfy carrel\" or \"cave\" that's not locked from the outside.   You will say I'm avoiding designing prisons.  I'll say that's correct, not a proficiency.  However I'm a student of institutions and learn from fact and fiction regarding many.\n\nThe dystopian Black Mirror type episodes, around some cultural innovation, provide points of resistance and give people pause.  \"Do we really want to go there?\"  Oft times, we really don't, and yet there's somewhere else, close by, same neighborhood, we consider a worthy destination.  We need to aim.\n\n[](https://www.flickr.com/photos/kirbyurner/26801619080/in/photolist-MWcCCk-24nKxN1-QQpNj1-HpWezM-GQniAG)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}