{
  "id": "3032230932761658102",
  "title": "Saint Misbehavin' (movie review)",
  "published": "2018-01-29T16:48:00.003-08:00",
  "updated": "2018-01-29T22:42:50.689-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/39944677212/in/dateposted-public/)\n\nI watched this over at Glenn's today. He had me over for lunch, great soup. I brought some tallboy Olympia beers.  The movie is from the library.\n\nI've been aware of Wavy Gravy for a long time, but was out of the country during Woodstock and would have been too young to attend on my own even if I'd been on the continent.  The first hippies trace back to the beat generation.  Wavy Gravy was your classic beat poet, in Greenwich Village, except with a strong sense of humor that's carried him until now (he's 81 at the time of this writing).\n\nI've posted to QuakerQuaker how I consider Richard Stallman to be a Bodhisattva, and now I've got another candidate.  Not that it's up to me to be handing out this title.  More that I convey what I understand \"Bodhisattva\" to mean by pointing out whom I consider to be archetypal examples.\n\nWoodstock had many of the same themes as Occupy a couple generations later.  Yes, these platforms give voice to political views, but equally if not more important was the experiment in non-violent cohabitation.  Could half a million people cram into a rural area and enjoy music without killing each other?  Could they stay fed?  Would they spawn epidemics?  Lets do some science and find out.\n\nPeople are curious and want to evolve their logistical abilities.  Getting the Hog Farm (Wavy's community) to do \"Please Force\" security was a stroke of genius on the part of Woodstock organizers.\n\n[Occupy Portland](http://controlroom.blogspot.com/2011/11/virtual-opdx.html) (OPDX) was likewise all about the free kitchen, which [Food Not Bombs](http://controlroom.blogspot.com/search?q=FNB+lindsey) started, but then turned over to others, given its own more stringent practices.  The downtown campers were eager to do science and see if they could live as economic refugees for awhile.  Portland supported the experiment for a matter of months, then pulled the plug.  The kitchen packed up the night before.  The data was in.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}