{
  "id": "7727115547269304681",
  "title": "Sampling Facebook",
  "published": "2019-06-12T09:10:00.000-07:00",
  "updated": "2019-06-13T09:02:39.210-07:00",
  "content": "[verbatim, posted as Public ]\n\nMy current position on political theater (a main gossip station):\n\nI think I'm OK agreeing that the RT America crowd, at least, was \nimpressed with Hawaiian presidential candidate Tulsi Gabbard, as various\n stories alleged.\n\nShe's anti regime change wars, pro legalized \nweed (anti Prohibition), pro bitcoin, free Assange and Manning, twice \ndeployed, still active duty with the Hawaiian national guard.  Serves in\n Congress.  All good.\n\nI agree with RT America:  there's no one better.  Ergo she has no chance \nin a \"mediocrecy\" (where media is mediocre).\n\nOn the theory that RT America narratives stay consistent with those of \nthe Kremlin for the most part, I'll speculate that Putin and his cronies\n likewise admire Tulsi for her principles, despite her relative youth \nand inexperience.\n\nI see nothing wrong with the Kremlin having \nand expressing a  preference through their state-sponsored media channel\n on Youtube.  I'd say it's pretty obvious that's what's happening, \njudging from what I've seen so far.\n\nWith all eyes watching social\n media for cyber-manipulation, the best policy is just to state one's \nviews plainly.  But then clearly Putin doesn't get to vote, the American\n people do, and Americans are the ones who are pushing Tulsi off stage \nat the moment, because she's a peacenik and for other reasons.  \n\nAmericans are also the ones who elected Trump.  I don't buy for a minute\n that a few clever memes on FB or even Podesta emails on Wikileaks, \ncould have countered the complacency of the \"she's a sure thing shoo-in\"\n crowd. I expect less complacency in 2020.\n\nIf we can agree the \nRussian government would prefer Tulsi, then we can immunize ourselves \nagainst the still virulent \"Russians prefer Trump\" meme, which is a kind\n of cop out surrender on the part of Lower48ers who watch too much \nfictional Netflix about the spy world.\n\nThe Trumps were bored at \nthat meeting in Trump Tower, about the Magnitsky Act. The Russians \nwanted adult conversation, but the campaigners wanted gossip.  Most \nAmericans know next to nothing about the Magnitsky Act.  That's one of \nthose adults only topics, not a good fit for the current White House.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}