{
  "id": "5980040421130537007",
  "title": "SAO Meeting",
  "published": "2009-04-16T16:56:00.000-07:00",
  "updated": "2009-05-20T13:54:10.555-07:00",
  "content": "I'm doing [the ping ball thing](http://mybizmo.blogspot.com/2008/01/pin-ball-in-pdx.html) again, getting to lots of meetings.  This one with Chris was excellent, helped me connect dots with Saturday Academy, think in some new tracks about how we're doing it in Oregon.We talked Ubuntu quite a bit, also the gender imbalance, which [SAO](http://www.sao.org/) has funded some studies regarding.  I mentioned this being [a focus at OSCON](http://worldgame.blogspot.com/2008/07/women-and-foss.html) as well, plus the fact that the female FOSS bosses we do tend to have goddess status right out of the gate i.e. it's not a matter of smashing a glass ceiling, unless you're 2nd tier, in which case you're more likely a guy (because of the ratios involved, like 9:1::XY:XX in many venues).We had lunch outdoors on Hawthorne, enjoying a modest spring (sunny, but not blindingly).  I had coffee and a spinach salad, brought along some show and tell items, including StrangeAttractors (Design Science Toys), CubeIT! (Huntar), Ball of Whacks (Roger von Oech's, comes with seminars!), a Sam Lanahan [flextegrity](http://www.flextegrity.com/), an XO, some GIS literature, and a small Bucky book from the art museum, still shrink wrapped.  All this fit [my OSCON bag](http://worldgame.blogspot.com/2009/01/saving-children.html), believe it or not.  We had fun.Other Oregonians are moving quickly on these issues, not just me, which is gratifying to learn.  Given I'm such an old guy, I was able to talk about Visual FoxPro and dBase as if these were just yesterday's tools, whereas they're actually the day before yesterday's (smile).That [got me reminiscing though](http://mail.python.org/pipermail/edu-sig/2009-April/009291.html), had to agree with Patrick O'Brien: Python has a lot to recommend it over xBase.  Still, our \"dot prompt\" culture isn't so different, in terms of our expecting a shell.[The FoxPro development environment](http://mybizmo.blogspot.com/2005/03/pycon-2005.html) by the VFP Microsoft team had a to-die-for GUI design environment for [a thick client](http://www.flickr.com/photos/17157315@N00/3210762990/) (ala wxPython), i.e. a great way to go if you're not taking the thin client browser based route (see Ellen Ullman's Close to the Metal for more on the evolution of database technology and what it was like in those days).  VFP's development environment was even better than Visual Studio's in some ways, pioneering Intellisense (which I'd tend to turn off).Of course it sounds funny to call today's web browsers \"thin\", as if FoxPro runtime were any bigger in terms of sheer megabytes.  But the point is, the browser is an open standards well understood environment and almost everyone has one, meaning the actual application gets defined on the server, even if the downloaded Javascript ends up controlling the client.The HttpResponse suitcases delivered over the wire unfold automatically [within your DOM](http://mail.python.org/pipermail/edu-sig/2009-April/009283.html), setting the stage for JQuery or [GWT](http://mybizmo.blogspot.com/2009/02/democracy-engine.html) magic or whatever fun and games.  All this apparatus then disappears when you log out and drop the connection, whereas with FoxPro you have these multiple thick clients lying around in the form of exe and dll files, or should, unless you want a lot of unnecessary network congestion (like downloading a whole browser every time you want to use one).[Ian and I](http://worldgame.blogspot.com/2008/04/kitchen-tableau.html) talked by cell for a long time this afternoon with several interruptions.  He's eying the iPhone for his outreach applications (colorful [algebra games](http://coffeeshopsnet.blogspot.com/2009/03/csn-circuits.html)), which coincidentally kept cutting out when we talked about Androids (a competing model), but only because he was in a busy neighborhood with lots of buses.[Oversight meeting](http://worldgame.blogspot.com/2009/04/m-2009416.html) this evening, no rest for the weary, hope it's fun at least.  We went to Noah's bagels this morning, used our coupons.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgxdsBHs6Wp6LdK0PjZEAvlQFSIssPUqMoi0XsELh3uj37Xfv5j9R1Nnjvolr4Khqf-8GLLadpv-EUFOvk_UzZS9ieYo3DhuDG6khwi0ozI1XZ6qNB2gwelliczh3cTCeajonWD/s1600-h/ian_clown.jpg):: [bubblz](http://www.bubblztheclown.co.uk/) w/ ian @ atm conference (uk), post Pycon ::sent by cell",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}