{
  "id": "2722370313036386498",
  "title": "Scenarios",
  "published": "2007-05-03T07:34:00.000-07:00",
  "updated": "2007-05-03T08:23:17.796-07:00",
  "content": "I visited the [Costco](http://mybizmo.blogspot.com/2007/01/another-day-in-matrix.html) nearest the airport (PDX) twice yesterday, the first time to cancel Dawn's membership, the second time to prove my partnership status with Dawn Wicca and Associates ([DWA](http://worldgame.blogspot.com/2007/04/boring-tax-story.html)), and start a new membership in my own name with that business, still a going concern (Dawn's membership had been through [ISEPP](http://www.isepp.org/)).Then I went shopping, choosing judiciously I think, resisting temptations (no HDTV today, thank you very much), focusing on prosaic mundane needs, such as detergent, coffee, work clothes... OK, so I got a case of Red Bull, 24 for like $32 (plus cases of Sprite and Thomas Kemper Root Beer for Tara, anticipating summer).Then I went back to my spring cleaning, between calls for tech support, which I provided.I've made great progress freeing Dawn's good name from any negative karma in the form of debts. The medical bills are all paid, except maybe one from Apria (still researching). There's still a pair of shoes to pick up.The home equity line was retired per Dawn's plan, though I'm still slogging through the original mortgage (at least we bought in the Hawthorne District before prices skyrocketed, thanks to [Laurie Todd](http://worldgame.blogspot.com/2007/03/labyrinth.html) -- we were just renting before).Today I should visit some clients in person. Sure, we all like to VPN from our coffee shops, but there's no substitute for real face time. I'm not one to just telecommute and never set foot in a place -- a practice which helps keep my client list small, and therefore manageable.We have a Phase Rule thing going with Naga-the-snake, where I recycled a 10 gallon (37.85 liter) aquarium tank in the garage but skimped on buying a lid (which explains her [getting out](http://controlroom.blogspot.com/2007/04/errata.html) the other day).The current theory is poor ventilation made the internal climate too humid, hence the two barfed up mice. We've had her under observation at a more secure facility and hope to have her back shortly.In the meantime, I have of course upgraded the lid to a world class mesh, providing plenty of air circulation.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}