{
  "id": "5656793100777971735",
  "title": "Scheherazad Numbers",
  "published": "2021-10-03T14:41:00.004-07:00",
  "updated": "2021-10-03T14:41:50.310-07:00",
  "content": "On the Zoom call yesterday, with simultaneous chat (text dialog), I found myself weighing in on what I thought Bucky Fuller was up to with these uber-composite numbers, pregnant with prime factors, and going for a large number of digits.\n\nWe're used to large digit integers from cryptography these days, and the idea of a \"wrap around\" gear wherein our composite is the modulus for totatives, co-primes to N.  Scheherazad Numbers would have those too, but maybe not as many as we'd expect (depending who \"we\" are), given their size.\n\nFlash to the Antikythera mechanism, reconstructed from ancient blueprints (a rusted specimen, subjected to X-ray analysis), and we find a gearworks up to tracking local astrophysical phenomena.  Integers can do it pretty well, if at high enough frequency.  So could a computerized Antikythera with Scheherazad Number limits to precision, hold its own?\n\nThe theory includes trig tables and all manner of digital operation, within the confines of this high frequency integer space, however expressed as a decimal.  The Numbers provide a degree of resolution, without dictating a specific scale, much as RGB provides \"millions of colors\" and no more.\n\nIn Buckyverse we have this \"nature is not using pi\" trope, which stands for the whole phenomenological argument over whether pi has trillions of digits of significance in any future physics, or does Planck insure a limit on precision / certainty (Heisenberg too)?  Bucky comes down on the side of uber-precision being attainable, but infinite precision being the fetish of infinitists, a school of thought he's pitted against.\n\nIn other words, nature gets through the day without needing our trillion digits computer generated versions of \"pi in theory\", as fun as this target is to reach for.  Incommensurability is a real phenomenon sure enough. I don't think of Synergetics as \"in denial\" vs-a-vis what Euclid proved:  that the 2nd root of two could never fully resolve as some p/q with p, q integers.  Rationals have their limited exactitude, but then what doesn't in phenomenological space and time?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}