{
  "id": "4345988873105897150",
  "title": "Schismatics",
  "published": "2024-05-29T10:29:00.000-07:00",
  "updated": "2024-05-29T10:30:03.954-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjDbHG8LcR2caWMbSlCGCV7O7WvDdF4fJoFyRjJ9uqDpBrWR02PGjoC2rHNqDZhuulwXuOafZZWD2AvUE9rxyyB5KFne6knU0mZGw9Z1Cz3eAY1mFuW-u8Ruaz4WBiaw4JRVtyfvdaLH0XfyPFCEMYmnDvW__qAo0mBgU0vmUu5WaqpBgorzd6z/s1024/abducted_bucky.png)\nSchismatics: the (perhaps somewhat tongue-in-cheek?) study and description of the process of forming schism, and is often taken up in the course of religious studies.\n\nInevitably, as a school broadens to include a more diverse set of participants, among students, faculty, admin and crew, dividing lines begin to appear, logical groupings. In a healthy expected growth pattern, cell division, in terms of function, not just number, is no threat. Monoculture is closer to the antithesis of growth and form. However at the more metaphysical level, a split may be experienced as a schism and the school itself has to divide, which may feel painful on some level. The school was maybe not designed with mitosis in mind.\n\nAlong those lines, there’s a deus ex machina sect that preaches our ultimate rescue, or the possibility thereof, by ETs, off-worlders with the kinds of magic we could use. Within this sect, a subgroup believes the “ETs” aren’t from off planet, but have been indigenous since long before humanity emerged. \n\nFor example, when UAPs dart to and fro across the screen, violating all known laws of physics assuming a mass anything like that size would connote, at that distance, some faculty are excited to realize that all our energy concerns as a species might be satisfied with new physics like theirs. The fork in the road then becomes: do we learn from them directly, or use them for inspiration (they’re not talking) and develop the new physics on our own, perhaps clandestinely?\n\nA different sect considers it irresponsible to put any eggs in the UAP basket. If the ETs were planning to assist or attack in a big way, why haven’t they done it by now? Some would say they’re helping, others that such a war is underway. These are differences in cosmology. One sect’s Hollywood fantasy is another sect’s daily reality, actively inferred by their models.\n\nSuch a schism occurred amongst those tracking R. Buckminsterfullerene Fuller while alive. His Synergetics was open to interpretation, and with Bucky himself out of the picture, a more anything goes approach could be tested. The cannibalization of Synergetics could commence. I’m guilty of it too, in treating the concentric hierarchy, with jitterbug and other dynamism, like the beating heart of the matter, with the BEAST modules then making it hard core.\n\nI’m one of those who thinking investing in UAP technology, in the sense of getting investors to pay research costs, is not alignment with Fuller’s core program, and that Synergetics is not the new physics for abundant free energy from a zero point, as some Bucky fans proclaim. They’re in a different school of thought from mine, and I often point out that the Synergetics Dictionary has no entry under “UFO” as “UAPs” were then called.\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj6jgIH3p7pQdqk5_Wor2WuiOXgIgWbk9qE4OyORMaA_jgO5fxS544WUYK77TyLFnSBsCvo4huJf95zAfiO789AC5rJeWekft0QQ2DsjdK6BjnDcDMG2bPBLD7O4uYMwaYQM8J_3oqiNXON3BZwx26zEbax7PtfzCa1Z_br21YbPE8PDeua7Ver/s1024/abudted_bucky_2.png)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}