{
  "id": "8322276583661833614",
  "title": "Science Fiction Future",
  "published": "2016-10-26T17:17:00.000-07:00",
  "updated": "2016-10-29T17:17:25.783-07:00",
  "content": "We will need writers who can remember freedom.  We need writers who know the difference between the production of a market commodity, and the practice of an art.  So says Ursala Le Guin, another WILPF member (like [my mom](http://mybizmo.blogspot.com/2016/10/mystics.html)).\n\nSpeaking of science fiction, the [Martian Math](http://wikieducator.org/Martian_Math) I'm using, not unlike Tolkien's Elvyn in living internally to [some \"middle earth\"](http://controlroom.blogspot.com/2014/12/hobbit-economics.html) (a virtual nation we might say), features this artifact that looks like [a caltrop](http://mybizmo.blogspot.com/2015/09/manga-on-mul.html), if anyone knows what that is, not a jack in other words.  A jack is a six-spoked affair whereas a caltrop has only four spokes.\n\nIf you've taken linear algebra you know the 90 degree turn is into a whole other dimension, a twilight zone almost, given its 100% linear independence from the first ray in the picture.\n\nThe real estate from 0.01 degrees to 179.99 degrees is all brought into being by this Dim 2 (second dimension) but pointing 180 degrees opposite is back to Dim 1.  The clock hands lie flat, so back to one line, not a triangle anymore.\n\nJust taking the negative of a basis vector, is not to get a new basis vector, or dimension, as we're to see only three infinite lines through a shared center, with travel in both directions a property of any line or road.\n\nThe caltrop is nonetheless fewer spokes, four is less than six, incontrovertibly.  In making all four \"positive\" with these labels: (1,0,0,0) (0,1,0,0) (0,0,1,0) and (0,0,0,1), we're creating canonical linear combinations, road maps of zero or forward motion along these four directions, to any point in space.\n\nThe six-spoked XYZ artifact offers the same advantages:  a unique address per every point, a distance formula, ways of computing angles.  Going back and forth between XYZ and [Quadrays](https://en.wikipedia.org/wiki/Quadray_coordinates) is what many an Earthian diplomat learns in grade school, in preparing to work with the Martians on projects.  Their unit volume is not a cube.\n\nThe XYZ vendors claim they're touting most economical warez, in that three basis vectors, mutually orthogonal, are enough for their scheme to pan out.  Yes, negative signs are needed, to show basis vector mirroring, and eight octants get created.  That does not mean we should kowtow to the Martians.  They could learn from us Earthlings.\n\nAs you can see, there's a lot going on in this science fiction, with factions right from the get go.  Having the two coordinate systems in the picture is the first step towards at least having some interesting debates and conversations, during which terminological questions are clarified, definitions more clearly cast.\n\nHowever some teachers protest that linear algebra students have enough on their plates.  Martian Math may sound like fun in theory, but [adulthood is calling](http://controlroom.blogspot.com/2016/10/surveying-pedagogy.html).  We don't have time for gratuitous [brain teasers](http://mybizmo.blogspot.com/2005/12/heptagons.html).  Who ever heard of a unit volume that wasn't cube-shaped, anyway?\n\nFor my part, I think all six XYZ vectors should get equal pay for equal work and therefore -(1,0,0) i.e. (-1,0,0) is just as much a basis vector as its oppositely pointing counterpart.  That's not the official definition of course.  That's where philosophy comes in, to provide that subjunctive layer of \"could have been otherwise\" -- even in mathematics. \n\nMartian Math in science fiction, from the Silicon Forest: [https://t.co/bO4SOeMWIk](https://t.co/bO4SOeMWIk) (warning: [#mathy](https://twitter.com/hashtag/mathy?src=hash) [#mathsy](https://twitter.com/hashtag/mathsy?src=hash) and maybe a tad surreal).\n— Kirby Urner (@4DsolutionsPDX) [October 27, 2016](https://twitter.com/4DsolutionsPDX/status/791513120808153088)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}