{
  "id": "2627749538496634684",
  "title": "Science / Religion",
  "published": "2012-04-27T15:52:00.001-07:00",
  "updated": "2012-04-28T16:34:55.642-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/6973763244/)\n\nI was pleased Tara could join us again.  We've about run out of ISEPP lectures for the two of us at the same table, though perhaps there will be times.  I let her off at the entrance to the Schnitzer, while taking the car around to the City Park on 13th, just north of the Multnomah County Library.  I returned to the theater through the back entrance on the park blocks and didn't find Tara again until the Q & A.\n\nPhilip Clayton tells some interesting history and plays brief clips of key people, a lecture style I think he pulls off.  He's an innovative guy.  I should be forgiven for my esoteric immersion lately in the Homer Davenport story, with links to Homer Simpson and therefore... [Ned Flanders](http://youtu.be/Dd5iDTQy1OM).  If he'd said \"okaly dokaly\" I'd have cracked up out loud.  \"They'd probably like him at Earlham.\"  \"What's that supposed to mean\" (laughing).  Then it turned out he was Quaker.  So I was [probably right](http://mybizmo.blogspot.com/2006/11/more-election-day-news.html).\n\nPortlanders are pensive, serious thinkers.  I'm not saying Portland is the only introspective city.  I think it helps to have Quakers, even if only a few.  Have esoteric Buddhist sects if you're lucky.\n\nScience and religion had been getting along pretty well.  I was surprised he didn't mention Teilhard de Chardin.  I asked during the Q & A if he didn't think the best religions could still be ahead of us.  Instead of trying to make the old ones get along better, why aren't we busier inventing new ones.  We've learned a lot from these many civilizations, why not kick start a bunch of new ones?  Philip responded with the idea of retro-fitting or rehabilitating old ones.  Much more could be done with the teachings of Jesus than Christianity had ever yet tried, so why not re-animate from within an existing tradition?  I guess I wouldn't see it as either / or.  Inventing new religions is likewise a process of reinventing old religions.  Kneed that clay.\n\nAnyway (about twenty years ago was it?) that science / religion rapprochement all went kablooey and a major culture war got underway in which science and religion would appear to fight in a bitter way again.\n\nFor many, this felt like a throw back detour into a darker age.\n\nClayton's plea, transmitting Bronowski's (I remember that guy, a TV personality), was that we overcome the current impasse, the either / or mentality, and stop getting in one anothers' way.  Portlanders couldn't find much to argue with there and left the theater upbeat, was my impression.\n\nTara and I adjourned to the dinner, joining Jeff and a co-worker from Rumblefish.  The waiters were generous with me in particular when pouring red, perhaps for kindnesses exchanged, or so it seemed to me and Don.  Missed Nirel  (CSN) and other favorite people -- some just because they were at other tables, and we left before too late.\n\nWe seemed a small crowd.  Terry quizzed Tara about where she was going to college.  We talked about her 3rd place win in the state in a team she co-founded and co-led to glory.\n\nI've been very privileged to have been a father twice over, plus there's always [that dad vibe](http://worldgame.blogspot.com/2005/06/fathers-day.html).  The orbit through this theater, this hotel, has been a nurturing and satisfying one.  My thanks to Terry and the much larger cast that makes it possible, out to Mentor Graphics and beyond.\n\nWe also talked about DMSO and MSM, both stocked on the health food aisle.  You should not be surprised when close to the Linus Pauling neighborhood that you hear lots of complicated \"molecule talk\" regarding the possible pathways whereby the various ingredients might do their work.  Terry talked about chemical \"chaperons\" in the body, which may accompany complex molecules with a propensity to miss-fold, thanks to some inherited defect, and cause them to fold correctly nevertheless (hence the term \"chaperon\" although \"coach\" and/or \"guardian\" might also gain traction).\n\nAfter this enjoyable night out and some time with other Wanderers (ISEPP's cultish fandom), I retreated to the bat cave to catch up with my work.  Lots of people have an interest in Python these days.  Yes, I help whip that up, not ashamed to say that I do, no siree.  Here's a computer language that can take you places.  Not a waste of time to learn.  Steve, just back from points east, is in the same line of work.\n\nFor followup:  daft punk & IVM (back to designing those religions, Subgenius at work).\n\n[](http://www.flickr.com/photos/17157315@N00/7119846175/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}