{
  "id": "7737021942888552558",
  "title": "Seeking Diversity",
  "published": "2010-09-06T21:32:00.001-07:00",
  "updated": "2010-09-06T21:55:02.750-07:00",
  "content": "One of the threads on math-teach is [back to racial profiling](http://mathforum.org/kb/thread.jspa?threadID=2120346&tstart=0), sorting everyone into a few groups. This gets to seem like a mindless bureaucratic activity sometimes, so one looks for the check box for \"mindless bureaucrat\" on the forms, as that seems the most prevalent species.What I learned from watching international conference organizing, is that some countries do not permit their governments to inquire about their \"race\" or even \"ethnicity\".  There's no broad agreement that central government tabulators have a right to such data, especially in light of how many of these questions are based in corrupt science in the first place.  The concept of race did not survive modern genetics intact, and ethnicity is all about memes in any case, not genes.  So much about Social Darwinism is bogus, and yet continues to haunt public debates, sometimes just beneath the surface, sometimes overtly.The concept of \"breed\" (as in breeds of dog, horse) is a social institution and invention.  Yes, it's possible to breed traits in and out.  However no simple fractions or \"racial substance\" will be found, in either \"mixed\" or \"pure\" form.  No \"racial substance\" was never found in any DNA, and yet the concept persists as a meme virus, as \"something in the blood\".In any case, schools will (and do) practice a kind of alchemy, when it comes to seeking diversity. A public will want to second guess, might be looking for statistics.  Demographics about ethnic makeup, social class (the kinds of statistics people were discussing on math-teach) remain in demand.  What if the school doesn't keep them, doesn't know.  Perhaps the tally is on \"first or native language\".  You wouldn't know how many \"Asians\" were in this tally.  You might be able to piece this bit of information together to your own satisfaction from other records, but the school would not readily support this API and/or way of pigeon-holing people.If it's a school into which one hopes to gain admittance, then you're hoping various traits you may have will not count against you.  You think about your odds.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}