{
  "id": "8100589280496465145",
  "title": "Seven Year Itch (movie review)",
  "published": "2014-12-15T14:53:00.000-08:00",
  "updated": "2014-12-17T16:51:11.979-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhM68B1pLSID7urNH03ZyYwj0suEU7zUmUVknoI7W690b-eRTIXhvSGqOd6-5wiPNWs0LCod64UxLkthU_3FbXQmhR3g2PcW1oattmSVGeSGYJmDjdWdGxz1RaA7r0O7xVgjFFM/s1600/seven_year_itch.jpg)\n\nA friend who especially enjoys older films, with less swoopy computer effects, recommended [this 1955 classic](http://www.imdb.com/title/tt0048605/), directed by Billy Wilder and co-starring [Marilyn Monroe](http://mybizmo.blogspot.com/2006/08/blaming-castro.html).\n\nThe backdrop premise is the married men bid their families adieu in the heat of the summer, this being a privileged class with summer digs.  Yet even the janitor has manged to send his next of kin off Manhattan.\n\nWhich reminds me, the film opens in a light-hearted parody of the annual ritual to set the tone, set 500 years ago, using stock / stereotype Hollywood imagery.\n\nOur anti-hero, Richard Sherman by Tom Ewell, free of his family, and enjoying air conditioning, has an eerie habit you'd think he'd lose, of talking out loud at the top of his voice, committing his thoughts to the air waves (literal air in this case, not the \"air\" waves of radio).\n\nYou'd think a family man of some maturity would not be in the habit of voicing his thoughts like that, a first step down the slippery slope.  No doubt the director chose to ignore the \"inner voice\" option for comic effect, and it works.\n\nProbably the best moments are in the office when our star, having accosted Marilyn Monroe outside the boundaries of fantasy, suffers a paranoid backlash right when [the psychiatrist](http://www.imdb.com/name/nm0393028/) walks in, to talk about the slenderized (sensationalized) version of his book.  This film is it (dry psychoanalysis compressed for mass public consumption), one could say, appropriately slapstick (almost), with Marilyn upholding the \"dumb blond\" stereotype.\n\nThe protagonist is not just afraid his wife will barge in and want a divorce, or that his reputation will be sullied.  He's concerned about his own evident lack of will power and by his wife's infidelity as an echo of his own.\n\nHe makes the mistake of misidentifying fantasy with reality more than once, as the audience is given to know.  As onlookers privy to intimate fantasy, through the \"miracle\" of film, we know our guinea pig gets lost in the maze, not knowing what's real.  We see ourselves in his woes.\n\nOne of the funniest lines is when he defensively asks \"who do you think I've got in there, Marilyn Monroe?\"  The film reaches out to engulf itself here, like an Escher print containing its own canvas.\n\nAs I'm reading some books about the infusion of quantum mechanics through metaphors, I'll say Richard Sherman is a probability wave with fantasies tilting him this way and that, to where he intersects consensus reality in comical ways.\n\nHe's often dizzy with all the self-particle (\"me ball\") spinning he does, a symptom of having an active imagination.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}