{
  "id": "2102531111168275504",
  "title": "Seven Psychopaths (movie review)",
  "published": "2012-11-10T00:04:00.000-08:00",
  "updated": "2012-12-05T21:40:08.503-08:00",
  "content": "The movie opens staring at the Hollywood sign with the dialog starting immediately on the theme of reality versus fiction.  \"This is a fairy tale from the fairy tale makers\" the movie screams (quietly, at its own pace).  We see the screenplay later, neatly photocopied and ready to go.  The writer is walking it to his agent.\n\nIn the context of this dream, therefore, we encounter dream violence.  The scent of self parody and satire is strong.  \"This is what we do in the movies, we show you the blood and gore that we know is already in your imagination, if you're anyone like us.\"  Is this an alternative to violence?  Is showing it, vividly, a way of sucking it out of the real world and projecting it to a safer more contained one?  Could this be construed as a pacifist enterprise?\n\nThe film asks this question of pacifists, waving favorite symbols:  crosses, a Quaker...  Gandhi.  The Quaker is much interested in the Vietnamese psyche, which he imagines as full of vengeance, but then he takes it in another direction, as one of the co-writers of the screenplay.  He goes for an image of self-immolation (a bond).\n\nThe Quaker is also stereotypically in favor of \"mixed breed\" marriage, and as a couple they practice a form of satyagraha or use of inward weapons.  No guns for him.  The lead screenwriter, Irish, also tilts in this direction.\n\nThe theme that everyone in the dream is helping to make the dream, to pull it in the direction of their archetype, is also strong.\n\nGoing to and from Fox Tower (the cinemaplex) on the bus, I was reading Human Smoke, a non-fiction book about the reality and psyche behind World War Two.  The reviewers claim the writer is \"a pacifist\" and is providing a \"pacifist point of view.\"\n\nI'd heard the Quakers have a role in this book, as does Oswald Mosely.  Both are against engaging in this next orgy of outward violence, though maybe for different reasons.  I have more to read, just bought it this evening.\n\nThere's a dog on our street named Mosely.  Animals, dogs mostly (though bunnies too), feature playfully in Seven Psychopaths, riffing off the theme of no animals (as in non-humans) being hurt in the making of this film -- but then the humans are shown doing each other in with extreme cold bloodedness.  The murders are highly pre-meditated, planned, plotted, calculated, choreographed -- as if in a screenplay.\n\nThe characters wonder about an after-life, yet this becomes funny too, as they're already as if dead (killed) so many times, just not remembering clearly, the gift of time being at least a partial erasure.  They're already in an after-life, much like the ones before and to come.  Demons in hell have their own kind of immortality.  Karma is simply the conservation of momentum.\n\nI've also been reading [Blacksad the comic](http://worldgame.blogspot.com/2012/11/a-bright-november-day.html) (graphic novel, film noire) all animal characters, and dealing with themes of racism and white supremacy, the Cold War and rabid hatreds.  More fiction, more depictions of violence, more telling stories that elucidate, as well as entertain.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}