{
  "id": "8650670645446286115",
  "title": "Sharing the Gospel",
  "published": "2017-01-09T21:27:00.001-08:00",
  "updated": "2017-01-13T16:41:06.260-08:00",
  "content": ":: stories of Finland ::\n\nGiven news stories need to be brief on prime time TV, we have to expect homework through other channels, say History Channel or, more likely, Youtube. No that isn't me in the video.\n\nCase in point:  Portland Public Schools pays close attention to Finland's public education system for good reasons.\n\nWe get it WDC doesn't care about the same things we do, different priorities and ventures.\n\nThey're into financial values over there, vouchers, paying off balances due. That's an important aspect of doing God's work, certainly. Thinking purely in terms of money has its limits though.\n\nI'm in touch with public school teachers quite a bit, thanks to the Measure 97 campaign, which didn't succeed in passing.\n\nWe did get #CodeCastle to off the ground to some degree.  I've turned more towards MIT Scratch for my memes.\n\nTrue, we have no budget for that microwave tower, replacing or in addition to the cross, facing @OMSI.  That's fine.  Plan B is in effect instead.  Teacher trainings in the Roost?  Not happening, to my knowledge.  We had to shelve our Plan A.\n\nThose caring about Washington DC and its new Orange Party rules (corporate media still using the color Red for some reason, misunderstanding GOP did not survive Election Day #singularity), will obviously seem more up to date than little moi.\n\nGiven my job description, I can't afford to get sucked in to domestic / nationalist politics at every turn.  I'll check back in a few years on that #WallwithMexico campaign, how that all went.\n\nJust kidding, that's a fun one.\n\nMedia is slow to reflect that Orange is not Red. GOP as we remember it did not survive Election Day singularity. Orange Party rules now. [https://t.co/iTYECDEch8](https://t.co/iTYECDEch8)\n— Kirby Urner (@4DsolutionsPDX) [January 10, 2017](https://twitter.com/4DsolutionsPDX/status/818675916960210944)\n\nSee Michael Moore anthropology for why Finland is our model. Linux made Silicon Forest as strong as Silicon Valley if not Redmond right?\n— Kirby Urner (@4DsolutionsPDX) [January 10, 2017](https://twitter.com/4DsolutionsPDX/status/818668602517688320)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}