{
  "id": "6783600751201432503",
  "title": "Silicon Forest Curriculum",
  "published": "2017-03-28T21:25:00.002-07:00",
  "updated": "2017-03-30T11:19:02.917-07:00",
  "content": "I like to boast about regional differences, in the sense that Cascadia, home to the Silicon Forest, is pioneering a more useful STEAM curriculum than you'll find in most parts of the world, including in the UK, which sets the pace for many US east coasters, in the form of standardized testing.\n\nBut does this regional curriculum actually exist and [what does it look like](https://www.facebook.com/thekirbster/posts/10155108556688965)?  Simply to remain true to its roots, it'll need to focus on \"chips\" meaning logic gates, [boolean algebra](http://worldgame.blogspot.com/2017/03/unicode-anyone.html), ALUs, CPUs, GPUs and all that. Plus 'learning to code' will be integral with learning mathematics.\n\nThe above MIT Scratch application, very simple, suggests how we bridge lexical and graphical.  The coding environment itself is a mix of lexical and graphical elements, with the language defined in terms of \"blocks\" looking like jigsaw puzzle pieces.\n\nBy taking the XY and XYZ Cartesian apparatus of, building on what we learned earlier with figurate and polyhedral numbers ala The Book of Numbers (Conway & Guy) and Gnomon (Gazale), we bridge from mathematics to architecture and visualizations more generally. \n\nMere calculators won't get us there. We need real computers to learn our maths.\n\nWe need to embrace 3D printing and CAD skills, and what used to be called \"mechanical drawing\" (making blueprints).\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh_JRZSaF-_cqmDVcK5dG0ciyGfYf7CAT4ZFg1HhkputqS_nEZVcRwX70C8HZlQSP5IxvK3me0zG9k1qw3L3MHj4vAR4rinlxjcizzJzFk0VDzROZgOtYHabnsHlixDZgHeXUKh/s1600/smodule_syn.gif)\n\n[Fig. 988.13C](http://www.rwgrayprojects.com/synergetics/s09/figs/f8813c.html) S Quanta Module\n\nFor example, tetrahedron EFGH above is called an S-module and 24 of them applied to the faces of the internal icosahedron, build this octahedron of 4 tetravolumes.\n\nStarting with a smaller cuboctahedron of volume 2.5 and applying [the S-factor](https://www.facebook.com/permalink.php?story_fbid=284575858390621&id=220826461432228) twice, we get this icosahedron's volume. \n\nSubtracting this icosahedron's volume from 4, and dividing the difference by 24, gives the S-module's tetravolume of (ø^-5)/2.\n\nThat's right, unlike the east coast curriculum, the Silicon Forest is friendly to the Bucky stuff. \n\n[](https://www.flickr.com/photos/kirbyurner/33584991132/)\n\nMIT was somewhat friendly, at least [when Dr. Loeb was alive](https://flic.kr/p/SYP8xa), but Boston's public schools recently chose to go from the Mercator to the Peters Projection, without mentioning [Fuller's](http://grunch.net/synergetics/map/dymax.html). \n\nMaybe New England no longer appreciates American Transcendentalism (Fuller being the grandnephew of Margaret Fuller, early editor of Dial), but we do.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}