{
  "id": "2245217580663902995",
  "title": "Simulators",
  "published": "2023-10-17T19:33:00.004-07:00",
  "updated": "2023-10-17T19:33:58.584-07:00",
  "content": "We all know about simulators from Microsoft’s Flight Simulator, and maybe from Sims and SimCity if we have broader experience with the genre. \n\nIn these blogs, I’ve tended to harp on truck driving simulators, owing to the Trucker Exchange program I introduce under the heading of citizen diplomacy. However, these days I’m exposed to farm life more, and tonight after dinner, the conversation turned to Farm Simulator software. Lots of people play FarmVille and its many variants.\n\nThat’s what some will call the game pods then, those “more than just cubicles” we’re using for School of Tomorrow centers, multi-generational, co-ed, mono-generational, single sex i.e. they come in many shapes and sizes. \n\nSome feature dormitories, which in military terms might be barracks. \n\nI’m hoping, in my simulations, to give people more privacy than mere barracks provide. Bucky Fuller was into that to (providing privacy, protection). But then pods aren’t the same as dorms. You could have a pod in your private dorm, or your pod could be on a floor or a concourse somewhere.\n\nWhat “game pods” am I talking about?  These go back to my mixed use campus buildings, with dorms, cafeterias, gyms, and game floors. Simulators. You’re learning about your world through simulations designed to teach about infrastructure, institutions, chemistry, other natural phenomena. \n\nHere is where all that “gamification” comes in, in tandem with the Coffee Shops Network idea of raising funds through game heroics. Score high and benefit your causes. \n\nWe’ve been working in this world for awhile now, if you see through the right lenses. I’m just taking stock and helping to organize what’s already in inventory.\n\nI’m not saying we always postpone venturing into the field and actually doing the farm work that needs doing. I did some today in fact. \n\nThis particular farm is about making long term investments in the ecosystem, friendly to wild species, whether or not those life forms literally pay the bills. Conservation does not mean demanding tuition from those given sanctuary.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}