{
  "id": "1453748872893412479",
  "title": "Skin Color",
  "published": "2017-08-15T19:43:00.003-07:00",
  "updated": "2017-09-05T15:55:06.574-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/36621251195/in/dateposted-public/)\n\nWhen I was little, I'd hear my maternal grandmother sometimes refer to \"colored people\" which to her ears was not a slur.  America, in those days, consisted of \"whites\" and \"coloreds\".\n\nHowever my generation was already being schooled that \"colored people\" was not acceptable.  \"Skin colored\" in [a box of crayons](http://www.thehindu.com/news/national/student-sues-company-over-racist-crayon/article4792263.ece) was also biased, obviously, because off-pink (not white really) is only the color of a sampling.  Lots of skin colors out there.  That much, at least, is clear.\n\nWhat's not clear is whether \"white\" is really not a color, given few people are actually that.  Off-white is a paint color, a whole variety of them.  Singling out \"white\" as a one non-color seems a similar form of discrimination.\n\nIf \"people of color\" (POC) is OK to say, is it OK if off-whites and even true albinos, be considered people of color as well?  That would seem the more uniform basket we're looking for, where any skin tone has its associated RGB value.\n\nA problem though, is we use appearances for a kind of code, as in dress code, but also as in \"code of veiled meanings\".  Choice of font might be part of a code, or a flag, or other symbol.\n\nPerhaps the better word is \"brand\" as in \"look and feel\".\n\nLike when we go to high school or later college, we might have these various stereotypes, these templates, that people follow, more or less consciously.  Out of such raw material, identities get carved and tested, torn down and recast.\n\nIs obsession with nuanced codes the way we operate as egos?\n\nA lot of meanings can't or won't survive a bright light, but as implication and innuendo, they have a shadowy persistence.\n\nThe need to have or be a \"personality\" might have a lot to do with our color coding.  We get to play roles then, even pick up the mantle of this or that group and become as though mouthpieces of historical lineages, simply on the basis of a few genes in charge of skin, melanin content etc.  \n\nAs we grow older, and closer to death, some of us become the disembodied voices of these imagined \"races\" or \"ethnic groups\".  We might get our DNA tested, and build an identity based on what Ancestry.com has to say.\n\nLots of theories and superstitions, or call them \"day dreams\" help the ego glue it all together.  Everyone needs to be somebody, right?  Why not start with skin color, daft as that may sound?\n\nMight there be a way to champion humans, or even more than that, humanity itself?\n\nWe have this word humane, and use it with respect to [other animals](http://mybizmo.blogspot.com/2006/01/recruiting-new-wanderer.html).  In what ways might we train to be humane?  Would we need to identify as a person of any specific color to be humane?\n\nPerhaps these code languages, not of our own choosing, nor making, could be left by the roadside?  I'm tempted to disrupt them.  I frequently question the reality of \"races\" and the relevance of DNA to one's mental makeup.  The power of stereotypes, templates, role models is real though.  I admit [there's theater](http://worldgame.blogspot.com/2017/05/telerama.html). \n\nI suppose if [your daydream](http://worldgame.blogspot.com/2017/08/consciousness.html) is working well for you, adding insights and happiness, productivity, then it might be worth keeping.  I've been inventive regarding my own persona, crafting some [specific guy](http://mybizmo.blogspot.com/2011/09/my-character.html).  Realizing one's ability to be inventive is perhaps the most one might hope for.  Doesn't \"human\" mean \"made from clay\"?  I read that somewhere.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}