{
  "id": "1715734739600910935",
  "title": "Slavery Today",
  "published": "2009-12-05T00:25:00.000-08:00",
  "updated": "2009-12-05T00:42:38.379-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg-W5YjWyDk-M8fcwynOP-X9Lk8NXWWjth6I9xA66RXZzWrs5Jnd64pr25V6eQuNTbQnOdBuDOX9Sbh4hJbgfBPUlywN4IIzD4VDNzDvYsNwC2_o8hmy3s4cEWYZRSzLCyLzzLD/s1600-h/slavery_stop_loss.png)The \"stop loss = slavery\" campaign categorizes this \"[hidden draft](http://usmilitary.about.com/b/2008/05/05/army-stop-loss-could-end-in-2009.htm)\" with other efforts at rebranding the slave trade as something else.\"[Human trafficking](http://mybizmo.blogspot.com/2009/11/transactions.html)\" is not so much a euphemism as a way of alerting readers to true states of affairs in this world.  So call me a logical positivist for working at telling the truth?Wittgenstein was a Vienna Circle celebrity in his day and I'm [on record](http://groups.yahoo.com/group/WittrsAMR/message/922) as a Wittgenstein commentator [since my Princeton days](http://mybizmo.blogspot.com/2008/02/philosophy-101.html).  We weren't trained to see him as a logical positivist though, not even during the Tractatus chapter -- that's considered the more uninformed view in my somewhat snobbish clique.Quakers have a long history of fighting slavery via their underground railroad.  When policymakers had exhausted their options in Vietnam, [a lot of draftees went AWOL](http://worldgame.blogspot.com/2009/10/sir-no-sir-movie-review.html), effectively ending the draft.This wasn't supposed to matter so much though, as [the new Pentagon](http://mybizmo.blogspot.com/2006/08/mathcasting-about-phi.html) wasn't gonna need the big numbers like in the bad old dino days.  New levels of precision and effectiveness had been attained.  \"Lean and mean\" were the new watch words.Fortunate is the nation that might afford to be choosy.The current crop of pretenders doesn't have that luxury though.  Certifiably ill people get returned to active duty.  Those low on the totem pole have their stays extended to perform duties too expensive for the more elite mercenary troops.[Outsourcing the war](http://worldgame.blogspot.com/2004/11/pentagon-public-or-private.html) to private industry to line a few pockets, while forcing Americans into servitude, is hardly a way to win hearts and minds overseas, nor domestically either.People don't really envy Americans these days, given their [obviously oppressed](http://www.freedomcenter.org/slavery-today/) status.  Helping Americans throw off their [tyrant taskmasters](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html) is more the name of the game these days.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}