{
  "id": "5620263599474897211",
  "title": "Slutwalk 2014",
  "published": "2014-09-17T16:01:00.001-07:00",
  "updated": "2023-08-23T11:00:20.234-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157647727667125)\n\nThis crowd was on the cerebral side, regardless of dress.\n\nThe speeches were pitched to a high level and I overheard someone way a lot of St. Mary's students were in the crowd, a premier Catholic school not unlike St. Dominic Academy where I taught math and sundry subjects in the early 1980s.\n\nThe protestors were basically advocating for [Second Life rules](http://mybizmo.blogspot.com/2009/07/2nd-life-2nd-world.html) in First Life insofar as [avatar](http://mybizmo.blogspot.com/2009/12/avatar-movie-review.html) presentation goes.  Dress or don't dress your avatar however you like:  nothing about your dress code implies consent and/or a willingness to provide favors, sexual or otherwise.\n\nThe [Code of Conduct](http://mybizmo.blogspot.com/2009/06/speakers-lounge.html) around Portland State University and other places is clear:  women, and men, can dress how they like within whatever boundaries the courts would uphold (e.g. going stark naked is still not accepted public \"attire\" except in designated areas), and no aspect of one's costume or dress should be considered \"an invitation\" as in \"but she dressed like a slut, your honor\".\n\nUnderstood?\n\nPut in other terms, guys have no right to behave like dicks no matter how women dress or undress themselves.  \"Consent mode\" and \"dress code\" are two different concepts.  Don't confuse them.\n\nGet it yet?\n\nSome in the crowd were professional dancers who considered their performance art very far from an invitation to random others to assume anything about their willingness to have any specific type of relationship.  Portland has a lot of strip clubs.  These are supposed to enforce a professional code that keeps the dancers safe from non-consensual intimacy.\n\nThe main speech maker declaimed sorrow at even needing to hold such an event / protest as the rights being asserted should simply go without saying.  To have to fight for the right to never have non-consensual sex:  why again is that even up for debate?\n\nGiven the Code of Conduct is clear, I'm not for a moment saying it's necessarily a simple matter to resolve every dispute wherein an aggrieved party alleges non-consent after the fact.  Many a soap opera has featured a betrayal wherein an innocent party becomes the target of a criminal accusation, for whatever motive (revenge, blackmail etc.), or wherein a perpetrator protests innocence by alleging such a motive on the part of the aggrieved.\n\nSoap operas sometimes make matters easy for the audience as there's often a \"fly on the wall\" point of view (the camera) giving the inside story.  Usually a jury of one's peers, or the court of public opinion, as the case may be, will not have the luxury of such a viewpoint.\n\nThat's where the police and detective shows come in, along with the lawyer shows.  Our TV channels are awash in such stuff.  At St. Dominic Academy, they almost all watched General Hospital.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}