{
  "id": "8274346814740577",
  "title": "Small Talk",
  "published": "2008-09-04T17:54:00.000-07:00",
  "updated": "2008-09-04T19:33:11.860-07:00",
  "content": "We celebrated Tara's first day of high school by dining out at one of the excellent Mongolian grills in Greater Portland, but only after catching all of Alaska governor Palin's speech from the RNC podium, having caught big portions of the DNC show earlier.  She's taking journalism this year, plus [American history](http://worldgame.blogspot.com/2007/10/letter-to-terry-wanderers-business.html) is interesting these days, who can deny it?As a planner of an upcoming conference, I'm slated to join in a site check this weekend, even though this is a familiar venue, on the way to Mt. Hood.  I'm playing with the idea of heading on [over the mountain](http://mybizmo.blogspot.com/2007/11/road-trip.html), but the fantasy is too vague to call \"a plan\" at this point.  I often entertain such mirage-like possibilities, and sure enough, some of them become reality (isn't that special -- as in [special case](http://controlroom.blogspot.com/2007/12/management-by-rotation.html)).I was talking to a small business owner this morning, about what's good and bad about Portland.  You find a lot of young people flocking here, in search of opportunity, but sometimes psychologically unprepared for how dark it gets, how much rain. I know [Dawn](http://controlroom.blogspot.com/2007/12/trip-prep.html) was that way, coming in summer, [from Florida](http://mybizmo.blogspot.com/2005/12/on-mountain.html), running smack into that wall of a winter. Some swear by full spectrum lighting (check Ikea?), others take flight for sunnier climes, some grin and bear it, and some of us actually enjoy it (no kidding).  Anyway, she's working hard to make it work, feels weary a lot, is supporting a child.  I like her fun crew though, they generate a warm atmosphere.[Derek](http://worldgame.blogspot.com/2007/07/family-guy.html) is swinging by, just having a chat.  We're blabbing about slack, as in cutting oneself some, something we're good at in the Church of Bob ([Subgenius](http://worldgame.blogspot.com/2007/08/transactions.html)).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}