{
  "id": "5247353992617054953",
  "title": "Smiley Guy",
  "published": "2008-11-04T12:08:00.000-08:00",
  "updated": "2016-01-23T20:24:32.470-08:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/3002628701/)\n\nphoto by [Jody Francis](http://worldgame.blogspot.com/2008/09/portrait-of-artist.html)\nowner, [Fine Grind](http://www.yelp.com/biz/the-fine-grind-cafe-and-espresso-portland)\n(framed face by [FSphotographers](http://fsweddings.com/blog/?page_id=2))\n\nThe story on [the martian character](http://www.youtube.com/watch?v=Cwxc_zLH560) tie comes from my [International School days](http://mybizmo.blogspot.com/2008/08/lookin-good.html), when a local high powered exec decided he'd like a photo op, of him supporting some Model UN, good news in the papers.\n\nNon-obvious in this picture:  my NATO surplus winter trousers, part of [my Santa Fe look](http://mybizmo.blogspot.com/2006/12/action-figure.html).\n\nSo we're sitting around the library, a bunch of us cliquey high schoolers yakking up a storm, brainstorming whom to send from each country (he's requested a multi-national cast), when Josh Hoyt -- his dad this cool cultural attache with the embassy -- says \"let's send Kirby, he's from Mars\" (laughter).  That seemed to stick, and he (I) was \"the Martian\" from then on.\n\nBut there's more to this story.\n\nOnce we bussed to the venue, a big auditorium with a UN-like vibe, they sat us down for a photo op, me behind the USA flag with my team (Stuart Min?), incognito in my true role as ET.\n\nWe went around by the script, making pretty speeches, until we got [to me](http://mathforum.org/kb/message.jspa?messageID=9371133).\n\n\"Hey\" said I, \"we're all friends back in high school, not divided, not conquered, by this nation-state concept, let's unite [without the flags](http://www.flickr.com/photos/17157315@N00/2995889787/)!\" (paraphrasing).\n\nInstead of banging my shoe, I laid the flag to one side, suggesting others do the same, which they did, quite willingly I might add -- a victory for school spirit!\n\nBut there's more, getting hazy at this point, my moment of glory having passed...\n\nWe must have gone ahead with that photo op right?  I mean, this high powered exec wasn't about to get gypped (railroaded) out of his positive press coverage by the likes of \"lonesome cowboy\" here, the show must go on.\n\nStill, I thought we had a some real fun in the sun that day.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi5-zOKORa-zM_H2Et0v0USG5w-mw8tXD9-Holxq4SZFNCk-aL4WzZDOvcU-9wElxMt-StKHdJRWxEu-XY6utPR78HvbqQLRC2jFwaHnXhe53DlnK3cOvxR4oUc8SDAs0ltMRiU/s1600-h/electionday2008_res.png)vote!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}