{
  "id": "4041040038008713414",
  "title": "Smoking Gun?",
  "published": "2016-03-01T18:27:00.000-08:00",
  "updated": "2016-03-01T18:38:46.664-08:00",
  "content": "So what about taking the show on the road in a Bizmo (business mobile) and sending a heads up to the hinterlands that \"[code school](http://worldgame.blogspot.com/2016/02/martial-arts-schools-coding-dojos.html)\" might be an option.  Consider a future in IT (part of STEM [or STEAM](http://mybizmo.blogspot.com/2015/02/thirsters-2015226.html)).\n\nI was ready to start with recruiting a couple decades ago at least, and started sharing my designs.   Later I started articulating the vision in my on-line journals (blogs), getting it out there.\n\nA Control Room, or Dispatching Center, would keep the Bizmos busy.  Sounds like fun. \n\nOn the road with Global Data (or Global Matrix as the case may be).\n\nHowever, the GNU Math meme (a pun on \"new math\") was also deeply tied to those stream-linings in spatial geometry, where we get all those pretty [whole number volumes](http://mybizmo.blogspot.com/2007/12/more-makeover.html) and a quantum leap in sophistication, in terms of being able to think geospatially, with more than just XYZ as a scaffolding (matrix). \n\nWe had the IVM (another matrix), we had Quadrays (different basis vectors). \n\nEverything [was published](http://worldgame.blogspot.com/2014/10/recent-lesson-plans.html), in color, with animations, including to [Wikipedia](https://en.wikipedia.org/wiki/Quadray_coordinates) and [Wikieducator](http://wikieducator.org/Digital_Math).\n\nSources were cited, proofs were made. \n\nEven H.S.M. Coxeter, King of Infinite Space, said the sphere packing formula as worth crowing about.  We did [some crowing](http://mybizmo.blogspot.com/2016/02/notes-from-hyperspace.html).\n\nWe've seen almost no interest, however, in any of the above.   Search the web, check if I'm right.  No need to take my word for it.  My fellow humans have other priorities, no time for follow-through.\n\nI shared about Quadrays with PSU's Math Learning Center (MLC). \n\nI delivered talks on the concentric hierarchy to any math class that'd let me in (quite a few did), as well as at Pycons, Europythons etc.\n\nBut all this flint clicking failed to start a fire apparently.  How soggy was the fuel?\n\nLets hope some future student of our time, maybe in a hundred years, comes up with some theories, as to why a promising future was disowned and disavowed. \n\nI bet there's some story to unearth, maybe even a \"smoking gun\".",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}