{
  "id": "6355618026453967077",
  "title": "Soap Operas",
  "published": "2022-11-14T13:41:00.008-08:00",
  "updated": "2022-11-15T09:22:45.643-08:00",
  "content": "I just got off the phone with Maureen of Lake Oswego, having gotten all melodramatic, getting stentorian, while telling her melodrama was not my style, enough with the goodies and baddies already!  My impatience comes in waves, as I think is true with many of us, nor am I saying impatience is always a bad thing, on the contrary.\n\nSpeaking of soap operas, Don Wardwell was by today, in the wake of Glenn's stuff reshuffling in an orderly fashion (hi Barbara), and he told me the story of a guy he knew who was hoping to get a friend of his to move in with him.  He'd stormed out of the Pauling House when Don suggested his desire to discuss this move publicly might be inappropriate.  That guy was supposedly me.  You say she'd been a Jehovah's Witness, that I was smitten somehow?\n\nOne reason I doubt the story is it so closely matches what actually did happen:  at the height of my Food Not Bombs activity, around Occupy, I shared my house with three women (how I think of them, fairly), all of whom I still know and keep track of.  They're blog characters, you can go back and look.  We were in synergy in some ways, and no, it wasn't a harem situation, gosh darn.  More Charlie's Angels?  We're talking soaps after all.\n\nAnyway, I'll go back and check the timeline.  A don't doubt this new angel actually existed, I just don't remember Glenn talking me out of it, or the Pauling House episode (back to Don's recollection).  Apparently my erratic behavior had no consequences this time, as no such creature moved in.\n\nHere's what I think:  especially older people, but really young people too, are prone to develop \"like I was there\" memories, vivid, sharp, of contrary-to-fact scenarios.  Day care centers get shut down over this kind of stuff, and probably nursing homes too for that matter (I'm in neither business).\n\nSorry everyone, if I'm the one turning into a leaky bucket, letting important memories fade away.  I pride myself on having a good memory, as Suzanne might remember.  These blogs (Quaker journals) help a lot.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}