{
  "id": "8339027493420672020",
  "title": "Soap Opera Summary (satire)",
  "published": "2024-09-12T05:33:00.000-07:00",
  "updated": "2024-09-12T06:47:10.602-07:00",
  "content": "The news says NATO is about to give itself permission to amp up its invasion of the Russian homeland. The idea is to keep Ukraine out of NATO on technicalities but “for all intents and purposes” to use it as a military base, as had been happening under President Blinken and Vice President Nuland for some time now. \n\nWait, did I get the narrative wrong? Anyway, it’s time for NATO to get the show on the road.\n\nBack in knee jerk legacy media land, there’s probably some sense that people are following the action and are ready to jump into their roles as nationalist loyalist troopers, happy to march march march like the old people tell ‘em is necessary. \n\nThe NATO geezers expect the allegiance of a younger generation not necessarily cut out to play hero in such a tawdry low class drama. Who wants to die for the knuckle draggers? “Why let those dinos live through me?” your average coder is thinking. “They don’t even know Python, most of ‘em (OK, Ada maybe).”\n\nI can’t think of anything more uncool than living in Virginia with parents slaved to Beltway Mafia politics. What an ugly childhood for so many. Shades of Laurel Canyon right? It’s the kids of privilege, like Washington and Jefferson, who are more likely to rebel against the parent company (East India in their case). The Doors.\n\nThe frenzied media, MSNBC especially, need to do way more to whip up Russophobia (aka dementia russogenica). Rachel Maddow, help us out here. The needle hasn’t really budged in a while, as attention turns to the “states are no solution” drama in the so-called “Middle East” (snicker). Is it time for another novychok bedtime story? What airplane is parked next to what airplane?\n\nPresident Blinken needs to deliver some great oratory, before people forget the plot again. Help us remember how democracy is at stake. Tell us how authoritarians will never get a toehold in the USA at least. These people are just not psychologically ready yet. Not for Mafia brand theater. More snake oil kool-aid is needed. Pass the numbskull sauce.\n\nLet me help y’all out. Um.. um.. “My fellow Americans…”. Something like that. And knock it off with the Zionista thing, that’s too radical for our middle of the roaders (pet lovers, cat ladies) by several orders of magnitude. No one thinks that’s cool anymore. Let the Brits take over that whole show. You know, the guys who started it. Lawrence of Arabia and all that.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}