{
  "id": "1274521382308380635",
  "title": "Social Darwinism",
  "published": "2022-09-02T08:50:00.000-07:00",
  "updated": "2022-09-07T07:47:02.383-07:00",
  "content": "My impression is the meme of \"races\" (how many again?) is a top drawer tool for recruiters working to swell the ranks of the Social Darwinists.  \n\nOne may be a fan of Darwin and his theorizing, without switching into \"genetic Calvinism\" i.e. some doctrine of preordained \"fitness\" based in having the better DNA.  That ideology worked well for Royals too, as it perpetuated the myth of \"blood\" i.e. some coveted genetic plasma, divinely conferring special rights and special powers.\n\nThe race theory depends heavily on their being a \"mixed race\" category.  People must be allowed to fall through the cracks so to speak.  Without cracks, the categorization system would be too brittle and break down.  One's racial makeup is allowed to be \"fuzzy\" and the prospect of entirely new races emerging is not actively contemplated in most racist science fiction (\"super race\" mythologies usually revolve around refining some prior race, even while pushing for its \"world dominance\" or \"supremacy\").\n\nWere a race detectable in pure form, even in a mixed race person (thinking of superstitions around blood again, and powers-of-2 subdivision e.g. 1/32nd race X), we would have found it by now, but there's no reduction of \"race\" to canonical strings of chromosomal encoding.  \n\nRather, we find ourselves defining \"ancestry\" which relates to \"geography\" based on the presence (or absence) of \"genetic markers\".  Tracing a family tree means following world lines against the backdrop of Planet Earth, with its partially overlapping scenarios.\n\nAnimal husbandry has the same degree of precision (imprecision).  In animal husbandry, one speaks of breeds, which one may consciously design and refine over the generations.  \n\nA Darwinist is able to see \"breeds\" within in the human family in that sense, a kind of family resemblance, but maybe through several filters, as there's no universal agreement on what any of these breeds really are.  We just know we keep re-encountering the same types.  Supermodels?  Midgets?  Midget supermodels?\n\nMen and women create this first idea of a divide, orthogonal to Darwinistic evolution through speciation.  \n\nHomo Sapien is the current species, a Cro-Magnon with some Neanderthal mixed in.\n\nAn alternative view is of a very expressive human genome, able to manifest features in various ways, without distilling into an essential palette of racial archetypes.  We don't need to discern \"races\" as the compass points for categorization, even if we're tracking ancestry.  The ideology of racial purity and of a genetic competition amongst genetic \"teams\" (the races) is a layer of dogma that doesn't logically follow from biology.  It's more an extended metaphor, with memes replacing genes in ways that pander to a sense of tribe and belonging.  We like to rally around genetic features sometimes, e.g. a convention for gingers.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}