{
  "id": "6806551778443456460",
  "title": "Some Psycho Analysis",
  "published": "2022-12-24T23:10:00.007-08:00",
  "updated": "2023-01-30T22:00:37.812-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh2oDODJm9xRthRrBeYzxf5kCarNPvf3zVY8v9DoQENpZMkmO4ODUNXVjCwXNfONuZcZix--RO-OYoQBiwKcIU6g3h7IOMmeng0KKr2omvZnNacI1t6kWZETPa7ttF7H3Ga2VSxDTXjoJup_zXNeVbNR9CYfrTvvwQahwZEpGGFoZk6rtEpOA/s584/dump_nato.jpg)\n\nI\n don't see \"the USA\" as fighting Russia so much as an arrogant \nself-aggrandizing group we call neocons, which rose to power under \nReagan during the Contra War against Nicaragua, and sees itself as being\n in charge.  Many Americans have no beef with the \nRussians and are in fact of Russian heritage.  Washington DC may see \nitself as representing \"the USA\" but some of us just see a silly City of Morons (one of my blog posts).  Clearly I have my own deviant rhetoric.\n\nI\n also tend to shy away from historical accounts that make \"nations\" the \nprincipal actors.  I don't have any great belief in nations except as \nideological / psychological constructs we use to organize our human \naffairs, akin to a corporation or religious bodies\n / institutions. \n\nThe English language allows us to construct stories \nwherein Europe does this and London does that and Nicaragua does \nsomething else.  I know how to talk this way too, and do (when in \nRome...), but under the hood I'm a skeptic.  Only humans have agency.  \nThese inanimate actors are at best a kind of journalistic shorthand.  \n\nA\n faction of Ukrainian ideology wants \"Ukraine for Ukrainians\" and has a very definite idea of what that means.  Ethnic Russians fall \noutside the definition.  It's like if we had a faction here saying \"real\n USAers\" have to be white and of European heritage,\n anyone else is tolerated but is not as real. \n\nGiven my upbringing as a \nliberal, I was taught that \"ethnic uniformity\" was a primitive older \nidea of \"a nation\" that had been superseded by the modern conception, \none which accommodates a mix of cultures and religions and doesn't put \nany one of them in charge.  I call that \"secularism\". \n\nSecular nations \n(which accommodate religions) are the ones I'm snobby about and think \nmore highly of.  \"Ukraine for Ukrainians\" sounds old fashioned and \nimmature to my ears.  I'm sorry this faction has gained an upper hand in\n Ukrainian politics and that they have their proud boy types to enforce \ntheir racist views.\n\nTranslating\n to Americanese I might say that in my view 2014 was a January 6 moment, \nexcept the Trumpies won, the ultra nationalist Bandero Ukraine for \nUkrainian proud boy types forcefully took charge.  The decent \nUkrainians, especially out east, were shocked by \nthis violent uprising and wanted out of this nascent nation-gone-bad.  \nRussia is blue, fighting Maga Reds in Kiev.  NATO is fascist to the \ncore, we know from what it did to Libya, where my family worked for six \nyears.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}