{
  "id": "4322012207137629755",
  "title": "Speaking of Memes...",
  "published": "2015-12-03T14:26:00.001-08:00",
  "updated": "2015-12-15T05:07:16.725-08:00",
  "content": "I've not yet tackled the Richard Dawkins corpus but understand he's the source of the \"meme\" meme (i.e. the meme \"meme\"), though for him, twaz / is the \"gene\" that is selfish, i.e. our DNA may be cast as \"prime mover\" in some way Aristotle might understand.\n\nI'm really grateful for the \"meme\" meme, and do think that \"meme\" itself is quintessential, in showing off its power as a meme, even in defining what a meme is.  Like GNU, the \"meme\" meme is recursive (self referential).  I acknowledge \"memetics\" as a legitimate area for study and so on.\n\nI do want to make the case for \"selfish memes\" with a reminder of the Standard est Training, in which the Mind was the ultimate in Selfish, masking Being (authentic self).  Yeah, I know, sounds like a pile of Heidegger.  But the point was well made:  ideologies will throw people to the fire in droves, as it's precisely the DNA we're willing to sacrifice, so long as our core meme set or \"way of life\" lives on (continues to make sense to us).\n\nSwitching gears to a Quaker story, our founder George Fox is famous for answering, when asked why he didn't carry a sword (or handgun), that \"you can't kill the Devil\" with such a primitive outward physical device.  What he was saying is the physically animated body in front of him, the human being in corporeal form, was never the enemy.  The fight is with something maybe she or he saw on TV.  Why go around slaying couch potatoes, or the ones acting out?  These \"meat puppets\" of the various \"meme-plexes\" (ideologies) need some countering intelligence, whereas martyrs to memes help spread them more widely.\n\nLet's talk about \"psychological warfare\".  Immediately we think of people in camo (OK, maybe only some of us do), but lets admit it sounds a lot more military than civilian.  But who gets us hooked on cigarettes and other killer substances we know are bad for us?  They look more like cartoons and clowns don't they?  The \"Mad Men\" of Madison Avenue, the legendary birthplace of \"spin doctors\" in the world of advertising, are for the most part not paid as military officers.  Yet isn't suggesting you inhale what will kill you just a tad bit like chemical warfare, just a little?  Psychology is certainly involved.\n\nAgain, it's hard to see how our DNA benefits from smoking cigarettes, whereas it's easy to see how selling these things turns a pretty penny.  Having the advantage of legality is always worth having.  As a citizen of the State of Oregon, [rolling back Prohibition](http://worldgame.blogspot.com/2015/12/touring-home.html) has been on our agenda too.  Although not big on cigs, I imbibe spirits.  A lot of these memes have had their way with me and my DNA.\n\nSo that's how I'd preamble my question for Dr. Dawkins:  why \"selfish gene\" and not \"meme\".  Just asking.  He may have answered this very question a million times.  There may be a FAQ about it.  Forgive me for thinking out loud and [advertising my ignorance](http://www.imdb.com/title/tt1285016/) in that case.  Inquiring minds want to know.\n\nBefore I sign off, I want to circle \"Open Source\" as a meme that I care about, and yes I'm all for keeping the discussion alive about \"Free\" and what that means.  It doesn't \"get old\", not that fast.  New generations have come on the scene.  [Revolution OS](http://www.imdb.com/title/tt0308808/) is worth seeing.  I'd screen at least excerpts of that in my Saturday Academy classes.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}