{
  "id": "5881795421631380192",
  "title": "Speculative Prehistory: the Naga Story",
  "published": "2025-02-19T06:28:00.000-08:00",
  "updated": "2025-02-25T12:06:36.364-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/54337782321/in/dateposted/)\n\nI understand how a reader might pick up Critical Path and experience some disillusionment upon encountering the Naga Story. Even if the Genesis Story has little basis in science, perhaps with the exception of the flood (talking about the Black Sea filling up suddenly), how are we to take a migration story that begins in the South Pacific and comes westward to Europe and beyond? Why replace one incredible story with another one?\n\nA lot depends on how we define “humanity” as one could say we’re still on a Planet of the Apes with simple reclassification. The “homo” branch of the ape family exemplifies tool use, and we already have ape and monkey branches that don’t and/or can’t interbreed, so let’s make the so-called sapiens more of those, another breed of ape, why not? It seems like a demotion of sorts as we're saying \"humanity is yet to come\".\n\nThen comes the paradisiacal Eden-like experience of growing up in Polynesia, with just the right mix of stimuli, and at last, true humanity is upon the scene. A new ideal is achieved. Where this new spirit comes from is only tunable metaphorically: from the stars, as a transmission. That's in keeping with intelligence being metaphysical (weightless).\n\nThis humanity is spread by both land- and sea-based branching vectors, and provides actual human (pueblo) status to the sapien branch of the apes. We get the rice paddy economies following river beds towards higher mountains. We get the discovering of metals and their alloys. We get our planetary species civilization, spreading from Southeast Asia to India, Africa, Europe, the Americas, or directly to the Americas going around the other way.\n\nIn other words, we imbue the circumnavigating Polynesians with our identity as actual humans, in the process of becoming even more humane, while mixing it up with other animal stock in some cases, harnessing and riding them and/or domesticating and husbanding them. A third class of human took to the sea, depending on wind power more than animal power.\n\nWith industrialization came more “energy slaves” per capita, meaning humans were served by more and more horsepower not expressed through living animals but through mechanical devices.\n\nA hint about this reading comes from those passages wherein Bucky warns us about boxing and/or overspecialization. When we bash one another in brutish fashion, de-geniusing ourselves, we regress (revert) to our more ape-like substrate. Our humanity evaporates from the Zeitgeist when we march towards oblivion.\n\nThis may all sound well and good but what about Polynesians having affinity with dolphins and whales more than apes? Why say humanity has more in common with these indigenous ocean goers than with the landlubber tool users? And yes, some apes are more aquatic than others.\n\nFirst of all, that’s not actually the claim. Interest in dolphins and whales was developing over Fuller’s lifetime, with a strong emphasis on their safekeeping and preservation. Dr. Lilly even tried to open a communication channel with the dolphins, with a little help from his three-letter friend LSD. \n\nCritical Path was reflective of its own period in history in speculating about a humanity-dolphin hybrid (so-called mermaids). This might have happened on other worlds.\n\nSeeing a shared humanity in these ocean-going mammals is probably more predictive of the future than a key to past evolutionary biology on Spaceship Earth. \n\nHumans have the capacity to build out under water, as well as over water. Given the percent of the planetary surface that’s oceanic, humans will likely colonize a lot more of the oceanic ecosystem before they ever get to Mars, perhaps modifying themselves genetically in the process.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}