{
  "id": "3481692580798659813",
  "title": "Spinning Death Tolls",
  "published": "2016-07-25T10:46:00.003-07:00",
  "updated": "2016-07-25T17:21:36.844-07:00",
  "content": "As we learned from Vietnam, a military is in large degree a PR operation designed to reassure the home folks that \"we're still the good guys\" and that \"we're winning\".\n\nA lot of that consensus broke down during the Vietnam War, and the Pentagon resolved to learn from its mistakes, which didn't mean forswearing off senseless violence by spending down inventory.  That's a moneymaking racket too big to fail.\n\nThese days, the way to spin the civilian deaths is to [acknowledge a very few of them](https://www.theguardian.com/world/2015/aug/03/us-led-air-strikes-on-isis-targets-killed-more-than-450-civilians-report), as this gives the appearance of honesty and meets viewer-voyeur expectations.\n\n\"Of course some civilians will perish.  That's how it goes in the Hollywood movies as well.\" The public accepts that.\n\nSo pick a number, maybe double digit (85?), and have the media agree on that.  They all repeat each other anyway, so sewing these numbers is not that difficult.\n\nIn the meantime, the death tolls are ridiculously higher. What's a \"civilian\" anyway?  In Vietnam the theory was civilians were harboring the terrorists, and so complicit.  Bombing entire villages was routine, a great way to test the new weapons (napalm, Agent Orange etc.).\n\nSimply ruining that much infrastructure (irrigation channels, power stations) leads to untallied collateral damage.  Here, the general public colludes with the media, as long as the message \"we're winning\" and \"we're still the good guys\" is getting through.\n\nTruth is not the real goal.  Cosmetically acceptable stories are the goal, so the vets come home heroes and may be thanked for their service.\n\nAs long as troops are held in high esteem, more will sign up.  The PR machine ensures the wheels keep turning that way.\n\nTo some extent, social media bring different feedback to those more open to reading multiple sources. Controlling and sanitizing these sources is too much work, but marginalizing with misinformation keeps these liberals in check.\n\nThe returning vets themselves, [the braver ones](https://www.flickr.com/photos/kirbyurner/albums/72157641703362303), like Smedley Butler, will sometimes [actively engage](http://controlroom.blogspot.com/2016/07/the-price-of-peace-movie-review.html) in counter-spin against their former employer and become a [target of FBI investigations](http://www.nytimes.com/2002/11/24/magazine/24RITTER.html?pagewanted=all), sometimes leading to later smear campaigns.\n\nAccusing the media of a \"[liberal bias](http://controlroom.blogspot.com/2016/07/epcot-west.html)\" helps keep them in line and obedient to their true paymasters.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}