{
  "id": "2385242459612834531",
  "title": "Spring Cleaning",
  "published": "2010-02-22T19:37:00.000-08:00",
  "updated": "2010-02-22T20:34:16.453-08:00",
  "content": "Some people wonder what it's like, collective ownership.  They think a company must be very different, and yet an employee kitchen is a common feature of any ocean-going craft, a good shared metaphor, and sometimes the literal truth.  So like my rice cooker is with the Laughing Horse crew, such that staff might feed itself.  Other provisions schlep back and forth, such as many of the movies I've been reviewing.  It's a videos collection, not just a books collection.Speaking of kitchens, ours was long overdue for an overhaul, which I accomplished to some degree this first pass.I do not glow with pride that I succumbed to habits of accumulation and am now saddled with a homeowner's inventory.  What I would like is for more informal meetings to occur such that I am able to treat my visitors with gifts, which they could hint about.  I have some interesting articles of clothing, a book collection, some art, some kitchen supplies.  These could become souvenirs, as many of them have been for me.  Remember your visit, come again.An exchange student could grab four or five outfits in route to a zip code area of longer stay (perhaps a horse ranch near Sisters), along with some interesting reading.  I have many CDs.  LW donated her collection to Muddy Waters during its [attempt to stay afloat](http://coffeeshopsnet.blogspot.com/2010/01/adrenaline-week.html).I spilled popcorn in the basement freezer awhile back and need to shop vac the thing, defrost it completely.  I stuffed the smaller freezer upstairs, after doing some triage.  Kind friends brought us provisions when my wife Dawn Wicca was going through her years fighting breast cancer.  Not all of those provisions got used.  She died at home, surrounded by family and friends, on March 17, 2007.Again, I am regretful over having so much stuff.  My desire to accumulate has been replaced by a wish to get a lot more bare bones, while also getting more opportunities to share information and compare notes with other Grunchies, other brands of diplomat-scholar.The cook and volunteer grounds keeper (a musician, studying Spanish) is pretty good at getting us patched in to these Portland networks, education-wise.  I'm looking forward to leading more [Martian Math classes](http://wikieducator.org/Martian_Math) at Duke's or wherever.  [The other night](http://controlroom.blogspot.com/2010/02/doing-math.html) was a blast.[Dr. Tag](http://worldgame.blogspot.com/2010/02/yacoubian-building-movie-review.html), faculty member, is well connected within the United Nations, as well as to local universities and colleges, other NGOs, so that's another source of hope.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}