{
  "id": "8302969553452574741",
  "title": "Sputnik Day",
  "published": "2018-10-05T12:19:00.002-07:00",
  "updated": "2018-10-05T12:22:57.148-07:00",
  "content": "I watched this documentary about the Apollo Era yesterday evening, without having consciously tuned in, until somewhere in the middle, that this was Sputnik Day, October 4.  The movie started sharing about October 4, with a Sputnik 2 in November, and I'm thinking \"hey, isn't that today?\"  Sure enough.\n\nA big Our Backyard newspaper large format thing, color pictures, came from Metro addressed to Dawn Wicca.  I might not have given it a second look, but Carol plowed into it, spending the better part of the day with it. \n\nTo her, it's a newspaper about the legacy of Dr. Jack Urner, who she say worked for Metro in the 1950s and 1960s.  I was only a toddler and grade schooler, so who am I to dispute.  I know he worked for the Portland Planning Bureau, I just don't know when Metro (a tri-cities thing) got going.\n\nJack went on to work for Libya, Egypt, Bangladesh and some others (I'm not ranking them), but Portland, in Carol's mind, still bears the imprint of his greenway and park oriented thinking.  When you live in the Pacific Northwest, you're automatically some kind of landscaper and gardener. \n\nHe was not a Robert Moses type, looking for where to ram through a next freeway.  Indeed, he probably left the States partly to get away from the Robert Moses types.  But again, kid brain speculation maybe doesn't count for much.\n\nGamification:  I was thinking about board games and how we played them as a family.  Geeks stack them at home and sometimes get them down.  All adults.  Computer companies hope you'll play there.  Why go home when you can socialize in a state of the art rec area?  Then get back to work. \n\nYou can say that's exploitative.  You can say that's how some people prefer to work.  The only downside is the dorm isn't right in the same building.\n\nBoard games:  I don't want to hear if it's capitalism or socialism or whatever ism, just run the simulation and show me the script.  Let me see the movie. \n\nTaxonomy can come during the postmortem.  An ism is what you die of.  In the meantime, lets play.\n\n\"Lots of little experiments, very few big ones\" was my MTOD.  GST > Econ.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}