{
  "id": "114265475964593512",
  "title": "St. Patrick's Day & Wanderers Retreat",
  "published": "2006-03-19T16:41:00.000-08:00",
  "updated": "2006-12-14T17:13:13.131-08:00",
  "content": "[](http://photos1.blogger.com/blogger/1134/545/1600/jonbunce.0.jpg)jon bunce (photo by K. Urner)We've started our Spring Retreat @ Pauling House, on St. Patrick's day. Jon is about to play some guitar. Jim is just days away from heading for Libya, to catch the eclipse.Brian, our Yorkshire American (with bushy eyebrows like Jon's), also grabbed the guitar and sang some excellent tunes. He and I sound like we're Darwinian and anti-Darwinian respectively in a certain thread @ wwwanderers.org -- and yet we're both quite happy with Darwin the guy, with his performance, his contribution to science. The Galapagos came up again and again in our conversation, with Steve eventually offering a cheap group rate, in case we just wanted to up and go there (tempting, very tempting).I used this opportunity to project some of my favorite video segments: the [Yes Men's presentation](http://www.imdb.com/title/tt0379593/) on the WTO's new leisure suit; the Festival segment from [Ghost in the Shell 2](http://www.imdb.com/title/tt0347246/), and [Warriors of the Net](http://www.warriorsofthe.net/).We also watched a Google Video about [Sangay Park in Ecuador](http://video.google.com/videoplay?docid=-3423673535782656771) -- Steve's wife Laura is from Ecuador and I wanted to show off the \"has everything\" potential of this stash. Archive.org failed to cough up any Flip Wilson comedy tracks for Steve however.David Feinstein dropped by on Saturday. He talked about teasing more data out of hemolyzed bovine plasma, by first dropping the convolution assumption around two constituents, adding wiggle room, then substituting a weighted average of two 10,000 randomized trial basis vector sets, with around 450 random numbers per basis. His goal was to approximate actual test results without nailing the algorithm to just those particular values (the deep alchemy: derive usable generalities from specificity).David's remarkable talent: to make this all clear.Also on Saturday, I left the retreat to attend a memorial service for Jo Fowler. The family reserved the huge auditorium in Lake Oswego High School and yet the venue was almost not big enough. This woman, whom I'd never met in life (her husband a coworker), was definitely worth knowing. She brought joy and life into the hearts of many, children and adults alike.Back @ Pauling House: Allen G. Taylor swung by, talked about ocean currents in Drake's Passage, SQL for Dummies and such.In reply to Allen's helpful prompting, I tried to explain, briefly, my Qv2 (Quakers, version 2): war metaphors OK (e.g. Nayler's \"Lamb's War\"), but with our weapons turned (and tuned) to a more inward vista. I pointed to [the Quakeress](http://www.amazon.com/gp/product/images/006088102X/ref=dp_image_0/102-8834637-6402554?%5Fencoding=UTF8&n=283155&s=books) on the cover of one of the art books in my collection; she's just killed some bug-eyed monster (a demon or devil -- the Slayer meme).We're talking science fantasy here (obviously) -- another name for old time religion (but with a lot more science).Glenn and I have continued brainstorming around geometry cartoons, which would include explorations of his Global Matrix concepts.Don requested [Peter Ward's performance](http://mybizmo.blogspot.com/2005/03/update-from-pdx.html), about how we're in a carbon dioxide window, dependent on plate tectonics, on a planet that's likely rare, if not unique, in its level of sophistication. I'm buying; we're good. That doesn't mean we'll be here forever. On the contrary, the gist of Peter's talk was: we're mortal, get over it.As a grand finale, Terry showed up again, on Sunday afternoon, to project a DVD: Roger Penrose addressing an audience at Western Oregon University, about his voyage of discovery in the world of the aperiodic pentagon. Two shapes, appropriately coded, are sufficient to aperiodically tile an infinite desert, such that any two regions, no matter how large, may be made to coincide, and yet the desert itself remains unique, an individual.In the background, I've been continuing threads on the Math Forum (Drexel) and edu-sig (Python community). I also booked my plane ticket to London, for the Mark Shuttleworth Foundation's education summit in April.Dawn and Tara have been persuing their own respective social life trajectories, including watching more early Buffy on rented DVDs.Addendum:The furniture has been set back, the dishes washed, flowers planted (on the far side of our future Cafe Philosophique), personal effects removed, except a few of mine, such as the laptop I'm now using, on battery, sitting at the board room table with leg repaired, to better than standard, by Barry and company.This was a good retreat.  My fond greetings to Shomar (woof), who got as far as the parking lot.[](http://photos1.blogger.com/blogger/1134/545/1600/urneratretreat.2.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}