{
  "id": "6308672161601862875",
  "title": "Staff Meeting 2012",
  "published": "2012-05-11T22:25:00.003-07:00",
  "updated": "2014-03-14T00:08:49.178-07:00",
  "content": "Some long time readers of this blog know that I spend a lot of my time connecting to [a small server farm in Illinois](http://controlroom.blogspot.com/2011/06/back-office.html), where I plow with my \"[OST tractor](http://controlroom.blogspot.com/2011/10/at-wherecamppdx.html)\", planting seeds, sewing, tending, reaping.  A job.\n\nThis used to be NetMath, connected to the University of Illinois, than acquired and moved to Sebastopol. Our leading lights are the Grays.  The staff is spread out.  Sometimes we send \"OST moles\" to conferences, recruiting students and faculty.\n\nWe hang out on Skype and have a faculty lounge on Facebook for round the water cooler conversations. \n\n[When we get together](http://controlroom.blogspot.com/2011/02/make-mathematics.html), we do Show & Tell. \n\nBruce shared limericks and sang the blues for the Grays' dog, Wilson, who recently died.  KB1 shared about her food van / bizmo, for sale on eBay.  KB2 shared about her boat slip, currently sublet while she works on the boat angle.  Steve showed slides from Brazil.  I shared my opening slides [from Occupy Portland](http://worldgame.blogspot.com/2011/10/occupy-portland-event.html), celebrating FNB's central role.  Lorri mocked the genre with her \"favorite candle\" presentation.\n\nMostly we do a lot of planning, comparing notes, future visioning.  That's what lots of companies do, including other schools.  Ours uses quite a bit of technology, in order to provide students with a learning experience.  The old idea of a \"correspondence school\" comes to mind, with the Internet making everything run faster.\n\nTrish remarked on my Nirel-brand cuffka, a standard part of my costume these days.  She's a performer and shared a clip of one of her roles in Guys & Dolls.\n\nSome of our crew are avid players of [Settlers of Catan](http://en.wikipedia.org/wiki/The_Settlers_of_Catan).  I studied the rules for this language game, but am doubtful I would prove victorious against such serious players.  Debra won her round though, and she had not played before.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}