{
  "id": "157398463999843657",
  "title": "Staggerers Party",
  "published": "2019-02-24T00:43:00.002-08:00",
  "updated": "2019-02-24T01:01:22.145-08:00",
  "content": "The term \"staggerers\" jokingly derives from \"wanderers\", what we call ourselves, I think mostly for the wandering nature of our group meetups.  The conversation flits from topic to topic.\n\nI'm not claiming we're unique like that.  When adults gather at dinner or cocktail parties, you note similar stream of consciousness chit chat.  We practice democracy in having inclusive conversations that give people frequent opportunities to change the subject if they wish to.\n\nIn other modes, we keep things more organized, even ritualized if in the realm of religion, legal rites.\n\nSecular institutions are not without ritual.  But I wander.\n\n\"To stagger\" in this context means to walk in a halting fashion, not gracefully.  However we're speaking metaphorically and just poking fun at ourselves.  I don't expect it's a term that will catch on.\n\nI'm reminded of \"Quakers\" as by some accounts the term had the spin of a insult.  Without a time machine, it's no simple matter to recreate the psyche of a 1700s England.\n\nOur youngest participant had suffered the most dire healthcare chapter lately, in terms of acuity. I remember my bout with appendicitis just out of college, staying with friends.\n\nWe gathered at my place, Carol gamely lurking in on the conversation, in the living room, where pizza was had.  We also have an upstairs.\n\nYou can see the place through my Oregon Curriculum Network website, where I use a Google Street View of it.  I think of myself as a for-profit business that funds a nonprofit, which is my work to uplift education practices in Oregon.  I'm far from being expert in all such practices.  I'm here to learn.\n\nSpeaking of learning, Don helped me tune in the Sallie Tisdale corpus.  I bought her book on female Buddhist personages, for Kindle.  That was but a couple hours ago and I haven't studied it yet.\n\nDavid had a pinkish shirt with the NASA logo.  He used to work there.  I've got other blog posts about Dr. DiNucci.  Wanderers meet in the old Linus Pauling House in Asylum District.  I've been writing up many of the meetups in these blogs for over a decade by now.\n\nLike what happens in many parties, gatherings, meetups, of an informal nature, if there's internet, speakers and screen, there's the possibility of dialing up (selecting) various video clips. \n\nThe diner juke box is/was similar.  People take turns picking music. \n\nThat's behavior that also traces to salons and parlors, developed as somewhat playful spaces by our Victorian ancestors.\n\nBob works as a nurse, these days on a night shift schedule.  He goes pretty far back in this blog, to an Esozone.  Don, a frequent visitor of Doug Strain, met Bob in his role as staff.  Bob is a jolly good fellow.\n\nMy curriculum was web based, not textbook based, and not behind paywalls.  As of this writing, a lot of my pioneering, such as my [Numeracy Series](http://4dsolutions.net/ocn/numeracy0.html), is still there.  However by the time you read this, a lot of that stuff may have gone off-line.  I haven't gotten to a place with Oregon where I think my domains will be long term relevant going forward.  Cyber-tourism is still in its infancy.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}