{
  "id": "328464371133524627",
  "title": "Starvation = Torture",
  "published": "2007-11-05T05:22:00.000-08:00",
  "updated": "2007-11-05T09:57:37.010-08:00",
  "content": "Partisan politicians are lining up pro / con the new AG nominee, asking him to take strong positions on stuff he's clueless about (not fair during war time says GWB in his [radio speech](http://www.marketwatch.com/news/story/text-president-bushs-weekly-radio/story.aspx?guid=%7BC5538144-21D9-45C7-B77D-567CD9C9CBD0%7D)).Sure [waterboarding is torture](http://www.washingtonpost.com/wp-dyn/content/article/2007/11/02/AR2007110201170.html), but so is slow death by starvation, a result of political policies, not nature or God, unless you want to blame our retarded and selfish human nature on external causes (always an old standby).Over a decade ago, we were hearing how \"lack of political will\" was the only reason people were still dying of hunger.  [Katrina](http://controlroom.blogspot.com/2005/08/refugee-camps.html) sort of dramatized the situation:  \"let 'em die, not our problem\" was a prevailing attitude among some of the higher ups -- still their attitude today.And yet we're supposed to vote for these people?  A joke right?Another excerpt from Quaker-P (Sun Nov  4 17:04:58 PST 2007):Death by starvation is also slow and tortuous, by all accounts.I'm eager for a deeper investigation into those policies in which liberals might be complicit. Studies I've read suggest there's plenty of food and then some (just look at the average waist line in this country for confirmation).Focusing on the president's AG nominee seems a way to deflect debate, to keep USAers from looking more deeply at their role in keeping the world a hell hole for a lot of perfectly innocent people -- then they profess to not understand why they're so reviled around the world.If any politicians feel like showing some [real leadership](http://worldgame.blogspot.com/2004/11/campaign-begins-recruiting-talent-now.html), they'll focus on alleviating starvation and preventable disease.In the meantime, the rest of the world moves on to the next level, organizing around this cesspool of [intellectual squalor](http://mybizmo.blogspot.com/2006/08/hiroshima-day.html) and depravity.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}