{
  "id": "4285702087608272610",
  "title": "Staying Put",
  "published": "2019-02-27T18:18:00.001-08:00",
  "updated": "2019-02-28T23:20:36.747-08:00",
  "content": "As it turns out, the weather was pretty normal, after the morning flurries.  But we didn't know that would happen waking up.  I woke up early, to an email from the auto mechanic very conveniently allowing me to reschedule.  Sure, why not?\n\nI was up early because of time zones again.  Not the first time.  We in the on-line economy, when doing synchronous meetings, need to adjust for the global economy staying awake, somewhere, 24/7.  This was a follow-up appointment, having established the only remaining glitches were client-side.  This morning's meetup went off without a hitch.\n\nHowever, with snow coming down, the street already white, I wasn't about to rush out to have my door lock inspected.  My car is a junker (meant affectionately, and not out of disrespect to a still strong engine) and shows wear and tear everywhere.  Remember Columbo with Peter Falk?  I think my car is nicer than his at least.\n\nI'll be getting back around to that soon though.  To postpone owing to snow is not to neglect, at least not in Portland.  We're allowed to take snow days.  The district schools were all closed.\n\nI had an assignment in a district school yesterday.  There's a lot bureaucratic going on, in addition to all the Python learning.  I sent a note to the parents, reminding them of what we're doing around Codesters, an adaptation of the Python language that runs well in the browser.  These are middle schoolers and I'm not expecting them to have the same wishes around how to spend time.\n\nDeke told me yesterday was Personal Chef Day, and that I am for my mom.  She does a pretty routine diet, thanks to the \"food is medicine\" mantra, and her pills interact with all the rest of it.  That makes the work easier.  She's able to fend for herself to a point, if need be.  And she'll want you to know:  she's not the only one known to leave a burner on.\n\nHave I talked about Tulsi Gabbard yet?  The candidate for US president.  I remember:  I started a draft on Medium, but don't regard it as pithy and [probably won't publish it](https://medium.com/@kirbyurner/friendly-musings-on-national-politics-8e62f6d51006).\n\nIn general I think like an Atlantic Monthly of some months ago, that the job of POTUS has become too undoable, in terms of demands and responsibilities.  As a consequence, I'm finding myself not wishing that office on anyone, as too cruel and unusual.  Tulsi deserves better.\n\nAn emperor-president is too oxymoronic a notion, we've been finding that out more and more over time.  The screenwriting just isn't believable.  The illusions have worn too thin.\n\nPolitical bubbles have popped before.  I'm not scapegoating here.  No one president has brought about this state of affairs and indeed many of fought it, in ways we don't (and probably won't ever) know about.\n\nSpeaking of the job of POTUS, the scandal lights were flashing big time today as the public learned more about the personal wheelings and dealings of their chief executive, from his former lawyer.\n\nThe broad outlines of the story have been public for months.  However, the full circus potential of the scandal had not been exploited, in the manner of the Kavanaugh hearings, until this morning.  I was blissfully oblivious, until my daily briefing from one of my TV hound friends.  I did some catching up later, having decided to stay put.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi1UyNMDbn970hiY93t9HceQw8rvYQ1CR49kI6nDGVw8ChekSGv3udEDvJAC77955p9mxg9GlR5zl0ORR6UFvvYyiWvOaNicyGh_YS9ZigLqkMA1OtsH03U_ZEP3mYn-ostHxT9/s1600/33368912418_c84650ec66.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}