{
  "id": "2057804005716684962",
  "title": "STEM:  Carbon as a Theme",
  "published": "2015-08-02T00:30:00.002-07:00",
  "updated": "2015-08-02T07:37:34.567-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/20033358749/in/album-72157654417641521/)\n\nI've been looking at the Allotropes of Carbon as a unifying theme when it comes to developing [2D and 3D graphics](https://mail.python.org/pipermail/edu-sig/2015-August/011290.html) on computer as a part of an integrated STEM curriculum. \n\nGraphene is flat (2D) whereas buckyballs and nanotubes are more 3D -- as is diamond of course.\n\nA customary drawing tool for 2D graphics is the Turtle, as in LOGO.\n\nI'm interested in extending that theme, though with adults I'm pushing the Tractor as an alternative.\n\nInstead of a \"Turtle object\" we have a \"Tractor object plowing the field\" -- a read / write activity on a 2D surface -- a field being a simple data structure, an N x M matrix of (X, Y) cells. \n\nWe're used to XY square grids and XYZ cube grids, however given Carbon as a theme, I envision more hexagons (planar) and 3D analogs e.g. [space-filling rhombic dodecahedrons](http://controlroom.blogspot.com/2015/07/of-kepler-and-aristotle.html).\n\nHow hexagons tile a sphere with pentagons, ala the soccer ball, is where the buckminsterfullerne comes in, as a strategy for [dividing spheres](http://dividedspheres.com/). \n\nIf anyone else is using carbon chemistry as a unifying STEM theme, around which to integrate various mathematical exercises, I'd be interested to learn about it.\n\nAdding computer graphics to the curriculum gives leverage to those wishing to escape the hegemony of scientific calculators.  Break out of the 1980s!\n\nToday it's easy enough to provide each student with a desktop in the cloud e.g. an EC2 instance on Amazon.  That's the [direction we're moving](http://worldgame.blogspot.com/2015/07/pws-personal-workspace.html) in at my school. \n\n[  originally posted to [Maria Droujkova's mathfuture](https://groups.google.com/d/msg/mathfuture/gTuyXO5zpl4/gf26OPSkAgAJ) Google Group ]\n\n[](https://www.flickr.com/photos/kirbyurner/10736778704/in/album-72157654417641521/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}