{
  "id": "7345930406946595734",
  "title": "Storybook Nation",
  "published": "2015-11-11T19:29:00.001-08:00",
  "updated": "2015-11-28T19:45:38.581-08:00",
  "content": "Inventing broad brush stroke stories about how West Region was won, is an ingrained habit, so ingrained we don't really call it \"inventing\" with \"we\" being the authors of such tall tales. \n\nLike that all of Louisiana Territory could be \"sold\" by Napoleon, in need of a war chest, to a bunch of Company investors in the then Mason Capital.  [Or tell it how you like](http://www.history.com/topics/louisiana-purchase), it's a fairy tale of sorts, however told, but hey, we all learn about it in school, and that makes it \"true\".  Sometimes \"the past\" just seems too unbelievable, know what I mean?\n\nDonald Trump is doing public debaters a public service in sketching the comic book literal picture of a \"real country\", not one conquered on paper by imaginative storytellers.  Sure we can mobilize, at this very late date, to actually spill the blood it would take to once and for all give those Yanquis total control.  Sure we could.\n\nThe arterial system of tribal migration was certainly interrupted by fences and freeways, diminished certainly, but to bring the circulation of the pueblo to a total stop, in a desperate attempt to get a stranglehold on the situation, once and for all, with a giant wall and everything?  We could call that Washington's last gasp, a final death rattle.  Leave it to a New Yorker to make the funny noises.\n\nSpeaking of school, we've been sharpening pencils in the Martian Math department.  That's an initiative to [strengthen STEM](http://mybizmo.blogspot.com/2015/09/caltrops.html) by bringing [real REPLs](http://controlroom.blogspot.com/2015/10/integrated-learning.html) to students.  Remember in [The Martian](http://worldgame.blogspot.com/2015/10/the-martian-movie-review.html) where Matt Damon hits on using ASCII?  You learn that stuff, along with Unicode, when packing for / training for Mars.\n\nWith real REPLs like Python's comes a decent helping of Group Theory, not everyone's cup of tea, but a great way to spin one's wheels learning coding, which is [all the rage](http://www.businessinsider.com/lyndsey-scott-model-and-coder-2014-1).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}