{
  "id": "9087873555422727678",
  "title": "Story Problems",
  "published": "2008-02-05T19:27:00.000-08:00",
  "updated": "2016-09-03T01:39:05.145-07:00",
  "content": "[ originally posted to [math-teach](http://mathforum.org/kb/thread.jspa?threadID=1692434&tstart=0) @ Math Forum, two typos fixed, hyperlinks added ]\n\nSo the spectrum I'm addressing here is from meaningless to meaningful, with the former kind of story problem focusing on underlying abstractions, the latter having \"real world\" dimensions.\n\n[Wayne has championed](http://mathforum.org/kb/message.jspa?messageID=5396081&tstart=0) the former, and indeed many of like mind ridicule anything deliberately reality based as \"rain forest math\" i.e. a transparent attempt to [politicize](http://worldgame.blogspot.com/2006/12/katrinas-aftermath.html), whereas aloof/removed abstraction is supposedly closer to apolitical vs. just head-in-sand Ivory Tower (i.e. \"leave me alone, I just wanna do  math problems, don't care what they're about\").\n\nThe \"[physics first](http://www.aapt.org/Policy/physicsfirst.cfm)\" movement, also \"[first person physics](http://mybizmo.blogspot.com/2006/04/more-first-person-physics.html)\" represent a happier compromise, in that our story problems are \"themed\" around the concepts of [energy](http://worldgame.blogspot.com/2005/01/brainstorming-about-pedagogy.html) and [power](http://mail.geneseo.edu/pipermail/math-thinking-l/2008-February/001230.html).  Given algorithms may be ranked for efficiency, all that's required is to understand that mathematics itself, the physical process of doing it, is energy-consuming.  An inefficient algorithm is like an energy-hog SUV (oops, political -- no apology).\n\nSo in our [computer math](http://mathforum.org/kb/thread.jspa?threadID=1689861&tstart=0) sequence, developing among various charters, other risk-taking academies not in the thraldom of some textbook (by definition out of  date -- [more](http://mybizmo.blogspot.com/2006/10/news-article-satire.html) on that some other time), we look at human productivity and algorithm efficiency \"in the same breath\" as it were, meaning we have that [metrological](http://worldgame.blogspot.com/2005/05/global-warming.html) component so despised by the \"purists\" (i.e. we actually care about empirical measures).\n\nBut rather than just wallow in joules and calories, we also have the concept of [O-notation](http://en.wikipedia.org/wiki/Big_O_notation) and the curves (graphs) those imply.  Average 15 year olds understand what it means to \"work inefficiently\".  That we might use mathematics to improve productivity, cut down on wastefulness, is a key point of this curriculum.\n\nApropos of that, we don't waste the opportunity to make our story problems meaningful, as the goal is to stay appropriately interdisciplinary and in sync with other subjects.  This idea of \"go it alone math\" that doesn't care about physics or biology or history or whatever is in itself inefficient, typical of slower, more wasteful thought processes which we'd like not to perpetuate in our eager, thoughtful young.\n\nTo some extent, you can judge a math curriculum by its story problems.  Steer clear of the willfully meaningless is my advice.  Life's too short for such idleness.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}