{
  "id": "4012467821264101763",
  "title": "Study Circle",
  "published": "2017-02-10T11:18:00.003-08:00",
  "updated": "2017-02-10T15:08:44.253-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/32784583536/in/dateposted-public/)\n\nIn addition to working with world game planners on Global U ideas [around trucking](http://worldgame.blogspot.com/2017/02/trucking-again.html), I'm studying a New Yorker article, Dymaxion Man, about Fuller, published in 2008.\n\nSure, that's one way to compute the account, tell the story.  New Yorker features a lot of intelligent writing.\n\nNo mention of the Cornwall Eden Project, nor of the Epcot Buckyball (\"Spaceship Earth\"). How does Synergetics relate to the CCP?\n\nNo mention of Dr. Arthur Loeb, nor A & B modules, T & E modules (3D printable!).\n\nWe'll have exhibits in our World Game Museum, of what the textbooks were ignoring (a basis for ignorance). Lets see how the narrative accounts compute then, shall we?\n\nIs West Point teaching the Bucky stuff at least, sharing our American heritage with high ranking officers?  Scandalous if not. We're investigating. \n\nA couple comments, from my Facebook timeline:\n\n[](https://www.flickr.com/photos/kirbyurner/32824207775/in/dateposted-public/)\n\nAlso:\n\n[](https://www.flickr.com/photos/kirbyurner/32824208605/in/dateposted-public/)\n\nThe\n main literary trope I find regarding Bucky is that he was a failure and\n his inventions didn't fly. Put his awards and degrees, number of works \npublished, historical role as \"engineer saint\", in a pile, and put that \npile next to any detractor's and compare. \n\nTrue, he didn't win a Nobel \nPrize. Is eleven honorary PhDs enough (given for free remember, to help a\n school uphold its own brand)? Elliot Norton chair of poetry at Harvard?\n Patents not just on the dome, but the IVM itself (like if Descartes had\n patented XYZ). \n\nThis guy appears to be a huge success, by objective \ncriteria. One of the most successful who ever lived. I think the \"he was\n a failure\" trope is a projection. People think \"the world is still a \nghetto ergo Bucky did not succeed.\" Specious. Completely void of real \nthought.\n\nOr was it 47 PhDs? That's what [BFI claims](https://www.bfi.org/about-fuller/biography). Depends what \"doctorate\" means maybe. \n\nSuch a failure right? [Poor slob](http://worldgame.blogspot.com/2008/06/poor-slob-bucky-psb.html).\n\nAfter\n being spurned early in his career by the architecture and construction \nestablishments, Fuller was later recognized with many major \narchitectural, scientific, industrial, and design awards, both in the \nUnited States and abroad, and he received 47 honorary doctorate degrees.\n In 1983, shortly before his death, he received the Presidential Medal \nof Freedom, the nation's highest civilian honor, with a citation \nacknowledging that his \"contributions as a geometrician, educator, and \narchitect-designer are benchmarks of accomplishment in their fields.\" \n\nStudy Circle. Trucking simulations, [@Iran](https://twitter.com/Iran) freeways. [@NewYorker](https://twitter.com/NewYorker) toes the line on \"poor slob Bucky\" [https://t.co/zYnao31TjJ](https://t.co/zYnao31TjJ) [@BuckyFullerInst](https://twitter.com/BuckyFullerInst)\n— Kirby Urner (@thekirbster) [February 10, 2017](https://twitter.com/thekirbster/status/830191518975561728)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}