{
  "id": "8960584525230055267",
  "title": "Substance Control",
  "published": "2015-10-01T17:51:00.003-07:00",
  "updated": "2015-10-02T16:03:16.249-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/21863148862/in/dateposted-public/)\n\nOregonians were in the mood to celebrate today, in Portland especially, [as Prohibition notched back](http://worldgame.blogspot.com/2008/12/repeal-day.html) a bit.\n\nI made a symbolic purchase, [snapping pictures](https://flic.kr/p/z3oVQL), then came home to the tragic news on the radio, about the mass killing in Roseburg, one of Oregon's towns.\n\nThere's a connecting theme:  substance control, interpreting \"substance\" rather generally.  Guns are a substance, but then in a way, so are states of mind.\n\nWe're instituting different substance control protocols around cannabis, will we around guns as well?\n\nA civilization is somewhat defined by how it controls access to such and such.  That would include to information, news sources etc.\n\nAnother duh moment:  I'd been scouring the Internet for a computer monitor also able to show HDTV.  I finally realized any monitor with HDMI-in would do, and I already have one of those, so no new purchase necessary to use the CenturyLink Prism service. \n\nGlenn talked of General Semantics and \"substance control\" in another sense: maintaining mindfulness, not falling victim to one's own body chemistry, i.e. not becoming only a complex of  knee-jerk responses.  Korzybski segues to Bucky [at St. Quentin](http://worldgame.blogspot.com/2014/01/the-bellman-equation-movie-review.html) [ the Youtube is gone -- the warden is introducing Bucky to the prisoners, mentioning they've been studying Korzybski most lately].\n\nOf course way more people in Syria are getting mass killed every day.  Same issue:  it's so easy to get weapons, all you need is a \"just cause\" and some money, or a patron with an agenda.  But then try crossing a border for the same \"just cause\" reason.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}