{
  "id": "4369248442005701275",
  "title": "Suicide Squad (movie review)",
  "published": "2016-08-12T22:30:00.000-07:00",
  "updated": "2016-09-03T01:22:48.176-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/28327563824/in/dateposted-public/)\n\nSuch a depressing future.\n\nHey, for those new here, my \"reviews\" mostly only make sense to those who've seen the movie; I don't work hard to address those \"just thinking about it\" i.e. it's all archival, you'll decide at some point.  I also pride myself on not reading a lot of \"what other people think\" before giving my spin.\n\nIn this case though, I couldn't help but hear some buzz, so I'm sorry.\n\nBagdad Theater was in good form, and after the film I went to Back Stage per the hoped-for workflow, and indeed some Olympics teasers (Rio, 2016) were on, though nothing too substantive (no audio).  The screen is indeed huge.  The greyhounds (vokda + grapefruit juice) were excellent, no complaints.  [JetBlue](http://mybizmo.blogspot.com/2005/07/jetblues-bizmo.html) flyers experience extreme turbulence (news story).\n\nDepressing because the \"good guys\" are so not, and what it's really about is persecuting freaks, meaning [civilization](http://mybizmo.blogspot.com/2016/05/recent-reading.html) has gotten nowhere, just gotten a lot uglier.  Nightmares R us.  However I'm not faulting DC Studios or the movie-makers.  [Our science fiction](http://www.quakerquaker.org/forum/topics/helping-the-poor-in-bandwidth?commentId=2360685%3AComment%3A147324) has been dystopian for quite awhile now.\n\nWe go there for a reason, to think again about the mistakes we're maybe making.  Simulations teach.  Here we see [the CIA](http://controlroom.blogspot.com/2016/05/captain-america-civil-war-movie-review.html) \"obligated\" to employ weapons no one wanted to see used, after deliberately getting in over it's own head by unleashing them, or by \"priming the pump\" depending on how one tells the story.\n\nThat Batman is a background good guy \"law enforcer\" in Gotham, and that we get to see from the villains' point of view for a change:  nice premise.\n\nI'm not going to sit in the bleachers and just criticize an expensive comic book, as that's not my idea of a \"review\".  Thank you all for a heartfelt performance.  In case I forget to say it again?\n\nHey, that Tom Hanks movie, upcoming, about the guy emergency-landing that airplane in the Hudson, I'm all for seeing that.  I can relate, as a passenger if no one else.\n\nThanks also again to Bagdad.\n\nIn terms of refugee camps, yes why not \"drive in\" movies, sans the cars, but with more serious content, in the sense of less densely encrypted.\n\n[I love comics](http://worldgame.blogspot.com/2016/09/gateway-to-asia.html) myself, though I wouldn't count myself as faithful a follower as many.\n\nBut hey, if I'm a refugee in a camp, looking for ways forward to the future, I'm not likely to wanna wade through ten thousand years of one particular culture's psycho-history.  I mean lets get real here.\n\nI beat a straw man.  No one that I know of was suggesting screening said movie, in first release, in refugee camps around the world.  Hollywood is not into that.\n\nMy saying it's inappropriate is like, way outta left field.\n\nAnyway, I may have more to add regarding this film at a later date.\n\nThe need for superlatives for \"beyond human\", be that \"meta\" or \"super\" or \"trans\" is more a test of the English language.  \"Hyper\" is another one we might try (shades of Lawnmower Man).  \"Cyber\" is already taken as in Six Million Dollar Man and Robocop.\n\nNietzshe sure got quite a few balls rolling, with that Übermensch meme. It's an archetype, part of our yearning to overcome.\n\nSpeaking of \"overcoming\", I don't like singing We Shall Overcome anymore (a favorite in the liberal hymnal).  As a kid it made sense, but I'm 58 now, so either I did or I didn't.  Deadlines make sense.  Using the future tense at this point sounds phony.\n\nJohn Taylor, visiting from Indonesia, was at the house when I got home.  I had those new USB memory sticks ready, one for each of us.  He's writing his autobio.\n\nI showed him the Word docs inside Office Libre, on a Pi.  Checking at Fred Meyer's today, they've removed all the Linux-specific magazines.  The dumbing down campaign takes a toll every summer.  The idiocracy always find new ways to oppress the geeks (freaks), like by taking away their reading materials.\n\n[](https://www.flickr.com/photos/kirbyurner/28330138903/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}