{
  "id": "5899916131779592320",
  "title": "Summer Camp",
  "published": "2014-12-17T17:13:00.003-08:00",
  "updated": "2014-12-20T15:33:21.239-08:00",
  "content": "I was back to my \"boot camps for teachers\" meme today, this time including their families.  Glenn and I had been talking about publicly funded boarding schools, pre-college, of which there are [very few](http://mathforum.org/kb/thread.jspa?threadID=2665253).  However teachers are not \"pre-college\" in that sense, so the topics were loosely connected.  The bridge or glue language was Quakers, and public-private collaborations, more like in the old days.\n\nOf course I'm back to my [Project Earthala imagery](http://controlroom.blogspot.com/search?q=Earthala), those elusive Fly's Eye Domes and other gear, perhaps deployed only for the semester, then [packed up and returned](http://controlroom.blogspot.com/2006/08/hexapent-housing.html) to the giant warehouse somewhere.  Humans getting better at not leaving that much of a footprint.  OK to stake something for the GIS record but we're not wanting to harm the pre-existing ecosystem.  The eco-village comes and goes.\n\nAlthough I mentioned helicopters, something of a cliche in Fuller School circles, Glenn emphasized their danger.  If the property in question is accessible by container truck... I'm just not into building lots of roads (defeats the purpose), more into making do and/or letting roads go back to nature (some counties over-built, lets face it).  Anyway it's not up to me to make the site-specific recommendations, not when summarizing the network.\n\nSome of these might be closer to \"call centers\" as in \"places of employment\" than training centers or schools.  People have already trained in order to get here.  I'm not insisting on pegging the stereotypes, and draw on the variety / diversity in summer camp experiences already, including reminding myself that cold weather conditions may obtain, as I've not specified a hemisphere (above or below the equator).\n\nSpeaking of which, we're coming up on [Winter Solstice](http://worldgame.blogspot.com/2014/12/wanderers-solstice-party.html).  Best wishes to travelers.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}