{
  "id": "113193426375143923",
  "title": "Sunday @ Meeting",
  "published": "2005-11-13T17:57:00.000-08:00",
  "updated": "2006-11-15T11:43:47.407-08:00",
  "content": "Quakers of the past reputedly didn't say \"Sunday\" -- and in some cases this was true -- as \"Sun Day\" has a pagan sound, as if we really needed to name days for obvious Sesame Street figures or whatever. Let's just call it \"First Day\" and be done with it. That way, if we exit the solar system, and lose track of the sun... Anyway, it's not true. I say Sunday all the time, never think twice about it.Anyway, I was at Quaker Meeting today, wearing my Quaker hat (Paul Kaufman styled it, with a Chicago-style band). Actually, I flung the hat onto the raised platform on the north side of the room and worshipped hatless, as is our custom. I even shared from the heart, but didn't physically rise to my feet, as our group is still small enough to make standing optional. I told some stories from what I called my \"ecumenical weekend\" (Catholics and Unitarians, mostly -- I think of Wanderers as more Science than Religion, though it does phase into Philosophy on occasion).Back at the ranch (not really -- no horses), we had guests over for homework. Our children are studying a combination of topics: coal, fossils, geological columns, layers of sediment. The local Max station under the Zoo has some amazing geological columns, tipped sideways, but going back in time in one direction. Long ago, this area was under a lot of water. A great flood happened, after some giant lake in Montana took off towards the ocean, leaving behind what we later called the Columbia River Gorge (a major feature of our landscape around here -- upriver was ground zero for the Manhatten Project, and OMSI teaches how important it is that we don't let groundwater fallout percolate out to our river (a lot of radioactive waste was just dumped or poorly contained, because there was a big war going on, and everyone was in a frenetic hurry -- no time for proper planning, and we're paying for that now)).Ways to mine coal (from the homework project): strip, surface, slope, shaft. Katrina and Rita hurt coal making they say. That explains the higher prices. Sounds reasonable. Coal types: anthracite, bituminous, lignite, sub-bituminous. \"Coal is a solid fossil fuel, it forms from decomposed swamp plants.\" Yep, that sounds believable.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}