{
  "id": "40227073835116904",
  "title": "Supplements",
  "published": "2007-01-17T15:03:00.001-08:00",
  "updated": "2007-01-17T15:34:20.148-08:00",
  "content": "I'm not one of those people who thinks a lot about supplements, though I take some (some niacin and such), have mentioned doing so [in this blog](http://mybizmo.blogspot.com/2005/02/beer-at-bagdad.html).Perhaps in an ideal democracy, we're all these super well educated [Incredibles](http://mybizmo.blogspot.com/2005/02/incredibles-movie-review.html), and trust ourselves to help ourselves to whatever medications, because we're all physician-philosophers and take our mandate to treat ourselves (\"[heal thyself!](http://images.google.com/images?hl=en&lr=&q=%22heal+thyself%22)\") both seriously and liberally.In practice, however, we do what we so often do, which is protect the \"power tools\" behind a counter, and let lay people (people of average skill) play with some lesser caliber fare, though still potent I would hazard, if you know what you're doing (or don't).And not even lesser caliber necessarily, but perhaps simply Chinese.  There's simply no way to authoritatively audit every aspect of millenia of practices, other than slowly but surely, empirically, with eyes wide open.  The medical journals are filling with such studies as we speak.  Here in Portland, many Eastern therapies win respect, for conditions like lower back pain for example.For this reason, we don't push political powers to regulate well past the capacity of science to hand down decisions, as if you could simply turn up the speed of the reviewing line, and run every food supplement, Chinese herb, folk remedy, quack theory, past the eyeballs of some easy breezy know-it-all refs.That being said, the scare stories, warnings, buyers beware stories, have every right to circulate as well.  Just because there's no central committee that plans to censor and/or second guess every decision, doesn't mean those poorly served by a drug or therapy, maybe destroyed by it, should have to shut up and keep quiet.  Defenders may also reply to attacks and so on -- we hope with plenty of empirical data on both sides.Bad press is no more regulated than good press, nor less exempt from empirical testing (circulating unfounded negative stories, as a part of some vendetta perhaps, is always considered bad science no matter who does it).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}