{
  "id": "104146165408226199",
  "title": "Surplus (movie review)",
  "published": "2010-05-08T12:48:00.000-07:00",
  "updated": "2010-05-11T17:36:59.097-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/4599843412/)[Surplus: Terrorized into Being Consumers](http://www.imdb.com/title/tt0368314/), chronicles the descent into irrationality occasioned by the industrial revolution.Unable to tear away from \"earning a living\" models, humans endlessly churned out more and more of what they already had too much of, while neglecting their own basic needs.Future shock apparently involved acknowledging our need to radically improve our cognitive approach to \"the economy\". Was it really all about shopping until we dropped?  Could there have been other answers?Questioning materialism used to be the quaintly anachronistic job of various once-a-week religions and had a \"tsk tsk\" neo-Victorian and/or Puritanical flavor.  As that questioning has become more urgently existential, much of the religious response has converged with philosophical and [scientific investigations](http://worldgame.blogspot.com/2010/05/tomorrows-people.html).Instead of the fires of hell, we have global warming to contemplate and/or thermonuclear war followed by nuclear winter.  A sense of human culpability keeps us in the game as having agency. We seem to have a steering function, even engineers think so.  This keeps a flavor of \"testing\" in our Global U (Spaceship Earth).We Can Fix This is exemplary of a more hopeful, less purely destructive, response (a road show, coming soon to The Bagdad).  The Coffee Shops Network idea was likewise an attempt to harness our best impulses to support the front lines.The film uses mockumentary techniques similar to [those of Emergency Broadcasting Network](http://mybizmo.blogspot.com/2008/05/defending-homeland.html) in Electronic Behavior Control System for example.  Multiple talking head shots, mostly of media personalities and authority figures, get spliced together to mouth some of the film's biting commentary.One of the longest takes, and most eerie, is in a sex doll factory.  These are among the best money can by.  We get the grand tour, and learn how body type, head, skin color etc., might be mixed and matched per patient tastes (one could view these as medical devices, akin to prosthetics, and therefore covered by insurance).  Shades of AI.  Factory and cubicle workers doing calisthenics in unison, inter-spliced with the sex dolls, provide an Orwellian commentary on the dehumanizing effects of the matrix.George Bush insisting we fight terror by shopping (our \"way of life\" after all), [and Steve Balmer](http://controlroom.blogspot.com/2008/06/iron-man-movie-review.html) whooping it up for Microsoft, come across as twin icons of  some kind of hypertrophic global materialism.Both are reflective more than instigative, doing their jobs as jester archetypes, properly suited for the masquerade.  Anonymous spectators take comfort from the hype, as they do from televangelists, shock jocks, other colorful clowns.\"Know your audience\" is the dictum for commercial advertisers, as well as for filmmakers.One might easily come to see rampant materialism as \"the matrix\" which traps us in [unfulfilling and dehumanizing scenarios](http://worldgame.blogspot.com/2010/05/tomorrows-people.html).  Experiencing said \"matrix\" as imprisoning is a first step toward liberation in that case, and is an awareness this film seeks to foment.In the foreground and haunting the sound track: our token \"terrorist\" who wants to fight back without being too tame about it.  Smashing a few windows is civil disobedience in his book, not violence against persons.Violence against persons, on the other hand, is what matrix shoppers tend to consider a \"divine right\" in contrast (including by proxy, against strangers in distant lands).  Their sense of security and right to over-consume go hand in hand.This film was released in 2003 and is a part of [the Laughing Horse collection](http://mybizmo.blogspot.com/2010/01/troop-maneuvers.html).  Thanks to recent reorganization, these films are getting more opportunities to circulate beyond just those few radical households that know about them.Private parties, teach-ins, networking salons etc., with music, presentations, and projected films, are not in violation of copyright, even where covers get played.  Fair use rights pertain.Movie Madness on SE Belmont may have some hard to find videos (and it does), but some of those at Laughing Horse (10th & SE Burnside) are next to impossible to obtain.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}