{
  "id": "3350431288801858768",
  "title": "Surveying History",
  "published": "2010-05-01T21:24:00.000-07:00",
  "updated": "2011-06-01T12:20:54.368-07:00",
  "content": "Webster Tarpley was being sharply critical of Freedom House [on Russia Today ](http://www.youtube.com/watch?v=NfXGS4dZbHk&feature=channel)(RT), making fun of the Bush Institute's workshop on cyber-freedoms. This led me into [reading up on Freedom House](http://www.freedomhouse.org/template.cfm?page=249), which took me (again) to [Bayard Rustin](http://www.quakerinfo.com/quak_br.shtml), a gay activist Quaker and former chairman of said NGO.Tarpley wrote George Bush: the Unauthorized Biography (about Bush Sr.) a book our resident Lyndon LaRouche afficionado Brian Hutchings used to cite often on Geodesic and Synergetics-L, the latter being the precursor the Synergeo.  Tarpley has [his share of detractors](http://www.zcommunications.org/crackpots-the-left-and-jewish-banker-cabals-by-chip-berlet), such as among [Noam Chomsky admirers](http://www.grunch.net/synergetics/makeover1.html).I ended up reading the Tarpley bio of Bush Sr. a long time ago.  [The section on Leo Cherne](http://tarpley.net/online-books/george-bush-the-unauthorized-biography/chapter-15-cia-director/) is especially apropos per Tarpley's remarks on the RT Youtube.The Tarpley investigation of Nazi connections was more tempered and balanced [in Kitty Kelly's book](http://mybizmo.blogspot.com/2008/02/philosophy-101.html) I thought.  Per [War Against the Weak](http://www.waragainsttheweak.com/), the USA's aristocratic intelligentsia was pretty much across the board into Social Darwinism and eugenics in those days, feeding a Hitleresque mindset.Now I'm curious whether [Kiyoshi Kuromiya](http://www.grunch.net/synergetics/kiyoshi.html), a gay activist associated with the MLK campaign, might have known and/or worked with Bayard Rustin.I've been reading [the ](http://www.quaker.org/sttp.html)[Speak Truth to Power](http://www.quaker.org/sttp.html)[ document](http://www.quaker.org/sttp.html) again, which agonizes about the erosion of freedoms in America thanks to its new post-WWII wartime economy.  The Cold War proved somewhat devastating to personal freedoms, much as the War on Terror has.  Freedom House was a staunch foe of McCarthyism I notice.James Woolsey, of [Who Killed the Electric Car?](http://mybizmo.blogspot.com/2007/01/who-killed-electric-car-movie-review.html) fame, is also a past chairman of the Freedom House board of trustees, a fact Tarpley also mentions on Russia Today.Here's mention of Kiyoshi, from Smash the Church, Smash the State, edited by Tommi Avicolli Mecca:At antiwar protests, gay men used campy new tactics to fend off cops and defuse tensions. As Kiyoshi Kuromiya relates in City of Sisterly and Brotherly Love (Marc Stein, Univ. of Chicago Press, 2000), “We’d go up to a line of cops with tear gas grenades and horses and clubs. And link arms and do a can-can. Really threw them off guard.”",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}