{
  "id": "4184245333029391129",
  "title": "Synergeo 57035",
  "published": "2009-12-10T20:15:00.000-08:00",
  "updated": "2009-12-11T22:06:31.855-08:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/4166687307/)It's kind of fun house mirror that I'd name something an \"NCLB Polyhedron\" isn't it?[http://worldgame.blogspot.com/2006/10/nclb-polyhedron-memo.html](http://worldgame.blogspot.com/2006/10/nclb-polyhedron-memo.html)You may remember I held a contest for the handsomest rendering, and Ken Brown won (that's his rendition in the blog).We might compare Fuller's quest with Mendeleev's in that he's looking at low integers, wanting to maximize their sense, their gain, vis-a-vis these volumes.  In [book] 2 of Synergetics, he's just completing his quest for volume 5.  You can tell from the war stories and diagrams that he's gone through a lot of shapes, looking at one then the other.  What really sold him on the rhombic triacontahedron I think, was precisely this narrow-line difference between the T and the E.  Whereas some might look at this as a \"flaw line\", for Bucky I'm pretty sure it was one of his favorite discoveries.  Much of the 2nd volume is focusing on this material.Newcomers to the field don't get the same sense of \"two [books]\" though, as for the web edition they were interleaved, as Fuller had intended.These NCLB memes seemed like safe enough and fun innovations such as to possibly galvanize debate to positive ends in the blogosphere, newsgroups.  Here's some writing worth wrastling with, worth tossing around.  We'll see.  So far, the science press is busy being anemic, not giving us air time.  No one has a clue what a rhombic triacontahedron is, even though they put pictures of Zome kits everywhere, cuz they're politically correct.  Am I just being too cynical?You may say we shouldn't have to care what a rhombic triacontahedron is, but that's just a value judgment from a specific ethnicity.  Those cultures that want to keep talking about that shape will have various ornaments around, this household no exception.That being said, it's no fun to pay into the system, and yet not have one's favorite teachings or stories shared.  Talk about stranger in a strange land syndrome.  Actually it's not that bad, as Cleveland High School happily displayed the Fuller Projection in global studies, for many weeks straight.  That really was an encouraging sign, even though nothing much was said about it.  That same map has since visited with Circadia folks (Burning Man, Burn Out) and Laughing Horse Books & Videos (a collection, an archive, as well as a store).  So Portland still has some sense of this heritage.  When we held [Ignite 7 at The Bagdad](http://controlroom.blogspot.com/2009/11/ignite-portland.html), and Phil said his name, several people cheered (plus I was received warmly).Kirby-->>> from mars import math[http://www.wikieducator.org/Digital_Math](http://www.wikieducator.org/Digital_Math)[](http://www.flickr.com/photos/17157315@N00/3292186750/):: global studies class, Portland ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}