{
  "id": "4122266858576191293",
  "title": "Systems Science",
  "published": "2019-03-15T18:27:00.002-07:00",
  "updated": "2019-03-17T17:43:05.123-07:00",
  "content": "Glenn and I hopped a bus 14 to join Portland State faculty and students at a brown bag lunch event.  We call it that, but no one was eating that I can recall.  We sandwiched into the Harder House meeting room, pretty much every seat taken, John Driscoll standing and delivering his presentation.\n\nJohn took full advantage of his time, launching early into preliminary material about [Hausdorff Dimension](http://mathworld.wolfram.com/HausdorffDimension.html) as computed with [a \"box counting\" algorithm](https://www.youtube.com/results?search_query=Hausdorff+box+counting).\n\nApplied to facades, or floor plans, generic grids, one may compute its fractional dimension d, or, conversely, create such vistas with d as input.\n\nWhat would it mean to extrapolate random buildings within a fractal space, determined by a few hyperparameters?  John is [exploring this question](http://johncdriscoll.com/2019/03/12/pin-up-2-2/).  Could such a font of detailed fractal structures provide a kind of clay, which an architect could then sculpt?  Iteratively?\n\nGiven my obsession with [spherical planet simulations](https://medium.com/@kirbyurner/thinking-globally-in-2016-f01cd34466a6), my imaginary invisible landscape was of city-like planets.\n\nWhat if Roman Civilization were to be spread, by algorithmic generators, to create realistic vistas of cities never built?  Where would the aqueducts go?  Portland has some, from Bull Run.  The terminal reservoirs were Roman-Victorian in flavor.  I haunt the ones on Mt. Tabor.\n\nNow try another civilization.  Add or subtract a technology.  The models would seem crude perhaps, yet educational.  Start with a river valley.  Now picture it urbanized.  Let the computer do the work, under the supervision of those with a strong sense of Feng Shui.\n\nI'm always in classrooms where the students want to enter into a multi-user domain together, while they're all in the same room.  The game development platforms we use don't allow for this, but the competing commercial platforms do.\n\nMy math teacher brain, in the meantime, is thinking \"why not harness this desire to socialize through game playing (remember bridge? remember card games?) and let us play something closer to SimEarth?\".\n\nThat was a real game by the way, in addition to SimCity.  In SimCity, we got to think about power plants, grids, city taxes, city services, property values and so on.  What would [a Henry George version](https://worldgame.blogspot.com/2009/12/wanderers-2009128.html) of SimCity be like I wonder?\n\nJohn has a kind of Machine Learning dynamic going, wherein software tools generate building after building, or block after block, with humans, perhaps licensed architects, registering aesthetic preferences.  \"I like this one better than that\".\n\nIn this way, human judgement and algorithm-developed architectures each play to their own strengths.  Algorithms generate a cornucopia of possibilities.  Human judges cull the field, leaving only a few noteworthy finalists.\n\nMachine Learning algorithms know how to reshape themselves based on feedback, in the form of some error function to be minimized.\n\nThe idea that architects and movie directors could interact with fractal generator city simulators sounds completely realistic if we're talking about [the movie industry](http://worldgame.blogspot.com/2019/03/portland-pacific-rim-center.html).\n\nYou want to fly around on such planets, but not necessarily build them, nor even draw them by hand.  They provide context.  They provide game boards.\n\nJohn and a long time colleague joined us afterward for lunch at Rogue Hall (Ione Building), part of Rogue Nation (the brewery). \n\nI took many pictures and was looking forward to folding them into [a next Youtube](https://worldgame.blogspot.com/2019/03/portland-pacific-rim-center.html) (I've been doing them daily), only to find out my SD card was acting up.  The computer wouldn't read it, nor would the camera after that.  Unusual.\n\nI ended up reformatting, losing all the pictures.  Fortunately, John's colleague [got it all on video](https://youtu.be/vp5OZ7P5t7I).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}