{
  "id": "306927524776479494",
  "title": "Tabor Walk",
  "published": "2010-08-24T12:35:00.001-07:00",
  "updated": "2021-03-15T23:32:25.604-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/46209241464/in/photolist-2dpmrzJ-2kmBf2p-2jnTDYv-2jbYsGD-2j8QQ2x-2cLvMC3-TwXjBf-Kkc9Jy-Kkc5W3-D2aQbz-pXKPaJ-m54k5N-bPdNDc-bsNC8j-b2ih8k-b2ig7X-9GWPHW-96i4KV-95uMAT-8JMt2q)\n\nI was roused from my pile of mattresses by Glenn, late getting started this morning, so an opportunity to partially overlap on a walk.  The New Seasons is really coming along.  We visited Mt. Tabor.\n\nGlenn has been checking with [sources](https://www.google.com/books/edition/A_History_of_Analysis/CVRZEXFVsZkC?hl=en&gbpv=0).  Exodus gets tagged for having discovered the cone:cylinder 1:3 relationship, where they both share the same base and height.  Then Archimedes got that a sphere in a cylinder occupies 2/3rds its volume.  He wanted that on his grave stone, and according to stories this is how a Roman scholar later found it, in want of repair, and had the grave site restored.  We should have more monuments to the guy and this discovery, why not?  Plus math-geometry needs its tomb of the unknown, from which many a discovery has derived.\n\nIn recent discussions with David Koski, he's focused on the analogy twixt [the cone, half-cylinder, sphere](http://www.textsavvyblog.net/2007/08/volume-of-sphere.html) and full cylinder and the tetrahedron, cube, octahedron and rhombic dodecahedron, by focusing on the common ratios 1:3:4:6.  In this case, the cone in question shares a base with a hemisphere 2/3rds the half-cylinder's volume (Glenn and I called this half-cylinder a \"tuna can\" with height = sphere radius, not diameter). If the cone is 1/3, the half-sphere is 2/3, and the sphere is then 4/3, a fraction familiar from (4/3)( pi )( r )( r )( r ).  The \"tuna can\" itself is volume 3, if the cone is 1, hence the ratios 1:3:4:6.\n\nFor the first part of our walk, Glenn's sources and the Koski conversations were a jumble and I was confused. The cone Glenn's sources talked about was 1/3rd the double-cylinder (two tuna cans), so already half the volume of the cylinder-contained sphere.  I'd only just awakened.  Actually I'd been tossing and turning, but about other issues.  The night before, I was up late watching a disturbing documentary.\n\nOnce atop Mt. Tabor, we met an intelligent Protestant (no, not an oxymoron) who wondered if we'd give him two minutes of our time, not to end with a request for money.  He had a stop watch.  I said \"two minutes is not a long time, so sure\" and he launched into a debate he'd been working on.\n\nAccording to his \"Wanderers presentation\" there's a school of thought that says Jesus was a great teacher and all, but he couldn't have performed miracles, the counter to which is that early Christianity, with all its travails, would not have gotten going based around some \"nice guy\" or \"decent human\" action figure (plus the teachings were quite radical for their day).\n\nGlenn responded with some perennial philosophy notions of avatars, descendants of deities, who periodically show up to save humans.  I mentioned a polarity, with a spectrum in between:  on the one hand, the \"miracles never happen\" group denies any supernatural phenomena as a matter of principle, while on the other hand you have a group that assumes miracles happen all the time, as a matter of course.  At either extreme, Jesus would not prove an exception to the rule.\n\nI enjoyed the \"lightning talk\" and mused how Portlanders could do \"philosophy in the park\" more often, just show up with the intent to have these debates and discussions, perhaps using these recognized templates (e.g. the two minute presentation).  We wouldn't need to have official sponsors, though I could see where some brands might want to become associated with civilized intercourse of this nature.  Beats television in some ways.  Like, we got some real exercise (Mt. Tabor isn't very high, but every calorie counts).\n\n[](http://www.flickr.com/photos/17157315@N00/4924524628/)\n[](http://www.flickr.com/photos/17157315@N00/4923929629/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}