{
  "id": "6487912434173111809",
  "title": "Task Management",
  "published": "2017-09-05T22:02:00.003-07:00",
  "updated": "2017-09-05T23:20:05.759-07:00",
  "content": "[Conway's Law](http://www.melconway.com/Home/Conways_Law.html) says organizations reflect outwardly how they communicate inwardly, and that gets me thinking about task management both individually and at more collective levels.\n\nHow we write computer programs may have an impact on how we conceptualize about multi-tasking more generally. That's something I sometimes talk about with [Dr. David DiNucci](http://worldgame.blogspot.com/2015/08/concurrency-again.html). He was at Wanderers this evening, which adjourned early on account of [unhealthy air quality](http://worldgame.blogspot.com/2017/09/vacation-time.html).\n\nIn the Python asynchronous model, a Task is like an egg working towards hatching, with an event loop scheduler checking each egg, almost round robin, until any one of them cracks.\n\nThe syntax expresses putting a wind-up toy into the mix, but how fast it unwinds depends on many environmental factors, such as the slowness, or speed, of the network.\n\nTick tick tick go the eggs, somewhat like time bombs but we want and expect them to go off eventually, and each one is enveloped in a waiting handler, less a callback function than a surrounding context, the enveloping Task.\n\nHowever, Python's means of maximizing or optimizing a single thread is only the beginning.  Spawning threads and processes is likewise possible, using tools from the same [asyncio library](https://github.com/4dsolutions/Python5/blob/master/py_async_get_chemicals.py) or other places.\n\nA procrastinator will often beat himself or herself up for delaying an important task just thought of, however queuing up stuff to do later is likewise a signature activity of the self-organized.  Putting things off is not a dodge, but [intelligent scheduling](http://mybizmo.blogspot.com/2017/03/silicon-forest-curriculum.html).\n\nLet tasks come to you and don't feel compelled to jump up and immediately attend to them in the order dreamed. Acting immediately is what we call \"impulsive\" and many seemingly important tasks will appear \"half baked\" looking back.\n\nDoing jobs in the same order you think of them may be a higher risk lifestyle than you need indulge in, is the mantra here. \n\nGo ahead and stay in [the lotus position](http://grunch.net/synergetics/gst1.html), even if your jobs queue grows in the meantime. You'll need downtime to optimize.  Seeing how to kill many virtual birds, with no real birds harmed in the process, with one stone, will be your saving grace in many cases.\n\nYes, sometimes we need fast reflexes to take over.  Things do happen too fast for a lot of, or any, conscious consideration sometimes.  However don't treat your whole life like a twitch game.  Practice the art of creative delay i.e. scheduling.  Computers do it.  Multitasking is a science and an art.  Learn to both divide, and undivide, your attention.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}