{
  "id": "8603019426034384609",
  "title": "Technical Topics",
  "published": "2023-10-12T00:20:00.000-07:00",
  "updated": "2023-10-12T11:09:16.479-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53248257922/)\n\nNot surprisingly, my science fiction turned to creating an Asylum City, in a hurry, especially for the Gazans who wanted to move here, at least temporarily. The city would be designed for mass evacuations, more a way station than a destination, and not the last of its kind.\n\nWhile I’m doodling in my head along those lines, I’m showcasing the bread and butter stack and content. Everyone in my business has a stack. I’m wearing a Supermarket Math hat now, thinking in terms of what’s in inventory. Does anyone remember LAMP? Linux Apache MySQL P-language (e.g. Perl, Python, PHP). That’s a good example of a classic stack, and a doorway into cloud-based architecture.\n\nI told Paul I thought we were in some National Geographic article, about Oregonians in October, harvesting something like beer hops, but with crazier names for strains.  Paul and I have a collaborative relationship based on a practice Glenn established.  \n\nI’ve been thinking about Glenn a lot today, and of my mother, two people I lost in the last year. Paul is a retired chef with a luxury hotel background, specializing in Anglo-French cuisine. He reminds us of our buddy Steve Holden who used to live in the same apartment complex. Yes, a past chairman of the Python Software Foundation and conference organizer who helped get the Pycons going.\n\nYou may find more about Steve by searching these journals. I tended to accompany him to these conferences he would organize, as one of the people on hand to keep things on track. Djangocon, Apachecon… some even more obscure ones, always excellent in their own way, as Steve knew a thing or two and relied on Nancy and her team, out of Orlando.\n\nRegarding the showcasing I’m doing, the embedded screen shot above is one you can click on to gain access to its original context, where a much bigger and higher resolution view is available. Here’s a direct link. You’ll find I’m going on about a certain “NCLB Polyhedron” where NCLB = No Child Left Behind, a meme from the Obama years. I was trying to get Phi (the golden ratio) a more exalted place in the curriculum. \n\nThe meme was somewhat tongue in cheek, more like something a MAD magazine might run with, versus a sober upstanding mass-published mathematics textbook devoid of social commentary. I was engaged in the andragogical practice of preserving a level of comic edginess that helps me retain the attention of certain readers (mainly fans of mine).\n\nAny number of secular mathematicians will testify that Phi is harmless and is easily shared in a curriculum context that has nothing to do with demons or devils (we’re coming up on Halloween here). I hope I’m not being too cryptic. The golden mean crops up in connection with five-fold symmetry geometric gizmos long associated with various cults (or call them subcultures) savvy about this specific aesthetic.\n\nThis version of the Notebook does not yet contain much in the way of graphics. I’m focused on sympy, the Python library, and its equation-solving capabilities.\n\nAsylum City would provide more opportunities for denizens to watch shows and start catching up on their own situation as seen from different angles. The Gazans, like the Ukrainians, would get that the world cares about them and in turn is eager to develop its generic ability to manage refugees in a humane way. If climate change hits the way some think it will, we’ll be glad for the practice.  However the need is real even today.\n\nWe have the need for skillful rehabilitation programs on a large scale almost everywhere, as people seek a better life in another set of circumstances.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}