{
  "id": "1290183232446662896",
  "title": "Tech Crawl 2016",
  "published": "2016-09-09T09:05:00.002-07:00",
  "updated": "2020-12-08T10:57:59.960-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157670370569344)\n\nI'd not been on one of these before and felt privileged to join Patrick in a night of hounding around inside some of the less [open bastions](http://controlroom.blogspot.com/2012/07/from-open-bastion.html) (lots of security) in Portland's downtown:  Puppet, Aruba Networks, Mirador, Cloud Compass, iovation, New Relic.  These were the ones we got to, plus many more were participating.\n\nWe also dropped in on The Tech Academy, given we've both served as Python mentors for the O'Reilly School of Technology.  OST has closed.  I kept some of its DNA in a test tube (not literally) in the form of OCT / RU, [a Flickr album](https://www.flickr.com/photos/kirbyurner/albums/72157654417641521) of little diagrams and such, along with souvenir business cards.  None of our proprietary software leaked out.  That would all need rewriting, and would reflect lessons learned, no need for carbon copies anyway.\n\nHowever, I digress.  What I was seeing were prototypical work spaces offering the kinds of roles those who study computer science and engineering hope to get for themselves.  Ample kitchens, friendly people, handsome facilities, right downtown.\n\nWhat more could one hope for?  We don't have Cubby Camps yet, with people doing more async out in nature.  The corporate cube farm has evolved considerably, but still loves a good 30th floor view, more of the mountains than from the mountains.\n\nIn taking pictures of the Puppet library (on display in the foyer), I didn't come across many Python titles.  Ruby looks to be making more inroads there.  Tech Academy did have a Python course.  Mirador is more a Java shop.\n\nWe see different levels in people's willingness to be polyglot.  I'll venture into Clojure, which I admire, while coding something I've coded before in other languages, [such as Quadrays](https://github.com/4dsolutions/synmods), a system of 4-tuple vectors mapping the same space as XYZ but with four positive rays to the corners of a tetrahedron, old hat to my long time readers, [check Wikipedia](https://en.wikipedia.org/wiki/Quadray_coordinates).\n\nWhy would anyone use that?  In philosophy class maybe, to introduce \"language games\" in mathematics, but where else?  Do any architects learn about A, B, T, E, S modules these days?  How about art school students?\n\nThese are not core questions pondered within the business sector downtown I don't think (not \"CBD questions\" -- except maybe at PSU, or University of Portland, in some study carrel somewhere, where following Wittgenstein links makes more sense).  I've taught the basics of \"Martian Math\" on both campuses, at one time or another, as well as at Reed and OGI, using Python mostly. CBD = Central Business District; OGI = Oregon Graduate Institute.\n\nIn other words (back to \"polyglot\"), suggesting people \"language hop\" as if that were some trivial jump, is often unrealistic, any more than an English speaker might simply \"hop\" to Japanese or vice versa.\n\nThere's not much truth in the slogan \"learn one computer language, and you've learned them all\".  Not really.  They come in families, like musical instruments do.  Learning Python does not make you a great [J programmer](http://jsoftware.com/) (APL family), though I've found them to make [a great combo](http://4dsolutions.net/ocn/Jlang.html).  Both feature a strong REPL (a rich interactive mode or \"shell\").\n\nGeeks in this day and age will tend to identify as Front End or Back End as to their stronger skill set and area of most expertise.  If you study Twitter awhile, you can pick up more buzz words, like Data Scientist and Machine Learning (additional skill sets, mostly back end, except the front end is about visualization and so is data science also).\n\nFront End means HTML / CSS and Javascript.\n\nBack End means what happens to those HTTP / HTTPS requests once received.  Is the front end a smartphone app?  Java, Ruby, PHP... Python.  Many more languages play in this space, or define the frameworks that provide yet more layers of shared person-hours.  Why reinvent every wheel?  Speaking of which, I met an old colleague from Plone days (still a popular Python CMS), still with [CD Baby](http://www.cdbaby.com/).\n\nPatrick and I went by bus (4 going, 14 returning) and wound up [at Hophouse](http://mybizmo.blogspot.com/2016/09/working-it.html) with our visiting friend Mike, in his later fifties like Patrick and I.  We've already enjoyed technology careers, against the backdrop of the PC to Open Source to smartphone revolutions.  I've spent a lot of time in cube farms, often in hospitals, or other client offices, staring at screens.  I'm still into staring at screens.\n\nThose initial waves of technology were sufficient to change the guts of Portland's economy in some ways, while in other ways much stays the same.  I'm not the expert, but I've seen quite a bit of water under the bridge, had a front row seat on some of the action.\n\nSome of my journal entries from years gone by somewhat bemoan the [loss of CubeSpace](http://coffeeshopsnet.blogspot.com/2009/03/serving-buzz.html), a US Bank building facility on the east side (not the USB Tower) that helped with cross-pollination, important when wanting to help geeks not fall into over-isolating silos.  Reinventing the same wheels over and over costs everybody.\n\nHowever the code schools, especially the ones hosting regular meetups, have helped provide synergy, in tandem with the user groups layer.  The Meetup culture has taken hold. People from different walks of life discuss their projects and share skills.\n\nWithout a \"public square\" mentality, specialized knowledge becomes over-specialized to the point of semi-paralysis.\n\nA Renaissance fizzles into yet another Dark Age (YADA) when the kind of liberal sharing encouraged by academia (traditionally) goes away.  The Free and Open Source movement was a direct extension of that tradition, per Richard Stallman at MIT, and the birth of GNU.\n\nOn a final note, I'd just been reading [Quincy Larson's impassioned plea](https://medium.freecodecamp.com/live-asynchronously-c8e7172fe7ea#.vne8bnd24) for \"more async\" i.e. less interrupt-driven open office plan setups.  He's talking about what we call Personal Workspaces (PWSs) in the GST namespace.  Study carrels.  Cubes.  Sometimes it's just office culture though, that needs to be addressed, if the floor plan is already fixed.\n\nOST was all about async and PWSs.  Mentors gave focused attention to student programs, but not in real time while looking over their shoulders.  Diagnosing program bugs on the fly is not typically how it's done.  We'd encourage unit tests, and lots of them.  I continue to work that in. \n\n\"Too much task switching results in lost productivity\" -- that sounds easy enough a proposition for the workflow architects to get.  Human beings are not [ARM chips](http://worldgame.blogspot.com/2016/09/wanderers-201696.html); they have their own specs.\n\nTech work sometimes means getting into a flow, almost a trance, like a novelist does.  I good novelist is a first reader to get the story, concentration is required.  Many novelists move to a beach cabin or some such, to get more work done.\n\n\"We need our software to work for us, not make us slaves to our machines\" -- another good one.\n\nI met up with PDX Code Guilders in one of the towers.  I'm expecting to cross paths again at the [upcoming Maker Fair](http://controlroom.blogspot.com/2016/09/maker-faire-at-omsi.html). \n\nHere's me after the Pi talk last night, modeling with said museum piece mascot:  [https://t.co/xC2MNabLvX](https://t.co/xC2MNabLvX) Pauling House on Hawthorne, PDX OR.\n— Kirby Urner (@4DsolutionsPDX) [September 7, 2016](https://twitter.com/4DsolutionsPDX/status/773571784801185792)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}