{
  "id": "4407254236878978924",
  "title": "Tell the Truth and Run (movie review)",
  "published": "2011-02-06T23:09:00.000-08:00",
  "updated": "2011-02-07T09:42:56.927-08:00",
  "content": "My thanks to Marian Rhys and Bob Smith of Multnomah Friends for bringing [this enlightening documentary](http://www.happinessonline.org/MoralCode/LiveWithTruth/p7.htm) to my attention.  I served as projectionist at the meetinghouse tonight, sharing it with a tiny elite, including Sonya Pinney and Harriet Holling, our elder stalwarts and a source of memories going way back.  Their kids were my contemporaries (hello to Sonya's Eric, Lael, Heather and to Harriet's Alice and Linda).The movie: Tell the Truth and Run, a biography of George Seldes (1996).[His brother, Gilbert](http://www.nytimes.com/books/00/11/26/specials/schlesinger-culture.html), was the well-connected arts and letters guy, friend of Picasso and James Joyce, who took over The Dial from Bucky's great aunt Margaret (with a few owners and editors in between).  These brothers had grown up in a Jewish intentional community known as The Alliance, losing their mother early to TB, and strongly influenced by their dad's engagement with world affairs and uncompromising intellect.George was on the right side of history in so many ways.  When this documentary was made, people had the benefit of more hindsight and were happy enough to pile on honors and accolades. He lived to be 104.In the actual battle for a freer press, he was the quintessential \"muckraker\" in the most positive sense, taking on the unholy alliance between advertisers, publishers, and what news that's fit to print (nothing that might hurt owner/sponsor profits, if at all possible).  He challenged journalists to live up to their own ethics (if they had any).[What were his radical positions](http://www.youtube.com/watch?v=v9UneDolVz8) that branded him a muckraker?He refused to suck up to El Duce (Mussolini) when so many were doing just that, on both sides of the Atlantic.  He was in Rome at the time, as a foreign correspondent for the Chicago Tribune, and he was eventually evicted, and might have been dragged off the train to Paris and killed had it not been for some British officers giving him cover in a hastily arranged ploy.After WW1 he went behind enemy lines and learned the average Germans were not the despicable people (\"huns\") he had helped dehumanize as a war correspondent. War itself was the enemy. General Pershing would not let him publish about the horrors of war. War correspondents enlisted in the Army were there to build morale, not question the dominant paradigm.He well understood that [the Spanish Civil War](http://mybizmo.blogspot.com/2009/11/into-fire-movie-review.html) was a dress rehearsal for Fascism versus democracies.He reported accurately on the approach of WW2, seeing the militarization of youngsters as the unmistakable harbinger of what was to come.  He already knew [the fascist psychology](http://controlroom.blogspot.com/2006/04/v-for-vendetta-movie-review.html) pretty intimately and recognized its features in his homeland as well as overseas.After WW2 he fought big tobacco companies and their huge propaganda machine.  Americans were (and are) easy targets for addictive drug pushers and their spurious health claims (\"more doctors smoke Camels\"), plus consumers wanted to believe their American dream, not explore its dark side or wake up in some \"matrix\".Lets remember that readers / viewers are often complicit, in insisting the media reinforce their world views. It's not just the moneyed who shape media campaigns.  There's an unspoken social contract whereby the moneyed end up paying for what the \"me tooers\" ardently hope might be a sustainable model of reality.  Given sufficient commitment and education, this might prove a more viable model [down the road](http://worldgame.blogspot.com/2009/11/kicking-can-down-road.html).George made a career of fighting corruption, conflicts of interest, hypocrisy, and made a lot of enemies in the process. After quitting the Chicago Tribune (too much corruption), he and his wife retreated to Vermont and set up their own four page weekly called In Fact, which developed quite a following. It reported on stories no one else would touch (such as the links between cigarette smoking and lung cancer). [FAIR](http://www.fair.org/) was in some ways a successor.By the time we get to the McCarthy Period, he's one of those vilified as a Red, along with [Albert Einstein](http://worldgame.blogspot.com/2010/07/einstein-omsi.html), Aaron Copeland, [Edward Murrow](http://mybizmo.blogspot.com/2005/10/good-night-and-good-luck-movie-review.html) and other \"subversives\".  Stoking public fears against dissenters, using [the \"Commie\" memeplex](http://controlroom.blogspot.com/2008/12/random-wanderers-post.html), was a convenient, if cowardly, ploy.  People were afraid to subscribe to In Fact lest their names show up on some FBI watch list, and the journal went out of business in 1950.George Seldes was in many ways a meta-journalist in that he discussed the business of journalism and the editorial process.  Many of his readers were themselves professional journalists.Having seen how newspapers sell themselves from this angle, it's harder to rush to their defense in [this age of the Internet](http://worldgame.blogspot.com/2004/09/note-to-journalist.html).  What if If Fact had been an on-line publication?  We've gotten to the point where money is less a factor than having [facts that cross-check](http://worldgame.blogspot.com/2005/12/omnitriangulating.html).  This is potentially good news for democracies.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}