{
  "id": "6866470966327387968",
  "title": "The Armstrong Lie (movie review)",
  "published": "2014-03-03T22:23:00.001-08:00",
  "updated": "2014-03-14T18:03:29.796-07:00",
  "content": "I watched this while \"queue slaying\" which is slang for \"my job\", which happens to be linked to another timezone, with 10 pm a witching hour i.e. I was trying to meet a deadline -- not unlike Lance Armstrong, how's that for a segue?\n\nYes, he lied.  When you're behind the false facades in a Wild West town, with so many brave fronts on main street propped up by slats, with willing true believers (fans) thronging in the streets, who would be first to let them down?  Organized religion comes to mind.  He'd become a cult leader and frankly, that's not the easiest role, whether you're a class act or the neediest of televangelists.\n\nHe wanted to rescue a sport and replace it with a fairy tale, while knowing, back room, it was all based on biomedical engineering, euphemistic for \"drugs\".  So much around \"drugs\" is really just \"adults\" not able to face reality.  We actually need those opiates etc.  What's with burning another's perfectly good poppy fields, if not seeking more control for oneself, a competing drug lord.  The hypocritical preachy self-righteousness around \"doping\" is awfully thick.\n\nSH dropped in for the last 30 minutes or so and I poured us some drinks (greyhounds to be precise).  With athletes uploading ever more bioticker statistics, direct from sensors to cloud, I could see where a cycling cult would open itself to crazy doctors, a few on to something, a human guinea pig bonanza, like Tour de France has been for a long time, Lance not the scapegoat (in my book).  Follow on the web, study the biochemistry.\n\nDoug Strain did experiments like that as a CO (conscientious objector to solution-by-mayhem):  he and his buddies lived in a freezing cold box many hours a day testing different diets, gathering data to help budget wars i.e. feeding soldiers in the field.  Doug was proud that they'd found cutting corners made for a less fit army, which could lead to losing the war.  Nutrition is not where to arbitrarily cut back.  Do so at your peril.\n\nUnder the soap opera and melodrama, with many reputations lost, is the physical feat of going from being a serious cancer case to winning one of the toughest races, with medical help.  The lies are all on top of that, but I still admire the stamina and courage involved.  Behind the curtain, he's still a mortal, not superman.\n\nSince the analogy was made:  to bank robbers returning to rob the same bank again, just to show that they could, and thumb their noses:  I'd admire such people at some level, even if they got caught, at least if it were a movie and no animals were harmed in its making.  Nor did Lance have that much choice.  He was uber-curious about his limits, as a legend in his own time.  He's a scientist, perhaps a mad one.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}