{
  "id": "3978710506941846895",
  "title": "The Age of Carbon?",
  "published": "2013-05-25T11:36:00.005-07:00",
  "updated": "2013-05-31T15:40:18.282-07:00",
  "content": "[](http://www.flickr.com/photos/kirbyurner/8822791508/)\n\nDr. Mark Hersam posed this \"age of carbon?\" question as a broad brush heuristic, a way of contextualizing his payload of technical information regarding the work of his lab at Northwestern University.  The hominids (two leggeds) have gone through stone, bronze, iron, plastic and silicon ages, maybe carbon is next or the one we're entering?  This was a Friday evening, cool and rainy, at First Congregational Church.\n\nRecalling the first international conference on fullerenes, where I was present, rubbing elbows with Kroto and Smalley and maybe that shyer guy (did you ever wonder why academics have elbow patches on their blazers? -- the better for elbow rubbing)), the bottle-neck then was \"the yield\" as memorialized in Smalley's famous remark \"it's the yield, stupid\" piggy-backing on Bill Clinton's \"it's the economy stupid\" sound bite.  Buckyballs (Bf, C60 etc.) were much more expensive than gold there for awhile, pound for pound, and much reward accrued to those labs which could supply them in any quantity.\n\nIn the nanotube business the problem was much the same, not when it came to synthesis (for balls either -- strike a match and you'll get some) but sorting, teasing apart the some 300+ varieties that all have their specific conductivity, chirality, diameter... quite a hodge podge.  Getting to interesting chemistry requires disentangling and for awhile that looked impossible.\n\nNot so, and this is where Dr. Harsam and his lab enter the picture, as pioneers of adding surfactants to give the nanotubes a way to dissolve in aqueous solution and then centrifuge the hell out of 'em.  The tubes sort by neutral buoyancy within a density gradient.  Big pharma has used this for a long time so equipment was ready off the shelf, and now the industrial correlate of Hersam's lab, founded by one of its grads, produces nanotubes in solution literally by the barrel.\n\nGraphene was the third breakthrough carbon to come along since the 1980s, with another Nobel Prize.  Buckyballs were first in line, and I remember that chapter well, as I was in my hay day at CUE, laying the groundwork for [a Project Renaissance](http://controlroom.blogspot.com/2009/12/dire-straits.html) (at least in Portland).  I rented a convertible and took [Dr. Nick](http://worldgame.blogspot.com/2012/05/twenty-one-guns.html) as far as the Bay Area.  I was on the phone with [Applewhite](http://mybizmo.blogspot.com/2005/02/ayatollah-of-tetrahedron.html) and [the BFI](http://www.bfi.org/) back then too, tasked with keeping Fuller's relevance to the fullerenes in the picture -- and that reminds me, I need to order another copy of [Popko's book](http://www.amazon.com/Divided-Spheres-Geodesics-Subdivision-ebook/dp/B00BC9N3MK/) (Koski called during the talk -- I'll call him back today). [Later: I got it for \"2nd kindle\" aka the reader on the Mac Air, good for airports].\n\nThen came nanotubes which I remember [from Chalmers](http://mybizmo.blogspot.com/2006/08/hp4e.html) (Gothenberg, Sweden).\n\nThen graphene, which Glenn has been reading about (he sat to my left at the dinner).\n\nWas the Nobel Prize pre-mature?  The science had been ingenious and skeptics had long held a mono-layer of carbon could not be stabilized.  But would this be a \"next big thing\"?  Samsung is forging ahead in this area.  When it comes to nanotubes at least, the technology continues to be aqueous, meaning the electronics may be [squirted out](http://spectrum.ieee.org/nanoclast/semiconductors/nanotechnology/graphenebased-ink-promises-future-flexible-electronics-).  These carbons are conductive, but variably.  The ingredients are there, but will we evolve the complex structures characteristic of the silicon industry?\n\nDuring the Heathman dinner (entree salmon) I asked how many allotropes we were were talking about now.  Isn't graphene just graphite pared down?  But by that reasoning nanotubes are rolled graphite and buckyballs are balled graphite -- the SP2 hybrid bonds, making carbon 3-way with electrons in change is what's common to all but diamond, SP3 with 4-way valency.\n\nTara joined us, helping with ushering people to their seats and sharing the dinner, then took off for a comedy club.  She asked Dr. Hersam about mechanical photosynthesis which he agreed was the Holy Grail right now.  Having sunlight directly power some CO2-to-methane chain was the focus of many a lab (Tara has a friend in that field).\n\nI then carpooled with Christine (another usher) back to the hood and she, Lindsey and I all watched [American Psycho](http://controlroom.blogspot.com/2013/05/american-psycho-movie-review.html) together at Blue House (Lindsey and I had not seen it whereas Christine had studied it professionally).  Before the talk, I'd been snarfing down Starbucks and fumbling with my Amazon Kindle, plowing through Mary's Mosaic (recommended by SL).  Along those lines, I found this [New York Times headline](http://www.flickr.com/photos/kirbyurner/8811908033/in/photostream/), at the Starbucks, somewhat sadly & ironically humorous.\n\nSpeaking of [Applewhite and the naming of fullerene](http://www.4dsolutions.net/synergetica/eja1.html), I did hear back from Sir Harold Kroto after we [sent him a group photo](http://mybizmo.blogspot.com/2013/04/wanderers-201343.html) from near Mt. Hood Community College (MHCC).  I've always thought he'd make a great ISEPP speaker and have said so many times to Terry.\n\nSkip Rung, head of ONAMI (Oregon nanotech) and [our tour guide that time](http://worldgame.blogspot.com/2009/11/onami-tour.html), introduced our speaker, after FEI, an electron microscope company, warmed up the audience with [some of the best](http://www.fei.com/resources/image-gallery/) micrographs available from non-optical frequencies.  These pictures are somewhat doctored (colorized) to bring out features.  Look for the new IMAX movie this November.\n\nNanotubes may be helping in [the microscope business](http://phys.org/news/2013-05-first-ever-high-resolution-images-molecule-reforms.html) given their high sensitivity, especially in infra-red (so telescopy too maybe?).  An incoming generation will need to pick up the torch and carry it.  We all need to buckle down and learn our STEM subjects (or STEAM).\n\nTable conversation also ranged into Neal Stephenson's books.  Jeff was getting into Cryptonomicon.  I mentioned the exhibit at the science fiction museum in Seattle, [the quill pen version](http://mybizmo.blogspot.com/2005/11/baroque-cycle-manuscript.html) of his Baroque Cycle. His name had come up earlier during Q&A, no coincidence given The Diamond Age with its nano-technology theme.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}