{
  "id": "8959753958617797583",
  "title": "The Big Fix (movie review)",
  "published": "2012-07-04T11:51:00.002-07:00",
  "updated": "2016-08-07T06:29:29.960-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/7538046806/)\n\nThis movie makes the case that BP has specialized in \"bad boy\" high risk game playing and has been rewarded in the past for recklessness.\n\nThe consequences of a cavalier and above-the-laws-of-nature psyche are still incalculable, but in the meantime we get some good X-ray snapshots of how the appetite for oil and its attendant sums of petrodollars, can deprive us of trillions of dollars worth of ecosystem assets, shortening many lives, human as well as nonhuman.\n\nIt's somewhat a repeat of the war of 1812 as the UK-Pentagon axis plunders and rapes North America, while the patriots drive their hippie (sometimes biodiesel) buses around, taking inventory of the devastation. \n\nGreat Britain has conquered what used to be considered more French territory.\n\nOrlando is an outpost for [British Aerospace](http://www.baesystems.com/home) and Guantanamo is where Her Majesty keeps the puppet US fall guys (the patsies) cynically undermining their own government (on paper not a monarchy). \n\n[Gitmo](http://worldgame.blogspot.com/2010/02/lame-analysis.html) (which the movie does not mention) is a potent weapon against American democracy on both continents, a violation of the [Monroe Doctrine](http://en.wikipedia.org/wiki/Monroe_Doctrine).  But the BP-Pentagon has no way of shedding [its imperialist reflexes](http://mybizmo.blogspot.com/2007/09/lampoon-harpoon.html).  That programming runs deep.  Puppets get used to their assigned roles.\n\nThe movie considers Huey \"The Kingfish\" Long as inspirational to these coastal peoples, colonized by an empire yet wanting to stay non-violent and democratic about it (having already won the Revolution).  The filmmakers have family ties to the coastal peoples themselves, although their accents are not as colorful as some of those interviewed.\n\nThe movie does a nice job of tying the story [back to Iran](http://worldgame.blogspot.com/2013/03/argo-movie-review.html) nearer the beginning, and to Saudi Arabia.  The BP-Pentagon is ravenous for more fuel, if only to carry-out its fuel-happy plans to get more fuel.  Flying jets like that is great fun, especially on the 4th of July, with colored contrails.  If some people get ill as a result, just make them the enemy -- like Louisiana is now infested with insurgent ecoterrorists (many former fishermen) which BP will fund TV and universities to help us demonize as dirty oil-covered hippies.\n\nGreg Palast is funny.  Lindsey cracked up at the \"Frankenstein machine\" remark, about how they just churn out another CEO when the last one has absorbed enough punishment in exchange for a compensation package. Other talking heads stake their reputations in various ways, carving out their positions.\n\nFrom an emailed review:\n\nThe movie is ambitious in that a wife-husband team try to take in a grand sweep of history view.\n\nThey point out various semi-obvious things, such as the fact that the military machine runs on BP etc., so one can't expect much protection from the more violence-prone based in DC, UK etc.\n\nThe dispersant used to make the oil sink to the bottom is having consequences that are still being studied.  Big dead zones in the Gulf.  Many unknowns.\n\nLots of people sick from all the spraying (the atmosphere has changed).\n\nWhat's somewhat amazing is how it's up to amateur non-scientist filmmakers to bring just about any of this to light, as the monied media have little interest in investigative journalism anymore.\nThere's a kind of born-yesterday innocence to the viewpoint, as if \"[corruption](http://worldgame.blogspot.com/2015/09/investigating-how-things-work.html)\" were only just now being revealed.  We need a better word for the fact that world history does not always unfold according to our imagined ideals.  Of course it's a struggle to resist colonization and enslavement by one's fellow humans.  We have a pattern of forcing one another to work against our own best interests.  The right and freedom to pursue happiness?  Really? Even for \"little people\"? What will they think of next?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}