{
  "id": "8771579023492762740",
  "title": "The Parable of the Amusement Park",
  "published": "2012-09-30T12:59:00.002-07:00",
  "updated": "2022-01-10T12:25:21.930-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157631661448363)\n\nMy brand of Quakerism is designed like Oaks Park, an amusement park in Sellwood.  Some rides have criteria, for safety reasons, like you need to be \"this tall\" (a ruler is shown).\n\nIn Quakerism, which is [a way of doing business](http://worldgame.blogspot.com/2012/09/attenders-to-spirit.html), as well as worshiping together, the \"rides\" are the \"committees\" as well as other activities / events.  Committees meet on a schedule.  \n\nBesides \"rides\", we have other \"games\" and \"amusements\" which some may say sounds un-Quakerly but this is an analogy.  Sometimes I use \"the circus\" as a metaphor for Friends, or \"the carnival\" (from which culture [the word \"geek\"](http://worldgame.blogspot.com/2007/06/nightmare-alley-movie-review.html) arises).\n[](http://worldgame.blogspot.com/2012/09/attenders-to-spirit.html)\n[\"Membership\" is not a criterion](http://worldgame.blogspot.com/2012/09/attenders-to-spirit.html) for going on or not going on rides, with the exception of the process called \"becoming a member\" (usually once per lifetime, like birth and death, although if you count transfers, then more often).\n\nYou may become a lifetime member of Friends, and that's one way of showing your commitment.\n\nYou may resign your membership when it's time to move on, either because you or your meeting thinks so (separations may be amicable, not closing any doors, or may be more abrupt yet open ended), or when you think membership in a given meeting might be less representative of your ideal park-goer, your preferred brand of Quakerism, and so you revert to original non-member status (the game posits \"non-member\" for newborns, but the \"birthright\" reflex might well be there, and in both parents).\n\nYou may dream up your own scenarios, about how one's membership might ebb and flow.  For some people, the chapters turn not around membership (as a concept), but around which meeting (as a place). Whole meetings disappear (we don't always talk about that), and members of those, not making a transfer... yet another way to simply [fall through the cracks](http://mybizmo.blogspot.com/2006/10/terminal-movie-review.html), as in any bureaucracy (so many have no nationhood, on this United Nations Day).\n\nPerhaps you think your meeting's membership lacks imagination and stubbornly prevents new rides from being installed, ones the kids would love.  So you turn in your badge, your card, without surrendering any of your \"inward weapons\" i.e. you're not leaving the park, nor even dropping your ideas for new rides.  You become more active than ever, sounding less hypocritical when you blame the members, who have agreed, after all, to be held accountable.\n\nA visiting member from another meeting might only consider a transfer if the new meeting had similar practices around marriage.  A given meeting might be well advised to be up front about its marriage practices when clearing new members, either newly convinced attenders (convinced to become members), or members of other meetings, looking at possibly transferring.  Don't take for granted that all meetings play by the same rule book.  Meetings differ in character.  If you're concerned about your meeting's character, consider showing up at Business Meeting and playing a role.  Ride the rides.  Do the work.  Participate.\n\nTrue, you might be more effective if officially based elsewhere (overseas?), even while participating here.  Perhaps some meeting has a \"secret membership\" status you can obtain, until it (the secret meeting) comes out of the closet as a new Meeting, fully formed (if members can have \"closed committees\" then maybe non-members can have \"secret meetings\"?).  Or maybe there's a Swiss bank for Quaker memberships.  Or perhaps that's all happening within your own meeting (or in your own mind (where things can get complicated)).\n\nFor this reason and other reasons, people resign and take up membership in different meetings (or they don't, or they resume membership, come back from retirement, in the meeting from which they earlier resigned).  They'll say they're moving out of town but sometimes it's about not getting along with their meeting.  They find a new meeting that more suits them.\n\nAlthough it's called \"a transfer\", it's also a process, or a ride.  One becomes a new member of the new park, and rides the \"becoming a member\" ride.  If practices are different in the new meeting, that may take some getting used to.  Some more degenerate meetings may have whole rooms or basement closets blocked off, \"restricted to members only\", a perversion of what it means to serve and spread joy.\n\nIf you're a member, you're a card carrying, bona fide, certified Friend; it says so right on the label.  Other participants in the life of the Meeting may choose not to brand themselves in quite that way, perhaps to spare other Friends the trouble of knowing about other affiliations, none of which are unrespectable, let us stipulate, but labeling oneself a member of a specific meeting just might not fit the bill.\n\nSay there's another amusement park you belong to, and people there will feel betrayed of you make Oaks Park a spiritual home, as if one could not have two bases.  Maybe you're not able to use your legal name and don't want to dupe Quakers into granting membership to some alias.  Yet you wish to fully participate and the people in your meeting want you to as well.\n\nSome of them know of your circumstances and understand why you cannot be public about some religious affiliation.  Yet the business is important and you want to see it done well.  You have skills in that area.  You're someone to consult.\n\nThe business might go differently were you to withhold your participation, however fortunately you see no reason to do that (pull back) since, as a non-member, you nevertheless have equal access to the decision-making process, committee service, the rides.  You know how the money is being spent.  You know what goes in to making up the various teams, planning the various activities.\n\nEven if you're not a member, none of the rides are denied you in my park and you're a full participant, you're just not card carrying, whatever your story.  And that's OK.  Becoming a \"member of Oak's Park\" is just one way to register and demonstrate support, one of many ways to contribute to the life of the Meeting.  Having members is a benefit, helps the park, as long as the institution of membership does not get out of hand and out of control.\n\nHistorically, a \"member\" was more like a \"block\" in football, bulky not with mass (though maybe with that too) but with \"social inertia\".  You had title, ties, landholdings, and therefore could not be messed with to the same degree as most \"little people\".   Early Friends were bullied a lot, as they tried to stand up to the recognized authorities.  Their fortunes changed when their closet admirers started coming out of the closet.\n\nGiving\n members some more powers on paper helps satisfy the state that there's a\n way to single out culprits should a legal case arise.  A service \n(valuable) performed by members is they make themselves culpable.  This \ndoesn't mean non-members are insensitive to their risk taking.  Members \nare a front line, protecting some of the more fragile / hidden Friends \n(more private) with their public-facing (sometimes intimidating) \npresence.  Members give \"a face\" to the enterprise.  -- from my Facebook profile\nIn joining Friends as an overt member, you were signalling that this Society was not to be messed with.  You were taking a stand by putting a lot on the line, but were perhaps already privileged enough to be able to pull it off.  Eccentric, maybe, but not to be denied your freedoms, not to be committed to some state sanitarium or penitentiary for some \"crime\".\n\nOther Friends in contrast, just as committed, but unlanded, not socially privileged, might conceal their participation in case the boss would find out, which could lead to being fired.  Being a member of a \"Peace Church\" while working in a military setting might be less effective than asserting one's command and control responsibilities in a manner that seemed Friendly.  Declaring membership would not be strategic, would force hands that shouldn't be forced.  A more delicate touch may be needed.  Such a \"closet Friend\" should not feel less included, less a participant, in the Friends tradition.\n\nSo as a soldier, you don't necessarily carry a card, claiming membership.  You support your meeting in other ways, perhaps [from a distance](http://worldgame.blogspot.com/2009/01/repatriation.html) (and in Cyberia, what is distance?).\n\nOne day, a group of Oak's Park members maybe got it into their heads that it's their exclusive privilege to ride some of the rides, and until you become a member, you have no access to said event, activity or amusement.\n\nTrue, not everyone gets married.\n\nNot everyone chooses to take this or that workshop.\n\nBut to actually bar / prohibit non-members from riding particular rides?  That wasn't part of the original design in my book.  Oak's Park would go broke in a day with such a philosophy.\n\nA member is someone who is saying \"this amusement park is good enough for me\" as in \"I am at peace here\" or \"I could die here\".\n\nA non-member may be in a different orbit, but part of what makes the amusement park a valuable experience for park goers is its equal treatment of members and non-members (including members of other parks).\n\nThe fact that some people become card carriers, public to the world about their affiliation, get the tattoo, is not a signal to the others to stop coming or to go away, or to stay out of Quakers \"internal affairs\" as if they were somehow second class, being judged as such  It's not as if recruiting new members were the whole point of having an amusement park or an art museum, with all the big rewards at the end of that tunnel. \"Becoming a member\" is just one of the rides, one of the rituals (like getting tattooed).\n\nWhat Quaker theology is not:  joining Quakers as a member is about saving your soul, with attenders second class lurkers who are wondering about becoming saved and see membership as their ticket to gaining salvation.  Again, that's not what Quakers believe.\n\nQuakerism, as a practice, is about being effective in the world by taking seriously the dogma of the Light within each person.  We are led by the spirit rather than by individual ego.  If we remain attentive to that spirit, we will find ourselves in greater unity than most ordinary business meetings might achieve.  We find ourselves in the same conspiracy, synchronizing trans-personally (supra-personally).\n\nTrue, attenders are in many cases our next members in the making, at their prime in terms of inquisitiveness and wanting to run integrity checks, test institutions, develop their talents and skills, learn to work in groups, seek consensus, trust the spirit.  All very valuable.  Withholding such learning experiences is not what Quakerism is about.  The park's aim is to be generous with its many safe simulations, models for the workplace and government.  There's an eagerness to share.\n\nFor a meeting's membership to deny these opportunities to attenders to participate on some committees would be a grave perversion of the design.  Beware of meetings that close Nominating and Oversight to non-members on principle, or won't let attenders on clearness committees, including clearness for membership.  I'd consider resigning if I were in that position, where a meeting had degenerated in that way, and then stay active, as an attender, to achieve a more intelligent structure.\n\nHaving more of your life ahead of you means now is a good time to learn from the simulations, which is what rides are in many case (Property, Program, Children, Care & Grievance... Weddings, Deaths).  \n\nHaving access to all the rides is how they / we become convinced they /we want to be members (and continue to rub shoulders with all the great attenders who bless \nthe meeting, at all levels of service).\n\nDenying a person access to a ride on condition of membership is arm twisting in a way most art museums could not afford either.  Members may get a discount, but discrimination against attenders would rule out most of the tourist traffic, from whence future members will come -- a descending / degenerating spiral that would kill the art museum in question.\n\nCelebrating membership is one thing.  Members-only parties or committees is another. \n\nGet too cliquey and focused on membership and you'll forget your public, your fans, your next generation, the people your meeting should treasure and welcome.\n\nKeep your rides open to be enjoyed by all, and you'll get your best people.  Focus on safety and quality of experience, not who wants to carry a card.\n\nYou have a Nominating Committee.  Evaluate people on their merits, attending to who expresses a leading, put also thinking about wall flowers.  The opportunity to serve comes in many forms.  People join committees just to get to know each other better.  What better way to learn about people than to do business together? \n\nHave both members and attenders on this Nominating committee and don't worry too much about which is which when seeking to nurture the meeting.\n\nAn experienced activist attender with plenty of experience with Friends and their ways, both in your meeting and elsewhere, might make a brilliant clerk.  Never overlook attenders when it comes to filling top positions.  [Make rotation work for everyone](http://controlroom.blogspot.com/2007/12/management-by-rotation.html).  Experienced members will always remind one another of this responsibility.\n\nDon't pass any rules that would forbid that from happening.  Keep your Business Meetings empowered to consider all options.  That's the design I urge, when discussing Together Friends.\n\n\"There is Silence, and there is blah blah rant rant.\"  \n-- old Quaker saying",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}