{
  "id": "5394175904510290549",
  "title": "The Berlin File (movie review)",
  "published": "2016-01-17T18:04:00.002-08:00",
  "updated": "2016-01-18T15:51:25.889-08:00",
  "content": "I chose this pretty much at random from the foreign country shelves at Movie Madness.  I spent probably as much time with The Making Of.\n\nI was maybe curious how a Korean-made film would work with Germany, but it wasn't that hard to make a seamless blend, as Korea, like Germany, has taken the full brunt of the Cold War.\n\nI recall being in Berlin myself when the wall was still a serious obstacle to one's freedom of movement.  Our train from Scandinavia was through East Germany to East Berlin whereas our US passports granted us access to the West.  Dad liked crafting obscure itineraries like that.\n\nDirector Ryu portrays a divided Korea fighting a Spy vs Spy war against the back drop of Berlin.  The budget was about $10 million.  It's a full-blown award-winning international action thriller in style, but without the distribution of say a Miramax.  The film was made in 2012 on location (in Berlin) but also in Latvia and Korea.  Getting the weapons to match in all three places was something of an ordeal.\n\nThe director imagined the film as contemporary to the point of futuristic by a few years and didn't want any dated ordnance such as Korean audiences were already used to.\n\nAs a non-Korean, I miss a lot when it comes to catching any [nuances about language](http://beyondhallyu.com/film-tv/korean-films-in-review-the-berlin-file/) and am glad the Making Of movie was explicit about that aspect of the movie. The elite / elitist spies on the North Korean side apparently spoke with an accent that signified their higher social class, reflective of spoiled brats from oligarchical families.\n\nThe paradox here is the Communist Republic is ideally class-free (the US value of \"equality before the law\" i.e no special rights, by dint of birth, is not that different), so having the spies wear their social class on their sleeves, so to speak, made for a more curious effect in the mind of a Korean viewer.\n\nApparently language usage patterns are by now different enough between North and South, that the South Korean actors found affecting realism a challenge  (the \"bad guy\" worried about getting it wrong).  Someone in the background was advising for authenticity.\n\nAgain, I missed a lot, though I did catch the reference to [John le Carré](http://worldgame.blogspot.com/2004/10/john-le-carr-on-bush.html) (the book passed between NIS and CIA).  Indeed, towards the start of the film I lost track of who was who at first.\n\nBeing a spy requires keeping track of plots within plots, with the story always taking surprising twists and turns.  An inability to either hatch or follow intricate plots is a self-disqualifying trait if you wish espionage as your occupation.  Those eager for such a career path need films like this for practice.\n\nAs one of the narrators points out (the director himself as I recall), the story is about people with concealed identities struggling to find their way in a foreign country and getting left out in the cold, as the wheels turning in the home country power centers get out of sync with what's going on in the field.  Heroes are abandoned or betrayed by their own headquarters, a common theme in spy novels.\n\nI was reminded of The Americans, [the TV show](https://youtu.be/cdFVP-lXtAE), because of the married couple under cover.  This Korean couple has given birth to no kids yet however (spoiler alert).  Also, Germany is not as much a direct target of the North Koreans' spying, whereas in The Americans the host country is also the primary country of interest.\n\nI was also reminded of [Farewell](http://controlroom.blogspot.com/2012/10/farewell-movie-review.html), for its centering on a Cold War fought by embassies in a European capital, though not Berlin.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}