{
  "id": "3944584485080465231",
  "title": "The Brainwashing of My Dad (movie review)",
  "published": "2016-11-15T15:03:00.002-08:00",
  "updated": "2018-11-13T14:49:07.910-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/25332023439/in/dateposted-public/)\n\nThis crowd-sourced Kickstarter documentary is the project of a loving daughter, Jen Senko, who was alienated when dad bought into the fanatical cult that is Goldwater talk radio (John Birch etc.).  Jen was more of a hippie, anti-Vietnam war, the kind of bra-burner Nixon was outraged about.\n\nThe aging hippie generation belatedly gets around to learning more about PR skills, which the Goldwater crowd felt it had to learn big time, or die.\n\nLiberals were a more complacent majority back then, taken by surprise by the Reagan years, so soon after Nixon's humiliation. Vengeful feelings over Nixon's impeachment lingered, and Bill Clinton took the brunt of it.  There could be no president Hillary (it's easy to say that now).\n\nYes, the Goldwater folks had to go back to the drawing board and create a whole new media empire from scratch, with Fox News the crown jewel.  The Imams (pastors) got in on the action, as \"Mosque Morality\" (the prevailing church orthodoxy -- [anti-GLTBQQIP](https://mail.python.org/pipermail/edu-sig/2015-May/011263.html)) was highly offended by the free love sexual revolution engendered by the pill. \n\nThe documentary doesn't touch on these hot button issues much i.e. it does not go deeply into what the disenfranchised \"moral majority\" (so-called) was reacting to.  Just calling the Goldwater folks \"racists\" or \"misogynists\" doesn't get us anywhere.\n\nIt's not that I'm \"against name-calling\" in some holier than thou sense -- there's no way to not name -- I'm just more respectful when the analysis goes deeper.\n\nHippies studied pretty hard, some of them, and a fringe even got into [geodesic domes](http://mybizmo.blogspot.com/2009/01/about-habitats.html).  J. Baldwin admits the domes leaked at first and took responsibility, saying he leaked (hah hah) the numbers to Whole Earth Review before NASA (i.e. Joe Clinton) had fully debugged its programs.  Good story.  He told it at the Fuller Symposium, the last time I met with [Ed Applewhite](https://mybizmo.blogspot.com/2005/02/ayatollah-of-tetrahedron.html).\n\nI have a collection of old Whole Earth Reviews (as distinct from the catalog) and do appreciate the writing that went into them. Yes, I think medications (drugs) had something to do with it.  The psychedelic counter-culture was called that for a reason.\n\nHowever, for all the interest in a design science, the Boeing engineers and like that stayed hooked on military-industrialism with its prime contractor irrigation system, to the detriment of our global living standards. Too few hippies went into engineering? Helicopters were misappropriated.\n\nI'm thinking both major parties are dead by now, and need to reinvent themselves or face the music.  Lets see what happens.\n\nI'm still hoping STEM or STEAM pulls us back from the brink, but unless that means saying the word \"tetrahedron\" with greater frequency, it won't have the integrity.  We've seen some positive trends at least, [like in Nature](http://mybizmo.blogspot.com/2015/12/global-data-global-matrix.html).\n\nMy morality is not quite left liberal in that I'm not offended if someone says it's possible to be gay by choice.  Lets accept that's true for some people, big deal.  That's kind of what \"bi\" means, no?  Some gays get all bent out of shape if you say for some it's a free choice, as if it's only \"moral\" if it's genetic or something.\n\nAlso, I don't see legalizing \"gay marriage\" as all that wonderful a civil rights victory, as \"marriage\" is but one of many contractual agreements, not necessarily the best, at least not for everyone.  My wife and I were a business partnership first. I'm not that crazy about diamonds as a gemstone, either.\n\nBut then who cares about my opinion?  I'm not trying to make the whole world think the way I do.  I do think the US would be less hypocritical about protecting freedom of religion if it lightened up about [non-nuclear families](http://worldgame.blogspot.com/2014/07/serious-about-soaps.html) though.  I've given that topic a lot of column inches already.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}