{
  "id": "9111689436073501399",
  "title": "The Heat (movie review)",
  "published": "2013-09-21T23:34:00.000-07:00",
  "updated": "2013-09-21T23:54:06.855-07:00",
  "content": "Having the FBI lady meet the USPO lady in a bar made a lot of sense as both the FBI and USPO are government pressure cookers where people of varied ethnic background are expected to get lots of work done, sometimes really difficult work.  Ethnicity gets in the way sometimes, or makes for a diverse crackerjack team.  It can tip both ways depending on the day, if the team is still bonding.\n\nThe \"team\" in this movie is a duo and spans a stereotype range in the night sky (of stars), roughly from Sandra Bullock to Rosie.  A particular spectral band of womanhood post Wild West chapters, the gun toting still there, amped up even.  Rosie has a fridge full of guns, which Sandra admires.  No, I'm not making fun of the actresses by calling them by these wrong names.  They are both hardworking and competent.\n\nThe nerdy girl complex targeted by the FBI closely matches the nerdy Osama tracker's in [Thirty Dark Zero](http://controlroom.blogspot.com/2013/02/zero-dark-thirty-movie-review.html) [sic].  The homework pays off, redeeming these strong readers from wallflower unpopularity.  We spend a lot of time on the lonely lady's high school year book, speaking volumes about the \"to whom\" this movie is addressed.  Rosie is from Jersey City where I probably taught her sister's niece or something.  Just kidding.  Any resemblance to non-fictitious people or places is purely coincidental (except we're allowed to say Boston).  All my best to both characters in their policing careers.  \n\nThe film is out-and-out comedy, tongue-in-cheek to the max.  This helps offset the believability.  Girls are being pushed by urban America into a life of fighting crime.  That's what Americans do.  We have good people and bad people and tourist attractions if you're just visiting.  Not like we're imaginative or anything.  And even if we're cops, we're free to abuse alcohol all we like.  Whiskey gets a field day, as does Mercedes.\n\nThe cathartic violence against the \"john\" based on Rosie's mind reading powers, rewards its primary audience with instant street justice, the kind of gratification they're there for.  If you're an anthropologist, new to North America, and want to learn some ropes, see this film, not just Borat.  See it at a brewpub like I did, one that happens to show movies, eat some pizza, down some beer (they were out of 20 oz pints so I got two of the 16ers).\n\nWas it risky to target an albino for the kind of joke where you make fun of someone's appearance?  The movie insists its harmless slapstick, basically vaudeville.  People are just funny, what can we say?  The other guy spoofs \"bad actor\" and that dovetails with our unconscious expectations.  But this film is more wicked than predictable.  I'm not going to diss it, so much as hold it out for anthropological study.  I'd like more psychological anthropologists on the job, not shrinks so much as people who analyze culture.  Saw a bunch [at Reed College](http://controlroom.blogspot.com/2011/04/roller-coaster-at-reed.html) that time.  Impressive.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}