{
  "id": "4202991709741915257",
  "title": "The Day After",
  "published": "2007-11-23T10:03:00.000-08:00",
  "updated": "2007-11-25T16:48:30.788-08:00",
  "content": "Thanksgiving was a milestone this year, in many dimensions.  Our family gathering shifted to Mary's place for this joyful occasion. We had a series of toasts, including one for dear Dawn.Howard told the story of finding himself upside down in his truck in Nowhere, Alaska, ending with a clean bill of health and discharge from the hospital -- a freezing sunrise in Fairbanks, a cold wait for the train (the life flight in between had translated him some 150 miles).The pies we brought, made by Tara, Ruth and Elise, were from freshly picked pumpkin and eggs from the farm.I showed up in my Costco leather jacket with a sheepskin lining and my beaver felt hat with the horse hair braid, Chicago style band, my name on the inside, a good match for Steven's way cool  leather one.  Mine is by Paul Kaufman, the Portland hatter, was made for me years ago, although reshaped more recently.Later last evening, Les and I joined a small desserts party hosted by technomad and electronics wizard [Steven Roberts](http://microship.com/), a denizen of our neighboring [Republic of Perl](http://controlroom.blogspot.com/2006/07/brought-to-you-by.html). There I had the good fortune to listen to Sky's intelligent interview of the vivacious [Roz Savage](http://www.rozsavage.com/).I showed off my own higher learning by correctly attributing the verb \"[galumphing](http://www.urbandictionary.com/define.php?term=galumphing)\" (Steven used it) to Lewis Carroll's Jabberwocky.Les and I exchanged meaningful glances when Roz said \"[gobsmacked](http://www.worldwidewords.org/qa/qa-gob1.htm)\" (I so enjoy that British language, so not often heard in these distant parts).I've decided to add some Google Analytics to my picture, starting today with my [Grain of Sand](http://worldgame.blogspot.com/).  Depending on my boredom level, expect to see mention of some of this data in future postings.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}