{
  "id": "5237241819776215023",
  "title": "The Throwaways (movie review)",
  "published": "2015-01-25T23:00:00.002-08:00",
  "updated": "2015-01-26T15:02:45.645-08:00",
  "content": "I learned a lot this evening, from the documentary certainly, but also from the intro and Q&A.  The Clinton Street Theater has gotten more active and into a groove with KBOO, which is groovy, no complaints from my corner.\n\nI don't go to that theater as often as John Waters says I should (fun clip), but Alexia's loyal participation in Rocky Horror on Saturdays maybe counts towards my good will karma.\n\nWe were fortunate to have one of the co-directors, the behind-the-camera guy who films Ira, the big affable gent on the system's throwaway list, as the system has no need for talented documentary makers with prison records. \n\nCable TV, on the other hand, does, and Ira is a poster child for those 1980s and onward public access studios the cable companies were asked to make, in exchange for mining the populace.  I've availed of the same resource, as did my co-workers [at CUE](http://worldgame.blogspot.com/2006/01/peanut-butter-bonanza.html).\n\nIra did exactly what sociologists who envisioned this symbiosis imagined should happen:  he turned his camera on the surrounding social ills and produced content for a concerned community audience.\n\nThe film poses some serious questions.\n\nWhat is the fate of those [decrepit city neighborhoods](http://mybizmo.blogspot.com/2014/08/visiting-downtown-detroit.html), with every child left behind?  Do those face gentrification, demolition, or the continuing malign neglect?\n\nArt colonies, connected with universities or not, sometimes do wonders for a neighborhood I don't deny it, so I'm not saying one scenario fits all, yet I think brand new cities, such as [Old Man River (OMR)](http://controlroom.blogspot.com/2010/02/news-we-could-use.html), deserve their day in the sun, so our generation might lay claim to some bold experiments, not just dreary wars. \n\nLet a lot of people start over, build it in to our workflows that they can.\n\nThe days of exporting your loose ends to Australia or North America are at an end.\n\nIra's story tells of the new Jim Crow laws, which stigmatize him as a felon who keeps paying his \"debt to society\" long after the years in the Staten Island prison have been served.\n\nDenied food stamps.  Ineligible for most work.  He's a throwaway on paper.  He doesn't buy that though.  He gets local cable station training in video making and now his award winning collaboration is traveling the country.\n\nIn Portland, the movie got itself a packed house, thanks to KBOO and its affiliates doing a good job of spreading the word.\n\nAs students of the Civil War well know, making slaves and later corporations into persons might happen in legal language, but society is often slow to see the benefits of following rules.\n\nAfter the war, many slaves continued working the same property not as slaves, technically, but as serfs.  Slavery became feudalism.  Keeping the old apartheid system going was the name of the game.\n\nDenying former slaves the vote became the object of an intimidation campaign with [the KKK](https://www.flickr.com/photos/kirbyurner/14819471913/in/set-72157646244323202) an overt symbol.  [The movie Selma](http://worldgame.blogspot.com/2015/01/selma-movie-review.html) recapitulates that chapter.\n\nFast forward to 2015 and the old trigger-happy conditioned reflexes remain, possibly senseless but still engrained.\n\nJo Ann Hardesty played a leading role in introducing the night's program and clearly had many fans in the audience.  She hosts [a regular show](http://kboo.fm/VoicesfromtheEdge) on [KBOO](http://kboo.fm/).\n\nA grass roots health care initiative aiming to cover Oregonians with something more coherent than the usual patchwork invited us to a rally in Salem.\n\nI was encouraged to see people exercising their prerogatives as bona fide stakeholders in ongoing community debates, and perhaps plans for a more democratic tomorrow.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}