{
  "id": "8239772732783877233",
  "title": "The Redacted Investigation",
  "published": "2019-04-19T23:30:00.002-07:00",
  "updated": "2019-04-19T23:32:14.481-07:00",
  "content": "I keep going back to [this story](https://www.apnews.com/3187ffc2e9d641f19d61e685f3da9dc2).  Why not pursue?\n\nIt'd be like that \nSkripal case, where the accused GRU agents, posing as tourists to \nSalisbury (as if there were anything there) smuggled nerve agent in a \nsealed perfume bottle, latter discovered by hapless dumpster divers. \n\nBrits saw through their cover story \nimmediately, having grown up on John le Carré spy novels and knowing a \n\"likely story\" when they see one. \n\nPut all these GRU guys, who supposedly \njumped to their feet when Trump said \"get those emails\" (Hillary's missing), on CNN (like \nthey did for Osama). \n\nThey'd have to send a team to Russia and true, you're\n not in jail in America where the cowards threaten you even before \ntrial.  I don't want sleaze balls getting involved.\n\nThe reaction when Putin made \nthis offer was \"no fair, the president trusts Putin more than us\". In \nlight of what the president considered a \"witch hunt\" this was in no way\n surprising. Still, it seems the Mueller \ninvestigation had nothing to lose by at least gathering more evidence. \nThe GRU guys would be confronted with the same forensic evidence that \nconvinced the grand jury. \n\nWe could all learn a ton about the technology\n used to leave or remove fingerprints, as when trying to conceal one's \nown moves and/or frame others.  The public has \nproved that it has an appetite for this kind of stuff.  Trump saw a way \nforward with potentially high TV ratings.  Is it really too late?  I\n guess the FBI (special prosecutor) closed the investigation without \never caring to actually interview the indicted foreign nationals.  They \nwanted to extradite first, get the alleged criminals into custody, where\n they could be put in solitary and otherwise mistreated (ala Chelsea \nManning).Obviously the Russians were not about to \nturn over their own military officers to a foreign power on flimsy \ncharges, before ever seeing a shred of forensic evidence. \n\nDismissing \nPutin's offer out of hand, after the US president said he thought it \nworth pursuing, proves beyond a reasonable doubt that the president has \nvery limited power.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}