{
  "id": "5930503773086709336",
  "title": "The New Year Begins",
  "published": "2024-01-01T12:44:00.000-08:00",
  "updated": "2024-01-01T12:56:20.189-08:00",
  "content": "I woke up to discover my Github repos, the Jupyter Notebooks, are no longer  communicating embedded graphics to the viewer. I changed nothing. Something changed in the machinery. The very same Notebooks viewed through nbviewer or colab are still showing all the images as before. I filed a post about my issue in the community discussion area. Presumably I'm not the only one affected and maybe they'll find a fix.\n\nI've been posting publicly somewhat more often, making comments on YouTube. I also tried to post a review of Alec's Bucky bio to Amazon. The first attempt was rejected, probably because I mentioned it was first published elsewhere. On this second attempt, I went with new prose.\n\nNow I'll upload an example YouTube comment or two, both from today:\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj23aAQRQ9NOPDbOkCxnDvGkjcMQZq0PHBJXWZCYNpn2p0uwXJJ6pek0sqbCN2FIq0EUq8sEo6biPbIXAqHRERIZoD-Chk3Dc6W3bPZ3y4yuIBu77iINqX47cHd6Wc6aTpl7HFeh125LEA_faUxWLRbmT7c_5P1qI7P5qi2NbH0pSN75irykIK-/s1710/Screen%20Shot%202024-01-01%20at%2011.56.14%20AM.png)[link to YouTube](https://youtu.be/-rrtxTz8NfE)My comment:I agree with Brie that the core of the insurrection was the fake electors scheme. A. Dershowitz says no, there has to be violence for it to have been an insurrection. That’s where the mob violence of Jan 6 comes in, which could have been so much worse. The brains did the dirty work with the faux legal maneuvers, the brawn came from known thugs summoned to the Capitol to scare lawmakers into following the subversive scheme.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgf4zEWTkUWW0N_UvyDsznPmEa3x8u1SmPda-FrBYM-VQgymBVJGpiHumsDiF3TtH7U6SYoohd3E4JP2qZhcJLGOMeLUtwsD6koYnMLmT0dULnGn0wFQvMB-1SLVyJ8XI0WOL4FCsow9ftLqI4Q3cbU4s7cnsY_jJbb6yBoQPCF8l2SWGZyh2qa/s1716/Screen%20Shot%202024-01-01%20at%2012.08.02%20PM.png)[link to YouTube](https://youtu.be/DMNo9QA1G6s)My comment:The CrowdStrike narrative (not FBI’s) that Guccifer 2 got emails from Russia is in the Congressional Record, but was never proved. CrowdStrike was notably weak on producing forensics to back up their story, and in fact confessed to not having any per VIPS (Veteran Intel Pros for Sanity). The story that Russia was behind phishing the Podesta emails (not the missing ones Trump alluded to) seems primarily aimed at shaping public opinion (they played the same card with the Biden laptop story). My own opinion was not thereby shaped, but I guess it worked on MeidasTouch folks. Always trying to associate Trump with Russians is BlueAnon nonsense.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}