{
  "id": "8914491748608642526",
  "title": "The Girl Next Door (movie review)",
  "published": "2015-03-08T22:19:00.001-07:00",
  "updated": "2015-03-09T15:55:42.789-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/16767593845)\n\nWhen I told Glenn S. I'd recently viewed a documentary compilation of Sex Ed films, USA / vintage (lots aimed at military men overseas), he immediately recommended The Girl Next Door as follow-on viewing.  He was on target as usual.\n\nIt's a coming of age movie aimed at vintage high schoolers especially, not just males but also females who study them and their competition, with the accepted stereotypes (remote Asian genius; stuffy oldsters who loosen up at the club) already ensconced.  Stereotypes are not a \"no no\", they're stock in trade in the movie industry.  Just because I run across a stereotype doesn't mean I'll think ill of a film.  [Some films](http://worldgame.blogspot.com/2004/12/team-america-world-police-movie-review_04.html) are all stereotypes and cliches.\n\nThe main stereotype this movie wants to explore is that of \"porn star\" and how the porn industry relates to Sex Ed, our could, if we'd let it talk about [LGTHBQQI](http://mybizmo.blogspot.com/2014/06/gay-pride.html) (H = hetero) in a classroom \"driver's ed\" style context (but maybe with fewer horror stories?).\n\nThe aforementioned documentary focused on how the Christian Right had used the Reagan years to preach abstinence, as this was the decade of the Church Come Back.  Or was it two decades of anti-liberalizing backlash puritanism?  Depends whom you ask I suppose.  HIV had a lot to do with both the need to be explicit, and to curb certain behaviors.  Biology is serious business, regardless of ethnicity.\n\nFor every hundred or so women you'll meet who chafe under patriarchal oppression,  you'll find a woman willing to boldly state that her side of the species is running the show.  Men are hopelessly outclassed by the fairer sex.  Is there a way it truly is, with only 1% getting the right picture?  Subjectivity trumps objectivity in this case.  The world is how one experiences it, but the higher levels are \"what you're adding\" as est put it; that's your \"value added\" in other words (the post-production cutting room is between your ears).\n\nWe had a guy at Wanderers recently, at a meetup I missed, claiming he'd developed the hypothesis of greater turnover among women i.e. they've been having shorter generations between birth cycles than men.  I'm not sure how he works the math, but the upshot is:  he thinks women have had that much longer to evolve and are literally a superior species to men, though sharing most chromosomes.\n\nSpeaking of chromosomes, now that DNA testing is not the super expensive undertaking it once was, a lot of data are coming in.  Things we thought were true may not be, such as that one's physical gender characteristics are XY- or XX-determined.  Nature is offering up more anomalies than the original theory could accommodate.  I won't advertise up to date knowledge of intersex phenomena.  Lets turn to the [web] [pages of Nature](http://www.nature.com/news/sex-redefined-1.16943).\n\nSpeaking of Glenn S., I heard from Glenn B. recently, another Glenn I know since our senior year together at [International School, Makati](http://mybizmo.blogspot.com/2006/06/high-school-memorabilia.html).  We compared some notes about an upcoming conference.  He sent me [this picture](https://www.flickr.com/photos/kirbyurner/16531564157/) from when I was more like the high schoolers in this film (closer to their age).  Now I'm more like the principal, in age if not in demeanor or moral rectitude.  Actually the principal comes around in the end:  stodgy Sex Ed films don't do nearly the job the porn industry could, perhaps using animation.\n\nI had a prom night and worried about colleges and stuff i.e. it's not like my high school experiences were without overlap with this fictional film.  Given I lived in the Philippines, I found my peers especially attractive.  My date was a nerd like I was (destined to be a geek) and from a strong Catholic background.  We had a lot of \"moral fiber\" back then, though like at any high school, the kids mature at different rates.  [Karma](http://worldgame.blogspot.com/2005/04/bumper-sticker.html) is somewhat individualized, for all the stereotypes in play.\n\nMy teachers weren't that stodgy though, nor the principal.  As for Sex Ed, I think they left that to R-rated films we'd all see in the malls.  Plus there's always the encyclopedia.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}