{
  "id": "113393199563990769",
  "title": "The Devils (movie review)",
  "published": "2014-10-27T16:45:00.001-07:00",
  "updated": "2014-10-27T17:20:13.040-07:00",
  "content": "Students of [Royal Babylon](http://mybizmo.blogspot.com/2013/10/afsc-support-committee.html) understand that royalty, like circus people, have been in-bred for a reason, to create a courtly cast of public figures easy to manipulate from behind the scenes, to puppet in other words. \n\n[The Devils](http://www.imdb.com/title/tt0066993/) is a reenactment of an historical period when France was undergoing incipient nationalism (this was long before Napoleon).  The so-called King of France (a royal) is kept feeling insecure by the \"threat\" of any city within its \"borders\" with walls.  Yet with a rampant plague going around, having a wall is actually good sanitation and the local strongman knows it. So the strongman must be framed and then murdered for his \"crimes\", which provides the plot for the story.\n\nThat the strongman happens to be a priest is very convenient for the framers, as he's something of a rock star with the nuns.  Absent family planning or competent medical services, when he gets a nun pregnant, she has no social security and freaks out, leading to momentum for a backlash against his studly ways.  The head of the nunnery doesn't quite have her head screwed on straight and she becomes the primary vector for vengeance, and ultimately furthers the king's minders' plot to fell the walls of the town.\n\nThe priest reminded me of [Copernicus](http://worldgame.blogspot.com/2011/12/starry-night.html), also hounded by fellow Catholics for having a live-in partner whom he listed as a servant in official papers.  Lots of priests had women friends, which Protestants used against them, leveraging the hypocrisy charge, although this particular priest had done his homework and found nothing Biblical to support celibacy in the first place.  Or rather, the Bible tends to self cancel on many issues, with voices taking all kinds of positions.  The Quran is the same way.\n\nCopernicus, Mercator, Descartes... all these good souls lived in terror of the Inquisition, and always for the same reason:  their intelligence was superior to the Pope's.  Any titular Pope or King is prone to throwing a hissy fit when some mirror mirror on the wall says someone else is the Snow White du jour.  The resulting rage feeds a desire for vengeance.  In the case of Mercator, with [better maps](http://controlroom.blogspot.com/2007/02/control-room-collection.html) than the Vatican's, that meant jail time.  For [Descartes](http://worldgame.blogspot.com/2012/08/of-quaker-schools-and-descartes.html), also caught in the middle of religious wars, it meant encrypting some of his best secrets in time capsules not decoded until the 1980s.\n\nThe nuns do not have the benefit of [depth psychology](http://controlroom.blogspot.com/2014/10/red-book-not-maos.html) in the 1600s and have no way to deal with the unconscious other than buying into the [namespace](http://worldgame.blogspot.com/2006/04/another-wittgenstein-essay.html) of demons and devils, the occasional angel.  Instead of psychoanalysts, you had exorcists and the Inquisition fielded these psychopaths by the gross.  Not surprisingly, the minders wanting to capitalize on France as a nation are hell bent on using the Inquisition as their tool, to bring down the strongman and the walls protecting his people from the plague.  They are successful in their plot and France goes on to terrorize the world as one more nation-state monster with corporate personhood (or \"sovereignty\").",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}