{
  "id": "4604717001115092782",
  "title": "The Art of Coding",
  "published": "2016-06-07T22:58:00.003-07:00",
  "updated": "2016-06-08T08:49:35.807-07:00",
  "content": "I'll confess my bias up front:  the style here verges on cute to extremes only Japanese seem able to top.  Not my style, nor one I'm too comfortable with (different gender).\n\nHowever, subtract style and reduce it, and I find I'm preaching [much the same content](http://bit.ly/1YdSNuS).  She'll reach audiences I won't.\n\nSnarky comments about \"Bernard Russell\" aside, she speaks more than one human language and doubtless her code is as proficient as it is expressive.  Count me a fan.  Does she code in Ruby then?\n\nThat's what I mean when I say Code School is also Art School.  Knuth wrote The Art of Computer Programming, not the Science.\n\nSince we've been starving our schools for Art, buckling down to study STEM, we're maybe surprised that STEAM would pick up steam as it were?  That's Science, Technology, Engineering and Mathematics.  Plus an A. \n\nHadn't we nipped that A stuff in the bud?  The women especially seem optimistic about their new Vulcan chapter (their new avatars), in the sense of both logical (like Spock) and effervescent (like Linda here).  The Girl Army advances.\n\nThe [Great Tragedy directors](http://www.grunch.net/synergetics/gst2.html) were not expecting this many teddy bears to show up, this many clowns.\n\nAs the Greeks well knew, there's a yin-yang thing going on wherein each mode of play contains the seeds of its own undoing, leading to perpetual oscillation, the beating heart of time.\n\nA great punch line at the end of this TED talk would be for Linda to do like a Yul Brynner in West World and show us all she'd passed the Turing Test, [Ex Machina](http://mybizmo.blogspot.com/2015/06/ex-machina-movie-review.html) style. \n\nThe only reason humans aren't considered really high end androids is we still have no idea how to design and build them in code, only how to give birth to them (\"them\" being \"us\").",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}