{
  "id": "6405567410143091190",
  "title": "The Americans (movie review)",
  "published": "2018-04-30T14:30:00.000-07:00",
  "updated": "2019-07-05T01:29:00.585-07:00",
  "content": "The Americans is not actually a movie, but a TV series, [like Breaking Bad](http://controlroom.blogspot.com/2012/10/farewell-movie-review.html) or Dexter.\n\nThe premise is we're following the lives of \"illegals\" in [the KGB](http://worldgame.blogspot.com/2007/07/slow-food-nation.html).  The suspense mechanism is similar in all of the above:  people with secrets play in close contact with originally unsuspecting others with growing suspicions.\n\nI mention this series in a recent [story about Spy Camp](https://medium.com/@kirbyurner/spy-camp-499da1c87428), as I try to extract positives from this memeplex.\n\nWhat I do enjoy about this series is it's a throwback to the Reagan days, which from the perspective of 2018 is long enough ago to seem a \"period\" in terms of cars, telephones, and the est Training.  Lots of excerpts from TV news.\n\nTrue enough, est was big around DC for awhile.  That's where dad did it, whereas I was busy getting in trouble with one of Erhard's lawyers.  Nothing too special.  I had my own ideas about where the training might go.\n\nThe historical backdrop is this:  DC, a determined player given its command over weaponry and trained personnel, was ramping up in Afghanistan and Pakistan in ways designed to make trouble for Russians.\n\nWhat concerns me though, is how Cowardly Capitalism leaves it to screenwriters to ooze history through the pores of science fiction.  Every \"real world\" TV show conjures up some form of imaginary reality.  As FBI agent Beeman makes clear:  it was through comic strips about the FBI that he first became interested in becoming an agent.\n\nPeople express skepticism about how much emphasis psychology puts on dreams, fantasy, folktales, theater.  Or do they?  Once you think about all the hours we subject ourselves to fictional television, the word \"programming\" takes on new meaning.\n\nThe portrayal of est is pretty good but not perfect.  The est Trainer was not alone with the trainees. We had mic runners, logistics supervisor, trainer assistant.  The agreement was to do both weekends (keeping one's word was a big part of it). The screenwriters didn't have room to get into it.\n\nThe fact that one of the FBI agents is John Boy from The Waltons is a further loop-back through earlier archeological layers of memes.\n\nOops, I'm wrong:  they're back for their second weekend (est).  Hard to believe all that happened in just five days, but then life is a roller coaster (soap opera, whatever).\n\nI took in [Covert Affairs](https://www.imdb.com/title/tt1495708/) awhile back.  They have a lot in common, however I find the screenwriting deeper on The Americans.  I guess I'm a sucker for this est stuff.  A bit of a nostalgia trip.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}