{
  "id": "3550378940714051817",
  "title": "The Business Plot",
  "published": "2024-12-17T11:23:00.000-08:00",
  "updated": "2024-12-26T09:25:40.719-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/54163860067/in/dateposted/)\n\nAlthough it’s not a no brainer, it’s almost that, to recognize Major General Smedley “Fighting Quaker” Butler for his bravery not only in the company of his men, but later in life, as more of a loner, when he published War is a Racket and had to expose the creeping private sector, anxious to keep devouring the public space.\n\nWhat public space? In some ideologies there’s no such thing. The world inherently belongs to this or that people, championed by this or that cult, and if not the whole world, then at least a part of it, with the intention to expand. That’s to claim the land on behalf of a people as private to them, which becomes the rallying cry of citizens once they have it. But do they have it?\n\nWe know about public spaces and public services, which happen when private interests collaborate to achieve something no one could afford to undertake solo. That would be the space program for example, in its more writ large aspects, and certainly that would be war.\n\nHowever these days the wars are privatized, not declared, and run irrespective of any meaningful oversight. Weapons and funding is easy to come by. All one needs are ideologues with a willingness to die for some cause. If not that, at least they can eat, presuming the militia is able to support itself logistically, which is not always the case.\n\nDo we have any public space left in education? I would say some. Without authorization from some private company, or better, with the authorization of only my own company, I have the right and ability to purchase public facing screen estate. Prospectors are able to scroll through my material. \n\nSmedley Butler was approached with a scheme to finally privatize the remaining public institutions that had survived thanks to FDR. The ruling elite wanted their country back. Smedley would have nothing of it and blew the whistle. After all he’d done to be loyal, he wasn’t about to go down in history as a traitor. Probably the business perps who tried to persuade him said they were doing it for the peoples’ benefit.\n\nFast forward and the push to privatize would reach an apex under president Reagan, coincident with a similar high water mark under Margaret Thatcher in England. The private sector would attempt to establish control without its takeover destroying the underlying legitimacy of their platform. One might call this Business Plot 2.0 and without a Smedley in the picture, it mostly worked, except that people were sensitive to the hollowness and lack of statesmen.\n\nFast forward some more and we have a eugenics-minded Social Darwinist private sector acting like we’re in the early 1900s again. The public sector is all but gone and a private mercenary army supports the highest bidders with WMDs. The USA to some extent still fights back, in part by keeping Smedley Butler relevant to the narrative.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}