{
  "id": "2582803627209816475",
  "title": "The Lobbyist",
  "published": "2021-08-15T10:57:00.008-07:00",
  "updated": "2021-08-15T11:22:32.839-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/5646223789/in/photolist-9ARms9-drcjLw-9AWnC2)\n\nI used to blog about myself as a \"lobbyist\" which probably conjures images of living the high life and lunching with high level mucky mucks. As it turns out, I did have a consulting gig with Associated Oregon Industries (AOI), directly across from the legislature in Salem. They want the rule makers to know: \"we're watching you like a hawk\" (paraphrase). Me? I was a lowly application developer, writing Visual FoxPro for their LAN.Anyway, as a lobbyist I was in league with those pushing \"[digital mathematics](https://wikieducator.org/Digital_Math)\" as an alternative way to fulfill math requirements. The Silicon Forest economy is all about bits and bytes, so the idea was to convert an old and rotting vocational track, into a more computer science like track, and let students opt out of college prep calculus and go through something more like engineering (cue Terry). What really happened is the code school economy grew up between high schools and universities. After the 20- and 30-somethings decide they're sick of low pay grunt work, they raise their sights to more computer skills for better income, the trophy being \"full stack engineer\". The industry itself (picture old Chamber of Commerce) will certify you're job-ready, no need for an expensive four year degree from some dot ee dee yu.If we think of life as a game of Snakes & Ladders, we know it's good to find ladders and climb them. The snakes have a way of sneaking up and providing themselves. No work necessary, to ride a slide.Fast forward to today and I have a bevy of pre high school kids, on the brink of high school, and I'm bagging up all of high school math, as I learned it, and mixing it up with more discrete / digital / computer science type stuff, per my former \"career\" as a lobbyist, and feeding it back to them. JupyterLab, Python, crypto, group and number theory... I call it \"lambda calc\" (with real lambda calc a core logic) in contrast with the \"delta calc\" of Leibniz and Newton. They're both math tracks through high school, per my chalkboard diagrams of the curriculum.I'm accelerating at high speed into what I see as a bright future for schools that don't have to compromise as much, when it comes to their certifications.  I picture those Quaker boarding schools, but add much higher tech (electric ATVs) and better animals (like we have here in Oregon).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}