{
  "id": "2383806266248247895",
  "title": "The Golden Compass (movie review)",
  "published": "2008-02-11T10:23:00.000-08:00",
  "updated": "2008-07-09T21:45:00.534-07:00",
  "content": "I liked the blend of Victorian aesthetics, ala [Pirates of the Caribbean](http://mybizmo.blogspot.com/2007/05/memorial-day.html), with semi-believable high tech.  We should be doing more with dirigibles.   Neal Stephenson explores this meme complex as well, in Diamond Age, though with more emphasis on nanotech, ala Michael Chrichton's Prey.All that concern about undermining dust and witches, separating kids from their animals, seemed like that old timers' religion to me, nasty and diabolical.  I'm happy to keep ridiculing and/or demonizing the Inquisition for at least another century or two, why not, right up there with Nazis.  Nicole plays a smooth villain, tries to pull a Darth Vader on Lyra (pretty name, Dakota).I recognized the good guy cowboy (Sam Elliot) from Ghost Rider.  He really gets around, that character.  Plus I enjoyed seeing the new Bond (Daniel Craig) recruiting spy kids already (quick work for a new guy).I found polar bear culture kinda dorky -- that \"vying for the throne\" meme [gets tiresome](http://mathforum.org/kb/message.jspa?messageID=6092683&tstart=0), no matter how deep the voice (like, what a booby prize to fight over). But admirers of the book version tell me not to judge the book by the movie.  Plus I maybe felt they were poking fun at [Klingons](http://worldgame.blogspot.com/2007/11/bird-of-prey.html), which gets me a little testy.The pairings with animals (familiars) is fun, though Dakota reports the use of stuffed dead ones.  Children have the more powerful counterparts, shape shifters, whereas adults have become set in their ways, settled into one character.  Such sidekicks would help with diplomacy I'd think, as it'd be easier to \"read the signs\" as it were, figure out what's really going on, yet this civilization seems just as war torn and bumbling -- go figure.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}