{
  "id": "1951024298307962665",
  "title": "The Big Lebowski (movie review)",
  "published": "2013-01-28T00:21:00.005-08:00",
  "updated": "2013-01-28T10:47:39.060-08:00",
  "content": "Lindsey was telling Jay I reminded her of \"the dude\" (Lebowski's moniker in [this film](http://www.imdb.com/title/tt0118715/)).  I'd never seen this, and my curiosity was again piqued, as it crops up as a cultural reference.\n\nLindsey likes to re-watch her favorites over and over, so it took little encouragement to have her fetch her copy up from her basement lair.\n\nI like Jeff Bridges.  Altered States was another one where-after some of my friends compared him to me. No wait, that was William Hurt.  Thanks Don.\n\nI'm currently rereading The History of Underground Comics.  Jeff's character reminds me of a comic character.  His life is a comic book, a storyboard, if painful at times.\n\n[The usual rules of physics](http://controlroom.blogspot.com/2009/05/great-buck-howard-movie-review.html) have been suspended in some ways.  People bowl a lot more strikes.  Or maybe it's the metaphysics that are different, or maybe it's just the 1990s.\n\nThe bowling alley takes me back to White & Nerdy (Weird Al).\n\nNext we saw [The Onion Movie](http://www.imdb.com/title/tt0392878/), which Lindsey had grabbed off a free pile.\n\nLike comedy night at The Bagdad, the latter is inconsistent / experimental, toying with ideas we have limited agreement about (special interest, for [focus groups](http://controlroom.blogspot.com/2010/06/bruno-movie-review.html)).\n\n\"Behind the scenes, Onion News's corporate owner, Global Tetrahedron, \nseeks synergy by promoting its other products within Norm's news \nbroadcast.\"\nMonty Python territory in some ways, though many comics explore here, variously / philosophically.\n\nJay was by because he needed to borrow my bicycle for awhile.  His was stolen.  We picked him up on our way from St. John's.\n\nJay is a key player in our [current Food Not Bombs configuration](http://worldgame.blogspot.com/2011/10/halloween-2011-2-of-3.html), which is in the process of reconfiguring.  Like Melody, he has lived in Austin.  Focus:  architecture, anti-waste.\n\n[](http://www.flickr.com/photos/kirbyurner/8423349300/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}