{
  "id": "7646850730636993347",
  "title": "The Putin Files",
  "published": "2018-05-22T03:42:00.002-07:00",
  "updated": "2018-05-22T05:00:24.246-07:00",
  "content": "I watched the whole thing, after a rather grueling data science class. Like I'd developed my Jupyter Notebooks using pandas 0.23 but left the teaching computer at 0.22 -- that was part of it.  The differences were subtle but when a demo doesn't work, I have to flounder and find out later what went wrong.\n\nWe were done by 10:30 PM and I started into Youtubes.  Now it's almost 4 AM.\n\nPBS has a huge number of hours on Putin I see.  I'm never going to have time for them all, but I'm glad I watched this one.  I've sampled others as well.\n\nIt's a little bit self-contradictory, not what I'd call unbiased, but this is Frontline, so we know it's leaving it to viewers like me to draw our own conclusions, which may be different from those of Frontline.  Free country.\n\nAs a veteran [of Portland Occupy](http://controlroom.blogspot.com/2012/11/occupy-unmasked-movie-review.html), I know these youthful movements to take over squares were indeed somewhat organic (I wasn't paid) and they occurred in North America as well.  The entrenched political sphere does not go unchallenged.  Oligarchs are everywhere.\n\nOne of the contradictions is she accuses the Kremlin of paranoia regarding paid protestors, then tells a story of protestors getting paid.\n\nJulia confesses she goes cross-eyed when it comes to cyber stuff, but a few minutes later turns out to be something of an authority on Russian hacking.  As of today, there's still a lot of speculation about the Fancy Bear stuff.  I see no reason to speak with such certainty.  Yes, we all have theories.\n\nWhat's illegal about Russians using Facebook anyway?  But that's a different story from what's in the DNI report, which is not about Cambridge Analytica and UK meddling either.  Pretty selective.\n\nThe Kremlin doesn't believe in organic protests, Julia says, but then the protests against fracking in the west show all the signs of the conveyor belt turning the other way, i.e. the invisible hand of Moscow is behind the anti-fracking astroturf.  So we agree there's astroturf.  What happened to \"organic\"?\n\nThanks to Oliver Stone for contributing as much to any \"Putin files\" as Frontline's lineup.\n\nAmericans love revolutions Julia tells us, because theirs was a success.  And democracy.  The line that all these wars in Iraq, Syria, Libya (undermining Allende, imposing the Shah...) and so on are motivated by purely \"good guy\" ideals makes for an ideological simplification and rather one dimensional storyline.\n\nBut here's Frontline sitting at her feet, lapping it up, no tough questions, as that's not what this is about.  The interviewers are mainly there as fans.\n\nLets hope they're doing at least as many hours on someone domestic. Taking shots at foreign leaders is fun, but there's more to being PBS than that we hope.\n\nBut wait, Congress is always threatening to pull funding.  PBS is more like RT than CNN in that regard, an arm of the government.  Youtube says so right under the video, with a link to Wikipedia.\n\nThe Putin Files is more likely to endear PBS to Congress, which needs its old enemies to stay sane.  Not much GENI talk around DC these days, quite the backwater (aka swamp).\n\nWhat's fun about this interview is Julia actually [mentions The Americans](http://mybizmo.blogspot.com/2018/04/the-americans-movie-review.html), which I've been watching recently.  Where science fiction ends and reality begins is always hazy in this world.\n\nMe on Facebook:  \n\nInteresting interview, long.  Frontline has hours and hours in its Putin Files.  Her dad grew up in Moscow. Julia has a somewhat simplistic good versus evil worldview.  Americans \nare idealistic and just want to spread democracy, making the world a \nbetter place.  Putin will never understand will he?\nWe can [project on Putin](http://controlroom.blogspot.com/2017/05/on-projection.html) all we like, claiming he's influenced by his background in \nspydom, but how are we not all in that world at this point?  \n\"Intelligence\" is a very generic term and it's not all about being a next \nEinstein (who was spied on).\n\nParanoia is not something specifically \nRussian, duh.\n\nWelcome to the noosphere then.\n\nWhen do we get to talk about telepathy?  Not on this show.  Switch to Esalen?  Tell us more about how the hippies helped save physics maybe?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}