{
  "id": "2846890675438485207",
  "title": "The Dark Knight Rises (movie review)",
  "published": "2012-08-05T15:18:00.000-07:00",
  "updated": "2012-09-09T00:08:24.021-07:00",
  "content": "If you'd forgotten [all previous Batmans](http://mybizmo.blogspot.com/2005/09/batman-begins-movie-review.html) and just walked in on this one, you may not remember how Bruce had fallen in with this cult in the Himalayas that plays \"angel of death\" to a moribund humanity.  The theme, as always, is misanthropy.\n\nBruce is paradoxically a philanthropist, but he's enough in touch with the dark side to know why it wants Gotham to be gone.  His own wasting away, in the wake of past trauma (PTSD) is taking its toll on Gotham psychically.  He is thrown in a pit of despair and we dare him to climb out of it.  He's just another sick and twisted little kid like all the others.\n\nLike [Pee Wee Herman](http://www.flickr.com/photos/kirbyurner/7720704694/in/photostream) for example?\n\nThere seemed to be some references to Occupy, but not many.  The rich are always having that fantasy about the mob rising up, and batman films always feature Gotham going crazy, by design of some Dr. Evil type, or perhaps a dynamic duo of Evils.\n\nActually, it's a whole cult that's evil, with the Himalayan cult a kind of reverse Avengers, here to squelch, once and for all, a disgusting humanity, undeserving of God's love -- not forgiven, a narrative at variance with the Christian myth on the surface, but then Christians plan for an end of the world Judgement Day as well, so not that different really, more like Rosicrucians perhaps?\n\nLaw enforcement gets to be \"the good guys\" in Batman, which is how it's supposed to be. If you're on the police force and want to take your daughter to a film that doesn't demonize police, this could be it.  They bravely follow orders. \n\nThe [guys in blue](http://mybizmo.blogspot.com/2005/11/post-thanksgiving.html) only fall down when they give up, or when they fail to rethink those orders and upgrade their performance with plot developments.  The power of intuition plays a big role in bat space.  The commissioner and the bat are attuned psychically, the meaning of that beacon (the bat is awkwardly close to being the commissioner's \"secret friend\" -- he's somewhat lucky it's a mass psychosis or he'd have a hard time holding that job).\n\nThe reason Robin maxes out of the ranks, by way of detective (private eye), is he sees the blindness of \"just following orders\" as an only fall back.  There's a rule that you need to give the grunt on the ground, the man in the street, the woman salonstress, a strong sense of the big picture.  They're supposed to have deeper motives than \"I just wanted to be a robot, so sue me\" (the usual war cry at the war crimes tribunal).\n\nThere's the suggestion at the end that he (the bat man) has learned to become much more invisible than before.  Bruce Wayne still alive was high profile, even when a waning millionaire or billionaire or whatever (the fall is as fascinating as the rise). Bruce Wayne as only seen by a chosen few is \"back to the bat cave\" in some ways.  The theme of Resurrection is just beneath the surface, after an ultimate sacrifice.  \n\nI guess I'm thinking the darkly gothic Batman, of all the superheros, is perhaps doing the most for a kind of old time Catholicism.  He's a role model for all of those in the pits.  He knows deep disappointment (like Pee Wee).  He is our champion and our defender, little men and women that we be, the Gothamites, so looked down upon by those show off lofty Himalayans.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}