{
  "id": "7319889915648881692",
  "title": "Thinking Globally",
  "published": "2016-11-05T21:25:00.003-07:00",
  "updated": "2016-11-11T18:09:58.253-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/16531564157/in/album-72157605485853546/)\n\nI probably come across as one of those \"globalists\" people rant about, although I'm not espousing some particular order as the new one.  I know it's not up to me, so when I ask myself what the future could be like, it's not to myself that I turn.  Yes, I'm [powerless in some sense](http://controlroom.blogspot.com/2011/10/intuition-and-science.html), but not in every sense, and I enjoy my freedoms.\n\nIn the 1960s we became aware of some \"jet set\" and young beautiful people who looked like Mary Tyler Moore and those handsome guys on Mission Impossible.  They had sideburns and wide lapels in one chapter.  Bell bottoms came and went.  I was busy growing up, a teenager, and yes, our family moved around a lot, without being military or missionary. I wore my mirror sunglasses and took pictures with my Kodak Instamatic.\n\nI saw the inside of many jets.  For a time, we even had UN passports.  Dad was freelance, a planner, and people everywhere see there's both reason and occasion to plan.  Indeed, if governments or private enterprises want to impress upon stakeholders that they're doing something related to management, then sharing plans for the future is pretty high on that list.\n\nThen after high school in the Philippines, at an International School (akin to Overseas School of Rome), I was privileged to attend an Ivy League university, Princeton, and absorb a lot of learning, find some role models etc.\n\nProfessor Falk was pretty enthusiastic about the ousting of the Shah of Iran.  He saw a new generation of Iranians taking over and ditching an oppressive cast of overlords, in favor of making room for an exiled government.\n\nWe were looking at ending Apartheid and as tuition-paying students we were asking how Princeton might play a productive role.  [Two Dickinson Street](http://worldgame.blogspot.com/2005/05/princeton-25th-reunion.html) (2D), where I lived for two years, was especially involved in that research.\n\nI studied about world hunger at the Woodrow Wilson School, while writing a thesis on Wittgenstein's later philosophy.  I tried to take full advantage of this well endowed campus, putting a lot of my energy into computer programming.\n\nAll that added up on my end to feeling we live on a [tiny dot of a planet](http://worldgame.blogspot.com/2006/07/pr-for-pl.html), surrounded by empty space and places far less hospitable.\n\nAs humans in Universe, it's up to us to \"save our ship\" and a lot of that saving comes from thinking realistically about our place within the biosphere, and behaving accordingly.\n\nA level of sobriety is called for.  I'm somewhat like Krishnamurti in thinking that our bigger failures trace to a lack of seriousness.\n\nNot long ago I wrote an essay entitled [Thinking Globally in 2016](https://medium.com/@kirbyurner/thinking-globally-in-2016-f01cd34466a6#.bvhxdteu2).  With that kind of press out there, it'd be on the foolish side for me to run from the \"globalist\" label.  That doesn't make me a part of the same conspiracy as everyone else so labeled.\n\nGlobalists are not all birds of a feather.  Indeed, if biology teaches us anything, it's that diversity is a positive way to work with complexity.  Yes, I consider the world to be complex.\n\nA lot of people are suspicious of complexity, subtlety, anything they feel they don't fully understand.  I get that way too (suspicious).  On the other hand, I don't insist that I'm the bottleneck and stuff shouldn't be allowed to happen that goes over my head.  Just because I'm out of my depth about something, doesn't mean that something has to pause or slow down.\n\nIt's up to me to keep up, as best as I'm able.  Is that why it's called the human \"race\"? In other words, in being a \"globalist\" I nevertheless hope to avoid being a \"know it all\" and exuding some air of phoniness based on some \"know it all\" attitude.\n\nI've had limited experience and was shaped by whatever adventures and misadventures. I'll share [my perspective](http://mybizmo.blogspot.com/2015/11/resolved-usa-still-solvent.html) and be a star in my own little show, partially overlapping with the stardom of others.  A lot of what I do is \"retweet\" those I admire most. In accepting the label \"globalist\" I'm not thereby making some special claim to originality.\n\nI've also talked about being \"elitist\" but really I'm more into \"esoterica\" such that I don't really believe in \"elites\" as comic book conceived.  Playing with [a Ouija Board](http://worldgame.blogspot.com/2008/08/elitism.html) taught me something:  that a lot of what goes down is from a shared unconsciousness, one might say.\n\nYes, it always feels like \"other people\" are in control, but that's to some extent just a truism i.e. \"there are more of them than there are of you.\" Duh, right? \n\n[](https://www.flickr.com/photos/kirbyurner/2577366231/in/album-72157605485853546/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}