{
  "id": "2379929859846052814",
  "title": "Thirsters 2015.6.11",
  "published": "2015-06-12T06:32:00.001-07:00",
  "updated": "2015-06-12T08:01:50.257-07:00",
  "content": "We have visited the topic of Afghanistan before [at Thirsters](http://worldgame.blogspot.com/2015/06/thirsters-201564.html).  We were visited by that [Pashtun khan](http://worldgame.blogspot.com/2013/11/a-khan-at-thirsters.html) that time in 2013.  The khan was looking forward to the US military not having such a stake in running things, as the planned draw down was just ahead.\n\nAs of June of 2015, the Afghanistan nation-building project ([Operation Valhalla](http://mybizmo.blogspot.com/2009/05/more-developments.html)) is still a fairly large employer of US military and military-minded.  [The Iron Mountain](http://controlroom.blogspot.com/2008/12/iron-mountain-revisted.html) does lots of business around the world and needs those [stepping-stone bases](http://mybizmo.blogspot.com/2009/02/news-and-views.html).\n\nA lot of [retired police](http://mybizmo.blogspot.com/2005/11/post-thanksgiving.html) find employment as contractors.\n\nStill, we're only talking about maybe 20-30K US-based personnel (including civilians) in a region of 30 million mas o meno, so a drop in the bucket.\n\nThe role-playing game called \"lets say there's a national government\" has not been going well.  People don't believe in the drama, nor the characters.  It's a low ratings show and people mostly have better things to do with their time and energy, such as growing opium poppies, which fetch a pretty penny on the world market.\n\nI'm not against that by the way (farming opium poppies).  I'm no dime store \"drug warrior\".  The world needs its opiates, an important medical supply.  Humanity is addicted to such things and needs the pain relief.\n\nLots of the funds, [according to SIGAR](https://en.wikipedia.org/wiki/Special_Inspector_General_for_Afghanistan_Reconstruction), have been misappropriated through corruption.  This word \"corruption\" is interesting in that it mainly means the board game one wanted to play with whatever spinner and pieces, is not in the cards.  The rules are not the ones that one had planned and so one says the game is \"corrupt\" not \"a different game than the one I meant\".\n\nThis belief in oneself as some kind of \"game designer\" comes from having an imperialist background probably, and therefore having a strong moral imperative to see the rules of the empire upheld.  That's imperial money, after all, going from DC's borrowings from Chinese and Saudis indirectly to Swiss bank accounts (where a lot of the funds get squirreled away by privileged Afghan families).\n\nYes, there's plenty of nostalgia ([and appreciation](http://mybizmo.blogspot.com/2009/02/wanderers-2009211.html)) for calmer days.  As the weapons keep pouring in and agreement breaks down over roles, turf and control, people try to settle their differences through killing, just building up karma in a somewhat haphazard manner, sinking deeper into debt.\n\nPTSD becomes more the norm.  Ordinary living, enjoying life, is less probable.  Even the period under Russian occupation seems relatively benign in comparison.  Those were indeed simpler days I think?  I got to Kabul in the 1970s, taking a bus with my family through Khyber Pass from Peshawar.  Things seemed to be going well.  We hopped an Aeroflot to Tashkent next (dad was enjoying life, by planning these exotic around-the-world home-leaves from the Philippines).\n\nSaying the US \"controls\" anything in Afghanistan much beyond its own embassy, bases and personnel would be something of an overstatement.  The US does not so much \"occupy\" Afghanistan as it has \"paid for a front row seat\" much as it has done in Iraq.  The US is along for the ride. \n\nLots of personnel get to witness first hand how insecure the place is, such as [our speaker](http://controlroom.blogspot.com/2013/02/report-from-afghanistan.html), a native Afghan turned US-based college professor.  They return to the US with stories about what happens when no one believes you're really a country anymore.  A lot of it sounds rather familiar.\n\nI was telling my mom as we walked to the car that I doubted we'd have any countries in 200 years, but my more nuanced understanding is we never had them.  We've had role-playing theater of various kinds, lots of courts and nobility, and now newer forms, giving way to newer forms yet.  \"National sovereignty\" was in the mix there for awhile.  As a concept, it's not particularly meaningful anymore.  But then belief systems persist regardless so I'm not expecting all the religious icons (e.g. the flags) to go away any time soon.  We still need those passports.\n\nIn Afghanistan, like in a lot of places, ethnicity is still a governing factor i.e. people want to know if you're Tutsi or Hutu or whatever (borrowing from [another namespace](http://mybizmo.blogspot.com/2005/02/hotel-rwanda-movie-review.html)).  Our speaker, when he gets fed up with such questions about his own background, just says \"I'm Israeli\" to shut them up.  [Funny](http://controlroom.blogspot.com/2005/12/thinking-globally.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}