{
  "id": "2707881695796777283",
  "title": "Thirsters Again",
  "published": "2014-08-07T23:00:00.000-07:00",
  "updated": "2014-08-11T16:08:24.457-07:00",
  "content": "I dropped mom at her [drones workshop](http://controlroom.blogspot.com/2013/02/report-from-afghanistan.html) at Unitarians and buzzed over Fremont Bridge, exiting on Kerby by the hospital then taking Weidler to the McMenamins on E Broadway.  I left just in time to retrieve her, in light nighttime traffic.\n\nNow I'm having a cup of tea with my British friend Steve.\n\nTonight's topic was the history of the Middle East (so-called) since around the time of the Ottoman Empire, with the rise of industrialism in Europe posing new challenges and giving rise to many new artificial states, such as Lebanon (a French project) and Jordan (British).\n\nThe French helped give [the Maronites](http://en.wikipedia.org/wiki/Maronites) in Lebanon a boost before leaving, while Britain in drawing in Jordan, as a state, was compensating [some Caliph](http://en.wikipedia.org/wiki/Hussein_bin_Ali,_Sharif_of_Mecca) for allowing Iraqi Muslims to be conscripted against Turkish Muslims (Arabs against Ottomans).\n\nI was interested to learn more about ISIS given that [demonstration in Detroit](http://mybizmo.blogspot.com/2014/08/visiting-downtown-detroit.html) we'd come across.  Christians and other ethnic minorities are feeling the boot of some rival gang as it takes over along various transportation corridors.\n\nReligious gangs are not a new phenomenon and one Thirster piped up with analogies between sectarian violence in Europe (Catholic versus Protestant for some hundreds of years) and what we were looking at here.  I'd say that goes without saying.  Humans are fairly predictable beasts of [limited bandwidth](http://controlroom.blogspot.com/2006/02/jihad.html).  They argue about a lot of the same things all through time.\n\nSo I hadn't realized this spooky subset of [Shi'a's Twelvers](http://en.wikipedia.org/wiki/Twelver), the [Alawites](http://en.wikipedia.org/wiki/Alawites), were so in control [in Syria](http://controlroom.blogspot.com/2013/08/city-of-morons.html), another [faux state](http://mybizmo.blogspot.com/2010/01/cyber-nations.html).\n\nIt's not that only some states are faux; they're all faux, it's just some get all offended when you point out their fauxness, whereas others are more reconciled to their being phony.\n\n[Thirsters](http://worldgame.blogspot.com/2013/01/thirsters-gather.html) have been meeting for many years, thanks to founder [Bob Textor](https://groups.yahoo.com/neo/groups/synergeo/conversations/topics/70918), anthropologist and a valued contributor to the design the Peace Corps in its early days, during the Bill Moyers and Lyndon Johnson years (early to mid 1960s).\n\nOur presenter tonight was Bill Beeman.  From the Thirsters listserv:\n\nBill is an internationally known expert on the Middle East and the Islamic\nWorld, particularly Iran, the Gulf Region and Central Asia. He has also\nconducted research in Japan, India, Nepal, China and Europe. From 1996-1999\nhe sang professionally in Europe as an operatic bass. He continues his\nmusical career. \nOne of the Thirsters piped up during Q&A, asking if Al Qaeda was as advertised [in The Power of Nightmares](http://controlroom.blogspot.com/2006/01/power-of-nightmares-movie-review.html), a largely imaginative projection, not unlike \"Mafia\" or \"organized crime\".  Bill said that it was, though he hadn't seen that BBC series, which I've written up and oft linked to from within this blog.  Once the demonizing had begun, Al Qaeda offices sprung up all over, like [Symbionese Liberationists](http://controlroom.blogspot.com/2009/02/neverland-movie-review.html) in the days of [Patty Hearst](http://mybizmo.blogspot.com/2008/05/cry-baby-movie-review.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}