{
  "id": "5334287621117564847",
  "title": "Thirsters",
  "published": "2006-12-29T11:28:00.000-08:00",
  "updated": "2006-12-30T17:27:49.987-08:00",
  "content": "Michael Hagmeier and I ended up rejoining a Thursday night drinking crew, one or two other Wanderers already there. Many views were floated, such as that [Spike Lee](http://www.imdb.com/name/nm0000490/) became a much stronger director when he started collaborating with [Martin Scorsese](http://mybizmo.blogspot.com/2006/12/american-dad-plot-synopsis.html) (this from Fred, our resident jarhead).  Apropos of that Lew wanted to be sure Fred saw [Bamboozled](http://www.imdb.com/title/tt0215545/), and rented it on the spot from nearby Trilogy.This morning I'm thinking about Saddam, in many ways the henchman of Americans, doing their dirty work, as a commie slayer, then as an Iran balancer. He got a lot of cues from State types, then overstepped, overestimating his clout in DC. The DC management teams turned on him and fought him in two wars, in both cases unfair fights, but war is never about being fair.The trial was a part of the war, and hence unfair. Killing him by hanging, if it happens, won't be fair either. He was a product of his times, and his level of brutality was about par for the course. His counterparts outside Iraq were no less cut throat.Wars often begin in disgrace. There's a kind of faux heroism that's all about compensating for a deep seated unfaced fear. Then there's honest to goodness heroism, which you find in soldiers absolutely, but not just in soldiers. War needs both kinds of characters. We celebrate the heros, but we learn as much about the characters of villains. The Gulf Wars will give future historians lots of raw material. Don't expect these stories to all be resolved in your lifetime (talking to myself here as well).Lew and I both appreciate Tom Robbins novels, and he's eagerly anticipating a new one. I carry this one Robbins metaphor around in my head, just to give the flavor of his exotic style: \"a smile flickered to her lips, like a seagull flying out of a bowl of tomato soup.\" Lew loved it, wrote it down.Fred remembers his grandfather's story about getting kicked around by cops, his money taken, back in 1939, when he was out after curfew. Who knew at the time, that years later, the grandson, like Lew a descendent of North Americans' slaves, would be a developer of the very street corner where that happened, in cahoots with [Korean](http://mybizmo.blogspot.com/search?q=korea) and [Jewish](http://controlroom.blogspot.com/2006/10/american-pop-movie-review.html) partners.Also present at the meeting: Fred's and Lew's high school classmate, a Cambodian, who'd impressed them all by showing up sans any English skills, and morphing into an American, even making it look easy. Fred said witnessing that transformation put a whole new spin on what being human made possible.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhR3mykQ3ecBo1n9gg4VYdeUi232cM7bv9zVEKjFsQGFswK6uWzKlh4x2ii3WK325K31W2p6bKLGZAdQxdJHcj400Ep2f6KHUkpTe_wmVHDQ_WD_tb6dsYkYsJoOxdA7ESD0DkG/s1600-h/bday49.jpg):: mh @ 49 ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}