{
  "id": "8853196238187321580",
  "title": "Thoughts About Meeting",
  "published": "2012-01-12T11:02:00.000-08:00",
  "updated": "2012-01-13T11:57:30.032-08:00",
  "content": "As a long time member of the Oversight Committee, I like to encourage Friends to see Meeting for Worship as the unique opportunity Friends offer, both to themselves and droppers in.\n\nSome churches may give the impression of these masterful \"life fixers\" within the core, who will take new recruits under their wing, show them the ropes, and set them on a new path.\n\nThat's a nice projection, but with Friends it's really in meditation (as some might call it), in worship (also called \"expectant waiting\") that answers well up in a form unique to the individual, comprehensible yet private.\n\nDon't expect it (the answers to your prayers) to come as direct advice from some \"[advanced Quakers](http://controlroom.blogspot.com/2011/07/this-ones-for-you.html)\" who are \"clear\" (that's more the [Scientologist model](http://worldgame.blogspot.com/2008/07/interest-group.html) maybe).\n\nSeek wisdom from within the community, certainly, but don't imagine there's a fix-it-all core clique of Bodhisattvas -- or go ahead and imagine it (some projections are healthy), but then make sure you include yourself as \"one of them\", as inner circle, so you don't make a pest of yourself trying to \"break in\".\n\nSome young folks just stopped by in a car and grabbed some of the free pile stuff Lindsey set out this morning. The girl was happy to get some shoes.\n\nI'll be missing the memorial service for Ardelle Dennis tomorrow, as I'm planning to be on my way to another service for my Aunt Eve, daughter of my grandmother Esther's sister Elsie, sister to Bill, Howard, Bo and Ed.  These are the Swedes on my dad's side of the family.\n\nYou won't find all Quakers using the word \"meditation\" for their practice, but there's enough of a bridge literature to provide that Asian-sounding spin in translations.  That some local yokels would hit upon such a style in the tumultuous 1600s is all the more amazing, and that a branch would follow one Penn to a so-called New World (or New Atlantis if Baconian), had a big downstream effect on the future of the new nation later established (in 1776 by convention).\n\nArdelle and her family were contemporaneous with mine in the early days of Multnomah Meeting.  Hazel Hemphill was among us.  Sonya Pinney and Bob Smith remember those days.\n\nThen our family moved to Rome where my dad had found work as an urban and regional planner for the fledgling North African state of Libya.  He later worked as a planner for the Philippines, Egypt, Bangladesh, Bhutan and Lesotho, although sometimes more on the education planning side, a more specific focus.  I didn't return to Portland until my late twenties.\n\nMultnomah Friend David Lansky was working for Ecumenical Ministries at the time, and helped me get on board with the Center for Urban Education, where I started my career as a teacher of computer-related subjects, a career that continues to this day.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}