{
  "id": "8330295315586007516",
  "title": "Thy Kingdom Come, Thy Will Be Done",
  "published": "2018-06-26T22:55:00.001-07:00",
  "updated": "2018-06-27T00:17:47.742-07:00",
  "content": "I don't think \"globalism\" always translates to fantasies about one world government. It's just a fact that 8+ billion humans are embedded in a spherical biosphere, a Babel University. It's neither hubristic nor utopian to point that out.\n\nOur awareness of this context is more acute than ever, given the faster feedback loops. Observing accelerated evolution and describing it ain't the same as fomenting revolution.\n\nMark Twain mocked artists' conceptions of Heaven (angels, harps...) as uber-boring and anything but utopian. What would Jordan Peterson offer as a vision of Heaven in light of his claim that humans hate predictability. Nirvana = Samsara? Is Buddhism giving more of a clue? But then \"marriage of heaven and hell\" is a Christian theme also.\n\nTower of Babel: 8 billion brains imagining reality in various ways = nothing sensical, yet something invisible, [the sum total Ouija Board](http://worldgame.blogspot.com/2008/08/elitism.html) re-weighting of weights. There's gravitas, but does it speak anything close to a language we might understand?\n\nSpaceship Earth == Babel University == Global U (a teaching hospital).\n\nSuggesting humans have room to be less awkward and uncoordinated in their collective self management hardly strikes me as a totalitarian vision. Extrapolate from trends?  Haven't we learned something as a species?  The question is have we learned enough to keep it going.\n\nCertainly the fate of humanity is cliffhanger enough to satisfy most anti-utopians.  Dystopianism is pretty easy to promulgate.\n\nYet is the Lord's Prayer not a promise of obedience to eternal principles?  What choice do we really have in the end?  Humanity might self discontinue. Utopia or Oblivion suggests a preferred direction, a gradient.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}