{
  "id": "6049280277723618362",
  "title": "To Be Takei (movie review)",
  "published": "2014-08-24T08:21:00.001-07:00",
  "updated": "2014-08-24T16:55:40.011-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/15013672911)\n\nThat's \"Tah-Kay\" not \"Tah-Kai\" as the movie makes clear.\n\nWhat strikes me about George Takei are the similarities between his story and that of [Kiyoshi Kuromiya](http://mybizmo.blogspot.com/2012/03/remembering-baryard-rustin.html), another Japanese American who [incurred internment](http://worldgame.blogspot.com/2005/02/adult-first-day-program.html) and a resulting life-long commitment to activism in defense of civil liberties, including gay rights.  Kiyoshi and I used to hang out some in Philadelphia, when I'd fly there for AFSC meetings.  He was likewise kind and brilliant, also focused on personal integrity.\n\nBeing gay is an orientation, not a lifestyle, George likes to point out.  If it's \"a choice\" so is being in mixed-sex relationships a \"choice\" i.e. it cuts both ways, yet many mixed-sex oriented don't think of it as \"a choice\" for them.  Well ditto.  That was reasoning by a standup comic we heard later that same evening, but it fits as analysis.\n\nThe documentary advances its threads in a multitasking way, an effective way of storytelling in that you get three minutes here, seeing the marriage equality campaign move forward, then three minutes there playing up the Star Trek lore.\n\nWhat's illuminating about this film is how it's highly media literate within what's popularly called \"pop culture\" so we get inside Howard Stern's radio show and into magazines and tabloids, visiting a lot of edgy comedy.  That's why the later show by Dick Foley and company at The Helium was so dead on, including more gay jokes.\n\nLike a lot of the stranger-fans in the movie, waiting in line for picture signings and so on, I'm a Takei friend on Facebook.  I don't think I've ever posted to his profile or commented thereon, but I've really liked some of his funnies.  I'm think of myself as a subscriber in that sense.\n\nThe movie spends some time on how Asians get portrayed in films.  Yes, a fencing sword is less \"stereotypical\" than a samurai sword one could say, but getting all martial arty and Bruce Lee like is hardly \"out of character\" for an Asian male.  They seem to do that a lot.  Not just Errol Flynn.\n\nThe interlude about a fantasy Kirk-Spock relationship kicked up by the collective unconscious for Internet consciousness, is hilarious.  ROTFLOL.\n\nThe musical George has been working on, Allegiance, is another one of those threads we see advanced.  Here in the Pacific Northwest, from where I'm writing, this musical would have special poignancy.  Perhaps we'll see it in Portland.\n\n[](https://www.flickr.com/photos/kirbyurner/15013663991)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}