{
  "id": "3896975265953302870",
  "title": "Tosca (opera review)",
  "published": "2013-02-03T19:33:00.001-08:00",
  "updated": "2020-12-08T11:01:34.060-08:00",
  "content": "[](https://www.flickr.com/photos/storem/216086335/in/photolist-k6uWt-ambKn-ambJF-k5deH-6T8nGW-8eUhF2-6T4mwz-9XcCm-fG4HD1-dd64w4-VHSg7B-5JvGKe-5JzXQS-B3EdDF-dVAsGg-xZHvL2-BQHzqG-4xzxCA-faqJKd-5JzY4Q-dVAsVZ-zt22cH-dVG59q-fVkU6Z-dGmaHh-Jm828-7HZyip-4VCekE-27FhcyK-5qvFWF-952Vbo-8AAbo1-7Fxetp-aqot6D-8q7zBi-8JAUrJ-81hN2V-LZGj28-5c7Y2m-7L25Mi-2jfZWZw-d37Ae-24iKUAF-JnWz1b-U5B1h3-4BTZe3-pf99SK-GD86Zq-7FB91S-7FB8q1)\n\nI had mistakenly assumed that, with a name like Puccini, the guy would know Rome like the back of his hand, maybe own his own Pinocchio factory (like Giapetto) and sell puppets at [Piazza Navona at Christmas time](http://www.flickr.com/photos/army_arch/8297431253/).  Nope, turns out he went to Rome precisely to research the script, get the landmarks right.  Apparently the old libretto had Angelitto or whatever his name was swimming across the Tiber river to seek sanctuary in St. Peter's.  But as we all know, these two institutions ([Castel Sant Angelo ](http://www.flickr.com/photos/spiri/2460996373/)and St. Peters) share the same bank of that river.  The original author was fine with taking dramatic liberties, but Puccini wanted more realism than that.  The opera was going through a phase:  \"verisimo\" they called it, or verisimilitude.  The music was becoming more like a soundtrack.\n\nI've been putting on my [Teilhard de Chardin goggles](http://controlroom.blogspot.com/2010/01/some-adjustments.html) from time to time and looking at history with that benefit of hindsight.  Sure, the explosion in logic made little sense at the turn of the last century.  What were they thinking?  Their rationality hardly improved and politics stayed as dumb as ever, so what was that all about?  Looking back, the computer languages were being born.  Lineages were getting started.  Turing fed into Von Neumann with channels back to player pianos and other hole-punch controlled devices.  Ada, Hopper...  It all makes so much sense in retrospect.  Like evolution creating the eye.\n\nLikewise one can see the stage as prototypical of the \"big screen\" we'd be getting later (Plato's Cave version 3), which is still pushing the envelope at 48 frames per second of little Hobbits running around in IMAX 3D.  That's what we're up to by the time of [this writing](http://controlroom.blogspot.com/2012/12/a-heady-xmas.html).\n\nBack in Puccini's day, we didn't have film yet, but we had something very like IMAX 3D, namely The Opera.  And the singing took (still takes) real athletic capability.  Not just anyone could belt it out like that without slipping.  In any case, artists had what amounts to a big screen, and they had a sound track to think about.  So there were lots of things to try, lots of niches to carve out.  Theater evolved in parallel.  Then we had \"[musicals](http://youtu.be/JrYz8qcFsXs)\" (not opera, but operatic). \n\nLooking back, Puccini was an early film director and verisimo was a move to ground more in the nitty gritty of the time, any time.  Yes, a genre, but an anticipatory one.\n\nThey say Puccini went to great lengths to get to tone of St. Peter's bell right.\n\nYes, it's been a long time.  When I was young and thin and more like a fish, clambering around on that [Trevi Fountain guy](http://www.flickr.com/photos/jesscamp/5366351982/) with [my friends](http://worldgame.blogspot.com/2006/06/machine-world.html) (we didn't steal the coins tourists were throwing, and we were tolerated as colorful youth, boys at play never mind we might be expats) I used to get \"dragged to the opera\" quite often by my culture-loving parents.  I was getting some of the best of the best back then, but didn't really realize it.  Now I'm back, as a gray.  I blended right in too, though I also saw quite a few kids, along for the ride with mom or more likely grandmom or dad.\n\nWhat I need to sort out is the back story.  What was the Vatican doing vis-a-vis Napoleon and why was the escapee being pursued?  What was the painter's view of Napolean's wins or losses?  And what was Scarpia the secret police chief of again?  Of what exactly?  Was that the Vatican's secret police or what?  I'll have to do some more homework eventually, fit those puzzle pieces together.  After Super Bowl:  OK, [Wikipedia](http://en.wikipedia.org/wiki/Tosca) clears it all up, complicated story, all the worse because Napoli (Naples), ruling Rome at the time of the play (set in 1800) is not named for Napoleon (Neo Polis = New City).  Speaking of which, good to hear [Civitavechia](http://en.wikipedia.org/wiki/Civitavecchia) mentioned.  That was Etruscan you know.\n\nAnd that was [my Superbowl Sunday](http://worldgame.blogspot.com/2009/02/superbowl-sunday.html) folks.  Doesn't sound like I'll be [doing any comments](http://controlroom.blogspot.com/2010/02/post-game.html) on the commercials, per previous years (I sometimes scan them for geometry).  I did [write about the cuboctahedron](https://groups.google.com/d/msg/mathfuture/C69NXWijEF0/tj-oDK4x-tsJ) on Math Future though.\n\nOh well.  Opera is cool too, not just kicking (and throwing) some ball around.\n\nI hear the power went out in the stadium.  That's pretty interesting.  Tell us more.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}