{
  "id": "2509303931478426340",
  "title": "Tourists Touring",
  "published": "2023-05-02T17:40:00.009-07:00",
  "updated": "2023-05-02T18:17:12.325-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52865983474/in/datetaken/)\n\nI was short on cash and don't usually carry checks, and they didn't take plastic, but next time I'll get my lifetime membership in the Portland Theosophical Society Library. I was introduced by another tenant in the building, a CPA.  They've left NW Portland for a Beaverton-Hillsdale address.\n\nI've been using the car more (driving out to Beaverton), so my mood (mode) has turned more spatio-geographic, as befitting us drivers.  I'm seeing the neighborhoods again, and how they inter-connect. Cars run it all by us relatively quickly, through all the windows.  We become geo-spatially fluent, more like London taxi drivers.\n\nSeeing Portland loom closer, coming from the south on I-5, is pretty melodramatic, through those Terwillager curves, under the cable car, and over the Marquam... \n\n ...then stopped by a freight train (not a problem, I love trains)... \n\nOn out Hawthorne to the hood (neighborhood); I'd been gone on and overnight (myself and the dog).\n\nI'm interested in Global University circuitry that gives people valuable hands-on skills doing agriculture but without extracting a big commitment involuntarily. I've written about all this a lot.  \n\nThe lure of the rural lifestyle is what's meant to serve as self-recruiting. We're not cudgeled the unwilling into harvesting the eggplant crop or whatever.  However, as a for-credit activity towards a doctorate in farming, you might want to try doing some hands on in Oregon's legendary Willamette Valley (where the river flows north).  We even do wines, like in Italy.  And raise alpaca.\n\n[](https://www.flickr.com/photos/kirbyurner/35170537880/in/photolist-VzUcA9)\n\nActually the alpaca business is mostly over the Cascade range to the east, in the Oregon high desert area.  Yet these neighborhoods are but hours apart by road (Santiam Pass), so it's really all one rural ecosystem, crisscrossed by various grades of road, and festooned with jeweled cities and towns (not literally, but like in Oz). I liked the Coburg area, what I saw of it, just off I-5 north of Eugene.\n\nBut do rural folk want to host (for a stipend) any temporary alien house guest visitors of a student exchange program nature?  They'd prefer actual ETs the way a lot of them talk.  There's no wish to impose, but if some agree, then you will see more tourists taking pictures and frequenting the watering holes.  Is this OK?  Oregon is worth seeing, via work-study, as a retiree or whatever.  \n\nTourists do want to come here.  The flip side of the bargain is Oregonians like seeing the world.\n\nIn sending Peace Corps everywhere else but here, North America, our good people were spared ever being visited by the idealistic young except for missionaries, e.g. the Hari Krishnas and Rajneeshis. We didn't get government sponsored emissaries (more like State Department types than died-in-the-wool Christians) coming to our shores, wishing to assist the \"richest nation on Earth\" become less pathological about poverty.  \n\nThat's a gross exaggeration of course (a one sided account).  We had programs like Vista that turned inward.  Even scouting has flirted with the idea of community service.  The religious tribes run hospital empires, praise Allah.  \n\nThe traffic patterns whereby the ideologies spread, has really been every which way (tourists from everywhere, going all over) for quite some time, as humans have become more kinetic (get around more) thanks to technology.  \n\nAlmost everyone into \"futurism\" (which by now sounds retro) is aware of this trend, and has been for decades (if old enough to remember).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}