{
  "id": "5195437544729743552",
  "title": "Town Meeting",
  "published": "2008-11-12T10:30:00.000-08:00",
  "updated": "2010-12-08T17:49:47.065-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiqTQKVXKd1lFPiHyyDvXdZf9XjLApVJjywQOLkHUanMXaOF_Q8lHhB-rinl-JxzT9-CHjVkYnk1lIq6aZYg1emR1XHMSqtTueOQ7a8Qzfo3qE7vhQ9nMexphk8P_Ig6k-RWejp/s1600-h/dyamxion_portland.png)So this proved to be an interesting meeting, though perhaps a bit rarefied for teenagers, unless a budding Italian Renaissance intellectual type, which some are.  Tara sat it out on the sidelines, after we saw Lionel Wolberger (of Synergeo) off on a safe journey home (he was visiting Portland on business).Trevor and I, classified as full-blown Fuller freaks [in some circles](http://controlroom.blogspot.com/search?q=Esozone), kept our traps shut, as we've both heard ourselves speak, including in front of rapt audiences.  I did manage to snap [Trevor's picture on stage](http://www.flickr.com/photos/17157315@N00/3022290117/) though, in a day of close-violations with my camera (I got stopped by a Powell's security officer shooting a book cover, [which book](http://www.flickr.com/photos/17157315@N00/3023120980/) I later bought (but hadn't yet -- had other lawyerly opinions about owning the rights to my own visual field, which I wisely abbreviated)).  Lionel stocked up on comix (manga, etc.).Back to the town meeting:  very earnest and bona fide attempts to connect everyday Portland-minded themes with Fuller's rather esoteric namespace, as handsomely captured in this [D.W. Jacob's screenplay](http://controlroom.blogspot.com/2008/11/press-on-play.html) (thinking televison), as performed [by Doug Tompos](http://worldgame.blogspot.com/2008/11/ieee-presentation.html).  If Spano ever did a recording, I'd like to see that sometime, plus [Ron's again](http://worldgame.blogspot.com/2004/12/school-business.html).  In the meantime, I've learned a lot about \"Bucky puppets\" from Trevor (he's learning the story through [his Synchronofile](http://www.synchronofile.com/)), Westinghouse a sponsor (all way before my time mind you).The panelists were pretty much in agreement that Bucky's focus on technology was at the expense of ignoring human nature, and therefore too narrow.  Some guy in the back [mentioned \"artifacts\"](http://worldgame.blogspot.com/2006/11/artifact.html) as sounding more anthropological (me noting the [name of the fashion store](http://www.flickr.com/photos/17157315@N00/3022316099/) across the street).  There was some agreement, developed through improv, on the word \"signals,\" as in free markets sending and receiving, through price information, weighted with whatever externalities.Portlanders are intelligent, literate people in settings like this, conduct themselves appropriately and with self-mastery.  I enjoyed the vibe and would gladly attend future such meetings, with the same panelists, rotating, whatever.  I'd probably drink more coffee first though, as I was experiencing the consequences of arising early that morning, having had a full day, [shades of Vilnius](http://controlroom.blogspot.com/2007/07/sunday-in-vilnius.html).Good job Tim DuRoche of PCS for setting this up, an unexpected surprise, impactful, and a great bridge between theater world and the rest of it, in alignment with the building's stated function and purpose.  Lots of professionalism in Portland.  I consider us blessed.Had I opened my mouth, I'd have said something about wanting detailed exhibits [@ OMSI](http://controlroom.blogspot.com/2007/05/omsi.html) about how the different water systems interplay, like Bull Run's and [Nehalem's](http://worldgame.blogspot.com/2004/12/nehalem-watershed-wanderers-meeting.html).  Let's not just talk about resources in the abstract.  Those LCDs (like the ones in the theater) need to be data rich, not data poor, pumping out [relevant global data](http://worldgame.blogspot.com/2007/06/our-global-u-advertisement.html) 24/7, about infrastructure, about glitches (not just traffic snarls)).That's the classism I care about (access to relevant info), consider us all relatively impoverished outsiders, compared to what it could and should be like, were World Game taken [more seriously](http://worldgame.blogspot.com/2007/11/world-game-museum.html) (spoken like [a true, die-hard buckaneer](http://mybizmo.blogspot.com/2006/09/yar.html), I realize).What especially intrigued me about this discussion is no one really took issue with Fuller's premise that we have, at least in principle, the wherewithal to enable peoples' enjoyment of higher living standards, by continuing to do more with less.Deficiencies in human nature were seen as putting a brake on that happening, with better education our best means for addressing these shortcomings.  This view marks a shift in outlook perhaps, as not so long ago people were more doubtful that we had the requisite know-how and resources even in principle.Why don't we teach kids how to cook anymore?  High schools gave up on Home Economics almost two generations ago.  Although Tara didn't attend this meeting, she agreed this question was important, cooked a meal the very next day, following [a recipe](http://mybizmo.blogspot.com/2008/07/together-friends.html).From separate occasions: Interviews w/ Allegra Fuller Snyder & D.W. Jacobs (Portland Center Stage):",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}