{
  "id": "3855764488847056534",
  "title": "Trekking Onward in Weirder Portland",
  "published": "2010-05-29T13:37:00.000-07:00",
  "updated": "2010-05-29T15:42:10.755-07:00",
  "content": "Philosophy of MathematicsIn light of the many math-related posts below, you'd think I'd be working full time on those video clips, looking over the shoulders of skilled professionals of various stripes and spots, a zoo of \"cool cats\" in beatnik terms (a bi-gender appellation, and not one of opprobrium).However, [the MITE fights](http://worldgame.blogspot.com/2009/02/mite-fight.html) rage on, with the ortho-scheme of the cube considered a primitive but for its handedness, which puts it more in the category of an A, B or T module.  Maybe talk to Frank Zubek about it?  The Hall Tetrahedron reduces to Q, the Schlafli shape.  How does \"handedness\" relate to \"congruence\" in these cases?  Either way, the MITE is original for its own left / right dissection, which has non-overt characteristics:  talking about those A & B modules again.  Isn't it interesting to find a thirding of so basic a nature?  I'm on record suggesting Synergetics is non-trinitarian (thinking of unity-2), however the Mite is somewhat evidence to the contrary.Stories and ExercisesIn another window, I'm connecting with Python's tempfile module, useful for setting up test fixtures in unittest.  My questions are again regarding the technical skills versus lore axes, their relative mix in curriculum writing.  What's the right mix of stories and exercises?  One needs those stories to give the exercises meaning, whereas the latter give substance to the stories.Designing ApplicationsRegarding software development, like at PSU and places, it's not bad workflow to imagine some \"pie in the sky\" version of in-house software, as a way of projecting the \"what's so\" of current best practices.  Envisioned software, aka vapor-ware, serves a real management purpose, as it helps people mentally codify what they're doing, even if the application is never committed to silicon.  However, it might be implemented in some cases i.e. inheriting an office already steeped in ideas of some dream application, if guided by realism in some crucial respects, is what application developers much appreciate.  A lot of the hard part is already done at that point.  The workers have developed the details, and, being closest to the job, are likely among the best qualified to have done so, so a win.  But then how much did the teams learn in high school about HTML, CSS, JavaScript, AJAX, SQL, ORM, MVC, XML, DOM.  Getting this computer science stuff into more common use is a challenge.  I'm eying making an end run through the humanities, not waiting for math teachers to catch up. The DOM (Document Object Model) is the kind of structure we encounter in Rhetoric, and XML is but Punctuation of a new kind (per Gene Fowler of Waking the Poet fame -- rolled his own XML editor in Delphi).I tend to blend the computer science stuff with the spatial geometry stuff.  I have a lexical-graphical bridge through Geography one might say, a sometimes fantastic domain (like a Wonderland, or Narnia... an Uru) which maps data in theater (as in Globe Theater).  The GeoscopeGoogle Earth is a good example, though here with a realistic vista:  a virtual Geoscope, ready for overlays of whatever data layers.  Then check Google Mars and Google Moon (both available in 2010).ESRI provides a lot of capability to professional cartographers and geo-scientists.  I've seen some of those tools in action.Whereas high schools can't be expected to always afford the latest high end equipment, in demand by career professionals, the open source commons has already provided some strong capabilities adequate at least wrangle the concepts.The GIS features in PostgreSQL, coupled with GeoDjango's ORM, are more examples of a tool sets able to supply maps to end users.  Exercises involving geo-caching, including in metropolitan areas, also wilderness, will perhaps take advantage of these tools.Is this a school server?  Then perhaps the local environment is already modeled in some detail (say the Mt. Tabor area in Weirder Portland).  Students gain a feel for that overview perspective.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}