{
  "id": "2339683858411242145",
  "title": "Trial Balloon Legislation",
  "published": "2022-02-23T13:09:00.005-08:00",
  "updated": "2022-02-23T13:30:44.296-08:00",
  "content": "To my way of thinking, a lower house, such as of representatives, not the senate, is a place to properly float trial balloon legislation. The point of the first few iterations is less to get something passed than to see who shoots it down and for what reasons exactly.\n\nFor example, as a lower house rep for the Asylum District, a role I'll assume for the sake of debate, I'd propose Oregon extend friendship to the people of the breakaway republics in the crossfire between Cold Warring superpowers.  We know how it feels, to be trampled underfoot by military oligarchies.\n\nOregon has a lot of ethnic Russians who remember what Nazi aggression was like, and how certain elements within the Ukrainian oligarchy abetted this aggression with their own forms of tyranny and oppression. Some Ukes today actually feel nostalgia for those days.\n\nEver since WW2 and Operation Paperclip, the DC bureaucracy has made it a priority to recruit obedient former Nazis to the righteous cause of building a Fourth Reich where the third one had failed.  Lessons had been learned.  The Business Plot, frustrated by Smedley Butler, had come so close to succeeding.\n\nMost of us know, from historian Edwin Black and others, that the eugenicist program to manage procreation based on the latest science, through forced sterilizations and bogus theories about \"race\", was much admired by Hitler's Germany, especially for how well the Americans were managing to pull it off.  Men of Anglo heritage, many of them in banking, were providing the blueprints, accounting for Hitler's reluctance to destroy them at the end of the day: they were Aryans, like him.\n\nFast forward and you get an alcoholic cocaine addled good old boy in the White House, running the show against the former Yugoslavia. Clinton was the Boris Yeltzin of those Monica Years, stumbling from crisis to crisis, as inept as they get, and then some.\n\nI know, I know, we're supposed to romanticize his performance as \"the first black president\" or whatever it was (Obama the second? -- sounds racist to my ears) but I can't say I was ever that taken by either Clinton.  Ordinary schmoes at best.  Christopher Hitchens saw something more sinister.\n\nAnyway, I'm long past trusting the DC-based imperial presidency to make wise choices and I support the separation of powers, between and among cities this time.  Any government wholly intra the District, is too ingrown to be other than monstrous.\n\nSure, lets have a trucker rally, but why not send the convoy to LA instead?  We all know the media power brokers live on the left coast. \n\nSilicon Valley kicked the last US president's ass, hard, off both Facebook and Twitter.  Send the convoy to the real centers of power why not?  Bring your case to the Pacific Rim overlords.\n\nDC is just a creaky old museum full of clueless old men, hoping to relive their glory days, for the most part.  The Pentagon: a giant nursing home, full of basket cases with awkward reflexes.  \n\nShow some charity.  \n\nLet other cities shoulder more of the burden of conducting themselves admirably against the backdrop of world history.  Stop pretending we need just the one CPU city.  DC is obviously in over its head, swamped.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}