{
  "id": "277739349928646691",
  "title": "Troll Farms",
  "published": "2018-04-26T21:06:00.000-07:00",
  "updated": "2018-04-30T23:50:29.617-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/26858043117/in/dateposted-public/)\n\nI perused [that Atlantic Monthly article](https://www.theatlantic.com/magazine/archive/2018/05/a-broken-office/556883/), about the old US president's job being impractical, and listened to the follow-up interview on NPR. I sat in my car in the driveway to get the whole thing, having returned from the elementary school in the blog post below.\n\nA strong president needed input from Intelligence Chiefs, with the word \"chief\" clearly resonating with N8V American tribes and their chiefdoms (\"fire chief\" is in there also).  Lots of them.\n\nToday was warm and Spring-like (because it's Spring). Glenn knocked on my door, arousing me from REM sleep.  He was on his way to Willamette Week on his bicycle, upset that Oregon Theater on Division was littering sidewalks with flyers, not even bothering to staple them to phone poles.\n\nUpper Hawthorne was awash with these things.  He picked them up, which took some hours.  I discovered the same littering phenomenon along Foster, and [took some pictures](https://flic.kr/p/JrDDQh).\n\nI also photographed the spanking new rollercoaster at Oak's Park.  I'd read about it, and now got to see it for myself.  It's brand new and in pristine condition.  The park was not open, but pedestrians are welcome to mill about.  I walked the bike closer for a better view.\n\nMy meet-up on Foster was in part about Australian history, today being Battle of Gallipoli Day.  Or maybe that was yesterday.  I'm doing some research on it now, and thinking of the movie Churchill and his reluctance, per that narrative, to sign on to the Normandy campaign.\n\nWe talked about the actor George C. Scott.  I was right that he starred in Day of the Dolphin (\"man is bad\").\n\nMost interesting was my discussion with an expert in Icelandic culture in medieval times, the educational institutions in particular.  I queried him about the Scandinavian spin on [this word \"troll\"](https://youtu.be/nhlBbHw_fgs) which is much in the news lately.\n\nInternet Research Agency out of St. Petersburg was deemed a \"troll farm\" by the FBI, but I didn't see Cambridge Analytica getting cast as a \"troll farm\" despite its openly bragging about its meddling in the 2016 election via Facebook.  Why the double standard?  Are Russians more troll-like than Brits?  Evidently.\n\nAs it turns out, trolls were badass anti-heroes that added spice to a family tree.  If you were a weighty House in Norway, you might proudly proclaim some troll blood in your veins.\n\nI'm reminded of how Neanderthals are in vogue today.  Good news if your genetic profile suggests you're not just a plain vanilla Cro-Magnon.  How bland.\n\nOf course I'm aware the term \"troll\" has developed its own meaning in the context of the Internet.  There's also the verb form \"to troll\" which roughly means \"to bait\" or even \"to tease\".",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}