{
  "id": "47473538205539728",
  "title": "Truck Versus Rail",
  "published": "2018-12-03T10:53:00.001-08:00",
  "updated": "2018-12-19T19:08:33.710-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj6ms15W5kw_7WCt-lbmlE8A-HqykjS-Wjlrbw5qOTNDItwrsmZWEpDLclboJQadCDm2rXXbbhxhh1_XmqT1At2XMQOua-6DFZCWdS81a4tyYcbZmqESU0DbCfOvRZ4bZKa93d_/s1600/46102559212_c10490935c_o.jpg)\n\nThere's a bit of an apples to oranges flavor to my Blogger post title comparison \"Truck Versus Rail\" as what corresponds to the rail system are not trucks, but the whole infrastructure of highways, freeways, toll pikes and yes, boulevards. Highways and byways.  Upon those, the trucks ride.  As do trains with engines on rail.  So the apples to apples might be: train engines to trucks.  Both diesel in many cases.\n\nAs a kid, I preferred rails to roads because of the added requirement for such things as switches, and switching yards.  Trains brought their own set of challenges.  Round houses.  Trucks had (have) their rectangular warehouses, sometimes solar paneled.\n\nThe forklifts run around inside, or even autonomous vehicles, routed to take stuff from here to there.  Switch around among trucks, go multi-modal to trains.  Truck and train actually work very much on the same team.  Both truck trailers (with wheels), and shipping containers (without wheels, stackable), are multi-modal, with an overlapping spectrum of modes.\n\nIn adult life, I began to think more about the trucking infrastructure, a prominent feature of the North American economy.  I'm no expert on trade agreements or substance control.  My focus has been university developed exchange programs whereby driver crews gain experience on routes usually considered to be beyond their scope.\n\nThink \"[Peace Corps for truckers](https://medium.com/@kirbyurner/truckers-without-borders-b260b133063e)\" but don't feel you have to thrust it into the State Department as some official government program.  We're giving analogies, not stating identities.  That being said, I could imagine the existing Peace Corps adding \"trucking\" to its categories, or maybe it's there already, I wouldn't know.\n\nI did not serve in the Peace Corps however our family sometimes met with, even offered hospitality to, Peace Corps volunteers in the field.  \"Volunteer\" doesn't mean \"unpaid\" so much as \"not conscripted\" as joining the Peace Corps is not some obligatory form of public service, as serving in the military used to be for US citizens.  We were US citizens living outside the US in places where Peace Corps people often work, such as the Philippines (but not in Bhutan).\n\nHowever, my focus on trucking lately hasn't taken me entirely away from trains.  The different ways to use a rail system other than for \"high speed\" go through my storyboarding.  Roads and tracks are not that different anyway, in terms of needing to obey constraints on grade.  Both steepness and curvature are considerations, though rail and road follow different constants.  Trucks turn very sharply compared to trains, which need a relatively huge radius to accomplish the same turn.\n\nImagine your university dorm and classroom is a four train car affair, and as rather button down.  Is this Princeton?  The keg party folks charter a different service, not that we can't serve regional beers, or whatever's local.  You're studying the region you're going through, learning the language, history, tastes.  You're getting academic credit -- as a lot of those truckers are -- from your time on the rails, often intentionally side-lined without an engine, per plan and schedule.\n\nHooked to all this is the idea of the Personal Workspace (PWS).  Trains might not always carry sleepers.  Most do not.  They could be modeled with offices, work and study spaces.  Ping pong tables make sense when you're parked.\n\nThe North American riding public in large degree switched to jets in order to minimize travel times over long distances.  Commuter hops were and are train and bus oriented.  Some American cities have invested lots in rail, Philadelphia especially.  Others rely almost exclusively on the \"rubber\" tire.\n\nOne might also experiment with trains that facilitate hopping on and off.  The moving sidewalk platform has been proposed, and used by Disney with some success.  The train slows to run at the same speed as the mounting belt and the passenger simply steps on or off the train.  Slower belts (moving sidewalks) run parallel and after a few transfers, the passenger is back to standing stationary at the station (why we call it that).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}