{
  "id": "2479421234476756118",
  "title": "Trucking and Social Media",
  "published": "2021-10-14T14:38:00.008-07:00",
  "updated": "2021-10-14T15:05:09.279-07:00",
  "content": "Some readers might be surprised to learn that I've long used the cab of the long hauler truck as my paradigm PWS (personal workspace) [in GST](https://worldgame.blogspot.com/2021/06/tiktok-meets-gst.html), even more than the cubicle.  The cab of a truck is a work-study space, and driving may take fierce concentration.  You may also sleep in your study carrel. The Trucker Exchange Program is a meme more than a program, even if I've taken inspiration from such as [Bob Textor](https://worldgame.blogspot.com/2013/01/thirsters-gather.html), whom I didn't know well, but I joined his drinking party anyway.  Thirsters at McMenamins. He had to do with sensitizing the budding Peace Corps to the importance of Anthropology (the A in STEAM says no one but me).  In terms of diplomatic corps, State Department types, I knew my dad of course, and [James Lambert](https://mybizmo.blogspot.com/2009/03/chauffeur-duty.html).Since I'm [propagating memes](https://worldgame.blogspot.com/2018/05/truckers-for-peace.html) more than I'm administering program, I don't have to worry about taking credit for the rising self esteem among truckers, where \"self\" stands for \"role\" i.e. \"job\".  The idea of a \"role\" is more appealing I think.  Theater is it.  World Game.  A play within a play within a play... Disney beat me to it, with cast members instead of employees. We see that holds all the way up, to Top Mouse.The romance of [the trucking lifestyle](https://youtu.be/bLJ_KgSEFtU), if only as a glimmer in the Eye of Possibilities, is enough to keep the would-be future trucker generations circling.  Let's make it a reality while we can. Like while we're not truckers, in my case, but active truckers may join us too.I'm some member of the movie crew in one scenario, following some experienced long haulers doing OBOR (Silk Road) or something in Africa, or Texas, or in Oregon or Australia.  I help with curriculum around trucking, to provide continuity, helping to design a global exchange regarding work-study opportunities.  The job (role) involves more tourism and diplomacy.  We depend on truckers to work things out.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}