{
  "id": "1192737054259378906",
  "title": "Truckers Revolt",
  "published": "2022-02-08T23:20:00.004-08:00",
  "updated": "2022-02-08T23:23:38.510-08:00",
  "content": "Whereas some around my household might be glued to the Beijing Olympics, my iPad is open on Ottawa a lot lately.  I can't say I'm getting it all in real time.  In this case, getting it asynchronously is sufficient.\n\nI was telling Dr. D. on our recent walk up Mt. Tabor, that from my own selfish point of view, I feel enough has been done to protect me against coronavirus.  It's not in my name, not personally, that edicts and mandates go forth.  \n\nWhat I want, for my fellow human, is for them to have a free choice to get vaccinated if they wish to.  Have vaccines available.  As long as much of the world is under-served, these noises about freedom of choice have little meaning.  Did anyone offer you a free set of shots, as they did me?  I took them up on it.\n\nWhether you've been vaxxed or not, I'm as protected as modern science allows me to be.  I'm actually not paying that much attention to who is and who is not.  I empathize with these truckers who say there's plenty of science on their side.  I don't think it's so cut and dried that those who defy the mandates should be punished in severe ways.\n\nWe may need to grow the health care system though.  I'd say that goes without saying.  If ER beds are in short supply, then more ER beds would make sense.  That would involve a reallocation of resources away from the more homicidal approaches to the human predicament.  A lot of ideologies advocate killing our way to peace.  I've never been much of a fan of those belief systems.\n\nTrucking needs to be interesting work involving intelligence gathering and diplomacy.  Truck stops replicate the ancient oasis, in terms of serving converging / diverging caravans and solo travelers.  These blogs, as well as my Medium writings, allow a glimmer of this possible future to filter in, enlightening our relatively dark age with more hope-filled premonitions.\n\nTruckers should have a lot to look forward to.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}