{
  "id": "44777188760902723",
  "title": "Truisms",
  "published": "2015-10-18T13:00:00.001-07:00",
  "updated": "2015-10-18T21:10:07.959-07:00",
  "content": "As long as the Commander in Chief is saying his lower downs goofed, in murdering all those doctors and patients, then that's what it was, a goof.  You can't \"send a message\" while at the same time disavowing it at the highest level.\n\nObama is saying point blank that no message was intended, so we're left with a \"crossed wire\" somewhere in the vast and gnarly bureaucracy.  Tracking this bug through the system looks like a paying job for many, so expect the investigation to take a lot of time.\n\nI understand those who fear a message was being sent however.  If Kunduz had fallen to the Taliban, yet Doctors Without Borders continued operating (literally), that could be construed as giving aid and comfort to the enemy.  That would be like [Jane Fonda](http://mybizmo.blogspot.com/2005/10/hotel-oregon.html) going to Hanoi.\n\nThe Geneva Conventions about not targeting medical personnel, is easiest to apply in the case of one's own.  Watching wounded enemy get hauled off the field, perhaps to be rehabilitated to fight another day, puts many a general's teeth on edge.  The urge to strafe the ambulance corps and run over any wounded with tanks, runs strong in the blood.  If giving in to that were OK...\n\nWe do know that US personnel like to run over people with tanks.  That's [well documented](http://www.informationclearinghouse.info/article7413.htm).  However in many cases these people are already dead and the point of running over them is merely to add insult to fatal injury.\n\nThe point of doing this is mostly revenge.  In putting themselves in harms way, soldiers sometimes come to harm (a statistical likelihood) and seeing one's brothers suffer feeds the rage reflex.  Running over a lot of people with tanks or other type of armored vehicle becomes a form of catharsis.  Didn't we see something similar in Waco, Texas?  The way the siege at Waco [was managed](http://www.nytimes.com/1997/06/13/movies/indicting-the-feds-for-the-siege-at-waco.html) pissed off Timothy McVeigh by his own account, leading to [his own act](https://en.wikipedia.org/wiki/Oklahoma_City_bombing) of domestic terrorism.\n\nSo some within Doctors Without Borders are understandably thinking that they were being \"run over\" simply out of vengefulness, to send a message, a deliberate attack.  That's what the Taliban would be telling them:  \"see, we told you so, this is how they operate, so why would you (or anyone) ever fight for them then?\" \n\nReleasing the cockpit dialog, both in recorded and transcript form, was a way the Pentagon had to assuage these paranoid fantasies and was the right thing to do (I'm assuming this was done with the blessing of NATO higher ups, as a part of prosecuting the ongoing \"crossed wire\" investigation).\n\nGiven the president's [public statements](http://controlroom.blogspot.com/2015/10/men-without-honor.html), we now know the Geneva Conventions still have the respect of the Obama White House.  I expect John Kerry would underline that fact.\n\nHowever there's still a gray area, symbolized by Gitmo -- the promise to close it being a promise no one is talking about right now -- wherein the Geneva Conventions apparently do not hold.   Enemy combatants have no rights, according to this dogma.  Imprisonment for purposes of inquisition is open ended in this view, synonymous with the War on Terror (also endless).\n\nA large and growing grey area tends to occur when the formalities and legal framework supporting a just war are ignored.  In such cases the players polarize into blind loyalists, willing to do the dirty work of subverting the rule of law, versus those wanting a place in history for heroically standing up to authority and questioning the legality of one's orders from on high.  We wish more Nazis had done this, but understand whistle blowers often face retaliation.\n\nThe president still depends on a statutory framework for authority and if this framework is widely perceived to be out the window, with respect to previous norms, then even intentional messages become difficult to send, as there is no longer a legal framework to support the president's authority.  Why is the president the one to ask?  What makes the president a chief of anything?  In any role playing game, straying too far from the game's premises may drain the roles of much significance.\n\n[Some analysts](http://www.theatlantic.com/politics/archive/2015/08/supreme-court-and-isis/402155/) have speculated the Supreme Court may need to provide some ruling soon, on whether the executive branch is within its legitimate war powers in morphing the drone war of the contractor-mercenaries into a stateless criminal operation, unauthorized by the relevant civilian authorities i.e. Congress.  Put that way, the answer is obviously no, but then the court hasn't ruled yet.\n\nThose who believe in diplomacy tend to look to authorities for legal advice and developments in Syria especially are fragmenting the somewhat fragile consensus.  Does Syria even exist?  That's a real question.  When whole nations dissolve, how does that affect their neighbors (Europe is finding out).  Many eggheads are working overtime, looking for ways to get Humpty Dumpty (the Middle East) back together again.  One may still draw the old borders, but how does that help?\n\nThe Reagan Administration got pretty steeply involved with mercenaries in the Ollie North chapter.  How different are the Contras from the groups engaged in gray area operations, the former Blackwater and so on, claiming to somehow represent the native interests of the American people?\n\nPerhaps we're only talking about the profit margins of a select chosen few, the Beltway Goons around the District of Columbia?  This is what Doctors Without Borders is concerned about:  that war criminals have hijacked the controls, and are now \"flying the plane\".  Given recent history, simply dismissing these concerns is impossible.  Coups happen, even in the US e.g. in 1963.\n\nLets see what the investigation (ongoing) discovers then.  Do we need someone like Richard Feynman, an outsider with credibility, to help out?   We certainly don't want Washington \"blue ribbon\" insiders with perceived conflicts of interest.  Several teams seem to have picked up the baton and the Pentagon appears to be cooperating fully.  It's only a matter of time before we learn more about what went wrong and what measures are being taken to prevent future gaffs of this undermining nature.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}