{
  "id": "2432960914169722707",
  "title": "Turning Sixty",
  "published": "2018-05-17T12:48:00.005-07:00",
  "updated": "2018-05-18T17:48:22.714-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/42175594331/in/dateposted-public/)\n\nA milestone for sure.  I almost didn't make it given [how the year began](http://worldgame.blogspot.com/2018/01/health-plan.html), with a sudden hospitalization. We tend to meditate on such things, as the odometer turns.\n\nI'm a working dude, not a big income.  Python teachers like me operate in the \"gig economy\" meaning without health insurance but for Oregon's.  Plus I do a lot more than teach this computer language.  I get to be one of the Wanderers and so on.\n\nGlenn Stockton was by this morning, starting work on his Global Matrix website ([think \"hexapents\"](http://worldgame.blogspot.com/2017/04/portland-design-week-2017.html)), having gained a new sponsor. I've been typing up his letter of introduction, for a packet he's mailing, to a new contact.  The sponsor is someone he already knows.\n\nRight now I'm cooking with wonderful leftovers that Melody prepared during her all too brief recent stint here in Portland.  She left Carol's room in great shape.  That's my mom, 89.  Dad died in 2000 in a car accident in South Africa.  Carol was with him and gravely injured, but stayed with us and bounced back.  We had a great time as a family, living all over the world.\n\nSome hours from now, I'll be launching into one of my night school gigs, bringing another cohort of Python programmers up to speed.  I'm also working on a Rhino project.  The Mac version of Rhino is quite a ways behind the Windows version, and I've never heard talk of a Linux version.  For what I'm doing these days, this version of OSX is sufficient.\n\nI'm blessed with friends (also Friends) and family.  The planet is still a nightmare, in the human realm at least.  The idea that [Engineers](http://mybizmo.blogspot.com/2015/05/engineering-as-moral-enterprise.html), not only Priests, Nuns or Psychologists, [or Philosophers](http://worldgame.blogspot.com/2018/05/philosophy-circles.html), might have a big role to play, in improving matters, is one of those themes the Wanderers are into.\n\nI suppose I'm more a Philosopher than an Engineer, but I do see the relevance of artifacts, logistics, workflows, to the whole business.  Economics is becoming more engineering-minded, and I think that's a good thing.\n\nA stronger science is not \"at the expense\" of mature religion.  That being said, not all religious sub-denominations have much of a half-life, unless they keep morphing in response to continuing revelation.\n\nOK, back to eating and getting on with my work.  I'll visit Rosalie and whomever shows up at El Mercado [ he wrote after the fact ].  Thanks for the TrimTab T-shirt!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}