{
  "id": "6286274067141910638",
  "title": "Turning Tables",
  "published": "2018-06-08T13:03:00.005-07:00",
  "updated": "2018-06-08T13:05:43.904-07:00",
  "content": "I see a lot of people in Congress hoping to build their careers by making political hay out of Facebook's indiscretions around sharing personal data.\n\nThe EU is pushing back using legislation, written by lawyers more engineeringly informed.  Having to read patent after patent is a way lawyers continue to be Einsteins.  They don't just capitulate to the emerging cast of engineers.\n\nHowever, some breeds of lawyer may not be sufficiently sensitive to the hypocrisy involved in pursuing private companies for amassing data that the government itself has seen fit to harvest, with equally base business motives in mind.\n\nThe national security surveillance state is sometimes portrayed as being \"behind\" Google, and of course there's lots of continuity around In-Q-tel and all that.  However, we may also tell the story as one of self reinvention, or even rebirth.  It's not like the old intelligence apparatus is still running things.  Rather, the IC of yesteryear gave up the ghost, which now inhabits a new body.\n\nThe District of Columbia still has a lot of pride in being cutting edge, maybe years ahead in terms of scenario planning.  Lets distinguish between WDC as a geographical area, where anyone might live, and as an icon or symbol in journalistic accounts.  There's a difference between map and territory.\n\nIn my view, DC is of diminishing relevance vis-a-vis other capitals as a result of changes in political circuitry.  Decentralization is more efficient unless we're going to re-polarize and fight some wars.  DC is venturing into trade wars as a theme, and appears eager to foment more violent outward wars as well, which somewhat accounts for its waning influence.  People would prefer [a less gloomy future](http://controlroom.blogspot.com/2018/06/fire-starters.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}