{
  "id": "3974070467472620103",
  "title": "Tweening",
  "published": "2018-10-11T12:39:00.000-07:00",
  "updated": "2018-10-12T10:00:02.568-07:00",
  "content": "The concept of \"tweening\" comes from ToonTown, the animation industry, to which [Portland plays host](https://worldgame.blogspot.com/2016/12/toontown-revisited.html).  Comics too, witness [Dark Horse](https://www.darkhorse.com/).  Manga and anime, for those used to a more Japanese spin.\n\nThe \"in between\" frames connect the \"key frames\" -- in hypertoons too.  I claim [hypertoons](https://worldgame.blogspot.com/2016/07/hypertoons-etc.html) to be my invention, where scenarios intersect through switch-point nodes.  With no break in continuity, your playheads travel through a \"spaghetti ball\" of toons (edges, segments, clips).\n\nWhere physics comes in:  are we able to connect key frames A and B with a set number of \"tween\" frames without breaking any physical \"laws\".  Physics is under pressure to provide guaranteed, deterministic results, provided one follows instructions.  No miracles required.\n\nCalculus is all about expressing rules in terms of neighboring frames.  Some scientists flirt with the notion that each frame determines the next in some ironclad fashion, such that all the unfolding action is like clockwork, deterministic, including our own thoughts and feelings.\n\nBelieve it or not, such a notion is actually a comfort to some, as \"it could not have turned out differently\" is a kind of reassurance people sometimes offer.\n\nIn practice, the meaning of \"determined\" breaks down if the trajectory stays unpredictable, even with the benefit of hindsight.  \"Given what we know now, we still could not have predicted what would happen, back then\" is not that unusual to hear.\n\nSans any closed form formula letting us crystal ball the future, our only way to find out is to get there.  However, statistics still tells us about likelihoods, and that death, if not taxes, is certain.  Taxes remain highly probable.\n\nAll questions of determinism aside, marrying the language of animation to scenario planning and calculus is [not a stupid idea](http://controlroom.blogspot.com/2018/10/animation-classes.html).  We're always making recordings these days, to various media, of what goes on around us.  The study of trajectories, of particles in cloud chambers, is at the heart of quantum physics.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}