{
  "id": "6125303318766453935",
  "title": "Twilight Zone TV",
  "published": "2020-07-20T08:36:00.003-07:00",
  "updated": "2020-07-20T09:58:11.771-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/6317374242/in/photolist-aPzGnc-aDCSpZ-qRo7cy-b9Y8B8-aWr3Yr-aKmGj6-aDCRKa-aCZS3k-aCfcgy-aBoaGW-aBobhw-aA9uX2-atE3Ce-atxVKo-atveMH)\n\nWe're aiming for a format Hollywood knows well:  a dedicated studio audience, providing a feedback loop, and in this case talent, as in a classroom where all are on tap to do Show & Tell. That was my Coding with Kids model when doing in-person classes in the local nearby schools.\n\nIf the plan is to keep going nightly through August, producing free content with lots of volunteer security, e.g. Wall of Moms, then the least we can do is corporately sponsor a nicer sound stage.  The idea of writing over the graffitti with other temporary graffiti, simply by slapping up a blank canvas, is being tried elsewhere in town.\n\nThe major audience, also taking in advertising, other current events, is what we might call the TikTok crowd, although of course many geezers are following on Facebook or one of those.  Social Media.  The camera people are likewise the audience self organizers. I've been one of the geezers, staying put in my own zip code and wearing a mask in public.  Except when I'm walking by myself or with a trusted-to-be-safe other... anyway, you know the code.\n\nThe melodrama spikes when the soap opera turns to images of the president gassing his own people and all that.  Not with lethal gasses.  Deep, long-lasting injuries are authorized. \n\nPublic sympathy is with an underdog and if vandals are mobbing the monuments, per the Dork City narrative, then the federal marshals are underdoggy. \n\nThe Wall of Moms removed some of the fencing getting in the way of the future sound stage maybe.  Bashing soccer moms is a symbolic way of hitting the insecurity button, which tilts the public the other way.\n\nOur corporate sponsors will want to make it clear they're not encouraging tacky S&M (sadism + masochism) complete with costumes. Other banks are lending to that group. \n\nIf you follow the money, we just wanted a better soundstage and some replacement graffitti, with volunteers doing most of the programming ala the public cable TV channel model.  Except we're more reliant on social media. \n\nWe see and process the clips the next day e.g. the Wall of Moms being charged with MacArthur like forces (I'm referring to the attack on the Hooverville in [Dork City](https://controlroom.blogspot.com/2013/08/city-of-morons.html) that time -- Smedley wrote about it).\n\nAs with Occupy, I'm wondering where to take it indoors as the weather cools, summer's longest day behind us in this northern hemisphere.  \n\nWe didn't have covid in 2011.  I ended up moving the Ministry of Education into Washington High School.  Long time readers might remember that story. WHS was abandoned at the time, but for art colonies. \n\nIn a later chapter, the revamped venue showcased the Buckminster Fuller Archives at Stanford University, [set to music by Yo La Tengo](https://worldgame.blogspot.com/2012/09/the-love-song-of-rbf-movie-review.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}