{
  "id": "3060746707323952012",
  "title": "Uncommon Core",
  "published": "2018-11-07T10:16:00.002-08:00",
  "updated": "2018-11-07T10:19:25.313-08:00",
  "content": "You may or may not be familiar with \"uncommon core\" (meme), depending on if we've lowered a rope in your zip code area.  That's what we've done in Portland, regarding spatial geometry especially.  The skeptics say there's no future in Polyhedrons, ever since Bourbaki mainly.  The Canadians have overtaken their neighbors to the south, in both AI and extended Euclideanism (ala Coxeter).\n\nNew England Transcendentalism, so-called, later simply American Transcendentalism, hooked its star to this Canadian memeplex, in the sense that the Synergetics \"bible\" (numbered passages) is dedicated to University of Toronto guru \"Dr. Donald\" as some affectionately know him.  Formerly a student of Wittgenstein's at Cambridge.  AI (ML) took some leaps and bounds at the same academy.\n\nThe Uncommon Core needs you to learn more about coding.  We'll compare and contrast functional with object oriented, but we refuse to abandon either in some religious war.  World Domination made sense for FOSS (another meme, needs a different word in Arabic).  It doesn't make sense for some subsect in programming to stake that claim.  So yes, we keep using Python, along with myriad other languages with a Jupyter Notebook like shell (or use JN itself in the case of Python, Haskell...).\n\nYou might think I'm talking college here, and I am, as Uncommon Core excels at that level, however I talked about \"lowering a rope\" which means to the littler people, the kids.  Andragogy meets pedagogy.  You may have read my Pythonic Andragogy essay on LinkedIn.\n\nI'm not trying to make stuff happen in every zip code.  Oregon Curriculum Network is named that for a reason.  Yes, I have meetups with people not from around here, and we compare notes, trade memes and artifacts, help stock our respective inventories with educational supplies.  But I know better than to dabble in zip codes (shorthand for \"micro-regions\") where I have no clue how things operate.  I'm not one to just parachute in and take charge.  I'm into organic growth and all that.\n\nHowever, given the Coffee Shops Network as another vector, less parochial sounding than Oregon Curriculum Network, you can find a cyber-footprint from pretty much anywhere.  If you have an LCD, we have the animations or ideas for storyboards.  You'll bring your own ideas to the table.  Synergy happens.  I don't need to leave my zip code to make the magic happen.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}