{
  "id": "7738027494211248488",
  "title": "Upcoming Commitments",
  "published": "2017-01-14T13:13:00.004-08:00",
  "updated": "2017-01-14T13:22:45.749-08:00",
  "content": "I've got two Princeton alum interviews in my inbox, and a Welcoming Committee with the Quakers.\n\nIn the first case, Princeton has a time-honored tradition of matching up each applicant with an alum, for some meetup time. I see it as an opportunity to hear from someone who actually went there what it was like, and a first thing I might say is way different for different people.\n\nIn the second case, Quakers have a tradition of recording membership which, once gained, should not have to be regained over and over as one transfers between meetings.  So there's a hand-off process, involving some record-keeping and actual face time.\n\nSpeaking of Princeton, I'm observing on Facebook that people will start talking engineering and science when arguing pet theories about what did or didn't happen.  It's one thing to dismiss others' belief systems as \"crazy\", another to get good exercise stating what one believes to be recognizably science.  There's skill-building involved, not redundant with doing crossword puzzles or Sudoku. So does Princeton teach science this way, is the question.\n\nWhat I'm suggesting is that a bright kid, fresh from high school, may have seen over 1000 hours of Youtubes on such disputed whodunits as 9-11. Where at Princeton is the course where adult discourse in this area is role modeled? Shall we expect panel discussions? Might we study the history of deceptions in general, back through the phony military build-up under Paton (the US general), concealing the ramp-up to Normandy? Lets not always pick the same examples, and if you do Gulf of Tonkin make sure you connect to The Doors (quiz question: what's the connection?).\n\nRemember all the 9-11 stories involve deception, as hijacking is certainly that, not to mention dive-bombing the airplanes into stuff, outfoxing defenses. How do we have substantive discussion of what's raised in all those Youtubes, now that we're paying for the privilege?\n\nFor all I know, Princeton has been offering such courses for years. I'm somewhat out of date. I advise prospective students to check out a course catalog, regardless of their interests. This is the time to comparison shop. Many schools will be excellent but for different reasons, so it's up to each applicant to decide which reasons are the best reasons.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}