{
  "id": "111077644660456129",
  "title": "Update from PDX",
  "published": "2005-03-13T21:09:00.000-08:00",
  "updated": "2006-11-15T11:43:42.987-08:00",
  "content": "Peter Ward was in top form for the ISEPP lecture (center ring, name on the marqee). He did his best to recruit scientists and engineers from a young audience, astrobiologists in particular (though during the Q&A, a rep from our own university system challenged kids to check out Oregon's offerings -- and Ward graciously responded with a question about why both states do such a poor job of ignoring their most important institutions: their universities)). He really appreciated how we attract so many of the high school set, not just fuddydud peers with already-formed views and established careers. He expressed his deep appreciation to Terry for making that happen, and Terry in turn credits the Mentor Graphics Foundation, and Corporation, both sponsors, with the former earmarking funds directly for K-12 participation in the ISEPP series. Don did the intro. Dinner after, then drinks in the bar (The Heathman does a very good job).Yes, I got to meet Fr. Bob, who has a cool campus setup, a spare yet well-equipped office. Ki Master George, an 8th grader, took Fr. Bob on a tour of a blog KI's serving, using bascially a LAMP configuration, though without the MySQL. Fr. Bob appeared delighted with the technology, and plans to keep it current with new postings.I put aside most of an entire day to finally implement my Hypertoon concept in running code. Someone had it running in Germany (or was it Austria) within hours of my posting it. This thread goes way back with me, to like 1996, but to get a working source code version has had to wait for the programming environment to come within my reach. With Python 2.4 and VPython as an add-on, I was able to get a prototype out the door. I showed it to Tara and she came up with some excellent ideas for improvements.My congratulations to Darren and Cristy on their wonderful wedding ceremony, conducted in high Quaker style. The spouses married one another with powerful promises, then affixed their names in the presence of a large gathering. We all lined up to add our signatures as witnesses after the Meeting for Worship had ended. During worship, friends and relatives offered kind words of encouragement, recollections, expressions of gladness, and advice. Darren's bro had planned a dynamite menu of two spanikopitas (rural and urban), many other delicacies. The music, which the groom had a hand in supervising, was highly eclectic. A good time was had by all -- including me, taking the full brunt of an early spring allergy (Benadryl helps). Dawn and I walked to and from the event, which was associated with a nearby park. We were reminded of our own wedding, which took place in similar Quaker style, also outside in a park setting. We likewise have such a certificate, signed by ourselves and our friends and family.Update: I'm feeling skeptical these days that my bizmo's responsibilities will allow it to stay as compact as I first imagined. On the way to the wedding, Dawn and I passed a rig that I used to think was about the right size, but when I mentally sketch in the internals, the shell ends up expanding a bit. Still, I refuse to tow an SUV. I want maneuverability. Plus there's the caravan option, or bizmos converging from different directions. Mine could be more compact if some of the bigger circus stuff gets driven by others, and shows up where it's needed. Many permutations are possible.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}