{
  "id": "1583356821914865260",
  "title": "Urbit Food Pod",
  "published": "2022-10-28T21:49:00.004-07:00",
  "updated": "2024-08-31T11:43:08.576-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/49485473676/in/photolist-pvEZhR-ySFa4G-A3tDJP-XZoVVL-6YZAVg-245rckJ-29tRj9n-8teEv6-2ifaZP7-2ioRZh1-2jj93by-2kYEM9B-2mn49FK-2mJvGBu-2mXuMe4-2nFwbsD-2nV2FCV-94mRQq-95xQkb-a9gn49-6Kwbqo)\n\n:: asylum food pod :: \n\nOne could do the prototype simulation without any hardware, so to speak, meaning no real food need be cooked for real animals.  Maybe there's a Planet \"bank\" (a conversion point, intra-currency), and each \"cart\" or \"truck\" is but a Moon of that Planet.  Good design?  I'm still learning.\n\nGetting that shopping cart app up and running in Urbit may be a solved problem.  What's more interesting is not the app per se, but the task of educating the public, and what more could a Food Pod be?\n\nThose following my blogs know I tried to interest the Methodists in converting an abandoned church into a community center focused on experimenting with exactly such simulations, with a microwave tower aligned to OMSI's.  That was Project Ghost Church.  Like a lot of my projects, it's more science fiction than real science at this point, more like Dark Matter or one of those.\n\nYou're probably thinking I must be backed by a bunch of wild and crazy libertarians, the Web 3.0 crypto warriors and so on.  I'm aware too that Swiss cantons were hoping to cash in on the crypto craze by leveraging their pre-existing savvy around financial services.  \n\nI have to confess I'm not really up to date on what either of these groups is up to.  All I know is I'm still looking forward to visiting one of these newfangled Food Pods some day.  It wouldn't have to be implemented in Urbit, although that seems like a natural fit.\n\nWhen testing, players need some \"funny money\" like in Monopoly, a currency accepted within the game. Spend funny money to get your virtual burritos.  Playing the \"board game\" (pun intended) is how one develops expertise in advance of actually implementing such a facility.  \"Simulate with software and players before you build\" as a way to work out some kinks.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}