{
  "id": "1479423395746601240",
  "title": "Vehicular Autonomy",
  "published": "2018-04-27T18:13:00.002-07:00",
  "updated": "2018-05-10T03:31:30.067-07:00",
  "content": "I think we've all been impressed by the theme park ride, if we've had the pleasure.  I'm talking less about the rollercoasters than what I called \"noisy doors\" in remote childhood.  The car rides on a track, with passengers not responsible for steering.  Sometimes the track veers unexpectedly, part of the fun, and a reminder of helplessness (these rides can be scary).\n\nWe understand that a swarm of vehicles, controlled by the same software, could fly down the freeway, not touching.  A small town might implement the \"Disney\" system.  I think of it that way because of the rides, the Wild Ride of Mr. Toad in particular.\n\nSo where are [the EPCOTs](https://medium.com/@kirbyurner/driverless-cars-fa2672d7da3b) for testing these technologies?  We see the Hyperloop experiments.  Prototypes are important, nor must they stay under wraps.  We're doing science here.  Science evolves through \"many eyeballs\".  We're a Bazaar, not a Cathedral.\n\nFrom Al Gore to Donald Trump, the rhetoric has been similar:  infrastructure needs upgrades.  With president Obama, we got the surge, the economic stimulus package, a shot in the arm.  But the public sector is locked out.  Investors want to keep it all proprietary.\n\nThe Grunch, in the meantime (a word we use, for \"supranationals as a group\"), needs human subjects. I know that sounds evil.  Now I'm thinking of Guinea Pig B, another insider reference.\n\nBernie Sanders:  give everyone a job.  Reality TV might have a more serious purpose, to show life in an EPCOT.  Let people decide for themselves if this is a future to favor.  [Product placement](http://controlroom.blogspot.com/2018/05/new-world-order.html) might happen even sans commercials.  We see the artifacts in action.  We talk about the brands we use.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}