{
  "id": "3272446880202600347",
  "title": "Virtual Worlds",
  "published": "2023-11-13T06:04:00.000-08:00",
  "updated": "2023-11-25T22:58:16.273-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjp4YRQkR124WVtRaOS_HU_dfhgzy3UkrmbXFOlcHNW0Lz0t0Hk-DJokLHW0DVulqW5q0_9MoTbeFKJvWmvOkwc1a56g-dfiWK1eL3cAlh2qgaTsTRVebpUmjbHa7CmtwtjztBh3oErt4Udo4z95S8NrgHNHNfAUs9tn_LXM-Kpjl8odwUFBweu/s480/gd_uncle_sam.jpg)\nYou may remember my virtualization model, inspired by my first encounter with an IBM mainframe. My account thereon emulated that of a mainframe operator. I had the resources of a whole computer, in virtual form, and could mount things, manage a file system, putter about in my cloud computer. That was in 1977, and here I am in 2023 enjoying much the same experience, with the toyz and I evolving together ever since we conjoined, or since I became a part of the cloud and/or internet, another host, another client.\n\nLater, post Princeton (Class of 1980), I got into the World Game simulation more, via the workshops (in Oregon, and in San Diego at the 1995 GENI Centennial) and by meeting Chuck Dingee, one of the workshop instructors. \n\nKiyoshi Kuromiya drove me to Medard Gabel's WG headquarters in Philadelphia. This was the group that used a gymnasium-sized version of the Fuller Projection to stage a World Game experience for participants, involving role playing.\n\nPutting these threads together, I see the tidy set of flags representing the United Nations, each decorating a console and/or control room, a kind of mission control, where the object on the big screen, what the monitors all monitor, is Planet Earth, the homeland. \n\nImagine a picture frame around the Big Blue Dot, with a national flag bottom center, attached to the frame. The insignia belongs to the control panel. Every nationality shares the same game board. \"This is your Israel, your promised land...\" \"This is all your Republic of South Africa, your promised land...\" \"This is all your United States, your promised land...\" Most of which is an ocean. One island in one ocean.\n\nDoes creating a new point of view always entail adding a new flag to the UN set? Not at all. IBM had (and has) a worldview. A given individual, a world game player, is free to walk from one control room to another, seeing the same Planet Earth through a large number of viewpoint windows. Israel's is a whole world view, Palestine's another, even if the latter is a virtual viewport with a diaspora for its citizenry, in the eyes of other nations. Universities might be able to step in with additional documentation permitting travel, if the nation-states don't feel up to it (more science fiction).\n\n\"Wandering from room to room\" doesn't have to mean physical travel, as we're talking headspaces mostly. In looking for communities that could use development and creatives, I'm seeking to open possibilities for refugees more generally. Each refugee family gets a menu of Asylum City projects, none of which in principle need be seen as dead end assignments without any possibility of return, should returning be in the cards (Bikini and Marshall Islanders are always wondering which atolls will still burn them alive).\n\nIn gaining hypothetical Palestinian citizenship in a diaspora nation, I'm still not necessarily freed from my penitentiary camp or compound by my UN prison guards. I'm perhaps imprisoned because I was forcibly displaced (or my grandparents were), but now that I want to leave my camp voluntarily, I'm told I can't be forced to leave, only to forced stay, by the international lawyers. If I try to force my way out, I'll be hunted, like an escaped slave in the pre Civil War US south.\n\nThe \"trust but verify\" approach adopted in negotiations around WMDs entails a lot of mutual surveillance, which parties may try to squirm out of, perhaps by exiting various treaties. \"If I stop spying on you, then I can rightfully stop you from spying on me\" might be the internal monologue, not always honest. Given parties to the original agreements may have considered them \"for the ages\" (long lasting), there's some inertia and some continuation of surveillance nonetheless, even to a point of some new regime taking over such that the exited treaties might be restored and renewed.\n\nIn the lead up to the 2nd attack on Iraq, post Desert Storm (now CNN's \"shock and awe\" campaign) I was always talking up surveillance as the way to nail down the results of any weapons purge, post the United Nations inspection program headed by UN inspector Scott Ritter. I published my little memos to Usenet, about all the webcams we'd be needing. \n\nI'm all for giving civilians the freedom to explore the benefits of nukes (including medical), where the danger of adding further weaponry is clearly a downside, not always factored in by the lobbyists, or even hyped as a net positive to the true believers.\n\nIn anticipation of a Chinese delegation coming to San Francisco, a theme of \"life in our urban centers\" is gathering steam (ramping up) on social media. How much will that city do to clean itself up before the Chinese cameras arrive, feeding millions of eyeballs with news about how the US is doing? Its regular folks, not its celebrated media personalities. Do other countries have this level of substance abuse? What experimental social policies are being tried?\n\nCitizens of a US mindset are likewise tuning in news from other states. Sometimes the enlightened approach is not to punish and criminalize but to invent new lifestyle possibilities.\nAlong those lines (homelessness, drug abuse, suicide...) is Germany really the basket case people say it is, ever since a pro-Ukrainian group sabotaged its infrastructure? I bet today's Germany would feel pretty normal to me, although it's been decades since I wandered the forest trails of Bavaria, or toured the industrial cities of Hamburg and  Cologne. I remember going through Checkpoint Charlie in our tour bus, back into East Berlin, where our train had stopped, coming from Scandinavia. Today, there's no more wall. Yet some states are building new walls. To what extent does the concept of citizenship require fences to make sense?\nThe tacit competition World Game sought to invoke was towards higher living standards, meaning likewise in an ethical sense, contrary to stereotypes. Living like a billionaire philanthropist is not all about creature comforts, the pandering to which shortens lifespans according to science. Most billionaires work out, realizing they're fortunate to be weighty (financially) and wanting to maximize the length of their lifetime scenarios.\n\nAthletes play to win but when genuinely in the spirit of the game, they're able to empathize and celebrate the victories of teams other than their own, based on quality of play, although fortune (luck) does play a role (per quantum mechanics (a type of thermodynamics)). \n\nHigh ranking military officers will cultivate this same empathy because it helps them think more like the enemy in some cases. Sometimes both sides sense political leaders have made this mess, and their clash is more a crash, like a train wreck. Such militaries feel abused. Tulsi Gabbard spoke up for them, although she's not a pacifist and carries a predictable level of antipathy towards Muslims, such as we've learned to expect from India's Hindus, influential among Samoans apparently.\n\nI tend to side with peace-loving civilians against those wishing to settle scores with outward violence, so I cheer when civilians manage to escape war zones and get on with their lives, perhaps returning to rebuild if and when order is restored. The Narnia kids got to do this, spending their childhoods in an alternative reality. The imagination provides a last resort form of escapism. \n\nThe martial arts are about controlling emotions and not rushing into reckless actions without thinking through consequences. Politicians without martial arts training may find their authority undermined, by mystery cults such as Mithraism. Military people start thinking alike, even across enemy boundaries, about the incompetence of a certain political class. This state of affairs doesn't always result in a coup or regime change, as those lacking imagination might suppose.\n\nA military may act in good conscience to defend a people, but if destruction engineering is the best answer (rubblizing the fruits of civilized living), with humans unwittingly caught in the crossfire (like on 9-11), then management failure higher in the chain of command is simply presumed, as a tautology. \n\nDesign science needs to be given a real chance first, and a lot of the time, that just doesn't happen. \n\nLetting civilians leave was an aspect of the conflicts both in Syria and Ukraine, and in Yugoslavia before that. Noncombatants had some humanitarian corridors to get out through. Convoys of buses arrived. You could elect to stay or go, amidst family pressures. If your nearest and dearest are all leaving, you might as well go too, unless your calling is to stay and fight some oppressor.\n\nOn the other hand, refugees fleeing devastation through Libya do not get supportive bus convoys or flotillas, operated by the many states. The navies and coast guards in question tend to criminalize migrating humans, finding them to be undocumented and therefore unworthy. \n\nThe Mediterranean is only partially organized around letting people merry-go-round on cruise and/or ferry ship tours, as if with Eurail passes. Folks in retirement phase, spending savings, or families working jobs at home, on a vacation, get to joy ride. Emigres get to walk or swim. Refugees get treated as outcasts.\n\nStateless humans suffer punishment by those enjoying statehood of some kind. The conquest of the planet by the prison states (states that act like prisons, keeping their peoples behind border fences, yet permeable to elites) is the story of recent chapters. The states hope to build more walls wherever they can gain a foothold as the ultimate public authorities, which is still an uphill battle for a lot of them, including in the federated states of North America.\n\nThat brings me to a concluding thought, which continues a thread raised by TrimTabbers on our last call. We were discussing Fuller's search, chronicled in his Ideas and Integrities (1963), for candidate college majors that might be used to unify the subdividing PhD specialties i.e. which majors might stay comprehensivist and polymathic? You need big picture thinkers, per Operating Manual for Spaceship Earth (1969).\n\nHe comes up with architecture as a main one, suggesting military logistics had been his own ticket to this mindset, but that this offering was now in retreat.  Architects might be molded into a type of social engineer who'd actually be integrated to in decision-making and planning circuits. \n\nOne of the TrimTabbers: \"so who is listening to such social engineers today and do we even have any worth listening to?\" Good question. I'd say many fancy themselves to be in such positions, even without \"social engineer\" on their business cards. From that point, our discussion moved (somewhat predictably I'd suggest) to Fuller's failure (a common topic) to persuade us that relative Utopia was really a choice beyond a fateful Oblivion. \n\nWe do not yet celebrate a shared comprehensivist viewpoint at this point, nor employ many polymaths, and we're therefore obviously going to hell. That seems closer to the consensus reality (CR) than than the Bucky buzz, which still heralds humanity's success, along with desovereignization.\n\nThat's right: Bucky disciples are not uniformly optimistic or upbeat given world trends. My main quibble with their conclusion is I regard Fuller to have personally been a success, in objective terms, given all his honorary degrees and stellar awards. Choosing oblivion would be more our failure than his. He did what he could. We don't get to use a double standard. Maybe judge your own performance first, before seeming to preside (serve as president) over others.\n\nHowever, from a flag wavy Uncle Sam informed viewpoint, I'm still in the game. My Uncle Sam (US) is a skeleton, Grateful Dead inspired, with additional iconography on the way, mixing in more baseball and other sports. My Ministry of Education after Occupy Portland is nowadays called Revolution Hall (we've been gentrified).\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi2ObbVuyPWV_2L7VvsuneNa0Y0vPQS3DmIjrZ7VSYSZvDzB-hOAGOFH7QlClVn7XpuO8L2mGgKIOMI6HkYD97tJmAkWsNHIfn1zuiwGemYB2lSYVHwpAbgTbFcMduXKJJsJnqMNXENsb159GzzYBSN1Yhc_N-2ixomh2JSdqk8FXUUTZ9DGjyd/s1024/bball_usa.png)\nThe bankruptcy of the US from the Grunch point of view (Fuller's) occurs in the Reagan Era, with an imposter state sponsored by Grunch continuing in its now-vacated WDC-based role, taking us deep into a dramatic if surreal chapter, featuring a lot of farce and fanaticism. \n\nOr call it satire, as clearly practically no one is into suspending their disbelief enough to read this narrative as anything beyond a prescient piece in the speculative financial genre (a kind of science fiction). It'd be another forty years before gambling on US bonds was seen as tantamount to providing Grunch with its own risk capital, to spend in elective showdowns.\n\nSee Grunch of Giants, required reading among the Bucky disciples, to sample the flavor of World Game globalism way back then. I set up a domain and Wordpress site (grunch.net) to further memorialize this history and to further explore the ramifications of his contributions, including his receiving a Medal of Freedom in the Reagan Era (a fact most high school texts still tend to suppress, especially the USA's public ones -- another sign of Grunch's dominance).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}