{
  "id": "4818321604747120752",
  "title": "Virtual Expos",
  "published": "2018-10-15T11:52:00.000-07:00",
  "updated": "2018-10-15T18:30:48.466-07:00",
  "content": "[](https://www.flickr.com/photos/osucommons/3619498493/in/album-72157619653342096/)\n\nLewis & Clark Exhibition, 1905\n\nThe so-called World's Fair, sometimes called an Exposition or Expo, was a much higher profile event before the corporate donors decided they had nothing worth showcasing.  Expos were for sharing Big Dreams for the future.  Electricity.  Freeways.\n\nNow that we're looking at Peak Oil and are facing the realities of atomic and plastic waste, a lot of it irretrievably mixed into the ecosystem, what's the Big Dream?  Universities may have degree programs in cleanup, but Earth Day and Expo were not originally planned to be the same.\n\nThe oil producing Arabians are among the most conscious of Peak Oil, given the oil boom happened only recently, to the whole planet of course, but especially to them.  Dr. Fuller referred to oil reserves as \"starter fluid\" somewhere.  We could use it to boot a sustainable global civilization, but not if we couldn't wean ourselves off the stuff in time.\n\nNow that we have television, internet, phones as movie cameras, the idea of millions flying or driving to an Expo might be counterproductive.  [We have Burning Man](http://worldgame.blogspot.com/2018/10/the-playa.html).\n\nThe idea of Virtual Expos might make some sense, and also ways to make global development scenarios more of an audience participation business.  Having people on street corners raising money is less imaginative than fielding roving crews of troubleshooters, with fans and contributors watching from home.  That's what Bizmo Diaries was a lot about:  fantasizing about those teams and the surrounding reality TV.\n\nBut don't business mobiles drink [a lot of Peak Oil](http://controlroom.blogspot.com/2009/10/oil-water-movie-review.html)?  Are they part of the problem more than part of the solution?  I'm all for having that debate.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}