{
  "id": "3809066863475386453",
  "title": "Waking the Poet",
  "published": "2009-02-22T19:09:00.000-08:00",
  "updated": "2009-02-22T22:01:15.568-08:00",
  "content": "The title alludes to [Gene Fowler's work](http://home.earthlink.net/%7Eacorioso/Waking_TOC.htm), another armed robber who found Bucky from prison, kind of romantic, good if reading is allowed, I'd say laptops should be, could be intranet only, then air gap, not saying its my business.I was telling this store clerk reading the dictionary today that the imprisoned Malcolm X found that therapeutic as well.  Many of us do, like I don't blame David F. for subscribing to the OED, not one bit.I led Adult First Day today, as a committee of one, focusing on a two part query:  (1) how am I nurtured by criss-crossing the Q | ~Q boundary? and (2) what equals from outside Q-dom might I bring to nurture our group?  That's cryptic I realize, using Q to mean Quaker, [~ to mean not](http://worldgame.blogspot.com/2007/01/m.html).  Philosophy trained, geek, other failings.I hadn't planned to speak beyond the intro, but wound up bringing up [Glenn Baker](http://worldgame.blogspot.com/2008/06/transitions.html) taking retired brass on tours of Cuba, as in \"let's meet the enemy, now that we're emeritus\".  They had some fun parties, [with Castro](http://mybizmo.blogspot.com/2006/09/lost-city-movie-review.html) included.[Glenn](http://worldgame.blogspot.com/2008/05/sunny-day.html) and [Applewhite](http://mybizmo.blogspot.com/2005/02/ayatollah-of-tetrahedron.html) met a few times; Ed kept mentioning he liked the embracing genericness of the name [CDI](http://www.cdi.org/) for some reason.  \"So maybe I could bring someone [high ranking](http://controlroom.blogspot.com/2006/11/no-problems-in-houston.html) from DoD to our meeting\" I mused (paraphrase)?  Like I'm [thinking of Nozizwe](http://controlroom.blogspot.com/2006/12/coffee-shop-talk.html) that time, and our meeting with [the DL](http://worldgame.blogspot.com/2007/07/10-questions-for-dalai-lama-movie.html) in Cape Town.Dr. Kasman worked in medical ethics in DC, which might explain the drift of my communications (i.e. people we both know). Her Hani was a hit with the kids.  Alexia and Tara made it to Ikea today.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}