{
  "id": "1390936414967828687",
  "title": "Walking with Nick",
  "published": "2010-11-18T15:46:00.000-08:00",
  "updated": "2010-11-18T17:22:16.119-08:00",
  "content": "I joined Dr. Consoletti for a saunter to 17th and Hawthorne, site of [the Barley Mill](http://mybizmo.blogspot.com/2008/09/quaker-curriculum.html) (a Grateful Dead capital) where we dined on tater tots, coffee and beer.  This was a chance to catch up, reminisce, compare notes.  Nick knows a lot, has been around the town a few times.  I value his information, much of which is in the category of \"news\" i.e. I knew nothing about it.  I'm far from omniscient, lets make that clear.Now I'm back at the meetinghouse, juggling logistics.  It's a crazy wet day and I forgot my bike lock again (Lindsey brought it).  My flashlight is underpowered.  I'm not appropriately equipped.  Call out the National Guard right?  When the absent minded professor decides he does wanna be president ([thinking of Albert](http://worldgame.blogspot.com/2010/07/einstein-omsi.html) again), stand back everyone, maybe lend an umbrella.I went back to [my yak of the morning](http://groups.yahoo.com/group/synergeo/message/63614), which is that (a) an aphoristic style ala both [Nietzsche](http://mybizmo.blogspot.com/2008/02/philosophy-101.html) and [Norman O. Brown](http://controlroom.blogspot.com/2009/03/airplane-reading.html) is apropos and (b) it's more up to self-professed humanities experts to grapple with Synergetics.  Leaving it to physicists and mathematicians is quite the opposite of stepping up to the plate.  You've got your philosophy of mathematics if you need to blend into the woodwork on occasion.  [Wittgenstein's stuff](http://coffeeshopsnet.blogspot.com/2010/07/on-wittgenstein-and-fuller.html) is almost custom made, for talking about cubing versus not-cubing, where 3rd powering is concerned.That's something to look at between your readings [of Emerson and Thoreau](http://worldgame.blogspot.com/2008/06/literary-investigation.html), maybe [Logicomix](http://coffeeshopsnet.blogspot.com/2010/05/buzz-about-shops.html).  Don't push it off on those \"engineers\" you need to vilify.  This is common heritage, a contribution to the vernacular, obtuse as it may seem.We talked about [Bonnie DeVarco](http://worldgame.blogspot.com/2004/10/blast-from-past.html), [at Bioneers](http://groups.yahoo.com/group/synergeo/message/63594) (way overpriced for depressing times, Nick thought), in the early days of BFI's founding.  We share a number of names in common.  You could call that a \"namespace\" if so inclined.Yes, I heard about the Medal of Freedom.  Sounds like there's more of a story there than most people know to tell.  How might we encourage future curriculum writers to delve more deeply?We also talked about the Coffee Shops Network, a way to get [faster geometry](http://coffeeshopsnet.blogspot.com/2010/06/streaming-sg.html) to the public without needing a visa from [the gulag](http://mybizmo.blogspot.com/2009/07/screen-tests.html).  Sit sipping your espresso, and see some of those memes you might have encountered in prose.  Maybe you've been a loyal reader of these blogs?  If so, you'll probably know it when you see it.I'm drenched and there's no one here (here's Justin).  I should get to work, washing those pots and pans.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}