{
  "id": "1665384496374036147",
  "title": "Wanderers 2016.7.6",
  "published": "2016-07-06T19:34:00.002-07:00",
  "updated": "2016-07-08T00:10:17.266-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/28087356911/in/dateposted-public/)\n\nI ended up spending much of the 4th of July, a holiday in this zip code (A) hanging out with old friends and (B) immersing myself in European history, French Enlightenment period especially, which overlaps a British Enlightenment coupled with an industrial revolution.\n\nSo, David Hume was highly admired in French salons for his cheerful temperament.  I need to dig up that article linking Hume with Zen (if memory serves, [that's what it did](http://www.theatlantic.com/magazine/archive/2015/10/how-david-hume-helped-me-solve-my-midlife-crisis/403195/)).\n\nRousseau, on the other hand, was rubbing too many people the wrong way, especially Established Religion.  He needed asylum.  Hume was persuaded to take up his cause, but with the warning that Rousseau often turned on his benefactors, and this ended up happening.\n\nWanderers was interesting today.  Glenn was discussing the global bead trading industry, going back to [the Indus Valley Civilization](https://youtu.be/n7ndRwqJYDM) of some 2000 BC and earlier, to known \"garnet mines\" in Northern India used over 10,000 years ago.\n\nActually garnet, a form of quartz, is often mined from riverbeds, tiny, pre-polished.  A pump drill may be operated one-handed, leaving the other to keep the bead in place.  Glenn had some specimens, with a magnifying glass, and a great book.\n\nStudying said book was an eye-opener, and reminded me that \"trader beads\" i.e. \"money\" were not a new phenomenon.  Gold aficionados harp on how any \"real\" currency is backed by gold, but rare gem stones, glass beads, necklaces, anything that looks really good and is hard to get, is worth having.\n\nHard currency looks \"good as gold\" by definition, as the promise of what it might buy if saved for future use.  In Critical Path money is backed by beef, i.e. cattle.  That's a good a backing as any, and Fuller elaborates on this narrative with a lot of Minoan imagery, proving he'd spent some time with Toynbee as a Delian.\n\nCritical Path was brave in that it cannot be taken literally in some of its more speculative sections.  As a prelude to Tetrascroll it's in part a fairy tale or myth, as the New York Times reviewer put it.\n\nAnyway, lets not trivialize currency systems by telling shallow stories about gold.  Yes, that element has many useful properties.  The Periodic Table is a great contribution to STEM, as is atomic theory, and the structural chemistry it begat, with Linus Pauling, in who's boyhood home we meet, a midwife in that begetting process.\n\nThomas Jefferson also featured in my studies, as did Ada again.  In Ada Byron's day, electricity as an isolated phenomenon, an object of scientific study, was fairly new.  Ben Franklin was in on the investigation.  Natural philosophers would astound the aristocratic class in [the resort city of Bath](https://youtu.be/ccfGq4Mqbjo), where the well-to-do went in search of miracle cures.  All manner of \"infotainment\" was made available.  The musician Herschel, and then astronomer, discoverer of Uranus, started out in this nexus.\n\nWhat Babbage and Ada didn't quite realize, was the Age of Steam was giving way to the Age of Electricity.  We'd still use steam, but not for delicate computations.  Transistors could do those.  We'd learn to etch silicon with photographs of city-sized machines, shrunk down to mere wafers.  These machines would be reliable and soon learn to communicate by radio, another consequence of our figuring out about the electromagnetic spectrum.\n\nWittgenstein and the Vienna Circle came later, around the time of the World Wars, in retrospect two chapters, followed by Cold, then Endless.  Yes in fast fowarding to Wittgenstein, I bleeped over Napoleon, the Indian then Civil then Spanish-American wars.\n\nLudwig Wittgenstein was an Austrian thinker from a wealthy family, looking to make a difference.  He ended up in Bertrand Russell's chambers and both men warmed to one another and learned from one another.\n\nLudwig showed up right around Russell's peaking in concentration.  The word on the street was Ludwig would carry on, picking up where the other left off.  Early 1900s.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}