{
  "id": "3546693524217716203",
  "title": "Wanderers 2009.20.1",
  "published": "2009-01-21T10:42:00.000-08:00",
  "updated": "2009-01-21T10:48:35.774-08:00",
  "content": "Tara managed to at least catch the new president's speech from PPS, though equipment troubles kept some of the musical numbers from reaching her public high school.She's been working on getting a speech and debate team started, having sampled Lincoln's and discovered her penchant for civic life.Given it's so \"bloody cold\" (a UKism) I chauffeured her to the library last night after the CBS News, showing up late for Wanderers.Steve Spiegel gave what I thought was a clear and concise presentation, full of good advice for improving community mental health, including political justice between cultures [ala DemocracyLab in my thinking], fewer messages about social status, and more respect for charitable subcultures [thinking Coffee Shops Network].He wondered why he didn't get a more appreciative audience in academia, with me suggesting his thinking was \"not obfuscated enough\" (i.e. was too easy to understand).Another interesting fact about Steve is he suffered intensely stress from the Vietnam War, though not from having directly partaken of the violence in distant Southeast Asia, but from not feeling effective enough in stopping the war where it began, in [the North American psyche](http://controlroom.blogspot.com/2008/09/paved-over-past.html).That war made him crazy and this little philosophy he's distilled to a few sheets of paper is what helped him get through it.Others around the table, such as Dick, Glenn and myself, were in Asia around that time.  My short time in Vietnam was as a civilian tourist however, whereas Dick was in Korea during some of the worst parts.  Glenn was at an NSA listening post very close to the DMZ.  He's not our only Wanderer with NSA experience -- thinking of Don Benson.I've temporarily signed in to the Chicago user group pre Pycon, got up to 53 slides yesterday, [focusing on \"topics\" versus \"lore\"](http://www.flickr.com/photos/17157315@N00/3214428790/).  How might a high school math teacher and corporate trainer both cover the same topics while keeping the material engaging and audience-appropriate?Lore is not just about banter or telling jokes, although that's part of it.Another secret is [Pascal's Triangle](http://www.flickr.com/photos/17157315@N00/3197627961/) is never an inappropriate topic, if handled mindfully and age-appropriately.Best wishes to Barbara, off to California again.  Sorry [Gordon](http://gordonriggs.blogspot.com/) -- sometimes this [absent minded thing](http://controlroom.blogspot.com/2008/12/nato-professor.html) catches up to me.  I'll make it up to ya.Morning after:  [Nancy and I](http://controlroom.blogspot.com/2008/01/launching-mother-ship.html) had coffee at Fine Grind today (greetings to staff), talking anthropology and religious \"isms\": Catholicism, Hinduism, Buddhism, Quakerism, [even Jungianism](http://controlroom.blogspot.com/2008/07/on-individualism-transcendentalism.html).  Nancy, a Wanderer, has personal experience with a number of these traditions, being a child of her times (eclectic, open to other cultures).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}