{
  "id": "2629523940088623357",
  "title": "Wanderers 2012.12.4",
  "published": "2012-12-05T02:11:00.000-08:00",
  "updated": "2012-12-05T20:50:04.217-08:00",
  "content": "Tonight we were graced with the presence of Sylvia Benner, along with [David DiNucci](http://www.flickr.com/photos/kirbyurner/8233461651/in/photostream), both legitimate spokespeople for the atheist and secular humanist community in Greater Portland.  Both were articulate and informative.  Wanderers are very receptive to these subcultures, having no set in stone doctrinal dogmas (we have a coffee fund).  [Bill Shepard](http://worldgame.blogspot.com/2009/07/wanderers-2009715.html) despised telling children about Santa Claus (in the sense of tricking them into false beliefs).  A lot of atheists are refugees from various religions, some disowned by their families.  Until recently, admitting to being an atheist was like committing social suicide.  You were a \"godless commie\" or whatever.\n\nBoth principals spoke with experience about the stresses of creating community.  People come in various stages of some progression.  Some feel deeply scarred and are angry at a particular religion.  Others seek low voltage interactions, nothing melodramatic.  The mix of characters may prove volatile.  A kind of alchemy goes on.\n\nI could identify.  I was sitting way in the back, in a nice comfy chair, mostly sitting in rapt attention, engaging in the discussion (\"is the Dalai Lama an atheist?\") but also focusing on [a Quaker blog](http://quakersusanne.wordpress.com/2012/11/24/another-difficult-topic-sex-offenders-and-quakers/) that had been brought to our attention by one of our members.  Once again (like in [those movies](http://controlroom.blogspot.com/2012/11/occupy-unmasked-movie-review.html)), rape was an issue.  [Various brands](http://quakersusanne.wordpress.com/2012/12/01/discipline-and-emotions-sex-offenders-and-quakers-part-ii/) of sex offender want community too.  Why not check out the Quakers, as they're probably not armed and likely not dangerous.  Sometimes it's tiring to have to watch one's back every day.  We get our share of tourists, looking for something more permanent.  Just like the humanists do.\n\nSylvia was on the whole upbeat about the future.  The fact that so many young people were not bothered by atheism as a position, had no bigotry against it, felt encouraging.  Maybe the world was growing more rational and intelligent?  Some statistics seemed to show that.\n\nIn some followup conversation I mentioned about being [a Quaker animist](http://mybizmo.blogspot.com/2008/01/lunch-in-old-town.html).  Like many humanists, I'm not that sapien-centric in that I respect and celebrate the nonhuman crew members aboard Spaceship Earth.\n\nOne of my themes for the Wanderers is we admit nonhuman members, and sure enough we had a dog present for this meeting, at the cost of come controversy given it snored loudly enough to interfere with some humans' hearing of the other humans.\n\nDuane Ray was by, haven't seen him in awhile, among other prominent movers and shakers.  We weren't all in totalitarian agreement on anything.  The discussion revealed rifts, but then consensus regarding belief systems was never the game or goal.\n\nLabeling and taxonomy were a core focus.  Are polytheists atheists?  The obvious answer is \"no\", but then if you've never believed in \"one god\" that seems somewhat atheistic to any God promoted as the one and only.  \"Apathist\" was another term bandied about.  Unlike the \"agnostic\" who either \"doesn't know\" or thinks people \"can't know\", the apathist just \"doesn't care\" one way or the other.  If one's commitment is to live an ethical life irrespective of stated beliefs, then \"knowing\" (in the sense of indulging in metaphysical belief systems) may be unnecessary.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}