{
  "id": "9142613762104067799",
  "title": "Wanderers 2012.7.25",
  "published": "2012-07-25T21:57:00.001-07:00",
  "updated": "2012-07-27T09:46:47.090-07:00",
  "content": "[Steve Holden](http://holdenweb.blogspot.com/2012/07/fun-and-games-at-oscon.html) and I were to present, post OSCON, about our sense of Open Source and so on. \n\nWhat's up with the FLOSS revolution?  Whiter teeth?\n\nAs anticipated, I had to skip the first hour.  Per Facebook from the night before, I've been doing car trips to Union Station, connecting with Amtrak and Greyhound. \n\nI'd also wanted to check in with Officer Walker at City Hall, where she's been undertaking logistics.  I shared that with the Quakers etc., Facebook Friends, in the context of updating my profile on several topics.\n\nI came into the room to find [John Taylor](http://worldgame.blogspot.com/2007/02/wanderers-2007228.html) had joined us.  He's on a stint from Indonesia.  At age 77, he's semi-retired, looking for a landing spot, maybe in Portland, for himself and his soon to retire younger wife. \n\nI'd helped John find temporary quarters while in town, after mom had offerred him Lindsey's storage studio, but I didn't think his head would survive the low rafters.\n\nFNB seems to be in flux again, with SE chapter not always so alone.  I sometimes get inquiries whether the Quakers might offer their kitchen again, one day a week.  I'd certainly be game. but I'm not clear what the routine would be. \n\nThat was something Lindsey and I did together for a year, before we went our separate ways in that namespace. \n\nAlthough I still play an administrative role as an anarcho-boss, I've been less of a fixture at Colonel Summers Park, and not just because of OSCON, Indiana.\n\nI've sketched [more FNB science fiction](http://tech.groups.yahoo.com/group/synergeo/message/70293) in the background.\n\nMy take on Open Source was it has become a recruiting tool in some ways.  If your company is not contributing something freely, of quality, then maybe your company has not much to offer? \n\nMine (ours) puts a lot of courseware out there for free, plus of course O'Reilly Media is behind OSCON itself, the Open Source Convention. \n\nI gave the example of Conoco-Phillips and the graphics package it maintains, [one of the topics](http://controlroom.blogspot.com/2007/07/python-in-control-room.html) at Europython a few years back.\n\nBut what what does \"of quality\" mean?  Do we recommend Zen and the Art of Motorcycle Maintenance at this point ([by Pirsig](http://en.wikipedia.org/wiki/Zen_and_the_Art_of_Motorcycle_Maintenance))?\n\nI confess I've been saying some relatively uncharitable things [about VistA](http://fcw.com/articles/2010/08/27/mumps-va-vista-system-roger-baker.aspx), the medical records system from the VA.  I had a run in with MUMPS (the M-language) earlier in my career and I just can't bring myself to think anything MUMPS has much of a half life. \n\nI say this as someone who has actively looked at the recruiting problem (how to get more M programmers?), made proposals (on math-thinking-l especially). \n\nI'm not one of those who thinks that just because something is \"open\", it is thereby \"of value\".\n\nSome of our group adjourned from the Pauling House to Pepino's down the street, for an outdoor eating experience. \n\nI worked from then forward until [the AFSC meeting](http://worldgame.blogspot.com/2012/05/afsc-program-committee-meeting.html).  We've been meeting monthly, with a bunch of us phoning in.  I've been hearing a lot of stories about the immigration situation.\n\nWhen the French donated the Statue of Liberty, with its inscription about \"send us your poor, your huddled masses\", what was the assumed debt?  What was owed? \n\nDid [the New Atlantis](http://controlroom.blogspot.com/2010/10/new-atlantis-movie-review.html) at one point promise the world to always serve as a beacon of hope? \n\nOne could say that was a part of the Telos, a promised land archetype, a Next / Other World.  A New Jerusalem.  God had led His people to less godforsaken parts, less mired in past soap operas.\n\n[The USA operating system](http://grunch.net/archives/117), now global, has a more closed feel about it, true, since Planet Earth is a ball. \n\nShe's not a \"closed system\" however, not in the thermodynamic sense. \n\nWe (as a species) have reason to hope for a breathable gas mix for some time to come.\n\nYes, I saw the stories about Greenland.  [Brian](http://mybizmo.blogspot.com/2012/07/condors.html) came on strong, about the 97% melt off.  But the footnotes did not escape me.  We've been here before, in like 1889, and the ice record tells a story:  every 150 years or so. \n\nBut given how many other curves are out of rhythm, or apparently so, it's hard to interpret what we're seeing. \n\nClimatology is properly a part of STEM, at least that much is obvious.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}