{
  "id": "993297309343861281",
  "title": "Wanderers 2015.5.13",
  "published": "2015-05-13T09:50:00.004-07:00",
  "updated": "2015-05-16T11:23:27.740-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/16942048124)\n\nI'm listening to some well sourced discussion of the earthquakes in the Himalayas.  We've got a speaker who goes there often, did his PhD work there, and is an accomplished Dev Team player, comes to Thirsters. \n\nThe police and army came through like gangbusters, on the street within five minutes pulling people out, with sacred sites protected also as a specific goal and task, for rebuilding later, nothing stolen, no souvenirs like in Baghdad. \n\nGovernment leaders seemed to disappear.  They abandoned ship in some way?  Of course the Internet was down and probably television?  Everyone disappears when the media stops working.  You need trained people on the scene anyway, not just improvs.\n\nThe airport was jammed with jets going in and out, huge volume.  Paperwork was a bottleneck as well and only registration was preserved with most customs falling by the wayside. \n\nTents were pilfered, when still on airport property (not all of them, just a lot). \n\nPeople need tents so chalk that up to free distribution?  People think \"plans\" must be followed, because they grew up in environments designed for school children.  That's me having an opinion.\n\nThe \"most deserving\" is always a difficult calculation and people don't always come to the same answers, so you have tug-o-war tensions among families, often characterized as \"class struggle\" in more superficial analyses.  Not that that's wrong.  At Hogwarts, Slytherin defends itself against the inferior houses, which are class-like in some ways.  Did you say Harry grew [a pair of horns](http://mybizmo.blogspot.com/2015/04/horns-movie-review.html)?  Hah hah.\n\nWe talked about the Newar Temple around the corner, so far spared by the earth's crust shaking, though many say Portland is overdue. \n\nWe're looking at a picture of a Gurung in his cape, who plays a role in Gurkha soldiery.  How does the English word \"private\" translate into many cultures? -- that became a next question. \n\nDave DiNucci is here, president of Greater Humanists.  We're brainstorming about [the house next door](http://controlroom.blogspot.com/2015/05/conference-call.html), also still standing. \n\n[The Gorkha Foundation](http://gorkhafoundation.org/).  That's the nonprofit this guy supports.  His name is Don. \n\nThey work with a hospital, Physicians without Borders and so on.  Tarps, blankets, food, medicine....\n\nKeeping it going over the long haul is the big challenge, after the media goes back to turning a blind eye.\n\n[](https://www.flickr.com/photos/afscportland/16944578153)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}