{
  "id": "5531249956504011728",
  "title": "Wanderers 2009.9.30",
  "published": "2009-09-30T00:18:00.000-07:00",
  "updated": "2009-10-01T09:55:32.782-07:00",
  "content": "This was a Tuesday night open session.  We talked about what that means.  Given our one big table configuration, cross talk among private parties adds to the hubbub, challenging those with hearing aids especially.  My proposal was to keep giving the floor to show & tell artists who'd guide the discussion, keeping cross talk (simultaneous conversations) to a minimum.  We also just need more hosted sessions (vs. open mic format).When actually talking about topics, we had this stellar [polyhedra-in-stereo exhibit](http://interisland.net/johngilbrough/Space/) c/o Bill Sheppard.  I was initially ho hum saying I see this kind of stuff a lot, then figured out it was all in JavaScript, not Java, which perked my interest.  Lindsey felt vindicated at this point, as JavaScript, Perl and C had been her favorite three horses back in the good old days in Savannah.  The Java craze was at high crest back then maybe.Nowadays its [more JavaScript we admire](http://controlroom.blogspot.com/2009/09/django-conference-day-1.html), though as a system language, Java has a great deal to offer (it's maybe what people did with it that sucks, at least at the enterprise level sometimes).  The sweet spot Lindsey likes (we all have our tastes) is that C-Assembler interface with the low level device drivers.  Letting something loosey goosey like Python control real world objects, [like choo choo trains](http://controlroom.blogspot.com/2008/07/infrastructure-park.html), sounds kinda perverse to her ears, and I understand that.  These Python extensions are written in C though, just export a control panel (API).When it was my turn to talk, I hooked the Ubuntu Starling to Don's Apple speakers and blasted [Tom Lehrer's New Math](http://video.google.com/videoplay?docid=-7841878207694220233#), writing the subtraction problem on the white board.  I had the longer (9 minute) [ballad about Ramanujan](http://www.archive.org/details/Ramanujan) queued next, but the torch never came back around.  Anyway, I've played it before, like on retreats 'n stuff, along with my fave [16 Words](http://mybizmo.blogspot.com/2007/09/lampoon-harpoon.html).  Billy Joel's [We Didn't Start the Fire](http://mybizmo.blogspot.com/2005/09/wanderers-retreat.html) and [Ghost in the Shell](http://mybizmo.blogspot.com/2006/03/st-patricks-day-wanderers-retreat.html) (anime) interlude scenes also top my list.I'm still angling to book LW some time on [the Jon Bunce upright](http://www.flickr.com/photos/17157315@N00/3947825595/), some discussion of music theory.  The classical pianist at Muddy's sure had some good advice, such as \"lose the bracelets\".  But then grand piano concert hall territory and punk bars just aren't the same deal.  One needs a range of costumes, matched to the venue in some way (perhaps to push the envelope, perhaps to camouflage ala our pet chameleon).We also discussed some of the stories prominent in the news:  the typhoons in the Philippines; the tsunami in Samoa, [various political stories](http://www.cbsnews.com/video/watch/?id=5353770n&tag=contentBody;housing) (some chatter about the so-called [butt bomber](http://www.cbsnews.com/video/watch/?id=5347857n&tag=mg;eveningnews)).I was fresh from watching CBS News, so relayed about Madeline Albright's [brooch collection](http://www.cbsnews.com/blogs/2009/09/25/couricandco/entry5340543.shtml?tag=contentMain;contentBody), not unlike Admiral Crowe's hat collection in some ways.  I'm sorry I missed her [at Bagdad that time](http://mybizmo.blogspot.com/2008/10/diplomacy-r-us.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}