{
  "id": "9115317433992325938",
  "title": "Wanderers 2018.8.21",
  "published": "2018-08-21T23:09:00.002-07:00",
  "updated": "2018-08-21T23:29:29.505-07:00",
  "content": "I haven't been chronicling Wanderers meetups at all frequently, in contrast to ages past. They're always datelined in that same titular format, so feel free to search, should you find intact infrastructure.\n\nOur practice as Wanderers is to practice \"open session\" wherein the conversation wanders and no one is obligated to stick to the topic, as there's no topic per se.  We sometimes take a vacation and turn the evening over to a leader, a presenter, thinking of ourselves as good guinea pigs, but then we go back to earning our name and reputation, as those with no fixed agenda, just a coffee fund.\n\nThe more formal story of our beginning is Terry Bristol, President of ISEPP, needed a stable of trusted conversationalists should a big wig come to town, meaning a top science & engineering practitioner and/or writer-journalist on the book selling circuit.  The cast was eclectic to say the least, with the guest often staying at the Heathman, then lecturing in one of Portland's swankest venues, either at the Schnitzer (old school theater palace) or the Christian church one door down (pews, gallery, organ), on the Park Blocks.\n\nSo say Jane Goodall shows up.  Everyone would like to meet her, but rather than mob the poor creature (actually quite self possessed), Terry could have a party, serve refreshments, and the Wanderers could instantly create the suave / sophisticated surroundings such a celebrity would have come to expect.  We were the proverbial intelligent laypeople, not peers perhaps, but from neighboring walks of life.\n\nTonight we practiced yammering about (a) the big bang (did it have a center) (b) whether any good could come of our grave circumstances (c) near death experiences, such as almost-drownings (d) paranormal phenomena (e) the non-existence, or existence, of extraterrestrials and why we haven't detected them yet (no one present argued that we had, but each meeting is a random function of who happens to show up).  We had some jokes and puns.  We were a sampling of genders and generations, I won't claim random.\n\nI want to mention in particular that Peter Sloterdijk came up and we debated the pronunciation of his name.  Francher has been delving into his most recent writings whereas I'm still stuck in the trilogy, Bubbles, Globes and Foams.  We are not of any special religious denomination and I would say we're mostly a haven for those who don't espouse any mainstream religion, or religion at all, but with numerous exceptions of course (we're riddled with true believers of one kind or another). \n\nFrancher and I are especially fans of Buckminster Fuller, whom Sloterdijk writes about quite a bit.  I'm also into the Wittgenstein stuff.  Larry knew the Trimtab meme. Later I posted to Facebook, in the spirit of what I'd said then:\n\nWhen\n I look back in history it's like Alexander Bell (telephone, \"kites\"), \ncontainer shipping, the internet (more than just Al Gore)... i.e. I \ndon't place my hopes & dreams [tm] in the hands of prima donna \nactor-lawyers who claim DC as their Hollywood-like universal studios \n(many well-known backdrops).  They're entertainment, at best a \nsimulation, but these days sing off key.  My focus is on the artifacts, \nlike the cars and trucks.  Highways.  Bridges.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}