{
  "id": "613871593896114503",
  "title": "Wanderers 2017.12.27",
  "published": "2016-12-28T12:04:00.000-08:00",
  "updated": "2016-12-28T15:38:09.268-08:00",
  "content": "Don organized this Tuesday's meetup around sharing a short movie about the power of advertising.  The writer-producer says what distinguishes capitalism is its huge output, with the log-jam (potentially) in not giving players enough incentive to consume it all.\n\nThe analysis casts the players in their archetypal role as mindless, once the brainwashing is complete, and still unsatisfied, because one never really has enough of what one doesn't really need.  \"Enough is never enough\" as they say, in Over the Hedge, a cartoon parody of [suburban living](http://mybizmo.blogspot.com/2009/11/end-of-suburbia-movie-review.html).\n\nA shortcoming in the analysis is how lack of means puts severe brakes on consumption, such that advertising works against itself in portraying an unattainable never-land as its mythical backdrop, but then promulgates \"starvation wages\" as what all these consumerists deserve.  The left hand fights with the right and capitalism becomes semi-paralyzed.\n\nThe question \"what makes us happy?\" and the false answer \"more stuff\" avoids another question: \"what is work?\"  Work from whence happiness derives, versus some mindless \"pursuit\" of end-of-the-rainbow type happiness, would seem a more secure footing with which to gain traction.  What does advertising tell us about that?\n\nAdvertising tells us that doing advertising, or PЯ as I like to call it (rolling in [propaganda](http://tvtropes.org/pmwiki/pmwiki.php/Main/TheBackwardsR)), is powerful and effective and well worth paying top dollar for.  This DVD said much the same, attributing all kinds of power to advertising even while skirting the question \"is it effective?\" -- the assumption already being, that it is.\n\nI've been recalling the Hunger Project and the level of cynicism that quickly grew up around it, as a purpose of that project was to bring to bear the full power of advertising to unleash our outrage about low living standards on the richest planet in the solar system (by far).\n\nWe're like a superpower compared to Mars, so why do we let Earthlings die in droves from easily preventable causes?  The humans rose up against the prospect of full-scale brainwashing PЯ campaigns for anything other than their customary purposes.  The Hunger Project as envisioned [by est Trainers](http://controlroom.blogspot.com/2009/12/some-storytelling.html), was strangled in its cradle by righteous critics.\n\nHowever, now that we've had some decades to even more fully appreciate the power of memes and memeplexes, with memetics a mature science (with a little help from anthropology), we might be ready to try again at outgrowing our old ideas about \"what is work\" and look for something more satisfying than bombing ourselves back to the stone age, as we seem to still consider a likely prospect.\n\nIf you're part of the problem are you really working?  I'd say a lot of money is spent forcing people to do \"negative work\" in exchange for compliance.  \"Compensation\" we call it, and with good reason.  I take issue with this idea of \"net worth\" and [side with GST](http://grunch.net/synergetics/gst1.html) against the most laggardly forms of Economics, which confuse wealth with money far too carelessly.\n\nWe used my Mac Air with a borrowed DVD player, connected by USB.  The technology performed well. I didn't contribute much to the discussion as I think about advertising all the time and didn't want to get myself started.  I'm not at Wanderers to hear myself think.  I get that pretty much wherever I go.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}