{
  "id": "2469262203265916672",
  "title": "Wanderers 2009.2.11",
  "published": "2009-02-11T08:04:00.000-08:00",
  "updated": "2009-02-14T01:32:49.777-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj2oyY35e4Jl20ThE7Kcww-IZfEm3c5LIvi0nEoc1zJctfQHSTVjKICv9Ocxn-agZAS3imLppcX73O0U8T7HgtgQpQajneMAXINS4vQ0dwUuFAVnrYVrP1BjWJ1LgoK9s3JuLZ9/s1600-h/00028.jpg)This morning's presentation by Helen Spector is on [Appreciative Inquiry](http://appreciativeinquiry.case.edu/).First we learned about a PBS TV show (available through Netflix) on The Hobart Shakespeareans:  5th graders, many with English as a 2nd language, work with Mark Twain, math concepts, a variety of other content, to produce a Shakespearian play as a project.The fundamental premise of appreciative inquiry is we get answers to our questions, and we have the choice to focus on what's working.We did an exercise in appreciative listening with a partner, a guided interview, preferably with someone we didn't already know.  Then we introduced our partner focusing on something that surprised and delighted us about that person.Our energy as a group was raised by this process.  Buzz, with history as a radio broadcaster, liked the combination of \"relevant reverence\" with high bandwidth, \"an ideal combination for radio listeners wanting to expand their thinking\".\"Appreciative\" means \"growing in value over time\" not \"mindless happy talk\".  Questions focus attention.  Energy follows attention.  We get more of that to which we give our attention.  Ergo, the first question is fateful.  Focusing on \"what's broken\" may not be as productive as focusing on \"what's working\".  Stories matter, contextualize the technical information (one of my themes as well).We heard a story about Avon, how these techniques helped turn the company culture around, by focusing the group on what generative and respectful relations between men and women would be like, drawing on real experiences that workers could draw upon.The cycle of Appreciative Inquiry Helen drew on the white board was one of Develop, Discover, Dream, Design, Deliver, and back to Develop.  There's a methodology and a stance, the latter having to do with the questions, getting in touch with what works.  The literature, a lot of it from Case Western Reserve, refers to this as a 4D or 5D cycle (depending on whether Develop is included).Develop:  the question (e.g. what's working? -- a surprising question will redirect from a dead end).  Discover:  info about what works. Dream:  vision for the future.  Design:  the social infrastructure to support the dream.  Delivery: implementation.  Then what do we want to inquire into next?  Back to Develop.Interviewing is a core methodology in this management framework (there's a discovery interview protocol), more important than surveys or polling.  \"When do I get to say what's not working?\" sometimes comes up in this process.  Helen:  in the wishes.Anna Roys is with us, having arrived from Alaska (via Seattle) at 6:45 AM.  Anna is talking about the wildlife she gets to observe in her neighborhood, a live action version of Animal Planet. Some of these tools might be useful in her work around TECC.  I'm seeing applications in my own career as well.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}