{
  "id": "2069328704890679064",
  "title": "Wanderers @ OMSI",
  "published": "2016-12-14T00:00:00.002-08:00",
  "updated": "2016-12-14T11:50:17.682-08:00",
  "content": "OMSI is our local science and industry museum, of which I've always been a fan, since I was single digit, age-wise.  By now I'm almost sixty, and OMSI has moved, having been near Oregon Zoo in the old days.  Packy the elephant, a resident of said zoo, and I, are about the same age.  He's not doing well, bad case of TB.  I remember first seeing pictures of TB germs at OMSI. Small world.\n\nOur speaker  tonight, Dr. Sarah Schaack, was well practiced, having appeared in ten previous science pubs, or the like.  It's called a \"science pub\" because yes, they let us bring beer to our seats.  These were the really steep seats of the movie theater, originally Omnimax, now branded 4K and no longer projecting on a curved screen.  Quite the remodel.\n\nOur topic: the human genome (and the genomes of other animals), its sequencing, what it is, why it matters and so on.  Given the gigantic screen and super high resolution projector, we were treated to a Powerpoint on steroids.  Our Reed College professor needed to gaze up at three story high slides from close range, and not lose her balance.\n\nDon consulted with a few of us Wanderers, before announcing this experiment, in which we would forego meeting at our usual location, the Linus Pauling House, and congregate at OMSI instead.  Glenn and I road with Barry in his Mustang, who fought his way to our zip code through rush hour.\n\nSpeaking of Barry, I take care of a python (as in snake) by the same name, here in my office-plex.  I decided to give his aquarium a thorough cleaning today, and somewhere in the process, cut a knuckle, leaving a visible wound, upon which the human Barry later commented.\n\nMy mind was already drifting along the day-dream of gene transfer, me absorbing some snake genes through the cut.  That could only be mythographical, like what happened to Peter Parker in Spiderman (horizontal transport -- one of the warm-up quiz questions).\n\nThe human genome, especially the Y chromosome, is enlarged with a library of what we might call transient sequences, not part of the active protein-encoding version, more like skipped code, a wasteland in some accounts, a valuable repository in others. \n\nI'm reminded of human language and the many memeplexes that lay dormant, possible, even potential, but not much expressed.  Diversity lays dormant, between the lines.  Humans are packed with such \"detritus\" which may be our salvation in the long run.\n\nThe talk was free-ranging, if bound by the slides.  The Q&A afterward was even more so.  Portland has a rather science-savvy subculture.  Lots of geeks have moved here.  They don't call this the Silicon Forest for no reason, and genomics seems a branch of bioinformatics in many ways.\n\nAfter PCR, this process called CRISPR is the next big breakthrough. I missed an ISEPP lecture on that topic.  We learned about the patent war and what's at stake with that.  Geeks are always explaining to other geeks about one intellectual property war or another.  The cost of sequencing has been plummeting.  Now we're getting better at synthesis, not just analysis.\n\nWe learned about daphnia, somewhat ugly critters that pass DNA from one generation to the next asexually, unless under pressure.\n\nMutations sound like a bad thing to most ears, however most are considered harmless, and every so often the new sequence may be just what the doctor ordered.\n\nWe don't have all the big data we'd need to really cross-correlate genetic sequences to phenotypes, meaning profiles.  You need more than just a pile of genetic sequences to discover links to whatever traits.  We have a long way to go with our analysis.\n\nWe had a talk on genotype / phenotype matching at [@OMSI](https://twitter.com/OMSI) last night.  Science pub. Blogged write-up: [https://t.co/qjZLgg9UKJ](https://t.co/qjZLgg9UKJ) [https://t.co/8PcdcS9OTW](https://t.co/8PcdcS9OTW)\n— Kirby Urner (@4DsolutionsPDX) [December 14, 2016](https://twitter.com/4DsolutionsPDX/status/809120612924821505)\n\nBooks I recommend for learning Python:[https://t.co/0QbAOCwDji](https://t.co/0QbAOCwDji)Oregon Curriculum Network [#OCN](https://twitter.com/hashtag/OCN?src=hash) -- I'm also with Coffee Shops Network ([#CSN](https://twitter.com/hashtag/CSN?src=hash))\n— Kirby Urner (@4DsolutionsPDX) [December 14, 2016](https://twitter.com/4DsolutionsPDX/status/809122082810269696)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}