{
  "id": "113647341973393142",
  "title": "Wanderering in PDX",
  "published": "2006-01-05T07:33:00.000-08:00",
  "updated": "2012-06-18T20:39:40.806-07:00",
  "content": "Yesterday morning I wandered over to Pauling House to run camera for Terry, who was talking thermodynamics ala Into The Cool, Galileo vs. Da Vinci, engineering as art.  Terry drove me home so I could dig out the two tapes of [Rick's talk](http://worldgame.blogspot.com/2005/10/wanderers-20051018.html).  Then I joined Don and Rick himself for a Thai lunch at [Thanh Thao](http://cuisinenet.com/info/?v=237&/portland/rest/7556.shtml).\n\nLater brainstorming with Don helped me think through some issues with my new designer religion, a form of Quakerism (speaking of which, I saw Janet Jump sitting in her car one block north of Fremont as we headed towards the boat).  I'd like to bring Eve into the foreground (speaking of whom, it was great to have Eve back at Wanderers yesterday), stop blaming her for the whole snake business.  We'll use a tetrahedron as a \"temple of eVe\" symbol, plus the snake reconnects us to Naga, ala [Tetrascroll](http://www.amazon.com/gp/product/0312793626/qid=1136845405/102-9371474-8621747).\n\nYes, there's a kind of feminism implied here, drawing from [Gerald Gardner](http://www.geraldgardner.com/), [Joss Whedon](http://www.imdb.com/name/nm0923736/), [Starhawk](http://www.starhawk.org/) et al, although speaking as a guy, I'm treading lightly to not wall myself out (\"Kirby's angels\").  I'm also interested in a series of Meliptus commercials which make people really want to sign up for the seminar or training or whatever, but it turns out the ads (e.g. \"step into yourself\") are the product.  There's nothing to take ([an obvious allusion](http://www.hulu.com/watch/151134)).\n\nOK, that's on the humanities side.\n\nOn the other side of the chasm (C.P. Snow's), I've got my new computer.org mailing address working, thanks to IEEE, and have reupped with [math-thinking-l](http://mail.geneseo.edu/mailman/listinfo/math-thinking-l).  I've been a busy bee already [this month](http://mail.geneseo.edu/pipermail/math-thinking-l/2006-January/date.html).\n\nOn the way home from the boat, I stopped at a Safeway to buy Soduku puzzles for Dawn, then rode the Max to Hollywood, where I side-tripped to Trader Joe's for some Yemen Mocha (coffee beans I favor).  I'm drinking some now, from my new Starbucks Barista (an Xmas present).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}