{
  "id": "5047625354000959691",
  "title": "Wanderers 2014.1.14",
  "published": "2014-01-14T23:59:00.002-08:00",
  "updated": "2014-01-19T19:12:23.972-08:00",
  "content": ":: michael gholtston and trish ::\n\nWe were privileged to hear the life stories of an adventurer and explorer tonight, one Michael David Gholston, author of the slim autobiography Any Road.\n\nHe had been a war time journalist in Vietnam, and Iraq.  He'd lived in remote parts of Alaska for many years, also as a journalist.\n\nHe had tried his hand at becoming a pharmacologist which is where he met Trish, a long time teacher of pharmacological mathematics.  He was one of her older male students.  He was actually hoping to help nurse his former wife through an illness as a side benefit of this new occupation.\n\nTrish, in turn, had been a one time electronics student of Don's, the guy to go to if you want to give a Wanderers presentation.  He was on faculty at Mt. Hood Community College at that time, an institution Michael, our speaker, had also attended, studying broadcast journalism.\n\nBut it didn't take, that pharmacology career, and his friend and partner had died.  He re-enlisted in the military, the Army this time, at 52, and wound up covering serious carnage in Iraq, a huge truck bomb attack against a religious minority near the border with Syria.\n\nDid I mention Katrina?  He was there too, doing video journalism for the National Guard.\n\nHis Vietnam experience was on the USS Hancock, the 1940s vintage aircraft carrier, sent to manage the evacuation of the US Embassy by helicopter, or shall we say the evacuation through the US Embassy.\n\nAnd Guantanamo, he'd been there since Iraq.\n\nThis guy really gets around.\n\nAs I say, we were privileged to hear from him first hand, and to buy the book if we wanted (I wanted but am on a tight budget, might get to borrow Trish's sometime).\n\nAt heart he's this Quaker kid from Camus, Washington who just wanted to see the world and what it was all about, up close and personal.  He has never supported wars, but he does serve in them as one who documents what happens, to whom, and how.  He's an historian and anthropologist.  He reminded me of [Mike Shiley](http://worldgame.blogspot.com/2005/01/inside-iraq-untold-stories-movie.html).\n\nI had the bright idea to do our go-around of introductions a little differently, adopting the technique where people introduce each other i.e. not themselves, but someone else.  That's actually a great exercise in a small group like this one and people had some fun with it.\n\nThe guy introducing me didn't know me from Adam, nor I him, and I encouraged him to just make stuff up.  I was keeping it light-hearted.  He said I was \"some nice guy\" which was a fine intro (he'd been an engineer and spokesperson for Tri-Met (I wondered if he'd dealt with the case of [George Hammond](http://worldgame.blogspot.com/2005/01/brainstorming-about-pedagogy.html), another Wanderer and pioneer for allowing Segways on TriMet)).\n\nI introduced Barry but forgot to mention his time in the Peace Corps, which is an important aspect of Barry.  Oh well, takes practice.  I also introduced [Jeff](http://controlroom.blogspot.com/2010/01/message-traffic.html), as a provider of infrastructure of help to musicians.\n\nWe had our new bookseller partners with us, the couple who've taken over the middle structure on this Pauling Campus.  That's geography described elsewhere.\n\nThe famous statue Alpha Helix [by Julian Vos-Andreae](http://mybizmo.blogspot.com/2005/01/going-down.html) is directly in front of the new bookstore, which is truth in advertising, as the books include many good titles in the sciences and mathematics.  I was just checking them out today, paying my first ever visit (in this bookstore chapter) to the 2nd floor.\n\nI knew Steve Holden would be arriving at PDX tonight if all went according to plan, which it did.  I taxied him from the airport, the conclusion of a 27 hour journey beginning in England. \n\nThe reason they pushed those helicopters over the side of the USS Hancock (famous footage, surreal seeming) is that there were already plenty of helicopters ashore, and in an evacuation you need to make room for the incoming refugees.  The helicopters already on deck became surplus and on an aircraft carrier every inch of space is precious and a potential landing zone.  The decision to abandon hardware in favor of people was a compassionate one.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}