{
  "id": "5226105427935294897",
  "title": "Wanderers 2012.4.18",
  "published": "2012-04-18T10:48:00.002-07:00",
  "updated": "2012-04-20T14:50:36.371-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/6945069974/)\n\nWe're enjoying a total geek out this morning, doing Solar System 101.  [Jim Buxton](http://worldgame.blogspot.com/2006/10/libyan-eclipse.html) is studying various periodic phenomena relating to Earth's tilt.  David DiNucci has his book ready to go, so we're looking at that too.  [Lew](http://www.flickr.com/photos/17157315@N00/4952432659/) was part of the hiking group finding [Ki-a-Kuts Falls](http://en.wikipedia.org/wiki/Ki-a-Kuts_Falls) in the 1990s, his idea for the name, and that's been reviewed on TV recently.\n\nI'm short on sleep these days.  Our Ministry has shifted into high gear.  [The joint statement](http://mathforum.org/kb/thread.jspa?threadID=2367924) from the NCTM and MAA opens the door to open source and/or \"gnu\" mathematics (a pun on \"new math\").\n\nI completed a course [on accreditation](http://www.detc.org/) in the USA jurisdiction, which social process relies on NGOs and the natural tendency of institutions to want to set standards.  Affiliations crisscross every which way as USAers police each other.\n\nThe Earth zips along at a greater clip in the calendar around January, though given the orbit isn't that far from circular, these \"equal areas in equal times\" phenomena are not highly pronounced.  The motion is slightly slower at the aphelion.  [Animations](http://www.windows2universe.org/physical_science/physics/mechanics/orbit/perihelion_aphelion.html) tend to exaggerate.\n\nAlso, it takes another four minutes a day to turn around a little more to see the Sun in the same place, given the shifting viewpoint.  So that means adding four minutes a day every day, which adds up to about  a day's worth a year.\n\n[Nikki wondered](http://worldgame.blogspot.com/2012/04/spring-cleaning.html) if I was prepared for such a big bill.  Self employment takes its high tolls.  My income was 1099 based in 2011.  I said good bye to some $13K in one evening (including Oregon State taxes).\n\nWe'll scrape together some $ for debate clothes for Tara (she's combating at the state championship soon) and to fix the dryer.  We'll slowly rebuild.  In the meantime, I'm a harder target when it comes to politicking.  The numbers all check, within assertAlmostEqual floating point limits (geek joke).\n\nQuakers were mostly in the dark about the minute on Occupy that was going around, so Business Meeting decided to [kick the can down the road](http://worldgame.blogspot.com/2009/11/kicking-can-down-road.html) on that one.  [Josh \"the rooster\" von Kuster](http://www.facebook.com/kustertherooster), was helping shepherd and officiate, though Occupy had its own representative (no, not me).\n\nI don't see a need to conduct these national / international affairs at the NPYM level also, other than through the AFSC rep structure, which is active and high bandwidth.  Is FCNL involved in Arab Spring as well?  -- a question for Leslie (her nomination is seasoning).\n\nI sent around a memo suggesting NPYM no longer bother with a Peace and Social Concerns Committee that meets face-to-face but once a year.  Our circuits need to be faster and more responsive than that.\n\nNot that I'm giving orders (this isn't the USN).  I'm more just signalling Pam that Nominating could and should carry a lighter load (consistent with NPYM's founding goals per the lore (goal:  minimize the need for business at Annual Session)).\n\nThanks to networks and networking (alluding to the Grunch book), Quakers are moving to resonate at higher frequency (so should we call them Buzzers? -- like cell phones on vibrate?).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}