{
  "id": "3970779536460960142",
  "title": "Wanderers 2016.5.17",
  "published": "2016-05-17T19:50:00.001-07:00",
  "updated": "2016-05-21T17:03:35.414-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/27049480236/in/dateposted-public/)\n\nMy odometer flipped over today, from 57 to 58.  Mom sent me a nice email.  She had a grand 87th birthday in April thanks to WILPF members and other fans.\n\nI started the day making Soylent waffles, then joined some fine younger women, and their children (one only six months of age) for a walk in the Leach Botanical Garden.\n\nMelody, not with child, rejoined me later for ciders at Hop House.  Thank you Melody, for inviting me out to the garden.  Jen and Yarrow will be moving away soon, to California.\n\nNow I'm at the Linus Pauling House, a packed house tonight.\n\nDuane Ray is catching us up on gravitational waves, the theory behind them, especially the heroic efforts of Joseph Weber to detect them.\n\nWeber enrolled scientists in the possibility that gravitational waves could be detected.  Kip Thorne also deserves honorable mention.\n\nThe Laser Interferometer Ground Observatory (LIGO) is the instrument designed to register ripples in time-size.  Two of them (one at Hanford, one in Louisiana) picked up the same blip recently, making headlines.\n\nWhen it comes to \"making waves\" we should acknowledge that language itself is a tensive medium, and scientific discoveries may have the effect of \"re-vectoring\" word-meanings.  A visual metaphor, of some phase space, has us thinking of word-meanings having trajectories.\n\nThe meaning of \"gravity\" (a term) is being affected.  Meaning derives from use.  Usage patterns [have changed](http://physics.stackexchange.com/questions/192679/how-can-laser-interferometry-be-used-to-measure-path-difference-smaller-than-wav), thanks to these 40 kg mirrors, suspended, in a vacuum.  A tautology.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}