{
  "id": "116067906527550671",
  "title": "Wanderers 2006.10.11",
  "published": "2006-10-12T12:07:00.000-07:00",
  "updated": "2006-11-15T11:44:06.283-08:00",
  "content": "Our featured presenter needed to absent himself, owing to illness, so ISEPP president Terry Bristol, ever looking for the opening, seized the occasion to polish his talk, which he recently delivered in Salzburg (I'm not clear on the details).For the first hour at least, he gets rapt attention from our ilk.I only showed later, per my Wednesday morning routine, and helped out with some curious allusions to prajnaparamita (a little Sanskrit goes a long way with engineers) and Avogadro's Law (he was doing Boltzmann's), plus a few jokes.I also milled about in the kitchen near the coffee maker, chatting up the possibility of a Wal*Mart in Pyongyang with Jon, perhaps with an announcement as early as November 2nd?  Later, I made some snide and sarcastic remarks about \"sitting duck\" aircraft carriers like the USS Eisenhower, rumoredly preparing for battle in some dimension.Per these sitting ducks, you have to read Critical Path to understand how we Fuller Schoolers identify them with the [moronic element](http://www.grunch.net/synergetics/gst2.html) that makes bad policies worse out of greed and its consequents, [guilt & fear](http://worldgame.blogspot.com/2004/11/catholic-economy.html) e.g. we can't \"cut and run\" because some of these [outraged civilians](http://worldgame.blogspot.com/2005/01/rebuilding-iraq.html) are justifiably angry at being murdered for their oil, and might take their beef to our highest courts and win.More power to 'em.  That'd be democracy in action.Anyway, I'm brainstorming a movie wherein we expend unneeded cruise missiles against no-longer-relevant aircraft carriers.  Why use mockups and CGI and you have a lot of spare hardware just sitting around doing nothing useful?Terry's talk is getting a lot better.  He's bascially using Chaos Theory to help the more retarded among the Physicists understand why their \"fundamentalism\" (aka reductionism) isn't philosophically all that interesting or alluring to big money investors any more.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}