{
  "id": "1989929979752742380",
  "title": "Wanderers 2013.9.24",
  "published": "2013-09-25T00:01:00.002-07:00",
  "updated": "2013-09-25T17:42:22.557-07:00",
  "content": "Patricia Rumer has followed the action in Guatemala since the late 1960s, when she saw police bashing skulls at the Democratic National Convention in Chicago and decided she'd had enough of the USA for awhile, or at least needed some perspective.  That she got, in Guatemala.\n\nWhat indigenous peoples have experienced at the hands of \"the government\" (a militia, more like Burma's) is going down in history as a Civil War, complete with genocide.  USAers may remember it from the Reagan years.  They won't remember the general,  Rios Montt, against whom a lawsuit was brought, but then dismissed in a backroom process, after a guilty verdict.\n\nI don't know if they wanted a grisly hanging or what, but he, at 85, still has the comfort of his family and many of them don't.\n\nIndigenous folk are always great at using the civilized option, doesn't it seem, just as in the USA they're like walking encyclopedia attorneys when it comes to treaty law, whereas average gringos are sipping Slurpees [tm] and watching Beavis and Butthead on DVD.\n\nI showed up early to provide A/V, though Patricia had brought her own Windows computer.  The PowerPoint came up just fine in Preview off her thumb drive; the Mac Air came through, as it often does.  I depend on it greatly.\n\nThe audience was a mix of those who had, and had not been to Guatemala.  We went around the table answering that question in particular.\n\nAlthough I've been a gringo in a martial law zone, that wasn't in a Banana Republic, unless you count the USA as a Banana Republic, and that argument could and has been made (including by me).  You say we're not enjoying martial law but I'd say at least foreign policy has been pretty well militarized.\n\nDiplomacy these days usually means \"lip service\" to something, and is not a serious career -- judging from recent [scandalous admissions](http://mybizmo.blogspot.com/2013/09/lunch-at-maru.html) about relations with Iran.\n\nAnyway, our audience was a mix and some were most interested in the more gender-specific injustices, such as rape, overwhelmingly a male offense, and sex trafficking (ditto).\n\nDoes it start in the School of the Americas?  We should get a copy of that school's honor code sometime, for analysis.  Lots of people have that school as their focus so this research sounds doable at least.  In which course is rape discussed and dissected as a tool of intimidation against a Cold War backdrop.\n\nActually there was maybe some question around the table about whether Cold War terminology was relevant any longer.  Lew Scholl was there, and Lynne Taylor, the latter being chief organizer of the recent [World Religions confab](http://controlroom.blogspot.com/2013/09/interfaith-meetup.html) (no Mormons, but then Atheists don't get much attention either and certainly we had one of those).\n\nThis was a high powered group, we Wanderers, lots of worldly experience.  And yet none of us sounds like a Cold Warrior.  We're pretty much bored with the \"capitalism versus communism\" dialectic.  What was supposed to come next again?  Some withering of the state wasn't it?  Shall we get on with it then?\n\nPatricia was eloquent in her analysis.  She focused a lot on the need for bottom-up grass-roots decentralized planning styles.  If you want  your copper mines, why not willingly go through channels versus throwing all your eggs in some short term top-down basket?\n\nWhy cast your lot with some Burma-style militia?  Why not plan for the long term and do your mine in partnership, and with the proper feng shui?  Stretch it out.  Don't try compressing multiple generations into one.  Wheels have their different turn cycles.\n\nIf mining is truly unaffordable, the decision will be reached, but in a lot of cases, there'd be ways to develop the resources to some level without making enemies for life of the current landholders.\n\nI'm not sure what US Embassies advertise as their role to political fundraisers for Congressional  positions.  Perhaps State is weak because it over-promises way more than it can deliver, which makes the military nervously insert itself lest \"America seem weak\" (how often do we hear that?).\n\nDid you over-promise on the power of a US Embassy as a bully pulpit and now feel hat-in-hand towards your sponsors in some board game, where natural resources are like tokens?  Is this Monopoly?  Does DC even know what game it's playing?  Forgive me for not having all the answers.  An investigation is underway.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}