{
  "id": "7814283057544185172",
  "title": "Wanderers 2014.12.2",
  "published": "2014-12-02T19:54:00.000-08:00",
  "updated": "2020-06-23T10:02:50.895-07:00",
  "content": "One of our topics tonight:  where does \"hippie\" come from?\n\nIn [Greenwich Village](http://en.wikipedia.org/wiki/Greenwich_Village), [New York City](http://en.wikipedia.org/wiki/New_York_City) by the end of the 1950s, young [counterculture](http://en.wikipedia.org/wiki/Counterculture) advocates were widely called hips because they were considered \"in the know\" or \"cool\", as opposed to being [square](http://en.wikipedia.org/wiki/Square_%28slang%29). One of the earliest attestations of the term hippy is found in the \"Dictionary of Hip Words and Phrases\" included in the liner notes for the 1959 comedy album [How to Speak Hip](http://en.wikipedia.org/wiki/How_to_Speak_Hip), a parody based on the burgeoning Greenwich Village scene. As opposed to the hipster, defined as \"A fully paid-up member of Hip society\", a hippy is \"A junior member of Hip society, who may know the words, but hasn't fully assimilated the proper attitude.\" It also defines hippie-dip as \"Derogatory word for hippy.\" [ [source](http://en.wikipedia.org/wiki/Etymology_of_hippie) ]\nAlso: was Thomas Edison really trying to invent a device to communicate with the dead?\n\nRegardless of Thomas Edison’s misinformed understanding of biology, he was inventive genius who was astoundingly capable of developing devices to serve a purpose. During the last decade of his life, he turned to inventing a device that would be capable of communicating with any sentience that existed beyond the grave. In “Spiritualism,” written in 1920, Edison postulated that, “For my part, I am inclined to believe that our personality hereafter will be able to affect matter. If this reasoning be correct, then, if we can evolve an instrument so delicate as to be affected, or moved, or manipulated – whichever term you want to use – by our personality as it survives in the next life, such an instrument, when made available, ought to record something.” Edison continued an attempt to develop this device. He continued in this essay: “I have been at work for sometime building an apparatus to see if it is possible for personalities which have left this earth to communicate with us.” [ [source](http://itcvoices.org/thomas-edisons-telephone-to-the-dead-myth-or-fact/) ]\nYeah, sometimes we sit there looking up stuff on our computers, comparing notes.  Why not?  It's called \"studying\".\n\n[](https://www.flickr.com/photos/kirbyurner/15318648064)\n\n[](https://www.flickr.com/photos/kirbyurner/15938962221)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}