{
  "id": "3123366317081145240",
  "title": "Wandering in PSU",
  "published": "2012-02-17T20:00:00.000-08:00",
  "updated": "2012-06-04T22:16:05.051-07:00",
  "content": "PSU has a truly handsome campus, newly outfitting with a Rogue Hall we noticed (and partook, somewhat hurriedly between gigs).  I spent some hours away from my desk haunting the halls of academia, bouncing around in buildings I do not normally frequent.  Other Wanderers were doing the same thing.\n\nRoger Paget was holding forth in a rather well packed large room.  Glenn, Don and I were a little behind schedule, coming in on the 14, then walking to this far corner of Portland State.  Roger has divided his time between North America and the Indonesian archipelago over the span of some 40 years, and has come to accumulate some wisdom.  We'd come to pick up on some of it, having met with him [at Wanderers](http://worldgame.blogspot.com/2009/10/wanderers-20091013.html) a few times.\n\nThen, next gig, [Jeff Goebel](http://www.flickr.com/photos/17157315@N00/6895228543/in/photostream/), recently moved to Albequerque, is living the dream as a top management consultant.  This was one of those workshoppy environments where people stand and represent things, verging on theater.  We're involved in the process, are part of the cast.  The study was about meeting in circles and facing our fears.  I'd say this counts as a significant town hall meeting, a true cross-section, as I was anticipating having [in Endgame](http://mybizmo.blogspot.com/2011/11/endgame.html).  Well done, then.  I was admiring the cynic about all these \"active listeners\" trying to make it all better in the Middle East, out of some sense of mission maybe (she'd just come back from there).\n\nRegarding Roger's talk, I saw his Jakarta as [a mirror for WDC](http://mathforum.org/kb/message.jspa?messageID=7672097&tstart=0) and think he saw it that way too at some level.  He has internalized the geological long-now aspects of government, embodies the \"unto seven generations\" type thinking.  I hear he's revered in Bali, and no wonder.  He's a bit of a Bucky-like character in that way, also appreciated on that circuit.\n\nLast night I dipped into the Telluride Mountain Film Festival, a touring collection of cinematic wonders giving us the state of the art in \"life at the limits\" films.  Guys freezing their butts off in Pakistan, kayaking the Congo (Kadoma), exploring the length of the Colorado to its new and recent death zone, where the delta used to be (talk about big deltas!).  The last one, of a cyclist showing off, is already out there, a Red Bull offering, and is marvelously well put together, and so deeply appreciative of the scenery (while really living in it). [Way Back Home](http://youtu.be/Cj6ho1-G6tw).\n\nI'm on duty again around midnight, MVP to PDX.  In the meantime, I have desk duties to attend to, raising a Python army.  Blue House personnel are hard at work -- working on beats (rhythms, prophecies).\n\nMilt has the same mission I thought I had, back in those Voodoo House meetups, to \"save Systems\" at PSU.  I think he'll do a good job and hand over the reins.  I've got the GST thing to keep plying.  Milt was another one of us present at the workshop.\n\nI noticed [Steve Johnson](http://www.flickr.com/photos/17157315@N00/6895228827/in/photostream/) is an upcoming speaker in that same colloquium.  His name came up in the Portland Tribune again recently, in connection with p:ear.  He and I go back, to the mid-1980s, when I first moved to Portland and ended up with CUE.  I'd definitely be at his presentation except that I'm expecting to be in California that day.\n\nBuzz and Brian seem to be getting along on the Wanderers list, a list that's frequently contentious.\n\nThese athlete geeks have recognizable geek traits, such as an interest in equipment, brand loyalty in some ways. I could see [Red Bull](http://controlroom.blogspot.com/2011/11/esozone-2011.html) as an overlap memeplex maybe.\n\n[](http://www.flickr.com/photos/17157315@N00/6895229885/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}