{
  "id": "831222894448475969",
  "title": "Wanderers 2013.1.15",
  "published": "2013-01-15T19:12:00.003-08:00",
  "updated": "2013-01-16T14:30:56.505-08:00",
  "content": "Barry is the speaker tonight:  How Cars Work?  Really, fully grown adults getting together for that?  Absolutely, that's Wanderers for ya.\n\nSome of us are \"retired\" but still busy all the same.  Others of us are \"working\" (not the physics meaning).\n\nWe went around doing intros, per usual.  Holden is back from the UK.  DiNucci (NASA, Humanists), musician Bunce (Ret.). Phil just coming through (he actually works here in the building, with an office and everything).\n\nLinus Pauling lived here as a kid, got into chemistry.  Electroscientific Instruments and Tektronix both got a footprint here too, along \"Asylum Avenue\" (one of its chapters), called Hawthorne now (after one of the doctors who started the Asylum, closer to 12th).\n\nIt's more about engines, which apply to boats, planes, trains and ships, not just cars 'n trucks.  \"Automobile\" is any \"self propelled vehicle\" (translating literally).\n\nIn the UK, steam powered vehicles on roads gave way to trains as the paradigm.  External combustion engines.  The fire is outside of the actual engine.  Sterling engine similar.  Hence solar sterlings, which Barry doesn't know about ([Infinia's thing](http://www.infiniacorp.com/en/)).\n\nJet motor:  fire on the inside.  [Wankels](http://jalopnik.com/5921410/the-last-mazda-wankel-engine-has-been-built) (rare today).  Hardly any turbines in cars.  Chrysler showcased a few.  They're air / fuel pumps, and in the process make usable power.  A horsepower = what it takes to raise 33,000 pounds one foot, in one minute.\n\nDiesel, way important.\n\nBarry's personal memory goes back a ways, and he's done a lot of research.  His dad was a machinist. All these fuels:  peanut oil...  He's explaining a jet engine now... 747... Some thrust through the cowling.  Chrysler's turbine cars had a bearing that cost as much as the rest of the car.\n\nLong discussion of two stroke engines, their advantages and disadvantages.  Barry understands them well.  They were never popular in cars.  Saab had one, a three cylinder two stroke.  Then he diagrammed the four stroke cycle.  Then two stroke diesels.\n\nI remember wandering through the science museum in Munich (Munchen) marveling at all the different engines.  Barry is like a tour guide from there.  Screw type blowers make an appearance.\n\nNew model engines are doing more to control the valves (variable valve timing, and lifting).  OBDII (on board diagnostic version two) gives you hints about what to replace.  Cam position sensor, knock sensor... lots to know.  Lots of valve patterns too (Barry went through some history -- flathead, overhead cams, more overhead cams...).\n\nComputer controlled direct injection is making a difference.  Focusing on the burn point more, with a little cup in the cylinder head... Honda, Mazda...\n\nWow, the Napier Deltic engine is pretty strange. Barry got through only about half his material. Maybe we'll do a Cars 2.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}