{
  "id": "112753669680411167",
  "title": "Wanderers Retreat",
  "published": "2005-09-25T12:20:00.000-07:00",
  "updated": "2006-11-15T11:43:46.183-08:00",
  "content": "I showed up at the Blanchard Education Service Center today to make some brief remarks on behalf of the [Koreducators'](http://www.koreducators.org/) charter school proposal.  Adam & Co. certainly have their ducks in a row.Retreat:Day one (9/23):We used [earth.google.com](http://earth.google.com/) software and projector to zoom in on the Pauling House, plus visit other points of interest (Gothenburg isn't highly resolved yet -- didn't find Chalmers). Jon Bunce grilled Dave Ulmer on his book (unpublished), having given it a close read. Nancy joined us enroute to another retreat at Mt. Angel with [Father Driscoll](http://www.salvationhistory.com/mission/staff/frdriscollCV.cfm). We looked at slides I took of Julian's unveiling of Heart of Steel in Lake Oswego, and slides of Dave's many bizmo adventures. The bizmo itself is parked out back, receiving satellite TV about hurricane Rita. Downloaded from iTunes and played: We Didn't Start the Fire (Billy Joel), played a bogus game of chess.Day two (9/24):Briefed by Dawn on Smallville developments (season 3), cartoons, Rita (weather news), breakfast on Hawthorne (Tabor Hill Cafe), helped Consoletti with inheritance fax, gave Ulmer my 9/14 letter (feedback on his book) while he projected the DVD [1984](http://imdb.com/title/tt0087803/) from his laptop (I didn't watch too closely this time, believe I've seen it before -- like [Brazil](http://imdb.com/title/tt0088846/)). Dave backed up the bizmo by 6', enough to see the HDTV satellite behind the tree. Jon & Don off to check out a dishwasher (mechanical problem). Allen's here -- he and I went out for Thai (Rick joined us for Thai take-out last night). I did some [more messing about](http://mail.python.org/pipermail/edu-sig/2005-September/005225.html) with \"math through programming.\"Big summit on future of Wanderers in the evening. Terry Bristol, [David Feinstein](http://www.analyticanimations.com/), Steve Bergman, Audrey Lee, [Pat Barton](http://www.symmetrics.com/architects/people/people_barton.asp), [Gus Frederick](http://highmars.org/xpcup/xpcart01.html) joined our group. Lots of discussion, lots of web sites projected. What did we decide? Terry is working on getting us a server with a fat pipe. Doug Strain's interest in peace work helps define us.Day three (9/25):Woke up with Sarah in the bed (sorry Dawn, I know the rules), another Smallville briefing from Tara (still season 3). Drove mom to Quaker meetinghouse (former ESI building) in Razz (our razzberry-colored Subaru wagon). Joined Dave & Don in the bizmo for long HDNet pans from a helicopter over New Orleans (some amazingly cool cemeteries). Even spookier would be HDNet over Chernobyl (saw that dare devil Russian chic's fast motorcyle diary -- likewise amazingly cool). Thanh Thao has been a source of most meals. [Celestia](http://www.shatters.net/celestia/) + [Stellarium](http://stellarium.sourceforge.net/) = an answer to my prayers. I missed the impromptu presentation by [portland.freeskool.org](http://portland.freeskool.org/). Office Depot, printer madness. Guests from South Africa (the home scene). Julian came by with both children (I projected my slides from the unveiling). Jon solved the story problem (about a man and his dog).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}