{
  "id": "322533425124350578",
  "title": "Wanderers 2012.3.13",
  "published": "2012-03-13T20:16:00.000-07:00",
  "updated": "2012-03-20T20:53:15.212-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/6995308119/)\n\n:: marianne presents ::\n\nOur Python group is meeting tonight but having just come from Pycon, I feel my internalized OS is saying Pauling House.  So here I am.\n\nThe topic is antisemitism, one could say.\n\nWanderers welcome Wanderer, Marianne Buchwalter, at 7:00 PM on Tuesday evening, March 13, at The Pauling House, 3945 SE Hawthorne, who will present and discuss her experiences of her family's departure from Berlin four days after kristallnacht, in 1938.\n\nHer uncle had arranged to exchange houses and belongings with a Nazi sympathizer who lived in Portland.\n\nMarianne documented this story in her 1995 book: Memories of a Berlin Childhood. [http://tinyurl.com/849vaos](http://tinyurl.com/849vaos)\n\nHope to see you there!\n\nDon\nI tried to get a word in edgewise, but we've got a full house and lots of people with stuff to say.  Fortunately, I have my blogs and am happy to resort to asynchronous commentary.  My new self-discipline is to only answer when asked (one of Fuller's too as I recall).\n\nI'm fairly optimistic that Judaism has made good enough friends in Asia, among Buddhists especially, that there's really no danger of another upwelling of classic Hitlerism or one of those.  When it comes to highly literate, scholarly cultures that control lots of assets, the Jews are not alone.\n\nHow much total fissile material do we need for nuclear medicines and so on?  This is a side conversation I'm trying to have while blogging at the same time.  I assume Iran is aiming for the medical market big time.  A [Japanese version](http://coffeeshopsnet.blogspot.com/2009/02/outreach-to-japan.html) of Global Data might have some figures (Japan has a lot of interest in health care).\n\nThe conversation has somewhat gone off the rails, but that's OK.  Wanderers are known for their meandering style.  Google Drones?  Lots of interesting chatter.  Some visitors here tonight, not just the usual crew.\n\nLindsey and I walked up [to Belmont](http://www.flickr.com/photos/17157315@N00/3182545429/) earlier today, as I made good on a belated birthday gift to get her some lenses, based on [an up-to-date eye exam](http://controlroom.blogspot.com/2008/12/industrial-scale.html).  She lost her specs shortly after we met and has been doing without.  As she ventures forth into the world, those lenses might come in useful.\n\nWhat I'm interested in knowing is whether Marianne has as high an opinion of Chaim Potok's writing as I do.  The Chosen was a big influence on me, helped get me into Freud and psychoanalysis as a future discipline, with the move to philosophy in the 1970s (there's a lot of shared lineage, through the Vienna Circle and Frankfurt School, to name a couple relevant switchboards).\n\nYes, I checked out [Portnoy's Complaint](http://en.wikipedia.org/wiki/Portnoy%27s_Complaint) but wasn't that big a fan.  [Woody Allen](http://controlroom.blogspot.com/2009/05/flash-back.html) fits in here somewhere.\n\nWe had snow on the ground this morning.  Portland is definitely in a different bioregion than Santa Clara.\n\nLew us here.  He'd been to the Quaker Men's Group.  I've gone in years past.\n\n[](http://www.flickr.com/photos/17157315@N00/6849185908/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}