{
  "id": "2251318135365191873",
  "title": "Wanderers 2011.11.16",
  "published": "2011-11-16T10:00:00.000-08:00",
  "updated": "2011-11-18T10:46:06.030-08:00",
  "content": "[Shomar](http://www.flickr.com/photos/17157315@N00/2925358252/in/set-72157611190983826/) died awhile back.  The Wanderers were not ceremonious about it.  We mostly just meet for coffee, form friendships, and then do our work with the dead and dying \"off camera\" so to speak, not as official business of Wanderers itself.David Tver, Glenn and I are yammering about directionality and coordinate axes.  I trucked out the thesis that the common pairing of \"positive\" with \"right\" in Anglo mathematics, a constant drumming, a harping, had essentially destroyed the English language as a \"force for good\" in the world.  [Too biased](http://worldgame.blogspot.com/2011/02/other-mexico-movie-review.html).  Glad to use American instead, or Fowler's Amerish maybe (pronounced \"a-MER-ish\" in his book).  Of course that's a minority view.  I tend to champion hopelessly underdoggy positions.Don keeps projecting his picture of the black swan.  I have a few of those too.  Same one I'm pretty sure.Nine of us here this morning.  Our new guest, Bill Harris, is a retired general ophthalmic surgeon.  After listening to us banter for 45 minutes, and watching us watch [Jetman](http://youtu.be/WgdIE2t8QkM) and [a mechanical bird](http://youtu.be/Fg_JcKSHUtQ) on Youtube, he raised the topic of the Occupy [movement / revolution](http://www.flickr.com/photos/17157315@N00/6268619854/in/set-72157627710609369/).  The notion of \"[corporate personhood](http://worldgame.blogspot.com/2011/10/in-nutshell.html)\" was raised at some point.  I held my tongue, no ethnic slurs against \"voodoo economists\" and their superstitions issued from my lips.  \"When in Rome...\"Bill is a \"go to\" guy when it comes to convening [town halls](http://mybizmo.blogspot.com/2008/11/town-meeting.html), [ignites](http://controlroom.blogspot.com/2009/11/ignite-portland.html), whatever [GOSCON-like](http://mybizmo.blogspot.com/2010/11/goscon-2010.html) follow-ups we stage in the wake of [OPDX / October 6](http://worldgame.blogspot.com/2011/10/occupy-portland-event.html).  Small neighborhood gatherings are expected in some zip codes (not unlike Wanderers).  We shall see.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}