{
  "id": "7638012538296321249",
  "title": "Wanderers 2007.10.11",
  "published": "2007-10-11T13:40:00.000-07:00",
  "updated": "2007-10-11T13:40:32.718-07:00",
  "content": "Twas a day for snagging a small bag of [cantharelius cibarius](http://www.mushroomexpert.com/cantharellus_cibarius.html) @ Pauling House, thanks to mountain man Buxton, a generous Wanderer.  Those'll be cooking soon, as fresh forest produce should be eaten while still fresh, no?That'll probably be my last visit to Island Café this season ([small hangout](http://mybizmo.blogspot.com/2005/09/talk-like-pirate-day.html) on Tomahawk Island, closes for winter).  The weather turned out to be perfect, complete with a fan club of seagulls, including a special \"one\" (Jonathan Livingston I presume).Out there on the boat, some of us came up with a funny term of opprobrium, for pretending to mock a wayward Wanderer.  We'll enjoin 'em from \"straying\" too much (too far or whatever). And some will (have, are) I'm sure, me included.Given the meeting was open agenda, meaning \"unprogrammed\" in Friendly parlance, lots of random topics got batted about.  I kept interjecting about Unicode and / or \"coding in Klingon,\" a meme we of Python Nation share with the neighboring Republic of Perl, to signify challenges associated with writing source outside Latin-1 and / or the ASCII character sets.Python 3.0, as well as Perl 6, are making significant strides in this direction, which is relevant to my work for hospital systems.  I want \"display name\" as a standard field, so that patients have the benefit of seeing their own names properly symbolized on display monitors and such -- feels [more like home](http://www.mail-archive.com/edu-sig@python.org/msg04080.html) that way.Dave Fabik is wandering off to Mexico, in some jeep with a friend, kayak roof mounted.  I phoned him from Meliptus yesterday.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhmoErMUxCHe4uDbcEWQIO4iGoKOtgrnAFj4HK7P2cQG-gCM_ilUHoa5p4OL4zQ8nwqVealLCVLKv8-Bhhumy_K9zCmVXD-JrVnlMwm8Xw8AWBQ_9z1BALMNnE6u8_Q9Pqg5fSn/s1600-h/101107_0646a_cropped.jpg) Motorola camera cell phone snap shotof the chanterelle mushrooms in a pancaptured on an Olympus Stylus 720 SW,emailed to gmail via Verizon and storedto KTU3 for editing in Adobeand posting to Google blogspot",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}