{
  "id": "5234783779622129409",
  "title": "Wanderers 2010.7.28",
  "published": "2010-07-28T14:30:00.000-07:00",
  "updated": "2010-07-29T13:47:02.021-07:00",
  "content": "I was late to the meeting this morning, as I'd been working out in this [conversation with math teachers](http://mathforum.org/kb/thread.jspa?threadID=2097005&tstart=0), as to the relevance of philosophy within their discipline.  I sense some divergent views.  Hansen says philosophy and science went their separate ways over 400 years ago.  Haim keeps invoking Marx and various \"isms\" commonly known as \"ideologies\" (e.g. Communism, Capitalism... Anarchism).  Is all this philosophy then?  Math teachers aren't always clear on their definitions at first, yet share some commitment to get more definite over time (math aficionados are accustomed to definitive thinking).Now I'm at Lyrik, waiting for a meeting to start.  I call this my \"corner office\" and use it to connect some dots, e.g. [to Martian Math](http://wikieducator.org/Martian_Math).Apropos of this history, I got to chatting with Jody via Gchat.  She's the former owner of this place, when she named it Fine Grind, after which I named my Fine Grind Productions when needing to produce some backdrop video for my theatrical appearance at Portland Center Stage, [as \"dymaxion clown\"](http://worldgame.blogspot.com/2008/11/ieee-presentation.html) (went over well, as a lecture on election night to the IEEE -- not what [Bruno](http://controlroom.blogspot.com/2010/06/bruno-movie-review.html) was doing back then).I bring up Martian Math because of the course I'm starting next week, after a quick trip up north (I'll be driving the torture taxi).  Tomorrow morning, Glenn and I plan to scope out the site again, maybe walk in the canyon.  He's doing Neolithic Math.  It's a summer camp and they've got segments spread across the time-line. My segment is \"the future\" and of course is science fiction in that sense -- but I won't skimp on having real math in the picture. One question is:  how flaky is J (I've requested the J-language be installed in the lab, a rock-stable language but there may be something \"special\" about this installation, I've been warned by the staff).So the fun at Wanderers this morning was tracking Jim Buxton as a dot on Google Maps.  We had the option of a Street View based on his spatial coordinates.  Of course the stills we were seeing were whatever the Google immersive camera car was taking in on that day, not some live video feed from \"the bizmo\" itself.  He was somewhere in North Dakota.  Don tried to hail him by cell, let him know we were looking over his shoulder (slowed to 47 mph going through Bismarck), but got switched to voicemail.  We used an Apple Powerbook and a computer projector to share the experience with everyone around the table, including a couple visitors just passing through.[View Larger Map](http://maps.google.com/maps?f=q&source=embed&hl=en&q=Bismarck,+Burleigh,+North+Dakota&sll=37.0625,-95.677068&sspn=36.231745,86.572266&ie=UTF8&cd=1&geocode=FQc9ygIdhSn--Q&split=0&hq=&hnear=Bismarck,+Burleigh,+North+Dakota&ll=46.808327,-100.783739&spn=0.244879,0.676346&z=11)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}