{
  "id": "17279722722472738",
  "title": "Wanderers Equinox",
  "published": "2015-09-26T00:31:00.001-07:00",
  "updated": "2015-10-03T09:13:40.613-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/21711883862/in/dateposted-public/)\n\nWe're definitely in full Fall season, coming up on Halloween, is how we thought of it back then (2015).  Wanderers / Pauling House (\"Dr. Phil\" joining) held its customary celebration however I arrived very late.  My day had already been quite busy in many dimensions, including a follow-up [visit with Dr. Bolton](http://worldgame.blogspot.com/2015/09/some-family-history.html), this time with Deke the Geek (as I call him, also Derek).\n\nWe wound up at Humdinger which was maybe a mistake on a potluck night.  I ate next to nothing at Pauling House, not arriving until almost 8 PM.  Gus was there, from Silverton.  We joked about the parking meters and talked about what \"Liberal\" meant, at one time.\n\nDick Pugh delivered an amazing lecture about the migration west of \"religious crazies\" (we may afford to be affectionate, a term of endearment lets say), along Erie, down through Ohio and out west to the fork, where it was either Venture Capital (California) or fertile valleys of farm life (predictable, one hopes) in Oregon.  The names of the towns are telling.  We're talking Klan-imposed definition of \"white\" combined with full blown Manifest Destiny Syndrome (MDS).\n\nDick tells it better than I do though.  I was entertained.\n\nThe Russians did come through but mostly didn't land here:  They headed for Sebastopol, CA and the Russian River area.\n\nMary especially had extensive knowledge of the giant Chinese ships, that had \"farms\" in their holds and could trade with one another (the flotilla was a floating city).  More to learn.\n\nWe enjoyed other oral recitations I won't go into, including a battle royale twixt me and X, over some matter of logic (or illogic as the case may be).  I'd done the lentil dish.\n\nMy top story was about Micheal Sunanda (not a typo), who was on his way from Eugene.  I'd brought some copies of his most recently published issue.  Dick was prepared to argue that Azomite was not the chemical name of anything.  Micheal agreed though.  It's more a brand name, for a mixture of chemicals some have used in permaculture.\n\nHe's here now (Blue House), this being the after party at my place.  I'm downstairs for a bit, keeping a lonely dog company.  She no longer climbs stairs.\n\nMy innate \"misanthropic\" (?) tendencies was another topic at the meetup, somewhat customary for me at Wanderers, where I've wanted to be open to non-humans.\n\nI said I'd had a realization that if I were super rich, I'd be donating to all these non-human causes, knowing well that humans were being taking care of by their more loyal donors.\n\nSome need to take care outside that horizon.\n\nActually my viewpoint was not that controversial.  Mary seemed on my side in that way.\n\nHer rant about the kid who couldn't work or be useful gave me food for thought for days to come I'm sure.  I pretended to be his lawyer at the meetup, but only to uphold my end of an ongoing investigation.  X said she'd dig the holes (Mary needs to plant some roses but her apartment complex can't muster the help, even given a likely candidate).\n\nI should rejoin my party upstairs.  Thanks for listening.\n\nThe Nissan needed a new starter and has one.  That's mostly in my Photostream, along with the parking ticket.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}