{
  "id": "111095115916725285",
  "title": "Wanderers Meeting 2005.3.15",
  "published": "2005-03-15T20:57:00.000-08:00",
  "updated": "2012-07-23T21:27:12.855-07:00",
  "content": "Today we learned about Meliptus, the name of Don's boat, and also a mnemonic for his Master Life Personal Development System. Don is refreshingly low key with his approach -- the antithesis of L. Ron Hubbard (another guy with a boat).\n\nWe talked about some successes in our lives, and the processes contributing to them. Mine was getting back into teaching, which I enjoy. That teaching job at St. Dominic Academy (Jersey City) was one of my all time favorites, if challenging. Getting that Saturday Academy gig last summer with the HPD's George Heuston the ex FBI guy, and co-teaching with Linux guru Jerritt Collord, was a breakthrough for me. I shared about the police chief being a son of Chinese immigrants, and wanting to [reach out to Latino youth](http://mathforum.org/kb/message.jspa?messageID=7852597), among others, to bridge the digital divide -- hence that computer lab at West Precinct (Hillsboro). The relationship with Saturday Academy continues (and HPD).\n\nOthers had interesting success stories as well (which they might tell, if so moved). I got some good feedback from Bruce when I shared my a plan to recruit master teachers into this alternative lifestyle centered around roving teacher-mobiles (specially outfitted RV-like jobbers), coordinated and supported through some OnStar-like headquarters. Bruce told me about [GM's Parade of Progress](http://www.futurliner.com/account.htm), a sort of traveling roadshow designed to clue kids about new technologies. And this was pre Sputnik, and in an age that was bolder (some would say more naïve) about its futurism.\n\nIf I ever get a bizmo, I might name it Meliptus Junior, in honor of Don's boat (a floating bizmo) and his role in my life as a master teacher.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}