{
  "id": "4701377300610830066",
  "title": "Wanderers 2014.11.26",
  "published": "2014-11-26T17:52:00.001-08:00",
  "updated": "2014-11-26T18:43:40.458-08:00",
  "content": "We had one of our best turnouts ever today, with people we practically never see.  Coffee was in high demand.  I said I'd be more like a photographer at a wedding and move about, then fade away as my day job is peaking.  Just getting to join was a privilege, with family and friends.\n\nOur topic was Matriarchy, beginning with concerns about definition and semantics.  Matriarchy is not \"just the opposite\" of Patriarchy, but then what's the latter?  Matrilineal is easier to define.  In Patriarchy, the fathers have a stronger \"need to know\" regarding the paternity of children, as property passes father to sons, or any offspring per King Lear.  In Matriarchy, paternity doesn't matter as much and the mother's brother may be head of household, with her husband the head of another household.\n\nConstance Tippett Chandler was our presenter.  She's an artist who shapes a concept of history as from clay, with attention to detail and scholarship.  Matriarchy is less concerned about gender, though patterns around gender may well develop.  \"Whoever is most fit for the job\" was her response to division of labor questions.  Creating the ethics in the moment as a way of unearthing a distant culture in the past may seem like undue editorializing, but as performance-based conceptual art, it makes sense.\n\nGiven circumstances, looming work-related tasks, I took my leave somewhat early and missed a lot of the discussion.  Do we really find evidence of a Matriarchal layer in Old Europe circa 7500 BC?  We do find a lot of sophistication about time and cycles back then, astounding pottery, evidence of successful civilization.  But what do we know about the social order?\n\nIn Connie's telling, that layer of history, or prehistory, is buried with [the invasion of the Kurgans](http://en.wikipedia.org/wiki/Kurgan_hypothesis), after which the archeological record shows plentiful weapons cluttering up the landfill, up until our day.  We're still the war-prone heirs of the horse-mounted bullies who imposed far stricter rules to the point of enslavement.  Patriarchy is a lot about asceticism, rank, policing others.  More fascist.\n\nObviously much discussion could flow from such a storytelling.  The Confederated Tribes of the Iroquois, by some accounts a model for the Federation of States branding as \"USA\" in later chapters, was Matriarchal.  In Connie's telling, the patriarchy reached a corrupt phase and downward spiral out of which the matriarchy then emerged.  Could this happen again?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}