{
  "id": "95928511030695815",
  "title": "Wanderers:  Winter Solstice 2015",
  "published": "2015-12-19T09:15:00.001-08:00",
  "updated": "2023-07-17T21:39:10.109-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157661873460079)\n\nYesterday was high stress for me, for the same reason it is for many this time of year:  the miracle of jet travel and the possibilities that opens, for missed and cancelled flights (and of course disasters and broken hearts).\n\nIn Tara's case, car troubles and an optimistic schedule left her in tears at the ticket counter in Dayton, Ohio, with me likewise calling United for options.  We lucked out:  she arrived through Chicago instead of Denver, at 10:28 PM instead of 1:30 PM, same day, same ticket.\n\nLindsey, another former denizen of Blue House, now a full time student at Oregon State, doing her field work [in Patan](http://wikitravel.org/en/Patan) (Nepal), likewise had last minute issues, with China Southern suddenly deciding to yank the  Kathmandu-Guangzhou flight.\n\nShe was able to re-vector through Bangkok and Seoul just hours before flight time.  Patrick and I met her flight from Seattle.\n\nSo for me, December 18 was a milestone positive day with the Christmas gift of family and friends showing up as I'd hoped.  We celebrated the solstice at the Linus Pauling House.  [Deke](https://www.flickr.com/photos/kirbyurner/albums/72157621114836443) joined us as well.\n\nLindsey, forty hours traveling, ended up crashed out in the living room and Tara was still in route on UA 518 so neither was at our Wanderers party.  I went from the party back out to PDX, bursting with gratitude that I would be reunited with my daughter.\n\nWe had a classic solstice with Glenn bringing his signature chili, Barry the ribs, and I brought along my signature lentil dish.  Bob Boreman played some excellent electric jazz guitar.  He's been practicing a lot.  We were impressed.\n\nAlso going on down the street:  what used to be Blue Butterfly, run by Micheal (also at our party) is now called the Fernie Brae and was showcasing a new edition of [Alice In Wonderland](http://worldgame.blogspot.com/2010/03/public-policy-1-of-2.html).  Dave DiNucci has played a role in this literary project and reminded us of this interesting cultural opportunity.\n\nThe pictures are all new (though in a period style), by David Delamare, one of the gallery's top artists.  The text has been revisited as well, in light of scholarship around this original tale by Lewis Carroll.  Deke was given some prints for his bedridden friend [Suzanne Pardue](https://twitter.com/PardueSuzanne).\n\nMichael is now based in Bali, bringing his Southeast Asian wares to the [basement of Gold Door](http://mybizmo.blogspot.com/2015/10/gold-door-2015.html) for selling during the winter season.\n\nLater today, Alexia, her friend John, Tara, Lindsey and myself, plan to see the new Star Wars at The Bagdad.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}