{
  "id": "4324649698404786437",
  "title": "Wanderers 2007.10.24",
  "published": "2007-10-24T12:33:00.000-07:00",
  "updated": "2011-02-15T19:32:45.109-08:00",
  "content": "I showed up quite late to this morning's gathering, not atypically, as I have other duties on Wednesday mornings -- which is why we also meet Tuesday evenings i.e. plenty of Wanderers in the same boat, in terms of not being a \"morning person\" or \"night person\" or whatever.Our presenter, Mark Frischmuth, showcased some open source concepts packaged as [DemocracyLab](http://www.democracylab.org/), a work in progress.  The coding team has yet to assemble, but it's good to think the general public will soon be getting better access to such networking tools, long a staple in the private sector.We had some heated discussion about why the pundits targeted Iraq for rape and plunder in the wake of 911 (Rumsfeld:  more interesting targets).Of course the answer is Hans Blix and his crew had determined the nation was relatively defenseless, an easy target for shock and awe.  Catharsis, in other words, an expression of [infantile rage](http://www.foxnews.com/oreilly/), plus a lingering vendetta from Gulf War [Episode 1](http://256.com/gray/thoughts/2003/20030324/episode_2.jpg). History is [chock-a-block](http://www.answers.com/chock-a-block&r=67) with such stories, dime a dozen.But I don't really blame GWB and his crew, as my read is a lot of irresponsible people desperately wanted to be whipped into a war frenzy and no politician in his or her right mind could stand in the way of that [stampede](http://www.youtube.com/results?search_query=lion+king+stampede&aq=f) and keep a hold on high office at the same time.  Standing up to spoiled brat North Americans is more like what other countries are for.Plus most decent North Americans were consistently dead set against the war all along, and apologized profusely to the world for letting the idiocrats seize power.  Plus our media have wised up a lot in the interim, so the situation isn't looking nearly so bleak, except of course there's global warming, starvation, disasters -- all addressable challenges if you're not too busy fighting meaningless shooting wars (save those for the Gameboy how 'bout?).Showed off my new cell phone, drank lots of coffee.  Good seeing Nancy again, and Jim.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}