{
  "id": "514155820278171139",
  "title": "War as Sport",
  "published": "2011-03-05T07:21:00.000-08:00",
  "updated": "2011-03-27T10:31:32.407-07:00",
  "content": "[Our corporation meeting](http://mybizmo.blogspot.com/2011/03/corporation-meeting.html) continues... Treasurer's report in progress.  Friends really appreciate JimFletcher.I've been reading some of the literature around Friends Center, reminding myself that many enjoy participating in outward wars, find meaning in it, and would feel lost without these kinds of challenges.  [War is addictive](http://controlroom.blogspot.com/2010/11/hurt-locker-movie-review.html) and many depend on it for their livelihoods, not just soldiers.Friends engage in somewhat parallel activities in extolling [the \"Lamb's War\"](http://www.flickr.com/photos/17157315@N00/5497828579/in/set-72157626076057099/) as something positive. This is an inward war, a jihad, waged with psychological instruments.  Many enjoy this work and take sustenance from it.Legitimizing large scale violence is [a core function](http://www.youtube.com/watch?v=gPJU0dbrOXI) of many states and religions.  The business of making war depends on inspiring ideologies, cheer leading, drumming up passions.  The star \"athletes\" in this sport become anxious when no war seems to be looming.  How will the next generation learn the ropes?  The cigarette industry has a similar ongoing challenge:  recruiting new smokers.Fortunately for the violence-prone, the human condition remains dire, with resources distributed highly inequitably and injustice the norm.  Betting on [the war machine](http://www.youtube.com/watch?v=R9wgjxO7JtY) seems like a secure investment and many pensions depend on its thriving (or used to -- some have escaped the vortex to morally higher ground).LAWCAP long ago figured out how to institutionalize weapons production across many congressional districts (CDs).  Since WW2, the actual needs of professional militarists has taken a back seat to [the economic needs](http://controlroom.blogspot.com/2008/12/iron-mountain-revisted.html) of the war machine.  Outward war is [an economic necessity](http://controlroom.blogspot.com/2009/06/recruiting-commercial.html) for this creature, regardless of consequences.  The proliferation of [nuclear WMDs](http://controlroom.blogspot.com/2010/12/countdown-to-zero-game.html) of little strategic or tactical value is symptomatic of this form of mental illness (the so-called \"military industrial complex\").Yeah, these are somewhat cliche thoughts for a Quaker to be having, I admit.  Decrying the \"war machine\" is an ancient literature by this time.  If people really thought a better lifestyle were possible without it, that'd shift the balance perhaps, but [such \"utopianism\"](http://www.theendofpoverty.com/) is routinely dismissed by the outward warmongers.  Those with the \"[most toys](http://controlroom.blogspot.com/2009/08/some-analysis.html)\" are given to believe that [their living standards](http://mybizmo.blogspot.com/2008/05/carrier-movie-review.html) would plummet were there to be something called \"world peace\", a nasty and undesirable outcome [by many accounts](http://mybizmo.blogspot.com/2010/01/revisting-malthus.html).  To really move beyond \"outward war\" (which'd require more effectively countering sociopathic behavior around the world), we'd need to go with something more [like general systems theory](http://www.grunch.net/synergetics/gst1.html) (ala [Kenneth Boulding](http://www.flickr.com/photos/17157315@N00/5497829057/in/set-72157626076057099/)) over traditional economics.  We'd need to take a more [Project Renaissance approach](http://grunch.net/archives/41), wherein longing would trump fear.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}