{
  "id": "113156140660727946",
  "title": "Wednesday @ Pauling House",
  "published": "2005-11-09T21:57:00.000-08:00",
  "updated": "2009-06-06T16:32:34.559-07:00",
  "content": "Setting: two tapes filled, camera now rewinding (I was cameraman, made lots of mistakes); participants are right now discussing [funereal](http://www.answers.com/funereal&r=67) customs, cemetery design and so on, having already covered transportation, economic and social rules, many other matters -- all this in the context of Guatemala, per Don's slide show.On break, Dick Pugh offered to do similar travelogues (Trans-Siberian railroad for example). We're Wanderers, so yeah, this makes some sense. On the other hand, we've typically integrated more science-minded analysis, dealt less in raw intelligence. What's the status of Guatemala's electrical grid I wonder. Or we could just lighten up and do more anthro -- more philo too while we're at it.Don was embedded with a former student and family, Don being retired faculty, Mt. Hood Community College. His student runs a restaurant serving USA-style dishes (pizza and such). Don learned a great deal on this three week sojourn, his first foray outside El Norte. He performed marvelously, and brought back a ton of interesting insights and information. Guatemala is definitely a happening place. I was especially taken with Chenté, a street smart dog in the family.I've got a bid request in with [Bullseyedisc](http://www.bullseyedisc.com/) to see if our tape collection might be transcribed to DVD at an affordable cost. We'll recycle the Hi-8 tapes, minting 3 DVDs per talk to start: copy to the presenter(s) of a talk; copy to the in-house library; copy for off-site backup, Iron Mountain style. We may take up a collection, once the bid is in (likely the $80 or so in the coffee fund won't cover it -- I've got a stash of like 25 tapes by this time, including the two of Doug Strain).Nancy joined Don and I for lunch on the boat where I got cell calls from France (school business) and from Mom in Washington, DC (I dropped her at the airport before Wanderers).Tonight I met up with Dick Pugh again, also Wanderers McCarty and McGown, at the Sigma Xi meeting at PSU (Brother Guy for the Vatican re Pluto et al (hey, I vote we name this new 10th planet, grain of sand thingy [Diana](http://images.google.com/images?hl=en&q=diana%20mythology&btnG=Google+Search&sa=N&tab=wi) -- or maybe [Coyote](http://images.google.com/images?svnum=10&hl=en&amp;lr=&q=coyote+mythology&btnG=Search) after some Native American)).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}