{
  "id": "9043785884501663682",
  "title": "Weird Stories",
  "published": "2008-08-13T21:44:00.000-07:00",
  "updated": "2008-08-18T10:28:32.938-07:00",
  "content": "[ internal memo to Wanderers, republished to blog (we're thinking of doing a Wiki) ]I got to Wanderers late this morning, just in time to advise [Barbara](http://worldgame.blogspot.com/2007/10/wanderers-2007102.html) about an inexpensive yet good quality wifi-equipped [laptop](http://eeepc.asus.com/global/) she might need in Panama, where she's headed this evening until December, wishing her a safe and fun journey.We didn't talk too much about the Wiki idea, more about DrFrankenstein (not TheMonster). GlobalWarming could be another [WikiName](http://moinmo.in/WikiName) -- anyway you get my drift, and there's a thing you can do with square brackets [ ] -- like more punctuation -- if you want to avoid the CamelCase look.Then I dashed downtown for this meeting at the Armory, a way cool theater these days, which went down to get room, up being out of the question in an historic landmark, although they did add a new roof (had to).  [Ed Schlossberg](http://nymag.com/nymetro/news/culture/features/4615/) an inspiration at some level (not sure which).  Check my Flickr Photostream for [some pictures](http://www.flickr.com/photos/17157315@N00/sets/72157606708448728/).[](http://www.flickr.com/photos/17157315@N00/)I rejoined Wanderers in their lunch setting, just as money was being collected.  The idea of a \"[one man Bucky play](http://www.curtainup.com/buckminsterfullerla.html)\" got people thinking of this manikin near Mt. St. Helens with a projected face. [David](http://worldgame.blogspot.com/2008/05/wanderers-2008527.html) suggested getting around \"actor guild\" restrictions (why [Johnny Stallings](http://worldgame.blogspot.com/2004/10/king-lear-play-review.html) can't play) by having his voice come from inhumanly scaled sources (too big or too small to be pigeon-holed as \"actors\").  We also brainstormed about finding people who genuinely believed they were Bucky, or were at least channeling (hence \"not acting, so not an actor\").  Such union busters we are (Fuller himself was a card carrying member of the machinists' union).Then it was on to [ another meeting ] where I perused A compendium of certain engineering principles pertainent to Brazil's control of impending acceleration in its industrialization by [R. Buckminster Fuller](http://www.popularmechanics.com/science/extreme_machines/4270764.html), Chief, Mechanical Engineer Section, Industrial Engineering Division, August 13, 1943 (so this was an anniversary of sorts).This document is a lot about interviews with American engineers who'd been helping the Russians around the first three 5-year planning cycles, the Russians still considered a friendly ally in this picture. In the footnotes, Fuller notes how Brits and Germans tended to get political, Russians encouraging them to join in the fun, with Germans more into proselytizing for their National Socialism ideology, whereas the American engineers tended to be gruffly dismissive of politics, almost angrily apolitical, which you might think (paraphrasing Bucky) would lead to their dismissal, so disrespectful it seemed, but [the Russians](http://worldgame.blogspot.com/2008/05/other-russia.html) actually liked these stubborn china shop bulls, even agreeing to secret service protection in one case, to help reduce friction.Also looking at Gargle & Snarky, [Bil Baird's](http://www.youtube.com/watch?v=dbuDaXjN8o8) puppet troupe on Westinghouse Broadcasting, teaching Adventures in Number + Space post Sputnik (New York Times Mar 6 1958, pg. 28).  [ Bucky apparently contributed a puppet to this effort -- ed ].Home to watch Katie and Lara explain about Georgia and the Russians, including a chat with the Georgian president even, [Condi](http://worldgame.blogspot.com/2007/10/amusing-women.html) also on the record.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}