{
  "id": "646589208719665066",
  "title": "Welcome to Chaos High",
  "published": "2020-03-25T16:37:00.001-07:00",
  "updated": "2020-03-25T16:46:08.209-07:00",
  "content": "Communications experts sometimes speak of the \"8th grade level\" as a kind of gold standard, as in an age post knowledge explosion, there's an on-ramp into any discourse and \"8th grade\" maybe means \"in layman terms\" (i.e. I'm not yet an initiate, nor may I ever be).\n\nThat mantra or rule of thumb has \"trickled up\" in that I'm seeing \"high school\" as that semi-uniform sampling in which few prerequisites are required.  You're starting with a white belt in whatever.  If you were back in high school as an older adult, this might seem like a threatening reset, as if you'd suffered brain damage.\n\n\"Why would I be in high school, I'm a doctor of (master of) whatever!?\" and of course that's an understandable sentiment when HS is regarded as \"once in a lifetime\".  However I'm positing that, with longer lifespans and a faster pace, the need to \"reset\" is perennial.  If you live long enough, you might go through \"high school\" a few times.\n\nTo take a concrete example, my generation went through high school when hand-held calculators were all the rage.  In a generation before ours, people understood slide rules, and therefore logarithms a lot better.  I'd say people were a lot more practical about approximation in some ways.\n\nAt the other end of the spectrum, I push into arbitrary precision territory, partly to break more of us free from using calculators.\n\nHere in 2020, on the other side of the free open source community ethic, I'm seeing the PWS (personal workspace) as the focus, or what we might call a \"cubical\" (except that divorces office work from other work).  A personal workspace should come with more than just slide rulers and calculators I'm thinking.\n\nUtopian literature from the 1960s comes to mind, Education Automation in particular.  That was Buckminster Fuller, always seemingly the wide-eyed optimist, telling us we were needed at home to study, in personal workspaces that didn't drive the people in them crazy.\n\nThe Dymaxion House was about taking drudgery out of housework, and financial concerns off a family's back, such that raising children and domestic chores could be relatively stress free and enjoyable.\n\nWhen my daughter took drivers' ed, the instructors led a session with the parents, explaining how what we were taught, and what was currently taught, had somewhat changed over the years.  The sideview mirrors would be further apart now, and you were to have headlights on at all times.  That's right, it didn't used to be that way.  Welcome to the new high school.\n\nNow look at literature.  Somewhere in there, we're going to run across a tight little geometry we don't want to just bleep over, or at least some of us don't.  We'll need our embedded vista viewpoints.  We didn't gaze at high definition 360 panoramas from Mars (Curiosity) either, when I was a kid.  Nothing like the \"Martian Math\" I like to riff off today.\n\nWhere will Tomorrowland's teachers take this stuff?  I look for signs, as I know it's all about feedback cycles.  The stuff my generation has been feeding in, will come back to us in some new way. Steering into chaos was ever thus.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}