{
  "id": "8284083247121791282",
  "title": "Welcome, to Planet of the Apes",
  "published": "2019-02-20T17:53:00.004-08:00",
  "updated": "2019-02-20T17:58:20.017-08:00",
  "content": "try it on x2 speed?\n\nPer a recent blog post, [one of the Fuller Schoolers](http://worldgame.blogspot.com/2019/02/riddle-of-peace.html) sent me a link to the Gutenberg Press version of an H.G. Wells piece.  Wells was attending a conference in Washington, D.C. in 1918, a gala affair with opening speeches by President Harding, aimed at heading off any more world wars.\n\nWW1 (as no one called it yet) had just ended.  Everyone was saying, how do we stop that from ever happening again?  Civilization was having a hard time recovering.  Wells wondered if the illness was terminal.\n\nOur man on the scene, as if sent by time machine, does his best to raise the awareness level, as we might say today, and without any use of psychedelics (Doors to Perception, by Aldous Huxley, came decades later).\n\nHe's skeptical that even he, a well-anchored man, will be able to muster the necessary sobriety of spirit to help regain an even keel.  He notices he's too giddy, one might say hysterical.  He's like a doctor walking among patients in a psychiatric ward, except we've lost track of which are which.  \n\nRussia has just saved France's butt against the Germans, and is now not invited to the table, because of those mean Bolsheviks.  Yes they were mean, as were the Zionists (Wells doesn't mention those).   Germany was to repay everyone.\n\nThe lessons learned were in meanness, and vengefulnes, for the most part.  Kids realize it's cruelty that counts, which becomes like their rite of passage to the despair of adulthood.  We won't get bullied again.  Next time, it's our turn to be the bully.\n\nAnd what about Japan, with its population pressures?  Could it really afford to give up its designs on China, and would it, if no one else did?  H.G. Wells was thinking out loud (not unlike Bucky -- the two did meet, in another chapter).\n\nWe've already been through many generations of European imperialism and colonialism by this time, one could say back through Rome.  Like Mark Twain and Andrew Carnegie, Wells is far from infatuated with imperialism.\n\nIn bringing up all these questions as a journalist, Wells was hoping to inspire deeper thought and more appropriate action on the part of his fellow planetarians.  He was doing the world a service, in sketching himself, the paradigm Englishman, in contrast to these impetuous Americans, and easy-to-get-along-with Chinese.\n\nHe's taking risks, as well as helping to define his own character.\n\nI'm not through the whole work yet.  I saw the name \"Briand\" popping up here and there, and started wondering about \"Kellog\" as in \"Kellog-Briand Pact\".\n\nWould that Treaty be the outcome of this Washington based process work?\n\nNot immediately, for sure.\n\nThat Treaty wasn't signed until 1928, and proved unenforceable against the warmongers (see embedded Youtube).\n\nWhen you get right down to it, the people who specialize in implements of torture and coercion, get to have their way quite a bit.\n\nWe all live daily under the threat of nuclear annihilation, and will tend to obey that within ourselves that would put off that terrible conflagration.\n\nNaturally there's push back against the warmongers, many of whom have already invested in reinforced bunkers.  The warmongers crave some proof they were right to be prepared, and stoke the self-fulfilling prophecy machine (the same siren songs, over and over).\n\nAs Wonder Woman would learn in Humans 101, a demonic force is hiding behind humanity, a Lucifer (they used a different name), determined to make this place a living Hell.\n\nHumanity sorely needs true defenders, and some pray for help from ETs.  I understand why a deus ex machina might have some appeal around now.  We have this sense of needing rescuing.\n\nWhere's a mother ship when you need one?  Beam me up Scotty.\n\nIn the words of one of my favorite Martians: \n\nIn his preface to the 1941 edition of The War in the Air, Wells had stated that his epitaph should be:  \n\n\"I told you so. You damned fools\".\n\n-- Wikipedia",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}