{
  "id": "1037325096236316585",
  "title": "Welcome to Wellville",
  "published": "2015-03-31T22:00:00.001-07:00",
  "updated": "2021-04-08T20:58:06.969-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157651278139308)\n\nI like the concept [of Wellville](http://hiccup.co/), which rewards communities wherein healing and health are considered normative, and health improvements are assessed by objective criteria.  The concept is reminiscent of [the BFI Challenge](http://bfi.org/challenge).\n\nJoining Wellville mainly means signing a contract to be open with data, though not to the personal level.  Whether one's community actually gets well or not depends on making the necessary investments, which Hiccup helps catalyze.\n\nThe seed or pilot projects, were a result of an application process.  Acceptance does not result in either paying or being paid, only in agreeing to be a part of an experiment, which involves being open with data.\n\nParticipants learn they're not helpless to [self organize](http://mybizmo.blogspot.com/2008/11/town-meeting.html) and implement strategies (such as healthier school lunches) and measure progress themselves (lower diabetes).  Just because you're not one of the original five doesn't mean you can't learn from paying attention.\n\nSounds simple, but grass roots self organizing tends to sound simpler than it is.\n\nEsther Dyson has an impressive resume, and although she's oft introduced, as tonight, by the CEO of Mentor Graphics, as the most influential woman on the computer scene, basically she's a very influential and respected Elder, all gender talk aside.\n\nShe's a stellar activist and is not afraid to apply considerable mental skills.\n\nPeople rally around her based on track record and discover their own ability to manage wisely.  She has an ex Marine as a sidekick on her Wellville project and he was on stage as well, fielding questions both from Terry Bristol (ISEPP president) and members of the audience, including me and Steve.\n\nClatsop County, [on the Oregon coast](http://mybizmo.blogspot.com/2015/06/goonies-movie-review.html), was one of the five districts of under 100,000 chosen to showcase results.  People are excited, but that's maybe hard to measure.  Audience members asked about sustainability and follow-through.  Many such efforts dissipate, good intentions notwithstanding.\n\nWhether health indicators improve in the next five years is the critical question and the project is in an early phase, though beyond just starting.  Their leveraging existing communities and networks, not starting from scratch, is one of the factors in favor of success.\n\nI'd been talking earlier today about [the brain drain](http://mathforum.org/kb/message.jspa?messageID=9733538) from the USG to the private sector, as if maybe I thought that was bad, but lets not forget the NGOs, which typically do what governments might have done but need nonprofits to really do for them.\n\nIn synergy with government, NGOs and their \"nonprofit corporations\" go a long way towards taking the edge off capitalism and making it seem possibly socially responsible.\n\nWhere corporations meet community wellness is where the rubber meets the road and Esther is certainly smart enough to see that.\n\nI was proud of ISEPP this evening as it was living up to its Public Policy moniker, giving the microphone to stakeholders to ask probing questions about pilot projects.  We did a good job asking serious and challenging questions (me included) with some making statements.\n\nI could tell that Wellville was getting a boost.  Portland was turning its wheels, and not without getting some work done.\n\nI only half expected to wedge in for the dinner, as an expendable director in the process of bowing out.  I make the dinners more well attended if sparse but tonight our sponsors and funders were enthusiastic for more schmoozing time and I gracefully took my leave, swinging through Rogue Hall on my way back to the car, having had drinks with Steve Holden at [Melting Pot](http://www.meltingpot.com/) both after and before.\n\nThe question is how to make public health -- not just expensive intervention (e.g. bypass surgery) against a background that takes ill health (poor eating habits, lack of exercise) for granted --  profitable to major players, such as providers of factory-made food stuffs.\n\nSteve asked if poverty or inequality wasn't by definition the metric (good question) whereas I was more focused on whether organized religion would get between young people and wise advice on lifestyle planning.\n\nHow does one teach \"the middle way\" i.e. avoiding excesses, while not becoming some kind of abstinence zealot (another form of addiction)?\n\nIt's not like we don't think these questions are unanswerable.\n\nI'm glad people are serious about even taking a look.\n\nClatsop County has a shot at better health and that's worth shooting for.  I wish them my best and offer my congratulations on being accepted into Wellville to begin with.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}