{
  "id": "2686452248096308830",
  "title": "What is Work?",
  "published": "2015-07-09T15:35:00.004-07:00",
  "updated": "2021-02-07T09:33:30.153-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/50918542783/in/dateposted-public/)\n\nfrom:  Chemistry: Imagination and Implication \n\nby A. Truman Schwartz (Elsevier, Dec 2, 2012)\n\nI can see on a macro scale where a piano mover, standing stationary, holding up the piano, is \"not doing work\" in the physics sense of \"work\" (force causing motion against resistance), but at the micro level, the energy expense has a real chemical manifestation.  The [APT cycle](http://hyperphysics.phy-astr.gsu.edu/hbase/biology/atp.html) is real, and sugars are [breaking down](http://www.biologyreference.com/Ma-Mo/Metabolism-Human.html).\n\nHow able are we to separate the concept of \"work\" from the concept of \"intent\" i.e. work is accomplished relative to a goal.  The difference between energy and work is that energy is \"wasted\" when it could have been harnessed to accomplish the \"job\" (goal) at hand.  Even if that energy was used somehow (expended), the expense was \"waste\" not \"work\".\n\nThe perpetual motion machine is impossible because of the law of unintended effects, i.e. so-called friction, a loss to waste, to heat, to meaninglessness, senselessness, entropy, corruption.  Every intended goal comes with a nod in the wrong direction and some energy goes that way every time.  We never achieve 100% satisfactory conditions for wasteless energy use.  That's a physical law.\n\nThe notion of work explains how \"the very same energy\" may be vested in Emerald City, the Oz capital, or in the desert sands surrounding the broken statue of Ozymandias, King of Kings.  Desert winds are energetic, but what work is being done?\n\nIn a [Teilhardian sense](http://mybizmo.blogspot.com/2012/04/science-religion.html), the direction of Work is \"towards the Omega Point\" of absolute Negentropy i.e. God, the Syntropic Source.  Energy doesn't care if we go there, but Will does.  Through the concept of Work, the concept of Will somehow enters the equations.\n\nHowever in retrospect the value gained from a project may not have much to do with original goals.  Side effects of the initiative come to have foreground importance.  That one's Will may not be \"of God\" so much as just Ego, perhaps weighed down by faulty beliefs, means the \"amount of work accomplished\" is sometimes an eye of the beholder thing.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}