{
  "id": "1846587387636938704",
  "title": "Which Way Home (movie review)",
  "published": "2014-10-31T13:28:00.002-07:00",
  "updated": "2014-10-31T13:33:33.494-07:00",
  "content": "Los Estados Unidos have become mythologized in more tropical climes, though here in El Norte, Costa Rica has a reputation as a subtropical paradise.\n\nNot only do these kids often have very hazy, uninformed ideas, their parents and/or guardians may likewise have a very poor understanding of what almost two thousand miles on the top of a freight train might do to a person.\n\nThe children run away, clump together in teams, and a large number come home as PTSD victims, having been starved, robbed, imprisoned, and/or forced to witness crimes, including atrocities, against fellow travelers.  Some come back in a coffin.\n\nWhat a lot of these Guatemalan, Honduran and Mexican kids don't realize is that North America has a large population of runaways just like themselves, fleeing broken homes.  They may be orphans, disowned, have an alcoholic step dad, mom's a meth head or who knows.\n\nFor one reason or another, a radical reboot / reset looks more promising than staying in the hood, and these kids hit the roads, sometimes the trains.  It doesn't matter what America you're in, the plight is the same, as are the attempted remedies.\n\nWhat's most touching is how many of these young wanderers imagine they might find a loving family up north, not realizing many of our voting USA taxpayers would rather enjoy using them for target practice.  Immigrants who got here earlier tend to be mean to later immigrants:  an old pattern, similar to the \"snobby butler\" phenomenon.\n\nOrganized work / study tours for academic credit, and web sites for matching students with global opportunities would be part of the solution, as well as safer train tracks.  By the looks of this film, trains in Mexico have a bad habit of flying off the rails.\n\nThe film crew is gutsy in riding the trains with the kids, getting lots of hours in and winning the trust of their non-unionized cast of characters.  The social services and authorities, as well as NGOs, are portrayed as always caring and professional.  The \"corrupt cops\" and \"predatory smugglers\" do their thing off camera keeping everything PG-13.\n\nMany thanks to [PortlandiaLanguages.com](http://portlandialanguages.com/) for hosting this showing of an Emmy Award winning HBO documentary.  Save The Children International was the designated beneficiary of all proceeds.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}