{
  "id": "116214154896856935",
  "title": "Whiteboard Doodles",
  "published": "2006-10-29T09:40:00.000-08:00",
  "updated": "2006-11-15T11:44:07.064-08:00",
  "content": "[](http://photos1.blogger.com/blogger/1134/545/1600/wb2.jpg)the birth of linuxA student wanted to know if Python might be used to write an operating system and, if so, what we'd use to compile it -- a kind of chicken & egg question (aside from Python not being a system language at this point).Above you'll see my outline of a response, the real world story of how our operating system Linux (one of several) was compiled using Stallman's GNU project's capable and free gcc.The rest of [the doodling](http://groups.google.com/group/edupython/browse_thread/thread/0fa4551eac2bf358?hl=en) has to do with [Vpython's cylinder syntax](http://vpython.org/webdoc/visual/cylinder.html), which aims a vector from a pos in the direction of an axis.  I'd thrown out the challenge to draw a tetrahedron, starting with a \"make hundreds of randomly generated balls\" script for clues.[](http://photos1.blogger.com/blogger/1134/545/1600/wb1.jpg)accessing toyzChronologically earlier in this talk, but easily inserted later, was this overview of Python talking to graphical widgets libraries to get its windows, mouse-pressable buttons and whatnot, called \"widgets\" in the trade.[IDLE](http://www.python.org/idle/), our out-of-the-box offering, relies on Tk for widgets, via the Python module Tkinter.Other shells such as PyCrust pull from [wxWidgets](http://www.wxwidgets.org/), a C++ library accessed from Python through the module [ wxPython](http://www.wxpython.org/).But keep in mind that other languages bind to these same libraries, explaining what Ruby and Perl are doing in the picture.The blue snake icon is about \"__rib__ syntax,\" [my shorthand](http://controlroom.blogspot.com/2006/09/lunch-on-hawthorne.html) for Python's special name methods (e.g. __add__, __call__), which look like ribs, and snakes have lots of ribs -- a good mnemonic that helps with writing one's first classes (we did Dog and Mammal), and needing to define __init__(self).Below that, I'm polling the class with my \"simplest polyhedron?\" question, getting back \"three sided pyramid\" and \"sphere\" (both good answers, though I define the latter away). Mathematicians call it a Simplex, in honor of its simplicity.However, connecting any four randomly generated balls with six edges isn't as easy as feeding  startpoint, endpoint pairs to visual.cylinder.  Next week, we'll take a more formalized detour into vector arithmetic within Vpython, plus introduce some [wrapper classes](http://www.4dsolutions.net/ocn/python/stickworks.py).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}