{
  "id": "8536630643841578962",
  "title": "Who Killed the Electric Car? (movie review)",
  "published": "2007-01-07T08:40:00.000-08:00",
  "updated": "2007-01-07T08:37:56.995-08:00",
  "content": "Warning, may cause a mild case of misanthropy.  Most the science is bleeped out (no cartoons about ions charging around).  ExDCI Woolsey shows up at the end, Evangelicals in tow, for an upbeat finish.There's something cruel about making a gas-powered motor vehicle company eat itself alive.  Make a different company with different management push the EVs.  Face facts: companies can't both fight to survive, pay pensions, and take poison at the same time.  Don't expect them to be so schizophrenic.  Have mercy.Do lawmakers and avid consumers really want to poke their fingers into a lot of fast turning machinery? Do we really know what'd happen if GM were forced to commit suicide?  The EV1 was its worst nightmare, the near runaway success of a competing way of life, likely better, and crushing it was the only sane way to go -- if you're GM.  Toyota got the jitters too.  They saw the future.  Who can blame 'em?  Who wants to dig their own grave? OK, OK, maybe some people enjoy it.Like, how about GE versus GM, or some respected name that just wants out of old fashioned internal combustion?  Rolls Royce? That might make sense.  Engineers don't need to care about brand, if their pensions move with them, along with good working conditions.  They'll line up based on what kinds of projects they're good at, what technology makes sense, attracts funding.The same problem those lawmakers are trying to solve, by \"forcing car companies,\" should maybe be left to rebranding consultants?  Little think tanks that specialize?  California is good at that stuff.  Oregon too.Keep in mind that many receding technologies achieve their golden age well after we see the writing on the wall.  Steam engines, for example, arguably reached their pinnacle when already eclipsed by the diesels.Dwindling numbers of die-hard gas powered vehicle enthusiasts might still have their fun in the sun for a long time to come -- even more fun than they're having today in their junky guzzlers.I thought the funniest segment was the old black and white newsreel about big oil in Iraq.  The narrator uses that spoiled richie rich voice so common back then, very upper deck Titanic.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}