{
  "id": "5423792877414930681",
  "title": "Withholding More Than Taxes",
  "published": "2020-12-09T07:53:00.003-08:00",
  "updated": "2020-12-09T08:02:38.837-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjs8axAnMw_v92131For4VTqxLuBN6NpU4-tQojR4Em_ZH6Oh1K1hkbm8EDB3fXJGs5v84jY3ddPmEwGdPB6RqMzxOzi1kDbCOkndqwvjpkyBwVR337y0ntXrWyFlg1w26vU5XJ/s180/smhierarchyanim.gif)A curriculum introducing the concentric hierarchy of volumes 1, 3, 4, 6, 20 with other volumes (including irrational) interspersed, in the context of closest packing (non-XYZ lattice), does not have to purge itself of XYZ. It goes directly to the imagination and fills your head. Cartesian coordinates are welcome (but we glance at Quadrays for a different perspective).You get comfortable with these geometric concepts early (in connection with natural and human designed architectures) and that means you get the history too: this bold futurist (tons of materials) returned from obscurity, thanks to his invisible army (fans, colluders, many of them Chinese speakers), and now it's not all doom and gloom, even though peak oil and climate change are still real (not denied). That bold futurism has returned.All it would take is like a cooking show with polyhedron measuring bowls and some cartoons (animations). Given Youtube, you don't even need to wait for the classroom teachers to get on board (they tend to be extensions of big publishers -- I used to work at McGraw-Hill and saw it from that angle). But you do need to give kids some clues. Needles in haystacks take a long time to find (especially if you're not even looking for them).We're one popular program away (like Sesame Street) from kids being fluent enough to know of their Dymaxion Map (Fuller Projection) and all those other conceptual tools he bequeathed to them, that the \"corporate personae\" (the liability limiting master controller pseudo adults) are now sitting on, withholding, deliberately suppressing, precisely because our American heritage is not consistent with the Great Tragedy scenarios they have in store for us humans (endless war, misery for the many, unfettered greed for the few --- we've already been herded around their block a few times, sacrificing the kids instead of teaching them).(from somewhere on Facebook)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}