{
  "id": "3188032629949021124",
  "title": "Women as Kings",
  "published": "2017-04-07T00:25:00.000-07:00",
  "updated": "2024-12-23T06:22:39.263-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157678956896774)\n\nI've chosen this title precisely because it's a gender bender, as we normally translate \"King\" to mean \"of the male gender\" and so \"women as Kings\" is an oxymoron, a grammatical error?  Why so though? Kara Cooney was interested in precisely that question.  In ancient Egypt, a woman would occasionally become Pharaoh.  How and why?\n\nThe timing of the talk was ironic in that pyramid-hierarchies run by men were clearly wreaking havoc, cranking up military invasion plans long in the making, and triggered by magic trick (not good magic, evildoers at work).  Women are not really represented in world affairs and are expected to go along as cheerleaders and care-providers, but why so?\n\nKara's hypotheses are in the direction of raw biological facts of life. Bearing a child puts huge stress on a woman, and that's just the beginning of her caretaker role.  Men, unencumbered by pregnancy or nursing offspring, range far from the camp, in hunter-gatherer tribes, and fetch the hard to find, treasured meat protein.  They literally bring home the bacon, which serves as a currency, cementing inter-family relationships.\n\nIn societies were getting the valued protein is something both sexes engage in, such as by fishing in the American southwest, women are more likely to sit on councils of elders and weigh in on the big decisions.  Where all the whale meat comes from men, women have little leverage and are treated more like livestock. \n\nOnce we're into an agricultural society, women still do most of the clothes-making and janitorial work. They're expected to have even more kids per year than in hunter-gatherer societies. Again, biology is against their achieving leadership roles.  Men are more likely to survive, in not undergoing childbirth, though they may fall in war.  Life spans weren't as long across the board.\n\nNow let's turn to Egypt and what made her special:  an ocean for a northern border, desert on three sides, and granite boulders in the upper Nile.  Large scale military invasions were pretty much out of the question, and the fertile river valley produced just about everything a civilization might need.  By dint of geography, Egypt was both abundant and well-protected.  In such a society, patterns could settle, through thirty dynasties, until she became more of an annex to Rome.\n\nThe main focus of Kara's talk was Hatshepsut. Dr. Cooney (UCLA) is an expert in Egyptian sarcophagi and knows her Egyptology really well. Her book, Women Who Would Be King, is on what allowed women to rise to the highest, most divine position in the land, beginning with explanations for why the occurrence was nevertheless uncommon, and still is to this day (not that we have pharaohs anymore).\n\nHatshepsut had a perfect pedigree, as a king's daughter who married a king.  When the king she was married to died, without leaving a son, succession switched to her nephew. She was permitted to act as regent as the nephew grew into adulthood, and even then, she served as co-king.\n\nSome decades after she died and was given a king's tomb, the nephew went to some lengths to have her memory expunged.  Archeologists are still putting the story together, understanding how temporal powers, even more than acts of nature, tend to mess with the record.\n\nCleopatra, Nefertiti, and some other female pharaohs made her list.  She was respectful of all of them, but pointed out the pattern:  none of them ruled solo, all were apparently tolerated in order to provide a placeholder and smooth a transition to some new lineage.\n\nGiven the brute facts of biology, Kara thinks women are perceived as loyal within a narrower, smaller sphere, the family or tribe, whereas men get to be the power brokers in the greater games. The public is more suspicious, almost instinctively, of a woman's loyalties and motives.  Men get more benefit of the doubt.\n\nThe Q&A was lively, and at the dinner downstairs, Kara kept the conversation going well through the dinner hour.  People gathered from all tables and shared viewpoints late into the night.  That was evidence of Kara's power and leadership right there.  She's a powerful presenter, and charming as well, in being so forthright.\n\nWhat I wonder, as a Quaker, is if women come into their own in power structures that have no obvious hierarchy, are less pyramidal and more networked.  I think of switchboard operators, a passing profession.\n\nI'm glad Christine got her truck back.  She drove me home, telling me the story.  The truck had been stolen right out from under her.  Except for the smell, it was undamaged, even came with some extra tools.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}