{
  "id": "7868273055921260753",
  "title": "Work / Study",
  "published": "2017-12-02T10:44:00.001-08:00",
  "updated": "2017-12-02T11:09:29.814-08:00",
  "content": "The plan in the \"US\" Congress, to gut grad schools by making tuition waivers taxable, targeting those with the least income yet still with hope, is motivating changes in bookkeeping.  Work/study is what they do in Congress too.\n\nWhen I get a job at IBM or Google, and work my butt off to learn a lot of in-house procedures, you could say I'm in a kind of grad school, except I never see the $95K income the government would tax, that represents the worth of my training.\n\nLikewise, a freshman legislator, still learning House rules, is getting a tuition waiver on like a $200K privilege, as she or he gets an education in the arcane functioning of government organs.  That's a lot like going to med school.\n\nGiven this concept of \"tuition waiver\" is so flexible, and doesn't apply in the case of IBM or Congress, it looks like schools will be changing their rules as well, to operate more like corporations, the only structure the \"US\" looks upon favorably, having been hollowed out by same.\n\nWe say \"US\" Congress with scare quotes at times, as the will of the people is no longer expressed through democratic institutions in the District of Columbia.  That's propaganda, or fake news, and rather weak.  We know bankruptcy when we see it.  The attack against grad students is proof positive that we have a dangerous parasite in our midst.  Let's hope the antibodies go into overdrive.\n\nYou'll notice the so-called \"public schools\" no longer teach civics nor provide much insight into the workings of government.  We've degenerated into clashing mobs and their media.  I suppose that's what they mean by \"populism\".  Whatever it is, it's not recognizably what's spelled out in the US Constitution. \n\nThat the USA is dead and gone, undefended by those sworn to uphold its Constitution, is [not really news](https://books.google.com/books?id=7bzPDQAAQBAJ&lpg=PA74&ots=Z6iD06JwCh&dq=grunch%20bankrupt%20extinct&pg=PA74#v=onepage&q&f=false) though.  We've lived with mob rule since the 1980s at least.  Imperialism spelled the death of a once proud democracy.  We live amidst its ruins and remnants, waiting to see what springs from the ashes.  In the meantime, it's all [Reality TV](http://controlroom.blogspot.com/2017/12/reality-tv.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}