{
  "id": "5363935652452934104",
  "title": "Working the Lists...",
  "published": "2010-03-05T22:38:00.000-08:00",
  "updated": "2011-06-12T12:28:10.365-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/4436951031/)Math Forum:[Re: Metric System (not the only)](http://mathforum.org/kb/message.jspa?messageID=7000720&tstart=0)[Re: Math Anxiety and Work /Study alternatives (for credit)](http://mathforum.org/kb/message.jspa?messageID=7000726&tstart=0)[Re:   Tetravolumes as a proposed standard](http://mathforum.org/kb/message.jspa?messageID=7001313&tstart=0)[Re: Story problems](http://mathforum.org/kb/message.jspa?messageID=7001314&tstart=0)[Re: Physical Activity Levels (a variable)](http://controlroom.blogspot.com/2010/03/for-credit-curriculum-games.html)[Re: Calculus Mountain](http://mathforum.org/kb/message.jspa?messageID=7002442&tstart=0)Wittgenstein List: (these links unlikely to work)[Fwd: from a Fuller School list](http://www.freelists.org/post/wittrsamr/Fwd-from-a-Fuller-School-list-mentions-Wittgenstein-RFM)[Re:  Family Resemblance and Mathematics](http://www.freelists.org/post/wittrsamr/Family-resemblance-and-Mathematics)Synergeo:[Re:  DC June](http://groups.yahoo.com/group/synergeo/message/57830)[Re:  Gnomon Studies, school standards](http://groups.yahoo.com/group/synergeo/message/57828)[Re: Operational Mathematics (meaning through use)](http://groups.yahoo.com/group/synergeo/message/57848)[More Storyboarding (Digital Mathematics Curriculum)](http://groups.yahoo.com/group/synergeo/message/65759)PSF list:members onlyWQM / MG list:approved sheepdoctorBy some lights, there's no \"working\" here, just goofing off (aka futzing around) on the Internet.Then there's other stuff that I did today.  Twenty blocks walking.  Yemen a topic (I've never been there).  Touched base with AFSC last night, not just about Haiti.  A call about Africa (Uganda).Our company's best cook is away on leave so I'm the chef by default.  I'm making:  an onion potato and broccoli topping (oil, water base), over brown rice and some kind of bean.  I'll have some popcorn later.Others in this radical household have already turned in for the night (that would include the pets).  Nope, spoke too soon.Is there a radical middle?  Was Ben Franklin a radical?  I'd call him a revolutionary certainly.How about Mark Twain?  Have you read his more satirical \"adult\" essays?  His anti-imperialist invective?Before these listservs (mail reflectors) became relatively easy to join, a group called Action Linkage encouraged people to run these by snailmail.  I joined at least a few such groups from my mailing address on Rhine Street in the Brooklyn neighborhood.I was also an early adopter of an IGC account, using PeaceNet I'm pretty sure, through dial-up access.  This was pre Web.I'd read Network Nation (Turoff & Hiltz) in Jersey City, along with Computer Lib / Dream Machines (Ted Nelson).  These works spoke to my condition.  When hypertext (http) finally arrived, I was hot to trot.  The Zeitgeist was strong within me, some philosophers might say, although that's not something unique about me -- the very meaning of Zeitgeist in a nutshell (it's not about any one of us, we share in the spirit).As a Quaker, I have other words besides Zeitgeist I might use.  In Synergetics, the Holy Ghost is mentioned, probably not in itself sufficient to make it a Catholic title.  I've seen Noosphere.  Some speak of telepathy, with or without allegiance to a God concept (many namespaces == many ontologies).  We often speak of Spirit or Light, preferring to attend to it than to define it.Placing a premium on intuition is what it comes down to in practice sometimes.  I know Applewhite relied on intuition quite a bit, which likely explains why he worked with Fuller as well as he did, despite ups and downs (we had those too).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}