{
  "id": "2552153951446273548",
  "title": "Working It",
  "published": "2016-09-12T21:12:00.001-07:00",
  "updated": "2016-09-13T07:46:52.664-07:00",
  "content": "We enjoyed a Hophouse gathering I doubt will be repeated, in terms of who was there:  myself, Michael Hagmeir (now resident of St. Louis, MO), Patrick & Glenn (Asylum District, like me) and Mike (visiting from Florida).\n\nMichael drove here in two and a half days, stopping at Carhenge in Nebraska and Craters of the Moon in Idaho.  The previous evening, I'd joined Michael and Matt for an evening together.  The car stays behind when he flies home.\n\nThen Glenn and I grabbed a 14 to downtown, leaving time for me to get to Payless for shoes (I wore out the Mt. Tabor walking shoes again), and have a beer each at Ringler's.\n\nOnly a few blocks from there is Wieden + Kennedy.  We arrived 20 minutes early, not sure if there'd be any shortage of seating.\n\nGiven the Tech Crawl that just happened, I somewhat made myself at home and poked around in the lobby taking pictures, not really what their workflow is set up for.  The receptionist had to remind us this was a private office building.\n\nAny problems occasioned by the arrival of the rest of our throng turned out to be self-solving given no one was wanting to be rude.  We all waited patiently for about forty minutes, after which the ball got rolling.   \n\nPDX Maker Week is only just making its debut.  We haven't seen Maker Faire packaged in the context of a whole week before.  PSU took on promoting this new idea, as a sponsor.  OMSI took on the two day Maker Faire.  Glenn and I [made it to that](http://controlroom.blogspot.com/2016/09/maker-faire-at-omsi.html) as well.  Thanks to [workingIT](http://www.workingit.com/), I got a press pass.\n\nSome of my more detailed initial thoughts on Dale Dougherty's keynote went to @4DsolutionsPDX, which is where I work on a maker space known as #CodeCastle.  I tweeted as we bused back to Asylum District along Division. I was thinking back to a certain Pycon keynote, and the Stanford connection.  Making commitments (\"I'll be there\") is making.\n\nMostly I was observing how advertising involves projecting lifestyles with deliberately placed products, and that's a form of \"making\" some have mastery over.  Which booths teach that?  All of them?  Pretty much.\n\nGlenn wondered if those promoting the \"Maker\" meme were trying too hard to encompass too many crafts outside the digital-electronic.  He's an analog craftsman going way back, but hasn't taken on \"Maker\" as a part of his own branding, preferring to leave that term to coders of devices.\n\nObviously memes are subject to regional variants, or call them dialects.\n\nBringing all these crafts together suggests synergies and continuity as well.\n\nGetting out into remote villages with high tech, yet adopting somewhat \"time-refined\" lifestyles (a euphemism for \"ancient\"), requires places that continue to teach the skills associated with high tech, in addition to all the \"intermediate\" and \"lower\" tech.\n\nSomeone has to keep designing and manufacturing circuits, programming games and simulations, even if a lot of people live nowhere near a chip making facility or fab plant.\n\nCivilization has a lot of batons to pass.  The relay race is another good metaphor.  Keeping our most advanced tech going doesn't mean we can't also have [camping](http://controlroom.blogspot.com/2016/08/refugees-camping.html).  Not everyone needs to live or work in high rises either.  A wide variety of lifestyles are required, for any at all to exist.\n\nSpeaking of OMSI, I've known evening events to occur there.  PDX Maker Week 2017 might look at OMSI as a venue for some 6-10 event. I understand it's hard working with all volunteers and donated space.\n\nMaking events happen is itself a kind of making.  Earning credit in some currency of the realm, for helping to pull these events off, might make some sense, a standard pattern.\n\nWhere making meets camping is what we call scouting, already a big part of the culture here.  Living \"outdoors\" does not mean sans any shelter from the elements, yet \"closer to nature\".\n\nCamping keeps upping the level of technology available, or at least opening the space of possibility.  We saw some interesting new camping ideas at Maker Faire. By camping I don't mean necessarily nomadic.  Farming and permaculture might go on, with sacred spaces made semi-permanent.\n\nWhere #CodeCastle \"actually exists\" physically is not important at this \njuncture, as right now it's a meme, i.e. more metaphysical, and tied \ninto the \"(High + Art + Code) * School\" meme -- that's supposed to remind\n us of the distributive property.\n\nOpen source tools for advertising lifestyles, based around artifacts and workflows, will help folks build learning communities.\n— Kirby Urner (@4DsolutionsPDX) [September 13, 2016](https://twitter.com/4DsolutionsPDX/status/775530797583306752)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}