{
  "id": "2336687077240735718",
  "title": "World Pax",
  "published": "2015-12-07T19:24:00.000-08:00",
  "updated": "2015-12-08T09:40:01.084-08:00",
  "content": "A lot of Democrats are shocked by the unseemly belligerence showed towards Persia, whatever disputed borders may obtain, on the part of Republicans, uniformly condemning of the deal.\n\nThey maybe remember that Kissinger, a Republican loyalist, advised \"tilting towards Iraq\" and that was official policy in terms of where the ordnance went, to support Saddam's side.  The Iranians were the \"bad guys\" in this chapter, all the more so after [the hostage crises](http://worldgame.blogspot.com/2013/03/argo-movie-review.html).  Or was that when the dynamics changed?  Under Reagan the threat was suddenly south of the border.\n\n[](http://www.nybooks.com/wp-content/uploads/2013/11/danner_2-121913.jpg)\nNATO/Handout/CNP/Corbis \nDonald\n Rumsfeld, then ambassador to NATO,\nwith Secretary of State Henry \nKissinger\nand President Richard Nixon, Brussels, June 26, 1974 \n\nSo after Carter came a [tilt the other way](https://en.wikipedia.org/wiki/United_States_support_for_Iraq_during_the_Iran%E2%80%93Iraq_war), with Republicans negotiating an end to said hostage crisis, and Ronald Reagan becoming president, with Bush his Vice President (Casey in CIA, preparing for Iran-Contra).\n\nThat there had been some kind of pivot, post the Carter administration, took even Saddam by surprise and he assumed his invading Kuwait would not be the trigger it was for a major shift in weight under George HW Bush as president.\n\nUnder the next George Bush (son of George Bush) the US would inflict uber-damage on a former ally, calling it \"shock and awe\".  Some saw it as betrayal.  Wasn't Iran the enemy, not Iraq?  Not since Ollie North sought Iran's help against Cuba-supported Nicaraguans.  Wasn't that an \"Iran Deal\" of sorts, until exposed?\n\nBut by now the Shah was out of power and the Ayatollah Khoumeni had replaced him with a different lineage.  Taking Iran for granted was no longer in the cards; it could not be bullied so easily.  To make a long story short, Saddam became the next Noriega, Iraq the next Panama. Rumsfeld and Cheney would help with both the tilt (under Nixon) and the counter-tilt (under Bush).\n\nBy the sound of things, I'm planning to recount some lengthy and dreary story about [the Orient](http://worldgame.blogspot.com/2015/04/what-is-terrorism.html), or Arabia or whatever.  I must be into oil or something.  Do I have a point or what?\n\nI'm just trying to explain why the Republicans may have a harder time swallowing an \"Iran Deal\" given their thinking hearkens back to English Empire days in trying to imagine \"what a superpower would do\" in these circumstances.  Their answer (by the sound of things):  just restore that old Pax Americana and let America rule the world once again!  They're thinking more [like Allen Dulles](http://www.mohammadmossadegh.com/biography/allen-welsh-dulles/january-30-1954/) maybe?  He's more their role model.\n\nThe thing is, there never was any Pax Americana, that's a myth.  The 1800s were about a Civil War (in the US) and the 1900s were about Global Wars (involving the US), so there's really no \"pax\" in this picture and the US is lucky to [still be here](http://mybizmo.blogspot.com/2015/11/resolved-usa-still-solvent.html) in any shape we might recognize.\n\nI'm all for Pax on Earth myself, in the sense of Peace or Mir.  I don't see that one nation, under God or otherwise, needs to enforce it, as that tends to stir resentment.  More, it takes a willingness to allow it on the part of many nations.  Allowing is more natural than forcing.  The world is sick and tired of wars and has the ability to heal if given half a chance.  [More ordnance](http://controlroom.blogspot.com/2015/09/done-deal.html) is not what's most needed.\n\nDemocrats see the Pax more like that, a co-production, whereas those still under the spell of the Manifest Destiny [meme virus](http://mybizmo.blogspot.com/2015/12/speaking-of-memes.html) (still rampant in some circles) need to see a Stars & Stripes on everything if they're to believe it's really real.  To the rest of us, less infected, all that \"faux superpower\" nonsense looks really phony.  No empire needs restoring.  No empire is what's best.\n\nI'm glad that Congressmen from both parties, and from more parties as they arise, get to travel a lot, especially out of the country, as a perk of the job.  Sometimes I forget, as an expat who grew up while wandering the planet, that many in Washington DC were never so privileged.  Their education takes time, just as mine did.  Even presidential candidates need more experience sometimes.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}