{
  "id": "1250869848189255641",
  "title": "World Game Continues",
  "published": "2018-03-07T13:50:00.001-08:00",
  "updated": "2022-02-02T14:45:35.956-08:00",
  "content": "Wanderers, who meet frequently at the Linus Pauling House on Hawthorne, tend to be familiar with the World Game idea, and a couple of us at least, have actually played it.  Francher showed up at the ones led by Buckminster Fuller himself.  I played it in Eugene, and in San Diego, when Tara was just taking her first steps.\n\nWe're reading about the passing of Jay Baldwin at 85, an American hero and lover of cars, who escaped New Jersey and headed for California along the open road.  His love of cars would steered him towards Fuller, who developed a three wheeled Dymaxion Car at a critical juncture.  Then came the Dymaxion House.  These were props we could use on the World Stage (where World Game is actually played).\n\nI'm beginning a new course on data science tonight and want my students to get in touch with their internal data scientist.  I think some of us get turned off statistics for the same reason we don't really like economics:  the topics are too dismal, to fatalistic and deterministic.  \"I'm not a statistic\" the ego cries, fitting the model.  I know I've eschewed thinking like a data scientist most of my life.  I'll confess that, and discuss techniques for overcoming such limitations.\n\nWorld Game connects to Club of Rome in that humanity was newly becoming aware of its ability to model reality based on big data, or any data at all.  Computers could churn through the number crunching, according to whatever algorithms.  Humans would be free to focus on the algorithms.  We could turn our mathematical understanding into a better tool for forecasting.  These were seeming like superpowers.\n\nI wrote on the Club of Rome in eighth grade, for Mr. Craden's sociology class.  We had sociology at the Overseas School of Rome.  Dad subscribed to The Futurist, was an urban planner in charge of drawing up fifty year plans for the government of Libya.  I took for grated that humans were meant to \"think big\".  That was part of our role.  During a crisis period in Jersey City, I came to doubt that such thinking mattered, as it never seemed to gain traction.  History did its own thing, never mind how we planned it.  I've come to a later synthesis, still being fine-tuned.\n\nWorld Game is all about anticipating, forecasting from data.  Even for that reason alone I should be grateful for this opportunity to retrain and change the relative weights in my neural nets, feeding more power and influence to my internal data scientist.  The free open source tools I'm learning to use help me play World Game more effectively.  The very process of learning to use them helps me project what the personal workspace (PWS) of tomorrow will be like.  The PWS is a core concept within GST.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}