{
  "id": "3009082135274064519",
  "title": "Wrap Up",
  "published": "2015-07-19T09:34:00.003-07:00",
  "updated": "2015-07-19T10:20:23.911-07:00",
  "content": "I've known Sara since [Gathering of Western Young Friends days](http://worldgame.blogspot.com/2006/09/more-about-quakers.html) and \nfollowed her trek into Landmark, with which she's been active for quite \nawhile by now.\n\nIn the dinner line I suggested she refer to me as her \"est\n vet Friend\" in Landmark circles.  \"I'm like the Viet Vet who can't \nquite remember to say Ho Chi Minh City and keeps saying Saigon\" I explained, \nmeaning I continued using the word est to refer to Landmark stuff sometimes.\n\nCarol (mom) has a hard time specifically remembering when [Jack (dad)](http://www.grunch.net/4dsolutions/jackbio.html) did the est Training in Washington DC.  \"He did a lot of things\" she says.  We were living behind the Capitol building, not off DuPont Circle like that other time.  [Lon Golnick](https://groups.google.com/forum/#%21msg/alt.fan.landmark/82xqjY23Kpc/hPqkovRfcZIJ) was dad's second weekend trainer.  That was the summer Bucky died.  I got the news when we were heading to Friends General Conference (FGC).\n\nMom's\n not remembering dad's doing est came up at dinner last night, as she overheard Sara and\n I yakking about Landmark.  My two trainers were Ron Browning and Charlene Afermow (the training lasted over two consecutive weekends, for which different trainers were deployed).\n\nI was reaching a peak around my est\n activism in those days, picking up on some urgency from Bucky Fuller \nand elsewhere.  I was return-addressing my envelopes from Erhard's San \nFrancisco office, earning me a phone call from his lawyer who told me to\n cut it out.  We'd had friendly correspondence too though, that office \nand I, so chalk it up to stormy times.\n\n[Applewhite](http://mybizmo.blogspot.com/2005/02/ayatollah-of-tetrahedron.html) was uber-suspicious of est when we first met.  Our friendship was far from a done deal at the outset, despite my evident fascination with Synergetics. \n We had our ups and downs, as I reminded him the last time I came to his\n apartment.  \"You can abbreviate all that\" he said, meaning no need to draw \nit out into some long story or soap opera.\n\nHe was then in the process of shipping off \ncollected papers to the Standford Archive and wondered what of mine I \nmight want to hold back.  I kept most of a file labeled \"Quirky\" (my \nwritings range from the quirky to the whimsical a lot).  That would have been in 2004.\n\nAnother issue between me 'n Ed was I'd at one point lept to the erroneous conclusion, based on a \"close\" reading of Cosmic Fishing,\n that \"E. J. Applewhite\" was one of Fuller's pseudonyms and was a clever\n allusion to what a human brain looks like when sliced.\n\nFuller\n has a strong mind / brain distinction running through his works and I \nthought it clever he gave his brain a pseudonym and had it doing all the\n filing and other mechanical grunt work to get Cosmic Fishing published, not to mention really  solo-authoring Synergetics.  One could see where Ed might not be amused by my error, which earned me some mocking down the road.\n\nAnyway,\n Sara ducked out of Annual Session to keep current with one of her \nLandmark activities, which she was able to do in Spokane (she had been \ndoing them in Portland).  Whitworth U is just outside Spokane's city \nlimits (right?), as I discovered wandering around in the car, looking \nfor a Wal*Mart.\n\nThe Nikon Coolpix Melody gave me to tide me over while the Fujifilm XQ-1 is fixed (actually \"replaced\" is the latest word from Camera World -- under warranty) has the older Compact Flash memory cards.  I'd been to two Fred Meyer's\n and not found a reader, but then the electronics sections of the \nvarious branch stores carry much the same inventory, so saying \"two\" was\n over-dramatizing the situation.\n\nWal*Mart, with a \nsomewhat larger inventory, had a SunPack multi-format card reader that \ndid the trick, resulting in my being able to read the card(s) and share a\n few pix to Flickr, where I created an album for NPYM 2015 (embedded \nabove).  Wal*Mart saved my bacon in Richmond, IN that time as well, \nafter the cleaning crew locked away all my charging devices.\n\nI\n yakked with Larry at breakfast this morning.  He came by Alaska \nAirlines.  He's a licensed pilot himself, but renting an airplane is not\n a small cost.  A plan to have someone to fly out with him and return the airplane to Portland that same day did not pan out.  Chris met him at the airport and they went \ngeo-caching on the way back to Whitworth U, a sport akin to treasure \nhunting and involving GPS devices and a loose community of peer players.\n\n[](https://www.flickr.com/photos/kirbyurner/19644522320/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}