{
  "id": "7376295502008548303",
  "title": "Wrong Again!",
  "published": "2020-04-01T23:02:00.001-07:00",
  "updated": "2020-04-12T11:58:41.435-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh9jQ8PC5C01P7vLzmJXxE7yv0mUxAkOIPgvtumfpUFPOFP729WjeWLfjM_zKBXKTxeCSMgbNM1ONwM1CVctgyp_YHyHqSv-YZtunNlrGgJT1IhMjhpwri16Z53O9cflyRmvxbQ/s1600/cubanim.gif)\n\nAs we were ramping up towards the apex, of the novel coronavirus pandemic, I took advantage of a teachable moment and went over the Synergetics relationship to Virology and its contribution to our understanding of the morphology of the virus.\n\nAlthough depicted as perhaps vaguely icosahedral, my understanding is this is one of the helical viruses, with its RNA all curled up inside a ball of fat with spikes on it.  The lipid ball, scavenged from a hapless eukaryote, naturally assumes a spherical shape, like a bubble, but the idea of \"capsid counts\" is somewhat out the window.\n\nHow it works in Synergetics is the [1, 12, 42, 92...](https://oeis.org/A005901) growth pattern of the cuboctahedron, is likewise the pattern of the icosahedron.  The two relate through the Jitterbug Transformation.  Viruses that are icosahedron shaped, made from capsomeres, will sometimes come with these numbers, which is what got Fuller mentioned in the New York Herald Tribune (1924 - 1966) -- not the New York Times I don't think, as Bucky mistakenly recalls in some interview on Youtube.\n\n\"All of these numbers are in fact found in actual viruses, 12 for certain bacteriophages, 42 for wart viruses, 92 for reovirus, 162 for herpesvirus, 252 for adenovirus and 812 for a virus attacking crane-flies (Tipula or daddy-long-legs)\" - The Natural History of Viruses by C.H. Andrews (W.W. Norton R Co., 1967).\nAnother link:  Synergetics is focused on the question \"what is life?\" in some contexts.  Dr. Fuller's collaborator, E.J. Applewhite, later wrote an entire book on that question, entitled Paradise Mislaid. As we hear in countless stories these days, \"you can't kill the covid virus, because a virus is not alive\".  But then let's remember anthropomorphism has always extended to natural forces.\n\nIf I understand Fuller correctly, he didn't see physical \"meatspace\" as the same as life, which latter he tended to equate with the metaphysical in his U = MP equation (M for metaphysical).  20th Century science was never comfortable with anything but U = P i.e. the universe is entirely physical.  That the virus is a kind of biomachine, or biorobot, was for Fuller an indication that whatever life is, it lacks physicality.  Does U=MP suggest a mind-body dualism?  Philosophers will have these debates.\n\nI'll [reproduce my comment](https://www.kirkusreviews.com/book-reviews/ej-applewhite/paradise-mislaid/) on Ed's book:\n\nE.J. Applewhite was a friend and I was aware of his process, albeit vaguely, in writing this erudite investigation into \"what is life, really?\". Having been a loyal collaborator on Synergetics, he was ready to contribute a magnum opus of his own. These chapters of his life were not disconnected, as the fact that a virus is just as much a machine or robot, informed Buckminster Fuller's view that the physical universe was not in itself alive. Discoveries in virology had proved there is no distinction. Life, then, was weightless and metaphysical. Per the review above, such thinking resulted in banishment. While Applewhite includes Fuller's views in his survey, he does not follow them blindly. He's content to invite us to the debating arena, and catch us up on the points that many have made.\nMichael Goldberg fit more data points with the capsomere counts, using a formula more elaborate than 10*F*F + 2 (* for multiplication). 1, 12, 42, 92... was not the whole story.  Virology moved on, adding to our knowledge at a furious pace, as one of the most interdisciplinary of studies (especially once we factor in epidemiology).\n\nI might get around to correcting myself on the Youtube channel, which is where I was bringing up these counts in the first place.  OEIS linked to my website (grunch.net) [under Links](https://oeis.org/A005901), and I like to show that off, by following the link to my virus page.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}