{
  "id": "8971626596776116371",
  "title": "Yakking with HomeSchoolers",
  "published": "2015-11-14T12:36:00.002-08:00",
  "updated": "2015-11-14T16:05:45.237-08:00",
  "content": "Yakking with home-schoolers [on the Web](https://groups.google.com/d/msg/mathfuture/-VBz8X1zSMk/YRodE7R8AQAJ) (hyperlinks added):\n\nI'd never seen Platonic Solid Rock by Dan Radin.  Fun.\n\nNote\n here at 1:36 mas o meno where we get the standard schoolish math re \nDimension, that his line segments (supposedly 1D) are most definitely \n\"lumps\" i.e. they have all the height, width and depth one could ask \nfor, even as incorporeal narrator informs us otherwise.\n\nThat's\n typical in Platonic cartoons:  they say \"you will never see a point\" \neven as they make the point (pile of chalk dust, usually).  Kids squirm \nuncomfortably and some try to mount some resistance, only to end up in \nthe corner, dunce hat on, an example to others who dare question \nauthority.\n\n\"Points are so small they're smaller than the \ntiniest atom\" (quoting some random math teacher) -- yeah, as if they \nexisted at all (to say they're Platonic means they're \"pre-frequency\" as\n we Martians say i.e. they have no energetic content whatsoever).\n\n[With Karl Menger](http://coffeeshopsnet.blogspot.com/2009/03/res-extensa.html) we get our \"geometry of lumps\" and do not distinguish \nline-shapes, point-shapes and polyhedron-shapes on the basis of their \nbeing \"depth only\" or \"just depth but no width\".  No, they're all 4D \nlumps, so-named because the tetrahedron broadcasts 4ness and is \ntherefore the canonical representative of Volume (i.e. pre-frequency \nspace).\n\nI'm\n into the intersection of mathematics and animation (mathy cartoons). \nEven just this animation about the International Mathematical Union is \nfun:\n\n[https://youtu.be/1VXDejQcAWY](https://youtu.be/1VXDejQcAWY)\n\nNote that I am not the creator of [the above](http://controlroom.blogspot.com/2015/02/a-tale-of-two-logos.html).  \n\nI\n like it in part because the IMU explicitly credits Buckminster Fuller \nas a \"popularizer\" of his \"Jitterbug Transformation\", which is this \ntwist-contraction of a cuboctahedron into an icosahedron then \noctahedron.  \n\nThe citation is somewhat ironic as standard \npractice in math circles is to dismiss Buckminster Fuller as a \n\"popularizer\" of X and Y without ever coming to grips with [Martian Math](http://controlroom.blogspot.com/2015/10/martian-math-storyboards.html).  \n\nI blame the philosophy department as union mathematicians\n are by training clueless about much beyond math (per job description) \nwhereas we philo types are supposed to stay more up to date on a broad \nrange of disciplines.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}