{
  "id": "4164879338463136472",
  "title": "Yakking with Patrick",
  "published": "2010-11-22T10:06:00.000-08:00",
  "updated": "2010-11-22T20:27:07.196-08:00",
  "content": "Sir Patrick was by yesterday evening, one of our resident geniuses ([97214](http://worldgame.blogspot.com/2010/04/back-in-97214.html):  the zip code of geniuses in the city that works).Dr. Nick came in later, and we screened [A Necessary Ruin](http://worldgame.blogspot.com/2010/10/necessary-ruin-movie-review.html) against the classroom wall (same arrangement I'm using to teach Python).We also talked about [girl scout math](http://mathforum.org/kb/message.jspa?messageID=7303061&tstart=0), which LW is pioneering -- a kind of bridge between Supermarket Math and Neolithic Math per my Heuristics for Teachers.  One needs to shop wisely, meaning [a lot of homework](http://worldgame.blogspot.com/2010/11/visit-with-architect.html) goes into the [BE phase](http://www.grunch.net/synergetics/gst1.html) (GST).  One simulates, plays \"what if\" in one's head.  Then you jump out of a helicopter or whatever (perhaps as a rescuer, perhaps as an occupier, perhaps as a company shill... many language games might apply).I also shared [this little cartoon](http://www.youtube.com/watch?v=g40KpZa4hSI) that's good for learning Wittgenstein's philosophy. I used it in my last Python class as well, given the nominalist (name -> object) model it well illustrates, antithetical to pragmatic operationalism but in an edifying way.Given Barton's connections to Hollywood, I'm always left thinking about documentaries when he leaves.  There's a lot of retarded slowness in getting those S3 cartoons imported.  We're coming up on [another NFL](http://worldgame.blogspot.com/2010/02/more-from-97214.html) that'll just show off how \"left behind\" is the Lower 48, or so I'm anticipating.  The USA is now the basket case of the world, refusing to upgrade, putting future shock off onto everyone else.  That's a theme of Idiocracy and deserves to be played up.Blaming King Obama for not waving his magic wand fast enough might give rise to a Harry Potter for president movement.  Lets watch for tell tale signs of that happening.  Without proper civics training in the schools, USAers fall back on monarchy and the claptrap of the Ivory Tower and its royal societies.  We're back to [courtly models](http://mybizmo.blogspot.com/2006/07/making-waves-in-dc.html), socialites buzzing around a throne. The socialism of the celebrity class, bejeweled and tawdry, is just more Lord of the Flies.I'm no Anglophobe [ala LaRouche](http://mybizmo.blogspot.com/2010/05/surveying-history.html), but then I'm not into [kowtowing to Hogwarts](http://mybizmo.blogspot.com/2009/07/hp-half-blood-prince-movie-review.html) when it comes to ethics, faith and practice.  That's one school among many.  We've got [better witches](http://controlroom.blogspot.com/2009/03/celebrating-wicca.html), and more \"right stuff\" free software, a better meme pool overall.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}