{
  "id": "3224390579990418037",
  "title": "Yakking with Old Timers",
  "published": "2009-08-03T21:30:00.001-07:00",
  "updated": "2009-08-24T01:37:44.390-07:00",
  "content": "I was over in Oregon high desert recently, checking in with some friends.  Some of these [boomers ](http://mybizmo.blogspot.com/2009/07/more-lobbying.html)have lived here a long time by now, given boomers are turning 60 or thereabouts, plus the land was settled [by immigrants](http://controlroom.blogspot.com/2007/12/map-psychology.html) rather recently, mostly [post Lewis & Clark](http://worldgame.blogspot.com/2009/01/columbia-gorge-recent-history.html).In my view there's some paranoia around this 2011 troop withdrawal.  Why isn't that finished already? They went in there really quickly.  Is there some problem with logistics?That was the hope with this last election, plus the Iraqis had one too, same result:  end the occupation now! (that was over a year ago). We were at least hoping to see some real work getting done, to get our economy re-pointed in a positive direction.  Is someone holding out for a higher salary here?2011 is a \"debate year\" in anticipation of 2012, meaning they'll want us to maybe return a different verdict this time, re-fight the same fight, maybe get a different outcome?  They're hedging aren't they?They made 'em vote seven times [in Palau](http://mybizmo.blogspot.com/2009/06/prisoners-for-pelau.html), before they \"got it right\" and said parking nuclear weapons in a tropical paradise was okey-dokey.  State wouldn't accept defiance on this issue, wouldn't take no for an answer, especially from indigenous women (the most bravely opposed).The name of this game is Operation Dilly Dally isn't it?  There's a constipation problem at some level in the Ruling Party (that'd be Democrats yes?).  Someone is being all foot draggy.[Washington DC](http://mybizmo.blogspot.com/2006/07/making-waves-in-dc.html) is still trying to colonize isn't it, force its will down our throats?  Not all Oregonians are equally appreciative.Count me suspicious, and I'm not the only boomer who thinks NPR is too spineless.  Let's debate this now in 2009, move over health care.  Why aren't the troops flooding home, top story?  [Our BS detectors](http://controlroom.blogspot.com/2009/05/spoofing-again.html) are set on high, so please be cogent and succinct.  No lame excuses this time OK?Before leaving Portland I had back to back meetings with Quakers:  Oversight and Quarterly Meeting Planning.  During the former, I ranted about \"bland Protestants\" who suck (how geeks talk sometimes).  Our assistant clerk made some wry quips about that.  He has a background in journalism I think.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}