{
  "id": "3328964464554463187",
  "title": "YouTube Left?",
  "published": "2023-12-13T11:00:00.000-08:00",
  "updated": "2023-12-13T17:19:00.653-08:00",
  "content": "The Left Youtube Pipeline - The Good, The Bad, and The Hot | YUGOPNIK\n\nI found the above video to be useful (apologies if it's gone -- as many are with the passage of time). The Yugopnik guy does a survey of what he calls the Left Youtube, a smattering of channels, including his own, meant to be exemplary of various types of channel within the Leftist brand.What's ironic is the overlay, a whiteboard corporate boardroom style treatment of \"the left\" as a capitalist enterprise, organized to recruit and marshall a demographic for the purpose of selling them merch.We get that picture of a funnel, wide at the top, with those entering getting a graded (sloped) learning curve into the deeper recesses of said rabbit hole.I was glad to get this briefing in part because [I've been exploring \"alt left\"](https://worldgame.blogspot.com/2023/11/alt-left.html) as potentially one of my properties (contested no doubt). This puzzle piece would fit, as it's all about being more \"mainstream left\" (i.e. not alternative) in tracing its roots to Marxism (i.e. flipped German Idealism).Reassuringly, few of these channels, almost none, were familiar to me, except for [an animation channel](https://www.youtube.com/@AamonAnimations). I've started doing my homework. Check the links in the YouTube description, if you'd like to explore that same space.I did find myself wishing for more overlap with channels I follow. Like back in the old days, before it got terminated, I was a pretty frequent visitor to the RT America channel. [Air America](https://en.wikipedia.org/wiki/Air_America_(radio_network)) had broken up, with some of its people going to MSNBC, others to RT. Doesn't RT rate any mention on a YouTube about leftie channels? I guess not, given YouTube quashed it.That's a good question though: have we all somehow come to an agreement that Russia is not left anymore? The DNC party line is Russia backs the GOP, although the latter has done a good job shielding itself from that charge. All that aside: was RT America leftwing or rightwing?I'm going to say leftwing with my definition of left going more through Mark Twain and the Anti-imperialist League, back to Hegel through Walt Whitman (and others), with a noosphere less ensnared within materialism. You can believe in a Zeitgeist without making your whole dialectic be \"capitalism versus communism (and/or socialism)\", as if everyone needs to think like a European. Here in the western hemisphere, we have our own ways of characterising the polarities. The economists are not alone in shaking their shamanic rattles.The Euros combined Marxism with Social Darwinism to contextualize class warfare. By the 1900s, [a faux science of eugenics](https://youtu.be/7Dyyt2kVOEg) had gripped imaginations on both sides of the Atlantic; the battle for who would be on top was translated [into racial terms](https://youtu.be/zm1yDO_nMA4).In GST (anti-economics), we see Global U earth as an anti-entropic beneficiary of solar largess. Seeing the plight of humanity as a World Game problem (with solution-oriented curricula) makes so much more sense than a Planet of the Apes style pitting of one \"race or creed\" against another in a fruitless struggle.  The \"theater of nations\" is on a spectrum between: mutuality and supranational collaboration; and self-destructive mental illness (the Global U is a teaching hospital).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "bizmo_diaries"
}