{
  "id": "851152050152452928",
  "title": "4D Studios on Myspace",
  "published": "2009-12-03T16:30:00.000-08:00",
  "updated": "2013-09-19T00:05:06.621-07:00",
  "content": "If when you go to Myspace.com/4Dstudios, all you see is this...\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjXrkmxK8gHiPsFmClPHdq6GrN9idH6Pov6gxo7tjPBM0MfRXQXUlL2EpsAmv_HI9uDwcOdYWb-Z4p4WFwmZByuPz2z0f807RW6ZYA3YiD9MOhSnuMqkCwd7fBsS0GVXa2rSuVN/s1600-h/myspace9.png)lite view\n\nand not this...\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgUhvvos-vHQROHqe1-wO5Fv7xbiamSlvWn8wwZZR75rUWxSmPx_koh-ul2i65PVHXpWztiGjzug6R2IHcrzziJZiJIMU-TXnAIdTnK-UOHrYrTBq_Qa-z1b60f1C2TlQWm0GoH/s1600-h/myspace8.png)full view\n\n... then look for a Full versus Lite View control on the upper right.  If you don't find that, try a different browser like Chrome to see if there's a difference, and/or dump a Myspace cookie that's keeping your view Lite.\n\nHere are the video clips currently embedded in my profile:\n\nCSN Esoterica by 4D Studios:\n\nAn early pilot developed for Coffee Shops Network, for sharing some geometrical information of special interest to our self schooling clientèle.\n\nDarwin at Home by Gerald de Jong:\n\nThis is a video of animations of Darwin at Home creatures which result from survival of the fittest and random mutation.  Narrative by Gerald de Jong the author of the software behind the project.\n\nLindsey Walker at Angelo's:\n\nCandid outtakes from one of several diverse venues frequented by a rising star from 97214, keeping Portland weird (strong, edgy). Check Friends list for link.\n\nA mathcast by Russell Towle:\n\nRussell Towle (1949 - 2008) was a mathcaster of high caliber, adding magnificently to our shared metaphysical treasure chest.\n\nElectronic Behavior Control System by EBN:\n\nA video from EBN's 1995 album Telecommunication Breakdown.\n\nKirby Addresses Wanderers:\n\nI delivered this talk about design science, Buckminster Fuller etc. sometime soon after the movie Die Another Day was released first run in local Portland malls, years before this posting to Google Archive in 2005 (November).\n\nMathematics by The Nobility (formerly JetPack):\n\nMathematics music video.  From the EP The Art of Building a Moat.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}