{
  "id": "3526735780924193817",
  "title": "A Billion Billionaires",
  "published": "2023-05-03T09:15:00.000-07:00",
  "updated": "2023-05-18T08:54:57.791-07:00",
  "content": "As a child of the 1960s, I grew up focused on advertising as an intersectional discipline:  psychology, public relations, sociology, with the hard sciences supporting from below.  \n\nThe psychology part was especially interesting, and we felt MAD Magazine was on our side, helping to forewarn us of the life of others seeking to manipulate us, that was in store.\n\nThe gospel of abundance and prosperity often seems a self parody, as it touts billionaire levels of wealth for all.  However, under the hyperbole, you find the obvious truths, regarding people \"living like kings\". \n\nThe kings of old never had iPhones or streaming, could only dream of such capabilities.  That's where our being billionaires stems from, along with not having to sit on some throne all day, listening to petitions and grievances.\n\nJust walking through a contemporary airport, say in China, going from train to plane or vice versa, is more than the greatest queen of old could have experienced, and here we're just everyday individuals, not special, not singled out, yet satisfied with the infrastructural solutions to our travel needs.  \n\nWe thank the engineers and regional planners, who took the time to scope it out, and to the construction specialists who made it happen, and to the willing guinea pigs (the early adopters, the test pilots) who checked it out and provided valuable feedback.\n\nWe've reached a kind of limit on Ghetto Planet in that average living conditions have to keep improving for us to know that we're making some headway with all our tools.  We need honest benchmarks to keep us honest, which is another way of saying \"in touch with reality\" which has its rules.  \n\nIt's one thing to rail against government for being way too strict, which it often is.  It's another to rail against Mother Nature and her exceptionless principles, whatever these might be, not saying I'm the know-it-all.\n\nBillionaires of the future, ahead of us in living standards, will enjoy a more congenial ambient backdrop.  It's not that we'll all live in luxury accommodations all of the time.  But then who would want to do that?  \n\nBeing out in the mud, digging trenches, laying pipe, is not a bad way to build muscles and hand-eye coordination.  This could be First Person Physics for a university program.  \n\nThe downer is when you're made to work as somebody's slave instead of on your own behalf along a work-study track (a tour of duty) of your own devising.  Others benefit, either way, but so do you when you're on board with your training.\n\nA theme park has the rides that it has, although there's turnover.  Oaks Park has its newest roller coaster.  However you, the theme park goer, are not required to ride them all, nor any, in any special order.  That's all up to you.  This is the mix of fatalistic (stoic) versus freedom-loving we wish to achieve.  \n\nWe can't do anything about what we can do nothing about, yet there's a remainder we might mess with to our heart's content.  Let that be towards our contentment.  \n\nBillionaire talk, and money talk in general, is a disguise over that sense of lasting security one might feel for one's self and one's loved ones, the lastingness of which is ever finite (mortal) in any matrix.  We feel impelled by deltas to keep working it, exercising those freedoms.  \n\nThat picture some have, of having enough to sit back and coast, is not all that realistic, given the sense of mortality every billionaire likewise feels.\n\nOne of my points though, is that Bucky Fuller was not lying (not being misleading) in some super naive way, when he talked about our living standards being higher than those of the kings and queens of yesteryear, not only physically but, potentially, psychologically.  \n\nWe're freer to distribute the psychological burdens of self governance more equally, and that's actually a favor to royalty in a lot of ways.  Leaving the job to just a few chosen celebs was actually more a source of their potential misery than many would know.  Being the scapegoat of the masses is no fun, even if they fatten and pamper you before the sacrifice.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}