{
  "id": "5732873720183332563",
  "title": "A-Bomb Day",
  "published": "2013-08-06T19:23:00.003-07:00",
  "updated": "2014-03-22T22:01:06.931-07:00",
  "content": "Disarm Day, 2013\n\nAugust 6 is more formally known as Disarmament Day, at least around here.\n\nI'm tethered through my Android, posting directly from the event, having wandered around taking photographs.  I've been doing this every year for awhile now.  Carol (mom) was one of the originators of this event in the 1960s, following her visit to Hiroshima about fifty years ago.\n\nA PSR man (Physicians for Social Responsibility) is speaking about the currently operational reactor, a Fukushima type (GE boiler), following a speech by Kayla Godowa-Tufti, a treaty rights activist.  This year we're finding out more about the Hanford Nuclear Reservation, its role in the Manhattan Project.  The plutonium for the first A-Bomb at [Alamogordo](http://en.wikipedia.org/wiki/Holloman_Air_Force_Base), as well as for the bomb dropped over the City of Nagasaki, were processed there.\n\nBig wheels turn slowly.  [Dr. Dyson's conclusion](http://mybizmo.blogspot.com/2009/12/freeman-dyson-in-portland.html) that the Japanese military was already in surrender-mode prior to the atomic bombings, seems highly credible to me.  The hoarding of nukes has become the hallmark of a form of psychological retardation known as \"the military-industrial complex\".\n\nNation-states, if ranked relative to average humans, have a negative IQ (below zero).  They consistently do really stupid stuff.  The UN is like a marathon [Beavis and Butthead episode](http://mybizmo.blogspot.com/2013/07/of-mind-and-body.html), with \"superpowers\" among the most doofy.\n\nNations with huge numbers of nukes are off-the-scale aberrational.  This is hardly news to anyone, and is one reason DC is known (semi-affectionately) as the Moron Capital.  The term \"moron\" stems from the pseudo-science of Eugenics and is used mockingly (sarcastically, satirically).\n\nSpeaking of which, the CEO of Amazon purchased the Washington Post just recently.  That's the headline for today. \n\n[Arthur Dye](http://worldgame.blogspot.com/2009/11/local-activism.html) is here.  I should untether and go look for him before we disperse.  There's a follow-up event at a nearby museum.  I see quite a few other people I know here too.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}