{
  "id": "3491747844430971920",
  "title": "A Breakdown in Self Discipline",
  "published": "2015-10-07T16:27:00.002-07:00",
  "updated": "2015-10-16T00:51:05.234-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/22027468855/in/dateposted-public/)\n\nCarol and I drove to Tom's this morning, which isn't far.  Walking is good for her, but today it was raining and this time three years ago she came down with pneumonia, after insisting on giving a speech on a [bright October 2012 day](http://worldgame.blogspot.com/2012/10/mixing-it-up.html) in the park.  She had to be hospitalized and was on oxygen for months after that.  So we take care and not push it.  This year she went to Des Moines.\n\nAnyway, at Tom's, an eatery, we had our breakfasts.  Per usual, I wolfed mine, being part wolf, at least in spirit (but also in eating behavior), so had time to spare.  Rather thank yak away, letting hers get cold, I went out for a Willamette Week, new on Wednesdays.\n\nThe cover article was really interesting.  Portland knows it's \"too white\" in some dimensions but is still trying to figure out in what way.  Lots of feedback circuits have been set up, and I think it's sinking in day by day, but to accelerate the process, PPS ([Portland Public Schools](https://mail.python.org/pipermail/portland/2015-October/001728.html)) has put its shoulder to the wheel and tried to get some real Diversity going.  Some active recruiting has occurred.\n\nThe article is a first person account by one of the main guinea pigs in this experiment, Erica Jones, from Georgia.  Although the experiment may sound like a failure the way she tells it, I think it tells of a talented and brave person making a difference and filing her report.  Mission accomplished.  PPS and WW readers learn a lot, the whole point from the start (to learn).  The protagonist gets to retire to an easier lifestyle free from PPS pathologies (they'd made her sick), so a happy ending.\n\nI recall on a jumbo jet, international in flavor, wherein we were all taking our seats, preparing for take-off.  Then some loud-mouth all-American white kid came on board, running his mouth incessantly in some fantasy world about terrorists and bombs, complete with sound effects -- unpleasant chatter to say the least.\n\nWhat was most amazing though, was his parents seemed to see no reason to have erased this behavior before bringing him on an international flight, subjecting fellow travelers to nerve-grating spew.  It's not like this was an infant.  And that in a nutshell is what astounded this teacher:  the schools had no effective means of working with a lack of discipline and disrespect (there's a difference between \"respect\" and \"obsequious\" which any English teacher might go into).\n\nBut then to speak up on behalf of the kids, I'd say the school they're placed in really is more like a penitentiary in that the brainwashing forced through those text books is really quite obsolete and not matched to the needs of current generations.\n\nThe curriculum is way behind and kids have that intuitive resentment that stems from feeling warehoused, like refugees anxious to get somewhere better, to some Promised Land, and feeling delayed by fences and border guards.\n\nThe teachers take on the sheen of prison guards.  But that's hard to articulate when you're a kid and when kids before you all went to school and a lot of 'em thought the same thing.  Only [juvenile delinquents](http://mybizmo.blogspot.com/2008/05/cry-baby-movie-review.html) hate school right?\n\nHowever, we can give objective shape to their deprivation.\n\nDo they teach you to cook (yes in some cases)?  Including for big numbers?  What history do you get and what civics?  How many voting machines does your school have and how often do they get used?  Do you ever get away [from light pollution](http://controlroom.blogspot.com/2008/08/escaping-light-pollution.html)?\n\nI'm not saying I know the outcome in all cases.  How about tetra-volumes, do your math books cover that?  They do?  Excellent.  I bet in some private Quaker schools they're already introducing at least a sidebar [on Quadray Coordinates](http://worldgame.blogspot.com/2015/09/compare-and-contrast.html), designed to keep those philosophical debates alive (to be revisited in later years). \n\nI've recently connected with another \"hacktavist\" youth group willing to take on more parallel / alternative schooling.  That's not a new pattern I realize.  Black Panthers did the same.\n\nWhen some mainstream system or curriculum breaks down, others grow up around it, sometimes to become mainstream themselves.  This has happened often in history.  It's not necessarily a crisis, or calamity, not an apocalypse (except maybe in some technical religious sense with positive connotations -- check with your local religious authorities).\n\nWhen change needs to happen, it tends to happen in some way, even if not the ways planned, and change often needs to happen.  Rule of thumb:  improving one's powers of anticipation and responsiveness is usually a likely possibility compared to the relative likelihood of stopping change cold in its tracks.\n\nWith all our new abilities [to flip classrooms](http://mybizmo.blogspot.com/2015/09/flipped-classroom.html) and provide professional development, more teachers could be like me, not responsible for a student's everyday behavior, which I don't monitor.  The teachers and students are not in the same room.\n\nStudying for real also means time alone, as in a study carrel, not just in collaboration.  That's what you learn in college if not before.  Packed into rows and columns, in a classroom, with all present supposed to be connecting the same dots at the same time... why force that?  Why is such enforced regimentation even a selling point?\n\nHaving [a safe personal workspace](http://worldgame.blogspot.com/2015/07/pws-personal-workspace.html) is what's paramount, if learning is really the priority.  If warehousing is the priority, why not just say so and drop the pretense?\n\nJust having a locker is not sufficient.  When does this student just get to sit and read, undisturbed, or just meditate, free of distraction?  Do motion studies [like in Elephant](http://worldgame.blogspot.com/2008/05/elephant-movie-review.html) (cameras follow each student).  Develop stats.\n\nHomework is great in theory, if you really have a home that fosters study.  Many homes do not.  Losing all interest in reading is a sign of serious brain rot.  Measure \"time reading\" as seriously as you measure \"calories eaten\" at least (over eating is more of a real danger, though over reading at the cost of degrading physical health is also a real condition).\n\nThe word \"gymnasium\" is right:  reading and reflecting are a form of working out.  Keeping fit is not just about swimming laps.  Watching TV is informative.  This is not an anti-TV rant.  However making TV (video / audio) is even more informative.  Does your school help you learn to do that?\n\nAs when writing or jamming, you may be lifting from other sources, making links.  Sharing camera shots, including segments, is not a crime when the licensing is deliberately liberal.  Citing sources is much appreciated and lends credibility but in some forms of journalism, sources get concealed, for their protection.\n\nDoes your school cover these basics then?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}