{
  "id": "4283132192301877744",
  "title": "A Domestic Future",
  "published": "2011-10-22T10:43:00.000-07:00",
  "updated": "2011-10-23T20:40:35.601-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/6239000596/)Not lost on many people is the [homey domey](http://mybizmo.blogspot.com/2009/01/about-habitats.html) flavor of [Rainbow Gathering tech](http://controlroom.blogspot.com/2011/04/earthy-day.html), with lots of web-like fiber stretched overhead to provide a kind of [utility network](http://controlroom.blogspot.com/2008/12/global-grid-info.html).  One could imagine optical fiber stretching to the Camp X theater (unit J, 34\" LCD dome), where we're showing some [serious movies](http://mybizmo.blogspot.com/2011/10/opdx-pdv.html) (a kind of officers' club).The bases I've studied have had their R&R side, especially the one near Baguio which I understand is closed.  [Jim Flory](http://worldgame.blogspot.com/2010/02/back-at-dukes.html) would've been born nearby, in some prison camp, son of missionary parents.  We were a technology family in the Philippines, exporting urban and regional planning from some of the best schools, plus with service in Portland on the resume, manifestly one of the better planned towns, Tripoli too.[The OPDX campus](http://groups.yahoo.com/group/synergeo/message/66629) may have hit a glass ceiling in terms of what the PNW has to provide.  No [dialysis unit](http://worldgame.blogspot.com/2009/11/onami-tour.html) in the Medic Tent for example.  These people are in pretty good physical shape on average.  The [refugee camps](http://controlroom.blogspot.com/2008/10/on-tap.html) we're looking at have [more heavy duty requirements](http://controlroom.blogspot.com/2011/02/wanderers-201121.html), but that's precisely why implementing rotation, starting with media personnel doing coverage, makes some sense.  Maybe [Lara Logan](http://mathforum.org/kb/message.jspa?messageID=7579008&tstart=0) will come down, and treat this as an occupation by some aliens (the thinking seems \"not from around here\" some days -- [maybe that's the Python](http://mathforum.org/kb/message.jspa?messageID=7591318&tstart=0)).Patrick and I were brainstorming at Angelo's, and realized having interviewers encounter more embedded professors and retired military brass might be a good thing.  [CDI](http://cdi.org/) should have a tent, and project Dr. Strangelove.  Given my footprint in FNB, I've already leveraged [an AFSC presence](http://www.flickr.com/photos/17157315@N00/6267497960/in/set-72157627710609369).We should get [Glenn Baker](http://worldgame.blogspot.com/2010/09/arabs-gone-wild.html) out here on a documentary, get some overview on Occupations more generally (including the one in Iraq, supposedly ending if not turning more Rainbow).I'm sure we have vets in some tents already, judging from the signs.  [Smedley Butler](http://worldgame.blogspot.com/2011/10/esozone-talk.html) would likely join us (I say \"us\" without [needing to bunk there](http://controlroom.blogspot.com/2007/09/barcamp-alpha.html) -- I've got my delegates getting fed, and so stick to my beat, including Colonel Summers park when I'm able).[](http://www.flickr.com/photos/17157315@N00/6268094351/):: at work, oct 21, colonel summers park ::We had this classic scene at Angelo's, where like this guy and his more restrained buddy accosted me, loudly but not in too ugly a manner, over something to do with drink (a topic in bars).  Was this the beginning of some altercation?  He had a Food Not Bombs T-shirt on. I had the FNB trailer right outside, as my next stop was the OPDX campus (its new home).  What a coincidence.  He was proud of that heritage, a kind of Hell's Angels for him maybe?  We parted friends.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}