{
  "id": "1214111726796819747",
  "title": "A Haunting / A Planting",
  "published": "2013-09-14T09:17:00.004-07:00",
  "updated": "2023-09-06T12:10:34.688-07:00",
  "content": "[](https://www.flickr.com/photos/17157315@N00/7292261272/)\n\n I've been continuing Occupy Portland (OPDX) in a metaphysical way, by occupying Washington High School much the way Joyce occupied Dublin, with his imagination, in Finnegans Wake.  The goals were educational and in reality a movie and band celebrating our hero Buckminster Fuller did get staged in these digs, much to my delight. \n\nOPDX had a headquarters, an abandoned, boarded up building, where Linus Pauling had gone to school, or so I'm told.  He was living on Hawthorne at the time, with his mom.  This was before his brilliant career at OSU, then Caltech.  Which is where Doug Strain got to know him.\n\nHowever, as a visiting neighbor from Richmond (I didn't sign the clip board which went around the inner table), I learned Craig Kelly is completing his plans to buy it from the District and is moving ahead with commercial development. \n\nSt. Francis has sold its stake in the park for condos.  Portland is continuing with infill, the purpose of having an urban growth boundary, like a belt.  Suck it in, suck it in.  A lot of single story buildings are being replaced with three and four story, adding density.  The big controversy is should they provide their own parking.  The architects have already decided that the future Portlander is able to afford not owning a car, a luxury, as you can still rent them or share them, with such blueprints as Car 2 Go's.\n\nSo the \"haunted castle\" Halloween look of our HQS is soon to get a face lift.  You can imagine the bats leaving.  Kind of a Night on Bald Mountain sequence (allusion to Fantasia).  However, this is not a giving up so much as a seed planted.  The resulting work / shops will show our influence.  OPDX broke some new ground in the annals of education.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}