{
  "id": "4259331501295405749",
  "title": "A Heady Xmas",
  "published": "2012-12-28T13:35:00.001-08:00",
  "updated": "2021-02-12T12:55:58.553-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157632365584321)\n\nScholarship has been in overdrive around here.  I mentioned to Carol about the Business Plot, of which she had not heard, and that sent her careening through the record for several hours, looking for actual names.  She found a 1999 account that seemed more complete.  That was the failed coup attempt against FDR, never really out of the planning stage.  She'd been reading about FDR thanks to some Bob Smith library books we got through the meeting.  Seeing the film with Bill Murry playing FDR was a logical consequence (Hyde Park on Hudson).\n\nWe (Carol and I) also went to The Hobbit in IMAX 3D.  I wasn't sure she'd have that option in Whittier, where she's soon to return, and she needs to see it again anyway, for dialog, as the hearing aid makes a difference.  That, and my subsequent reading about \"the making of\" led me to post about [Middle Earth Physics](http://tech.groups.yahoo.com/group/synergeo/message/70825) on Synergeo.  This in complement to my enjoying yakking with physics teachers.  There's been some bleed-across vis-a-vis math-teach, in terms of membership and topic, but that's all to the good I'm supposing.\n\nFriend Robert has been nudging us to research more about Quaker attitudes towards the Yule time celebrations, originally perceived as unwelcome and alien among those outside the Latin sphere.  He quoted a diary of a Swedish tourist in Philly, 1749.  Yep, \"Romanish\" holidays were considered worthy of concerted inattention, in narrative deliberately contradicting the dominant culture's, another counter-cultural tradition.  Strong eddies around Xmas remain even today.\n\nFor my part, I continued with the Quaker animism theme, allowing Sarah-the-dog to run freely about the social hall (not the first dog in that building), while Tara and I helped Food Not Bombs with the Tuesday serving (Xmas Day, December 25).  SkyBlue-the-trailer got hauled in as well.\n\nWe celebrated Mike Hagmeir's birthday, \"we\" being Heather, myself, Mr. Ryan and Michael.  That was my first time to try Pacific Pies and then Bushwhackers, which specializes in ciders.  I stayed late at the latter to read more Unbearable Truths, a Quaker pamphlet on my reading list.  The topic of Quakers and slavery remains a focus, along with some queries: \n\n- how do holders of nuclear weapons enslave humanity? and \n- how is slavery still practiced? \n\nRegarding (1), the burden of cleanup and safekeeping marks a lower bound for the headaches i.e. were it only so that leaking radio-toxins were our only worry.  Regarding (2): in many ways, but enslaving future generations to clean up past messes counts as imposing a kind of involuntary servitude.\n\nMuch other family business has been going on but it was never my intention to document every coming and going.  My thanks to Lucy's family for hosting Tara on Xmas Eve (our night for The Hobbit, first of three).\n\nLindsey's kraut-making projects are worthy of coverage in National Geographic.  Carol is off with Barbara today on some WILPF adventure.  Wanderers have remained active.  I need to get that third bid on fixing the office back to HQS.  Shortly, I'll need to return to queue-slaying (I'm enjoying a short vacation at this time).\n\nMom thought Murray's FDR was too much the dirty old man and seemed to side with reviewers who insisted Daisey and Franklin had a more Victorian relationship.  I'm not about to weigh in as my memories of the political / public sphere begin with the memorial service for JFK on the Ryan family's television. \n\nThose who actually experienced FDR (including over the radio) have their memories and hallucinations (waking dreams, imaginings).  We reserve \"hallucination\" for mistaking the unreal for the real, but  then ordinary daydreaming is full of made up projections.  Mom just realized she'd been picturing the Whittier Starbucks whenever I announced I was returning a bag to the one on Hawthorne (for a free 12 oz coffee).\n\nWe should admit that \"reality\" has a strong hallucinatory component of necessity, as we're forced to speculate in the absence of omniscience.  The [J. Edgar movie](http://worldgame.blogspot.com/2011/11/j-edgar-movie-review.html) had that as a theme.  He might have been involved in the Business Plot in some way.\n\nAt the cider place I used my Android to Google up images of Santa Claus owing to Coca-Cola's PR.  That company did a lot to anchor Christmas in the sugar-filled world of North America.  Sweets in winter make some sense when you're not just sitting around watching Netflix.  From my email to Robert and Friends:\n\nPS:  I am personally not righteously bitter or angry about Xmas\ncelebrations and/or its commercialization, and as a former denizen of\nRome have a lot of appreciation for its imperial ways, which are not\nunlike those of today's liberals, eager to include everyone in one big\nhappy family (pax Romana and pax Americana aren't wholly unrelated\nconcepts).\n[http://www.democraticunderground.com/articles/03/06/06_pax.html](http://www.democraticunderground.com/articles/03/06/06_pax.html)\n(cited for the picture more than the text).  I don't give Catholics\nall the credit though.  Our modern Santa has everything to do with\nCoca-Cola company PR (ongoing, in theaters today).  This year we\nmostly did Hanukkah with friends (when presents happened), foregoing\nthe tree and presents on Dec 25.  I do like the manger scene because\nit celebrates non-humans (animals) in this space of innocence.  My\nritual around that was to let our dog freely roam around the lower\nfloor of the Quaker meetinghouse on Xmas, as Tara and I helped Food\nNot Bombs prepare for an Xmas day serving downtown.  Sarah is clean\nand has no fleas, thanks to vet visits.  I'm a \"Quaker animist\" in\nthat sense (I harbor a religious appreciation for nonhumans, including\nany ETs).\n[http://www.flickr.com/photos/kirbyurner/8310787551/in/photostream/](http://www.flickr.com/photos/kirbyurner/8310787551/in/photostream/)\n\nOf course having Tara around is a chief joy of the season, Carol as well as she wouldn't usually be here this late into winter, right through to the next year.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}