{
  "id": "2200607929323696864",
  "title": "A Keynote",
  "published": "2012-11-25T00:25:00.002-08:00",
  "updated": "2012-11-27T10:38:49.500-08:00",
  "content": "I didn't get to attend this event, in Germany.  Lag times might be too great, vis-a-vis my work responsibilities.  Family responsibilities.  More travel would be good though.  There's a Lufthansa right from PDX, or was.  Suzanne got to go.\n\nWhen he got back though, to HQS, he was eager to share [his keynote](http://holdenweb.blogspot.com/2012/11/building-new-communities.html), already transcribed to Youtube.  Synchronofile was at the showing as well.  This was Steve's first night back.  Cigars at Greater Trumps / McMenamins were to follow.\n\nI'm somewhat pleased that \"social media\" has met up with \"networking software\" such that \"social engineers\" are now an obvious reality, and yet the capitalists can't complain, because these engineers work for businesses that trade in the stock markets.  What's more capitalist than Facebook?  So the old oppositional categories, old polarities, break down (lose their charge) as the dialectic marches on. \"New synthesis ho!\" -- a new world sighted, or world order or whatever.\n\nMore gradations, more of a spectrum, that's often what you need, when reforming an institution.  Up the frequency, make more tracks, add more options.  There's another reformist tendency that wants to starve, which quickly translates into \"punish\" and all the justifications that go with.  Suddenly you're surrounded by undeserving criminals.  The multiplier reformist is just as Darwinian, one could argue, as nature often counters dire straits with multifarious malarkey.\n\nTake nationalism for example.  Say you're not a nationalist, in the sense of thinking the nation state system is the bee's knees.  Look how many it left out, how many nationless, and how many stuffed into nations of poor design, sham nations, created just to be tidy on the maps, not leave space unaccounted for.  One could try to wipe the world clean of these monsters, these decrepit clawing things, or one could flood the world with new nationettes, tiny nations, [virtual nations](http://mybizmo.blogspot.com/2011/01/states-in-flux.html), naughty nations, clown nations, whatever.\n\nA given company is like a network, like a nation. It has culture, lore, lineage.  Blurring nations and companies is interesting.  Might a company be democratic?  Quakers have a fun time fitting into business law as non-profit institutions.  Their domestic partnerships might flip to business law also.  A company with a democratic constitution might provide a process for self government.  Python Nation, the PSF.  Nation?  We have a dictator, a chairman... or a company?  Or neither?  Or both?  [Nagarjuna](http://www.britannica.com/EBchecked/topic/401601/Nagarjuna) where are you.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}