{
  "id": "5576589997527627634",
  "title": "A Limiting Ball",
  "published": "2006-12-30T20:52:00.000-08:00",
  "updated": "2008-11-15T02:36:57.149-08:00",
  "content": "[](http://photos1.blogger.com/blogger/1134/545/1600/timessquareball.jpg):: Times Square [New Years ball](http://www.cbsnews.com/stories/2006/12/31/national/main2318298.shtml)[ ](http://www.cbsnews.com/stories/2006/12/31/national/main2318298.shtml)::\nI was mentioning to David Feinstein yesterday about misplacing my new global matrix jacket, a gift from Glenn, and then launched into a short monolog re the hexapent, over some excellent Thai food, on SW 2nd near Burnside in downtown Portland (Donzo was there too).Mathcast: as the number of triangles defining the 12 pentagons, the rest hexagons, of the hexapent tiling, increases indefinitely, the positive epsilon difference twixt the degrees around each vertex (a local apex), and 360 degrees (perfect flatness), gets ever smaller. And yet these small differences, whatever they may be, add up as \"taxes\" to a constant 720 degree \"budget\" no matter how many or how few.René Descartes knew about the 720 degrees. Bucky's contribution, I passed on to David, was more in terms of a cartoon: he made that 720 be a tetrahedron. In flying away from a flat surface, it subtracts exactly the right number of degrees for a convexity to form in its wake, say another tetrahedron, perhaps the first one's mirror image.Tara, Brenna and I had lunch in the Providence cafeteria, Dawn joining us later for tea.Before that, I had a heart to heart with Nirel over the phone, about her coffee shop scenario. Turns out we've had a lot of the same ideas, including around synergizing with television. Nirel'd be like that Greenwich Village character, the skilled behind the scenes match maker who introduced Bucky Fuller to Isamu Noguchi, changing the course of history thereby, and for the better.Tonight we'll be sharing our New Mexico slides (projected off the Toshiba, through the Optoma) with Chuck and Mary Bolton, friends of our family since before I was born. We may swing by Rose's place on the way, so Tara might pick up some homework papers for Winterhaven she's missing. \n[ ](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh9CGGAYbv0zvyGjk_F1YYVjWPUDYTcNtw8DWBlcE6fK06WV42DwVZ-2pdTtAiH89Yn0FbE-Kmm2pSEcfsdOj3juje3KUhZszg3kCeYI9vttOSxEWXTz8I8knwZeF4VJzpHzzJF/s1600-h/boltons.jpg):: Mary and Charles Bolton, Tara, Dawn ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}