{
  "id": "3005231632582978233",
  "title": "A Natural Disaster",
  "published": "2012-09-08T02:36:00.004-07:00",
  "updated": "2012-09-09T08:32:46.427-07:00",
  "content": "I enjoyed yakking with David Koski the whole way from PDX concourse to Max, to 75, to my neighborhood.  We're used to talking about rhombic triacontahedra and stuff, probably to the amusement of some fellow Max travelers.  We talked about namespaces and how Coxeter.Q and Koski.Q needn't be the same object, as any Python programmer could tell you.\n\nAlas, my levity balloon, say T modules (pointy wedges, 120 of them tiling a sphere-like shape of 30 faces), was just on the cusp of a high Entropy state, and E modules (E for Entropy, though in Synergetics for Einstein) were in the wings.  Hard drive crash!  The HP Pavilion's.  I thought it might be mainly software corruption but a BIOS test indicates it's a hardware issue, Failure, can't read, status 7 (whatever that means).  [KTU3](http://worldgame.blogspot.com/2007/01/ktu3.html) is no more, for all intents and purposes.\n\nYes, I backed up a lot of pictures, but using Adobe Elements, and will I ever find that again to restore?  Evacuating the household, moving 90% of the stuff to the school (what school?), would help us prep this place for an overdue remodel / overhaul.  The neighborhood deserves to see its properties maintained.  So where'd I get the fat salary all of a sudden?  There's those \"inquiring minds\" again.  However I think these fantasies are mostly just an attempt to escape the loss.\n\nWhat does occur to me though is some cults (we could call them) might specialize in a kind of transparency, in that students and faculty would be expected to scan in, otherwise upload, all kinds of personal data, such that on-line identities (real ones) became a basis for weaving stories, incorporating a gradually increasing radius, to make the scope of world history feel inclusive.\n\nBy comparing notes, life stories, researching backgrounds, genealogical records etc., we could piece together a customized view of the past / present, hinging greatly upon just exactly who showed up to attend.  One could call this \"place based education\" and some do, though I may be taking it further, making it more like another kind of \"reality TV\" in some cases.\n\nAll this dovetails with [the \"school server / school spirit\" meme](http://controlroom.blogspot.com/2009/04/school-spirit.html) (every schools needs a rack space for filing recordings and contributions), which in turn is close to what seniors might like for themselves.  Engineers don't want to \"retire\", they want to putter on their own projects for a change, and preferably in an environment that encourages and rewards both innovation and collaboration.\n\nStudents will be encouraged to bring show and tell stuff and share their lives.  They may choose to donate much of that stuff as rummage after awhile, but unlike the \"classic cult\" the stress is not on leaving one's previous life behind, but on using it as a springboard for getting to know the world in a new way, in cahoots with peers.  It's like a detective story, where you keep yourself in the plot, are not the \"know it all\" observer with magical powers to narrate omnisciently (usually an inauthentic voice, used by historians a lot, and spoofed in Idiocracy).\n\nGetting serious rack space with RAID and Hadoop-like failover etc. makes more sense when you're not just a solo individual trying to \"do it all\".  The idea of a \"nursing home\" needs to be replaced for engineers, with something more kibbutzy, and which includes rack space (not meant in the Spanish Inquisition sense, talking about shared storage).  People who always put off organizing their memories until old age will get to mix with younger folk doing the same thing (organizing their memories, putting in order the facts of experience).  A school's organizational memory need not be entirely public, but on the other hand a school is by definition that which draws on shared experience to produce original value-adding programming (i.e. curriculum, intelligence).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}