{
  "id": "4784021315265951848",
  "title": "A Next Project",
  "published": "2016-11-08T10:35:00.002-08:00",
  "updated": "2016-11-08T12:02:42.705-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/30828042076/in/dateposted-public/)\n\nA next medium project I need to take up, but I'm not sure in what medium (so many media to choose from) will be directed towards Philosophy Space (also known as \"Philosophy World\").\n\nLudwig Wittgenstein's Remarks on the Foundations of Mathematics (RFM) are annoying to many practicing mathematicians, because the tenor of his remarks do not reflect how they tend look at \"foundations\". Ludwig seems to turn them to slurry in some cases, undermining their eternal validity.\n\nSimilar annoyance is expressed towards another rank outsider [businessman industrialist](http://worldgame.blogspot.com/2010/10/necessary-ruin-movie-review.html) of the 20th Century, the guy who helped bring us the DEW line (see Cold War relics).  He purported to have a [novel way of modeling multiplication](http://mybizmo.blogspot.com/2015/09/manga-on-mul.html) in higher dimensions (like > 0).  What does that even mean?\n\nThose who've familiarized themselves with LW's writings (sorry, I'm fine with initials, no hagiography need apply), come to see he's got some good points, worth sharing.  These days I'm coming to learn how much he mined the William James corpus for good examples of a philosopher really doing some thinking.\n\nLikewise, the \"Bucky stuff\" is not just fluff, as the tetrahedron is indeed a topological simplex, so trying it on for size as a volume unit is hardly a radical idea in the rear view mirror.  What's radical is a vista wherein so few have thought to try said experiment, but then who's had the time or the inclination?  Now we've got it, and can kick it around.\n\nPiling on these two annoyances, Wittgenstein's remarks and Fuller's fork in geometry, come the makers of \"caltrop math\" (non-violent despite associations twixt caltrops and [acts of war](https://en.wikipedia.org/wiki/Caltrop)).  The XYZ coordinate system has a new buddy, not saying I know the gender (of either really).  The IVM made by Bucky easily accommodates said \"quadray coordinates\" (pioneered after Synergetics was published).\n\nStay tuned as to medium.  In just getting this outline out there, I'm hoping to spark some more interest in the background materials.  Check Wikipedia and like that.\n\nThink of it this way:  what would it be like to inject Quadray coordinates into Wittgenstein's remarks? The Bucky stuff is certainly like a Renaissance Neoplatonism.  These are science fiction moves, contrary to historical fact, designed to kindle new fires in some imaginations.  Not everyone is into philosophy obviously.  A positive outcome I would expect is a growing familiarity with some innovative ideas with practical applications.\n\n[](https://www.flickr.com/photos/kirbyurner/30228955553/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}