{
  "id": "3671758937248343293",
  "title": "A Night with a Pro",
  "published": "2012-10-04T21:59:00.002-07:00",
  "updated": "2020-03-26T14:11:04.844-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157631695870388)\n\nWe enjoyed an excellent presentation at Multnomah Meeting this evening, by a pro photographer, Skip Schiel, who works with Quakers and the AFSC.  He's up on some of the latest non-violent campaigns to restore a modicum of sanity into the Hellish Land (aka Holy Land, aka Israel-Palestine-Gaza).\n\nInterestingly, these latest campaigns focus on the Grunch (Caterpillar, HP... [Motorola](http://worldgame.blogspot.com/2010/01/activism-portlandia-style.html)) and less on aging institutions like the State Department or United Nations.  I could hear Bucky echoing in my ears:  \"the once proud nations\".  Yes, soldiers still put themselves in harm's way, but as Smedley \"Fighting Quaker\" Butler put it:  war is a racket.\n\nLots of maps, good profiles, updated information.  I felt like I was [back in Samsara](http://controlroom.blogspot.com/2012/09/samsara-movie-review.html) in some ways, enjoying the beautiful landscapes, some impressive engineering.  That train looks cool.  It felt good to update the brain bank with more recent images.  I hadn't visited [in Ramallah](http://mybizmo.blogspot.com/2009/07/lailas-birthday-movie-review.html) since the 1970s.\n\nInterestingly, Jeanne at [our lunch today](http://worldgame.blogspot.com/2012/10/sanity-check.html) asked directly if I were Swiss.  She married a Swiss guy and so knows the lore of the place, understood about Uri.  I don't encounter people familiar with [that namespace](http://worldgame.blogspot.com/2005/12/whats-urner.html) all that often.\n\nI asked Skip later if he knew about Albert Einstein's views ([thinking of OMSI](http://worldgame.blogspot.com/2010/07/einstein-omsi.html), but also this bio I have).  My understanding is he thought nationalism was for the birds but didn't think those birds would be relinquishing control any time soon, certainly not in his lifetime.  He turned down a chance to role play a president.\n\nThe bird-brained reflexes associated with knee-jerk nationalism go back to knee-jerks of even deeper reptilian origin.  Religion ties in through the limbic system (or one of those) and voila:  crazy humanity. Self-organizing?  We wish.\n\nI'm sympathetic to Rabbi Lerner's idea of a \"[no state solution](http://worldgame.blogspot.com/2012/01/scholar-talks.html)\".  Once two cars have a head on collision, or two trains, you don't always try to sort them out too carefully.  There was a train wreck of sorts, and whatever others want to say about it, I think nationalism itself became a self parody in this smash up, its own casualty.  \n\n\"Nations\" were mostly in the belief systems of \"little people\" anyway, right up there with Santa Claus in the Tooth Fairy.  The European royals saw more in terms of marriages (family) and warring ideologies (Catholic vs. Protestant etc.)  Do a little homework, and the nations fade in with the other psychological complexes, more programming, the operating system.  It keeps morphing.  The Chinese parade dragon, twisty turny, is its sometime avatar.\n\nNo, I'm not expecting the pomp and circumstance of nations to disappear, not even over the long haul.  Could be we'll see [many more of them](http://mybizmo.blogspot.com/2010/01/cyber-nations.html), including under the oceans.  We still have shades of the Roman Empire to this day, so why should we expect anything so neat and obvious as a Fuller Projection, intelligently nationless, except in the occasional meeting, board or classroom.  History isn't like that.\n\nPeople live in the past (the after image).  We don't all get the news at the same time, although global telecommunications is time crunching us more than usual, getting us in some \"present\".\n\nIn 2045 or sooner, someone with the requisite academic \"weightiness\" may argue the USA had effectively left the world stage by the 1980s, some \"withering of the states\" phenomenon (all of them) amidst a new world order (predicted by presidents, not just Lenin or Marx, the Promised Land of the Illuminati?).\n\nIt'd be one more Youtube, perhaps cogently argued.  As science fiction, it makes sense today.\n\nTrillions of dollars of annual deficits?  A desk-bound military helpless to not buy [tanks](http://mathforum.org/kb/message.jspa?messageID=7886625) it doesn't need?  Where is there a \"USA\" in this picture except in cartoon form?   Does anyone really believe all this crappola?   You can fool some of the people all of the time eh?\n\nWe've seen a lot of movies and know how to suspend disbelief.   Nations live on in our suspended disbelief.\n\nTheir withering didn't stop us from having some interesting theater though.\n\nWe've inherited from history (duh).  To some degree, we're puppets, machine-dolls -- that's what karma is all about, and Samsara ([the movie](http://controlroom.blogspot.com/2012/09/samsara-movie-review.html)).\n\nWhether we believe in these nations or not, we're compelled to go through the motions, acting them out somewhat unconvincingly.  [As NPR put it](http://worldgame.blogspot.com/2012/10/sanity-check.html), Romney is \"plausible\" as president and so of course is Obama.  That's talent we can work with, as screen writers, as we dream our lives away (you've gotta believe in something, right?).\n\nI also asked Skip if AFSC had asked him to photograph the US-Mexico wall as well, a somewhat similar project in many ways.  It hadn't (yet), though others have done so. \n\nThe swallowing of North American real estate by a Federation of States (like in Switzerland) is another partially overlapping historical narrative, with many of the same plot elements (poor treatment of the natives, zealotry, bigotry, land grabbing and greed).\n\nWave upon wave of \"true believers\" made America what it is today.  Ozymandius was here.\n\n[](http://www.flickr.com/photos/17157315@N00/5815210183/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}