{
  "id": "3880356073018617108",
  "title": "A Paved Over Past",
  "published": "2008-09-01T07:51:00.000-07:00",
  "updated": "2008-09-01T13:01:39.191-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjcqBDhBPn7ROFZwzVVncidP7ix0gACc07QB95C1usqPmPgPUywQijA1oZR1h97SiGRQVmt73T3A66a_qcLgtovsuTNOPMt1KXg4g-ROoYGrSdJfyEdLYo5JINZ4uXdqet3t6vE/s1600-h/synchronofile.png)I was watching Laura McKenzie's travel show on a CBS affiliate yesterday, an episode on Angkor Wat with its seven headed [Naga sculptures](http://worldgame.blogspot.com/2006/07/creation-myth.html), and on Vietnam, Hanoi and Ho Chi Minh cities especially.What was interesting was how little of America's wartime experience was alluded to e.g. Laura likes Saigon because it's \"more western\" i.e. French colonial -- no mention of USA colonial.A younger person viewing the show might get no clue there had even been a war recently, although in fairness I was walking in and out of the living room, might have missed the newsreels and war footage (CBS has a lot in [the archives](http://www.cbsnews.com/stories/2000/04/29/national/main190147.shtml)).But this was about attracting tourism, not teaching a lot of recent history, so I doubt much was shown even when my back was turned.  Plus the [badly misled Americans](http://mybizmo.blogspot.com/2007/11/gym-meditation.html) lost this one, a downer for some viewers, doesn't get them [in the mood](http://www.cbsnews.com/video/watch/?id=4401109n) to think about tourism.Turning to [voting machines](http://www.glassboxvoting.com/index.html), I see a lot of the same [ahistorical](http://controlroom.blogspot.com/2008/07/making-history.html) USA Today style \"tourism journalism\" i.e. let's not stir up trouble with too much realism or recent history.  Lets fall back on that dream of [free and fair elections](http://controlroom.blogspot.com/2006/11/voting-machine-story.html) we learned about in [civics class](http://controlroom.blogspot.com/2006/10/postpone-elections.html) (do we still teach civics in public schools, or was that abandoned for lack of courage?).A sign of growing viewer maturity would be more shows that dig up what we know about [voter fraud](http://controlroom.blogspot.com/2006/02/voting-machines.html) through the ages, including in America.  These shows could start way further back, not dwell on Florida or Ohio or any recent elections at first, just start moving in that direction.Let people in on more of the inside story, about how their government really works, or doesn't.Like, we hear a lot about voter fraud in principle, but not much about the [nitty-gritty](http://www.answers.com/nitty-gritty&r=67).  Where's the Discovery Channel show called Elections I wonder?  The focus could be outside the USA as well, as experiments with democracy aren't confined to North America.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgkXIzmZbM7gWXPAXsuSQ3u9tKAiBWqHHxvqhj6Vb3EUGqwkkBmSONO8vi2e-vOzGTNp1vyZT_iyGRHObyqalrJbZbbzLbXMXWzz2_6W3ziGPldsmV9stSH4PitzMTHOhMWnJaI/s1600-h/traveltv.png)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}