{
  "id": "2722956963527561657",
  "title": "A Political Spectrum",
  "published": "2022-10-25T14:24:00.011-07:00",
  "updated": "2022-10-25T17:41:22.298-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/4676118275/in/photolist-2ncwhBN-2kr68XU-Lb4mUf-26DxkCy-ZJV3gf-pYjAzF-c5xz8Q-akRqNu-8ryECF-88dk3T-6Tas8M-6q6w1e)\n\nI use the indefinite article \"A\" in my title because when it comes to \"political spectra\" we have a good many.  You might not know it to hear people talk though.  \n\nBy tradition, only one pole or axis is used and is labeled Right versus Left.  How one piles on after that depends a lot on subculture.  \n\nIn my neck of the woods, juxtaposing \"Conservative versus Liberal\" atop \"Right versus Left\", would make some kind of sense, but for how long has it, and for how long will it?\n\nAnyway, I sometimes perk up my ears when I stumble upon some meta discussions of what \"Left\" and \"Right\" mean.  I was looking at that topic here on the web as long ago as my Tower of Babel essay of the 1990s, one of the first in my USA OS series.  OS = Operating System.  I'm a computer geek of sorts.\n\nThe theory was:  Left is for Entropy, and why we seem to shift left, more left, more left over time, is because of thermodynamics and dissipation.  There's a sense of stuff leaking away.  The Left inevitably makes gains because evil chaos is winning, was the point, of these ostensibly Right wingers.  \n\nWhen I say \"wingers\" flash on airplanes too sometimes, flying in formation maybe.\n\nI have a different thesis, but it's similar:  on the Left is where we experiment, as we're impelled to shift our weight. \n\nThe conceit of some on the Right is that we have the option to just stay put, as if freezing everything while we figure out what's going on, were a real possibility.  Even a president can't make that happen.  We're talking natural law, aren't we?\n\nMany on the Right say to teachers: \"how dare you experiment with my children\".  Well yeah, it does sound demonic when phrased like that.  How about:  every generation is a next set of experiments in living, we hope thriving.  We're looking for the best ways forward.  Much trial and error is involved.  We bark up \"wrong trees\" in the millions, not seeing the forest for what it is.\n\nIt's like when you have a base camp with a cozy fire, but need to move the base camp towards some destination. Like they said in the est Training, when it comes to purpose, just think of always going further west.  Don't ask why; it's a metaphor.  \n\nWe therefore send out scouts to find the most promising next trails.  They report back.  We have a meeting to establish consensus.  Sometimes, a wandering band will branch or fork, depending on longer term objectives.\n\nThe Left is the perpetually scouting phase, where some come back with reports of dire dangers, awesome wonders, or don't come back at all.  That's where the sense of entropy comes from.  \n\nCasting one's nets forward in time yields a mixed bag, and it's up to the campers to assemble the incoming info, the feedback, in ways that advantage them.  In other words, the curators conserve and build traditions, a fancy name for habits.  Programs.  Engrams.  \n\nTraditionalists conserve artifacts and memories.  In Bayesian terms, they represent collective \"priors\" i.e. the current sense of things based on experiences to date.  Quakers might think in terms of Meetings for Business.  \n\nWe call them \"on the Right\" because they're the orthodoxy, the accumulated wisdom of the ages.  In theory that is.\n\nThose on the Left may feature a lot of younger and bolder personality types, who with age become slower to jump into the action pell-mell.  The older Right oft times empathizes with the younger whippersnappers who remind them of themselves, closer to the start of whatever careers.  \n\nYes, this template or boilerplate is the basis of stereotype type casting.  You'll find many a story line featuring \"the wizened activist\".\n\nSo that's my proposed spectrum:  \"Curators\" (on the right) versus \"Experimentalists\" (on the left).  Or shall we say \"Base Campers\" versus \"Scouts\"?\n\nI'd say let me know what you think in the comments, however the model here is that of \"a Quaker journal\" and so no \"comments\" are expected.  However off site commentary is always welcome.  \n\nWhat do Left and Right mean to you?  \n\nDoes the axis I've described make any sense as an organizing polarity?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}