{
  "id": "4712004628951936689",
  "title": "A Quaker Rant",
  "published": "2008-08-04T08:42:00.000-07:00",
  "updated": "2008-08-05T11:48:15.684-07:00",
  "content": "Something I posted to a Quaker list recently, hyperlinks embedded...At Multnomah Monthly Meeting during last semester's program, capped with a field trip to a doctors without borders type outfit (helps anyone, doesn't matter about religion), we have some very tech-savvy young boys, and what they like to talk about is the Internet.In particular, they're interested in how the public school they attend prevents [access to YouTube](http://mybizmo.blogspot.com/2007/12/quaker-preschool.html), which is already sanitized of obscene material per community standards, and besides, there's no guarantee that a library is entirely \"purged\" and/or \"censored\" w/r to every allusion or pop culture icon.A public high school should at the very least keep pace with the movie rating system, in terms of allowing age-related access, as that's one of [our freedoms](http://mybizmo.blogspot.com/2008/02/bleepography.html) in a free society, to browse our own heritage.  No underground comix allowed even in the library, and yet you're old enough to be recruited?  Protest to your school board, consider a boycott.\"[By federal law](http://usmilitary.about.com/od/joiningthemilitary/a/enlstandards.htm) (10 U.S.C., 505), the minimum age for enlistment in the United States Military is 17 (with parental consent)...\"[](http://usmilitary.about.com/od/joiningthemilitary/a/enlstandards.htm)A touchstone of the [civil liberties movement](http://worldgame.blogspot.com/2008/07/some-summer-memories.html) should be to decry this [dumbing down](http://worldgame.blogspot.com/2007/04/idiocracy-movie-review.html), a return to the days of banned books, with entire domains blocked without reason, other than for the convenience of those faculty who believe controlling the media is their state mandated prerogative (by whose authority again?) i.e. surrender important rights as Americans, ye who enter these gates.  Not a good lesson, right off the bat.Quakers have usually championed underdogs in the face of unethical oppression and in this case the underdog is our own youth subculture, struggling to make a way for itself.I think we owe it to our youth to not sit idly by as their civil liberties erode.At least there should be [lots of debate](http://controlroom.blogspot.com/2006/01/memo-re-google-in-china.html), to give them some reassurance we're at least paying attention, are aware of the issue (\"we adults\" that is, supposedly in charge, at least to some degree).Kirby UrnerBridge City FriendsPortland, OregonRe: our [most excellent adventure](http://mybizmo.blogspot.com/2008/05/field-trip.html) (field trip to Medical Teams International): (takes awhile to load Splashcast album, please be patient)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}