{
  "id": "4419232035106919499",
  "title": "A Tale of Two Movies",
  "published": "2016-03-06T07:25:00.001-08:00",
  "updated": "2016-09-30T09:57:43.442-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/23890816510/in/datetaken/)\n\nMy intent in going to Movie Madness this time was to find something on [the Platonic Year](http://controlroom.blogspot.com/2015/12/timelines-welcome.html).  Glenn is into timeline visualizations, cartoons if you will, that illuminate the meanings behind some of our astro-myths, such as the perennial see-saw between Orion and Draco if I have that right.\n\nAnyway, the star to the north best pegging the Earth's axis is not always Polaris, not everyone knows that.  The planet wobbles, like a top (precession).  Then there's the rotation about the galaxy to consider, another cycle.\n\nI went straight to the Special Interest section, seeking an armload of video goodies, only to not find what I was looking for.  I should take Glenn with me next time.  Having walked all that way, I didn't want to leave empty handed, and so Covert Affairs (season one) and Jabberwocky jumped out at me on the way out.\n\nI'd been reading about Terry Gilliam's life [at Powell's recently](https://flic.kr/p/CNY5Eb), snapping pix from his scrapbook, newly published.  [Jabberwocky](http://www.imdb.com/title/tt0076221/) was a puzzle piece in that regard, his next project after Monty Python and the Holy Grail and set in the same period.\n\nA main theme is \"framing\" in the sense of painting, a canvas, with a frame.  Artists Hieronymus Bosch and Dutch Masters inspired the filmmakers to stage reminiscent tableaus, adding the same comedy device used in Python:  contemporary people projected into an alien past.\n\n\"Framing\" in another sense drives the plot.  Quoting the tagline:  \"A young peasant, with no interest in adventure or fortune, is mistaken \nas the kingdom's only hope when a horrible monster threatens the \ncountryside.\"  The young peasant is framed by fate, caught up in events in a bigger story.\n\nCovert Affairs is similar to Jabberwocky in wanting to capture [the iconic frames](https://groups.google.com/forum/#!msg/alt.politics.org.cia/X0PYuTCNVoA/peEAIKYXZE8J) of spydom's Langley, an institution that tries to stay low profile, like some Bureau of Public Roads, so that the public imagination remains unshackled (unfettered) by too much that's banal and mundane.  The lighting and atmospherics make for some classy shots, of BMW derrieres, of HP computers running Windows (or was that Ubuntu, [as in Chappie](http://worldgame.blogspot.com/2015/03/chappie-movie-review.html)?).  Think:  a cleaned up Archer.\n\nThe screenwriters got a [tour of Langley](http://worldgame.blogspot.com/2006/08/drinking-liberally.html), thanks to the PR department, once the pro-CIA nature of the project became obvious.  The whole point is to glamorize with a cosmopolitan brush.  [What institution](http://worldgame.blogspot.com/2005/02/methodist-morning.html) doesn't want such treatment, from some of the world's best cosmeticians?  Every evil queen likes her lying mirror, until the day it says Snow White looks better, or has a purer heart.\n\nThe script writers know that avid viewers would catch any laptop or cell phone leaving or entering the building and police against making such basic errors (no GPS devices allowed).   Where these people get their guns once outside the parking lot is unclear.  Mostly they don't need guns because few go into the field.  They certainly don't get badges.\n\nThe ones who do get to romp through the countryside are mostly rogue or ex or whatever.  Few Langley-ites really get to see Colombo (Sri Lanka) up close, unless on vacation (no gun required in that case).  Best to get your travel years in before joining the Agency.\n\nOne of my pet peeves is how we use television to replace reality with fantasy across the board, and then expect adulthood to just magically happen.  Seeing the workplace through screen-writer eyes is often confusing to job seekers, especially twenty-somethings who grew up on TV and now have only fantasies to go on.\n\nHow could one possibly be a real cop if one's main influences were TV shows, like Hawaii Five-O?  Or a doctor?  Or a lawyer?  Or a soldier?\n\nBy the time LA and its film industry is finished with it, it's [not really a documentary](http://controlroom.blogspot.com/2013/02/zero-dark-thirty-movie-review.html) is it?  One has great sets, entire offices inside the studio, and more money to build them with than the makers of Jabberwocky ever dreamed of having.  Or is it that Toronto, where this play is staged, is so much more affordable?\n\n[The LA dream machine](http://mybizmo.blogspot.com/2016/09/wanderers-2016928.html) is like a Jabberwocky in consuming all that's real in its path, and turning out beautifully packaged framed substitutes.  The world becomes more toy-like and [Barbified](https://youtu.be/ZyhrYis509A).  That being said, I may rent Season Two.\n\n[](https://www.flickr.com/photos/kirbyurner/23841478525/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}