{
  "id": "8576012571813908968",
  "title": "A Tale of Two Tunnels",
  "published": "2016-12-15T19:33:00.000-08:00",
  "updated": "2018-04-16T21:48:17.599-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/3013259991/in/photolist-pNEb73-e7i8Db-bPvict-b89Pev-azUX29-8ZoRQn-8YLin9-8DhHcJ-7iN1QW-72iA4m-6YooRg-6V6uqW-6US1xd-6TzsJT-6xA7MG-5AgKdt/)\n\n:: Max line ::\n\nWhen boring from both ends under the Tualitin Hills, under [the cemetery](http://mybizmo.blogspot.com/2007/01/wanderers-2007123.html) (some bodies moved), [the zoo](http://mybizmo.blogspot.com/2016/12/wanderers-omsi.html), and the Rose Garden, the engineers used a combination of explosives and a tunnel-digging machine, custom designed, [big and expensive](https://maxfaqs.wordpress.com/tag/robertson-tunnel/).\n\nThe tunnelers from east and west would need to meet somewhere in between, for the Robertson Tunnel to take track, then trains, and they did, not without some delays, three cheers for getting the math right.\n\nThe Max trains (in Portland, Oregon) use those tubes (one each way) day in and day out.\n\nI get a similar vibe, of two tunnels [needing to meet](http://controlroom.blogspot.com/2016/12/new-conspiracy-theories.html), when I read the papers (understood to be \"pixelated papers\" more often than not, with moving bits — ads mostly — like [in Fantastic Beasts](http://mybizmo.blogspot.com/2016/11/fantastic-beasts-movie-review.html)).\n\nThe tunnel from the left is looking for [Russian spies](http://controlroom.blogspot.com/2016/10/bed-time-stories.html), the ones capable of steering the offended egos of proud hackers and libertarians.  The tunnel from the right is maybe looking for high rolling internationalist bankers in the long run, but in the short term is hot on the trail of a ring of pedophiles.\n\nWhere these stories meet is probably where Russian spies hack in to their victims' computers and plant incriminating evidence.  Didn't we hear something like that on the [Alex Jones channel](https://youtu.be/TDBFcWFurfc)? He was blaming [John Podesta](https://www.washingtonpost.com/opinions/john-podesta-something-is-deeply-broken-at-the-fbi/2016/12/15/51668ab4-c303-11e6-9a51-cd56ea1c2bb7_story.html) as I recall.\n\nI think [the PizzaGaters](http://www.salon.com/2016/12/10/pizzagate-explained-everything-you-want-to-know-about-the-comet-ping-pong-pizzeria-conspiracy-theory-but-are-too-afraid-to-search-for-on-reddit/) have a point though:  if this is the topic that really most interests that many readers and viewers, then the so-called mainstream media needs to go [beyond Snopes](http://www.snopes.com/pizzagate-conspiracy/) and really show the PizzaGaters where they'll need to defend their worldview, even as they advance it. \n\nSaying \"pedophilia is real\" is no defense, as we just went through over a decade, more like two, of talking about the reality of pedophilia among some professional Catholics. Those stories were and are the focus of any number of mainstream stories, [talk shows](https://youtu.be/zQu3KBAMLlI), documentaries, exposes.\n\nWe can't say the \"corporate media\" (and/or NPR) turns a blind eye to the whole phenomenon.\n\nWe grownups are expected to love children, just not in a twisted sexually exploitative way.  Freud revealed (made OK to talk about) child sexuality.\n\nThe so-called \"unconscious\" is having a harder time finding places to hide in the 21st Century, given all the open secrets.\n\nLets not forget so-called [honor killings](http://worldgame.blogspot.com/2009/09/forbidden-lies.html), genital mutilation, and forced sterilization as concomitant causes of outrage.\n\nIs it that the mainstream media is hoping to keep its more genteel profile and appeal [to tea-cuppy Victorians](http://worldgame.blogspot.com/2009/05/more-thoughts-on-politics.html) by remaining aloof from the tabloid world, more lurid and sensational?\n\nJournalists are groomed to see such \"entertainment news\" as the opposite of professional.  Academics write in knowing tones about the post-truth world, but without themselves participating in the mudslinging, getting down and dirty debating \"what's a proved fact and what's mere hearsay\".\n\nPizzaGaters want to know:  does Comet Ping Pong really have a basement or not, and if it does, are there tunnels? A tour on camera with owner's consent, might've forestalled the lone gunman showing up to \"self investigate\" on his own.  Snopes claims it's hard to find claims concrete enough to debunk, though it does keep updating its page on the topic. \n\nBut then the hero lone gunman, there to rescue the kids, was reviled as [a crisis actor](https://youtu.be/CjxJVkj_IBw) (just look at IMDB right? — he'd done some dabbling in acting, then must've gotten really committed). The gunman was roundly dismissed as a paid actor, by the very mob he claimed to represent (that's irony for ya).  Crisis actor theories permeate the 9-11 literature as well. \n\nIn my view, if the US president is willing to dignify the Russian spy story with a full report, due in January, then we might as well dive in to the specific allegations and collect whatever debunkings more publicly and officially, while finding what truth is to be found.\n\nWhat's real and what's Photoshop?  We only get this in dribs and drabs.  Partly how conspiracies gain momentum is they fill with meme viruses of questionable factoids never flagged by the true believers' immune systems. They have no antibodies.\n\nWhat's just a picture out of the blue, with an incriminating caption?  What's innuendo?  A lot of noobs won't know what that means.\n\nDon't we have a calling to educate the young?  For that reason I've referred PizzaGate [to the forensic societies](http://controlroom.blogspot.com/2016/12/pizzagate-debate.html), as more grist for the mill.  What constitutes a compelling argument?  Constant repetition?\n\nThe sleights of hand used to fill the echo chamber with \"common knowledge\" need to come to the light of day. Yes the Nazis used such trickery, but so does just about everybody else with a knack for PR.\n\nLets not pretend only one fighter in this ring knows how to use psychological techniques.  Wrestlers trash talk and self-promote as a part of their job description.  So do chess masters, in more subtle ways (thinking of [Bobby Fischer versus Boris Spassky](https://en.wikipedia.org/wiki/World_Chess_Championship_1972)).\n\nIf the mainstream press doesn't role up its sleeves and tackle the allegations more directly, beyond saying they're False News, then we're going to have to credit Russian intelligence for doing all the heavy lifting for us, in bringing corruption to light. Accusing them of causing the leaks, without refuting what the leaks are used to purportedly prove, only gives them more power.\n\nThe PizzaGate people already look up to Wikileaks for all the emails, which they insist are Google-verified and so on.  The technology gets respect.  Should President Donald Trump pardon Julian Assange then?  Otherwise won't it look like he's afraid to help [a hero in battle](http://mybizmo.blogspot.com/2016/11/election-postmortem.html) (the presidential campaign) because he's hiding something about the Russians helping? [The debate rages](http://hotair.com/archives/2016/11/16/the-latest-hot-pardon-rumor-trump-pardons-julian-assange/).\n\nThe Russians are coming out heroes in this chapter, in having apparently put pedophiles on the radar of a once unaware US public, now out for blood.  Stories about pedophile priests on NPR were not enough.\n\nI'm not saying this is the outcome that's fated.  I am saying that going after Russian spies while failing to pander to the mostly younger generation of \"investigator and researcher\" is going to self-fulfill a lot of prophesies.\n\nGive PizzaGate the respect it deserves, as a phenomenon, for exercise.  Then maybe we'll be ready to [revisit 9-11](http://worldgame.blogspot.com/2016/09/revisiting-911.html), long overdue for a more public re-examining.\n\nMe? I voted for Hillary, mostly as a favor to President Obama, who asked me to (me and everybody eligible).  I'd asked him to not start a foolish, endless war with Iran.  He obliged, attacking Libya and [then Syria](https://www.rt.com/news/332109-russian-jets-isis-warlords/) instead.\n\nBut just about anyone running for president except maybe Bernie is seen as a warmonger out here in Cascadia.  That's just DC's culture, going back a couple hundred years (through Taft, McKinley and Andrew Jackson to name a few Manifest Destiny heads).\n\nDC as a City ([of Morons](http://controlroom.blogspot.com/2013/08/city-of-morons.html), with a Beltway) is the province of arms dealers in the business of showcasing and selling WMDs, and not much else they do serves to compensate.  Make peace or go down to defeat.  Right now, DC is choosing defeat, as making peace is much harder. \n\nI see Iran as sanely [anti-nuke weapon](http://controlroom.blogspot.com/2016/11/fighting-nukehead-nations.html) (not power) while I see nuke-heads as drunk with a phony sense of their supposed \"superpowers\".  I'm sure that makes me some kind of globalist, [and it's true](http://mybizmo.blogspot.com/2016/11/thinking-globally.html), I believe Planet Earth is a globe (spherical) and that we have only our science fiction (which includes science) [and PR](http://worldgame.blogspot.com/2006/07/pr-for-pl.html) (tools of persuasion) to keep our various civilizations thriving thereon, God help us.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}