{
  "id": "4768615664350931468",
  "title": "A Triple-A Story",
  "published": "2019-02-04T09:20:00.004-08:00",
  "updated": "2019-02-15T12:59:34.059-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/46933855071/in/dateposted-public/)\n\nSo Carol and I were all set to back out of the driveway, when I realized the battery was dead.  I have [a Python script](https://github.com/4dsolutions/Python5/blob/master/carkeys.py) you'll have maybe heard about, if you've come here through other blog posts (they tend to link to each other).\n\nTime to call AAA, but was my membership up to date?  I feared not as my wallet card had expired.  However, the good news is I was paid up and membership services switched me over to the jump starter crews, by way of dispatching (why we're here in Control Room).\n\nMy Android (smartphone) was meanwhile at death's door on the charger and not up to taking calls.  I kept looking out the front door so as not to miss the AAA business mobile.\n\nThe battery bounced back with sufficient infusion from the car's internal recharging system, petrol powered.  We joked about the mountain of World Cup soccer balls in my front yard (the C6XTY sculpture).\n\nAAA's parting advice was to take the car on a journey, an adventure, off the beaten path (I added that last bit).  I invited Carol but she'd rather just stick to the original itinerary post test drive.  I took the Nissan to FuBonn, the giant (\"\") Asian mall (biggest Asian mall in Portland) and stocked up on noodles and some international beers (Myanmar and Singha).\n\nThe 1997 sedan performed well, having a newly rebuilt underneath.  Melody's rig had gotten that same way when she got hers redone in Olympia, not even risking it to Portland where repairs were planned.  You need a strong rig if heading over the ridge to California.\n\nIn between all this car talk, I've been pumping out some new \"U200bs\" as I call them, again inventing my own slang.  Hashtag hashtag.\n\nI'll end with a flashback to the Superbowl on NFL Day, an event in Atlanta in the opulent Southwest. I started watching the preshow at Hop House with Glenn, then raced over to Cork & Tap (the formal name) for a growler refill while still happy hour.  But they'd extended it.  I stuck around for an IPA then headed home with some groceries.  I ended at Derek's place where he used the kitchen to bake our pizza.  I brought the growler but we stuck to coffee.  All of this going around was on foot.\n\nPython 3.8 has been released to the curious testers and I'm tempted to grab a copy.  Python is under active development and isn't expected to contort as it did when we jumped from 2.x to 3.x -- a jump announced well in advance and managed bravely.  The was to work out a few kinks in the first iteration and shift the language to a more comfortable long term form.\n\nI'm glad AAA was able to respond quickly, and also that the event was not a roadside emergency, or getting stranded in a parking lot downtown, again with Carol as I recall.  I blogged that event too, and others before it.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}