{
  "id": "6369564916784877210",
  "title": "About Town",
  "published": "2019-08-05T07:37:00.003-07:00",
  "updated": "2019-08-05T13:58:29.972-07:00",
  "content": "Given my Quaker ethnicity, I keep up a brave talk about how we're able to get along well enough, at least as Quakers, to not let differences in nationality or language get to us (divide us).  How true this is has to connect to my experience, if I'm not to just spout empty statistics.\n\nI'll say about my network in Portland that I'm pretty pleased with it, but like with electricity, the flow of current is a function of the network continuing to change.  I see new polyhedrons (graphs) drifting into view.  For example, yesterday I saw myself in relationship to a native Chinese population in a new way.\n\nOn the east side, I do a lot of shopping at El Mercado, which has its own politics.  I get into that source of short stories in some of my Youtubes.  I also show a lot of slides from that location.  In the movie of my life that I'm chronicling (and directing to some extent), I have some settings to which I frequently return.  Most movies are like this, inheriting from theater.\n\nWhat's my relationship to the Russians?  Johan Maurer comes to mind.  I think of the Russian River near Sebastopol, the one near the Charles Schultz airport in Santa Rosa.  I'm wearing an O'Reilly School of Technology T-shirt right now.  I'm still in touch with some of my students.  One of them was in Afghanistan.  He learned some Python from me.  Fluent in Russian.\n\nMy point is any one of us can play these games, do these exercises.  Recast your image of your own network exploring for connections to some random ethnicity, take your pick.\n\nIn my postings about CUE (Center for Urban Education), I get more into my ties to Asian-Pacific and Latino communities.  However, as I say above, a static image from a past chapter is not a source of electricity so much as is reinventing (recasting) said image.  Reinvention is still invention.\n\nI'm not saying to throw away the past, as if you could, just respect it has momentum going forward.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}