{
  "id": "9102772387704869087",
  "title": "About a Factory",
  "published": "2015-07-31T19:25:00.003-07:00",
  "updated": "2015-07-31T22:59:38.743-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/20146827752/in/dateposted-public/)\n\nGlenn and I enjoyed The Bagdad today, another hot one.  Lots of street theater, though none of the buskers from the other day (above).\n\nA long happy chapter in Glenn's life was re-purposing an old abandoned high school, twelve foot ceilings, tall windows, maple floors, a huge walk-in air conditioning solution... to make it a healthy place to work, producing sensitive measuring devices.  The town had already dwindled to not quite a ghost town, when a new generation of young people showed up, Glenn among them, a Vietnam vet (exNSA).\n\nGlenn did a lot of the wiring and our discussion turned to conduit, how it's bent without crimping.  Ingenious spring sleeves do the trick, though he also described a more conventional solution.  Having tried to bend copper tubing by hand, and quickly crimping it (a kindergarten experience, saved for kitchen sink owning adulthood), I could appreciate the need for tools.\n\nFishing the wire through (this is conduit for wiring) is another art.  He talked about an air pressure powered \"mouse\" that may be used to fire the pull-cord right through the length, after which a tightly bound bundle of wires is pulled behind it, perhaps with the help of lubricant.  Why tighter is better I wasn't sure, having a memory of \"cable trays\", suspended from the ceiling, open to the air, but then there's a difference between high voltage cables and data cables.\n\nThe plant was in Jerome, Arizona, and the instrument was a very fine almost-pure gold mesh.  One could detect toxins at parts per billion not million, including the \"[sour gas](http://www.huffingtonpost.ca/2013/06/20/sour-gas-hydrogen-sulphide-hs2_n_3473666.html)\" that kills oil rig workers, if they hit a pocket of the stuff.  And mercury.  These were canary in a mineshaft devices, and used by environmentalists to document \"externalized costs\" in the form of deteriorating health (lower living standards) for surrounding populations (some factories are more polluting than others).\n\nAt its peak, this \"mostly hippie\" factory, meaning egalitarian, no cubicles, parties every Friday afternoon (well earned), turned a pretty penny and outperformed the competition, making a lot of less competent companies look bad.  I guess the factory was publicly listed or something, or in any case it got bought out and ruined by lesser minds from Phoenix or one of those.  That's from Glenn's angle of course, given the takeover involved everyone being fired (and adding cubicles \"so people couldn't see you not working\").\n\nThe unions, when influential on a construction site, have their respective turf when it comes to tubes and ducts.  Pipe fitters have their specialty.  However once the building is complete and in service, a next cast of ongoing maintainers get to practice a more inter-disciplinary blend of skills.\n\nGlenn really benefited from all the talents he got to develop, extending what he'd learned from growing up around a construction site:  [Glen Canyon Dam](http://www.canyon-country.com/lakepowell/gcdam.htm) near Page, Arizona.  His dad was a senior engineer on that one, the family having moved there from St. Helen's, Oregon.\n\n[](https://www.flickr.com/photos/kirbyurner/19989647608/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}