{
  "id": "8396015787254130377",
  "title": "Academic Contrarians",
  "published": "2022-05-22T20:00:00.000-07:00",
  "updated": "2022-05-27T10:11:44.561-07:00",
  "content": "Part of Fuller's legacy results from his example proving attractive to others fighting some uphill battle of their own against a skeptical academia.  \n\nThese up hill fighters have tended to rally around King Bucky as someone who voiced the right criticisms, regarding overspecialization and so on.  Those looking askance from afar see what appears to be a roiling mob psychology, with a semi-incoherent center.  \n\nAn entourage of crazies follow their beloved pied piper out of town and over a cliff.  Was that an inadvertent social service, that Bucky performed, in serving as a lightning rod and gathering point for the most disaffected?  Was he a Vortex 1,  turning the center ring counterculture into a sideshow of docility? \n\nI've seen some DC presidents I might interpret in this way.  Their technique is to use a magnetic ideology to sweep up a lot of people and deliver them, pre-packaged, to alternative spinmeisters, which might as well mean \"down the drain\".\n\nSome think GWB committed a gaff when he cited \"Iraq\" instead of \"Ukraine\" as his example of an undemocratic war led by authoritarians.  He corrected himself of course.  He's used to getting laughed at. His message to the Iraqi people on the eve of the invasion:  \"Don't burn the oil wells\" (smirk), i.e. that's what we're coming for.  \n\nAn American people used to mocking their president appears tone deaf when the mocking goes the other way.\n\nSome riding the Bucky coattails will offer spurious details about what Synergetics is really about.  \"It's about never needing to use mathematical symbols\" some will tell you, seeming to completely ignore all the radical signs, all the 2nd root symbols, that decorate the Synergetics pages.\n\nHowever Fuller's dedication of the work itself, to H.S.M Coxeter, a practitioner of n-dimensional Euclidean geometry, suggests Fuller saw himself more as a metaphysician than a straight geometer.  His agenda was to leverage whatever it might take to make humanity successful.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}