{
  "id": "982107450253559947",
  "title": "Accelerating Acceleration",
  "published": "2018-04-03T01:43:00.001-07:00",
  "updated": "2018-04-06T16:54:33.515-07:00",
  "content": "If you go back a ways, as I do, in terms of being aware of Future Shock by Alvin Toffler (he wrote other books too), then you recognize \"accelerating acceleration\" as one of his memes.\n\nPhysics folks like the notion, of speeding up the rate at which we're speeding up.  Just plain old speeding up (acceleration) is what we call \"forcing\" in that we may feel \"compelled\".  So when the force becomes more forceful, we may feel that even more.  There's a certain gravity to the situation.\n\nHowever \"force\" outside of physics has many negative connotations.  One breaks sensitive and expensive equipment by forcing. What's most valuable is often most fragile, which brings me to a bridge to the Bucky stuff (as I'm wont to call it):  ephemeralization.\n\nIn one of my Medium essays, I link Fuller's \"ephemeralization\" to Toynbee's \"etherealization\", the latter being a famous historian. However I think it's time we connect both of those to Ray Kurzweil and his Law of Accelerating Returns.\n\nFirst of all, lets simplify and admit that \"accelerating acceleration\" is still acceleration, no matter how you cut it.\n\nKurzweil, like Fuller, has lots of honorary doctorates, and more to the point, he has a narrative that's upbeat, relatively, and willing to take in some promising trends.  He sounds \"less myopic than average\" by Fuller's criteria, in that Fuller, like Kurzweil, found a lot of pessimism to be based in fake news.\n\nKurzweil quotes or at least cites Pinker in the above interview.  Another positive futurist, we might say.\n\nComprehensivists with both a big picture view, and a hopeful one, tend to stand out, as few manage to stay sources of believable good news.  People get cynical about all the \"forcing\" going on.\n\nLets review what \"ephemeralization\" means.  In Fuller's accounting, there's a metaphysical aspect to stuff in that we get better at doing stuff in accordance to our more fully developed intuitions about the whole show.  Putting these intuitions into words is far from easy, and is what science is all about in its perennial search for \"laws\" or in Buckyspeak: \"generalized principles\".\n\nU = MP was the Synergetics equation, where P is for all things physical.  There's a way you can aspect shift back and forth, Necker Cube like, where it's all physical or all a dream, but we don't have to go there to understand how \"more with less\" is a consequence of deeper understanding.\n\nSo... Kurzweil, Toynbee, Toffler and Fuller are all pretty much saying the same thing.  Many of the exponential curves are in our favor, and speeding up may be a beneficial phenomenon.  In and of itself, acceleration might be good or evil, or the more usual mixture.\n\nRemember that in physics, even slowing down, slamming on the brakes, is acceleration.  They may say \"sudden deceleration\" when being kind to laymen though.  Coming to a dead standstill, in terms of change rate, would be as shocking as Future Shock is being.\n\nNow that I've described this tight inner circle, of thinkers on the same page, I want to point out a few differences. Fuller did not suppose that major breakthroughs in AI were critical.  He talks a lot about energy grids, which are supposedly getting smarter.  But he's not expecting humans to succeed in creating their machine learning peers.\n\nWhat I told my class tonight was to be on the lookout for scams and hoaxes.  I invoke the same spirit of skepticism people use against belief in witchcraft, to question illusions.  Getting someone to believe they conversation they're having is with a machine that's almost human is easy, with a properly trained human.\n\nThe Turing Test is not supposed to be conducted in suspect circumstances, but that's just it.  Suspect circumstances are precisely those which get you to let your guard down.  AI has always had a carnival side-show-like flavor, like illusionists do, as sensationalists more generally.  Showing hitherto thought-to-be physical laws being violated can be crazy-making, as was Sophia, the Talking Robot.\n\nI told my students once again about The Turk.  That's the irony around AI:  it was booted with a hoax.  As Ada was the first computer programmer, The Turk was the first to pass the Turing Test (yes, I'm being anachronistic), in the same way humans pass it every day, but impersonating a robot (like Sophia).\n\nKurzweil sees Machine Learning (which I've been teaching) as a force for good.  We're leveling the playing field with free and open source stuff.  So did Fuller's \"design science revolution\" actually come about with the invention of Linux and all the rest of it?  Ray thinks Open Source plays a big role in driving us forward towards his Singularity.  His Singularity, or Big Crunch is not meant to be a bad thing.\n\nAnyway, I think a lot of people have a warped sense of where the technology is at this moment.  I'm far from all-knowing, but I recognize most melodrama on TV is science fiction, and more fiction than science a lot of the time.  Watching law enforcement shows, you'd think the authorities had truly awesome surveillance powers, but do they really?\n\nHollywood and fiction writers more generally have a stake in driving the plot at a somewhat thrilling pace, and getting people to suspend disbelief around technology is often the cheapest and easiest way to get a thrill.\n\nIn other words, I do think we need to stay vigilant with regard to bogus claims, especially around anyone's claims to have established a \"strong AI\" machine that passes the Turing Test.\n\nWhat I do think is within reach are new forms of banter in which we talk to our devices about news, weather and sports in a sort of superficial, non-linear way, punctuated with jokes and new tangents.  Machine Learning will give us that.  We may lower the bar for the Turing Test accordingly, as the people we meet learn to dumb it down.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}