{
  "id": "137147514504252829",
  "title": "Adult Discussion",
  "published": "2011-11-06T11:02:00.001-08:00",
  "updated": "2011-11-27T19:21:41.143-08:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/4511853818/)Our Multnomah Meeting Adult Discussion section (meets 8:30 AM), was all about Occupy Portland and Occupy Together.  This was not at my instigation in any way and I had no foreknowledge of the topic, though I can't say it surprised me.  The white board note taker listed all of our names as we went around, although one of us (not me) declined to be identified.Many views were expressed, including the idea that outward violence would inevitably be necessary to make some kind of point.  \"Mayhem = catharsis\" is how I'd characterize this school of thought.  One strikes fear in the opposition by seeming \"out of control\" -- I was [thinking of Dick Nixon](http://controlroom.blogspot.com/2006/02/history-is-surreal.html), who relished the \"mad dog\" aspect (mask) when dealing with his imagined foes.Others spoke to the \"inward weapons\" in play and how the stupid stuff might be less necessary.  [John Wish](http://controlroom.blogspot.com/2011/09/friendly-discussion.html) cited a Harvard study saying that violence levels were trending down.  He also explained about the city tax structure when we got around to discussing [the public restroom issue](http://mybizmo.blogspot.com/2011/11/endgame.html), which I raised.[Lew](http://www.flickr.com/photos/17157315@N00/6307089425/in/photostream), a water and sanitation engineer, and a member of our Nicaragua Delegation, joined myself and a few others for [some follow-up discussion](http://worldgame.blogspot.com/2011/11/global-warming.html) in the Social Hall, where other Occupiers, some new to our group, were mingling as well.When it came my turn to talk, I mostly [regaled them with stories](http://worldgame.blogspot.com/2011/10/esozone-talk.html) of Smedley Butler, the Fighting Quaker, and his outreach to the Hooverville in DC.  \"[Moron MacArthur](http://www.offbeatoregon.com/H0909d_BonusArmy.htm)\" stormed the place, ensuring FDR's victory in the polls.   Could it happen again?Would a commitment to public infrastructure, not only latrines, but warming spaces, be considered a \"victory\"?  The commitment to regather next year, and perhaps many years thereafter, to showcase the new village-level democracies springing up around the world, out of refugee camps in many cases, prisons and military bases in others, seems to have plenty of inertia behind it.OPDX itself has reached a point where a phased, planned shut down, with a plan to reboot next year, would be welcomed by several of the institutions involved, not least the social service agencies who treat drug addiction.  They haven't shown up around the perimeter in their community service vehicles (for the most part), to do screening and intake, but they have infiltrated and well know what's going on, and aren't shy about informing.Getting the public restrooms rebuilt, and made sturdier, for OPDX Twenty Twelve, would be part of this plan going forward.  In terms of perimeter vehicles, we've mostly had voyeur TV vans serving the passivist spectator flag wavy NFL/NRA stations.  The TV vans have not been exotic, just the usual networks we all recognize, except on [rare occasions](http://mybizmo.blogspot.com/2011/11/visiting-bizmo.html).The elements for a phased shutdown are already in place, as a part of the built-in DNA.  Humans have an inherent sense of community, an ability to internalize.  OPDX is not a full protein, when it comes to Village life.  There's no mortuary, no place to bury the dead, for example.  In future versions of this microcosm, [transplanted elsewhere](http://groups.yahoo.com/group/synergeo/message/67481), we'll have those features, much as the larger bases (and universities, [like St. John's](http://worldgame.blogspot.com/2011/06/visiting-geometer-priest.html)) have them today.Many within OPDX are happy to work with the Portland Police on a drag net operation to purge the camp of meth dealers.  The social service agencies have the same safety concerns as the public at large, which is the 99% after all.But then will healthcare become more available, to these people in need?The Americans may need to outsource such care-taking to subcultures with more compassion, such as doctors without borders and so on.[USAers](http://mybizmo.blogspot.com/2011/11/more-democracy.html) aren't especially well known for being able to deal with their social ills; getting kids to sign up for a military adventure is one of their biggest social programs, when it comes to government handouts, and that's not necessarily a drug free career either ([on the contrary](http://worldgame.blogspot.com/2008/06/random-zine-covers.html)).  JFK (a commander in chief) was on lots of drugs.The devil is in the details.Big pharma, in making money (profits) the standard, is cheating ([cutting corners](http://mybizmo.blogspot.com/2011/10/psychiatry-today.html)), thereby cheapening the quality of its proposed solutions.[](http://www.flickr.com/photos/17157315@N00/6316854705/):: OPDX 2011 / GA Nov 6 ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}