{
  "id": "115445583696643645",
  "title": "Advice to Synergetics Teachers",
  "published": "2006-08-01T11:54:00.000-07:00",
  "updated": "2006-11-15T11:44:21.919-08:00",
  "content": "I find one of the first things I need to get into, when lecturing on the Concentric Hierarchy (a semi-regular gig), is the Synergetics Constant thread.Amateur mathematicians are disbelieving that a cube of edges sqrt(2) could possibly have a volume 3, as their mental model of powering is entirely cube-based. The pro mathemeticians understand the possibility of an alternative model, but Fuller's is [alien](http://www.4dsolutions.net/ocn/alien.html) and they have better things to study.So Fuller has readers go through this whole exercise of [looking at](http://www.rwgrayprojects.com/synergetics/s09/figs/f9001.html) growing/shrinking tetrahedra, then triangles, to see how the 3rd and 2nd powering relationship (vis-a-vis a changing scale factor, applied to edges) doesn't change. Double the edges, eight-fold the volume, just like before.Likewise, the Pythagorean Theorem admits to more than the standard square + square = square interpretation. That could be any shape (say a silhouette of Pythagoras [1]), as long as the proportions are properly metered (the shapes are all similar, such that shape + shape = shape).Once we've been through this, and people realize the cube thing is cultural, it becomes a lot easier to dissect said volume-3 cube into a tetrahedron (either one) and its four 1/8th octas. Said tet = 1, so the remaining 2 (1+2=3), distribute among four 1/2 volumes, 8 of which give the volume- 4 octahedron [and so on](http://www.rwgrayprojects.com/synergetics/plates/figs/plate03.html).Then its long and short diagonals on the volume 6 dodeca and we're almost done. 12-around-1 for the volume 20 cubocta, embraced by the 2-frequency cube (x8 the original 3 volume = 24), and the jitterbug, to capture the five-folders (pentagonal dodeca, icosa, and rhombic triaconta mainly).With that out of the way (the [concentric hierarchy](http://www.rwgrayprojects.com/synergetics/plates/figs/plate09.html), which bow-ties in two Universes (positive and negative)), we get to the next standard objection: \"but so many polyhedra are left out of account! What about all the Archimedeans, the zonohedra, the this that and the other?\"I have two answers for that:(1) no one is stopping anyone from expressing Archimedeans in terms of A & B modules, E modules or whatever, or inventing modules of their own. Yasushi Kajikawa did some of the most important and pioneering work in this domain (published in the Japanese edition of Scientific American), before moving on to disaster relief shelter solutions (his focus at the SNEC summit @ Russell's in DC). Plus David Koski pioneered recursive self-construction of the T-mod (Ed forwarded his stuff to Stanford).[2](2) Second answer: Bucky's Synergetics is not intended as some comprehensive survey of all matters geometric. He salutes Coxeter, yes, as the paradigm geometer of our age, then dives head first into philosophical system-building, more in the tradition of Hegel and Kant (plus I apply my signature post-linguistic-turn Wittgensteinian spin). Don't think of Synergetics as a math book at all, and you'll be miles ahead of your peers, still struggling with a lot of misleading imagery.So, to recap: explain how \"the cube is cultural\" to keep your momentum through the concentric hierarchy, which is conceptually satisfying once gotten (keeps your audience with you, even if skeptical), then handle the objection that Synergetics is neither comprehensive of geometry as a whole, nor finished in terms of what we might do with it (duh).To help free their heads from musty and mystifying math associations, remind them it's really literature in some philosophical domain (note the citation to Plato) -- or do what I do and classify it as American Transcendentalism, a product of the 1970s Renaissance, a lot fed by the Apollo Project. Comparison to Poe's Eureka are more than apt, as E.J. Applewhite signified in his last public address (2004 Bucky Symposium @ GWU).[3]Also, try to remain cool-headed and don't launch into any diatribes about how anyone calling themselves a \"math teacher\" should already know all this by now, as Fuller's early synergetics constant stuff was published circa 1950. Statistically speaking, it's less and less likely that your audience will have overlapped Bucky in any lifetime scenario sense, many of them having been born since the 1980s. Go with the Universe you're given, not the one you wish we'd had. Accept reality (even if it is only special case).Notes:[1] I saw this bust-of-Pythagoras demo @ OMSI one time (our local science museum, back when it was still adjacent the Zoo), plus similar teachings on the walls of Winterhaven (not my doing), a local public school and technology magnet (somewhat different spin than Benson's, also for techies).[](http://www.grunch.net/synergetics/quadray/pythag2.gif)[2] [\"Playing with Blocks\"](http://www.4dsolutions.net/synergetica/synergetica5.html)[3] [Ed @ GWU](http://mybizmo.blogspot.com/2005/02/ayatollah-of-tetrahedron.html)[More on the synergetics constant (3rd powering thereof)](http://mybizmo.blogspot.com/2006/07/practicing-multiculturalism.html)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}