{
  "id": "474478118133983279",
  "title": "Advice to Some Dieters",
  "published": "2024-02-15T09:39:00.000-08:00",
  "updated": "2024-02-15T11:26:07.182-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/30965270764/in/album-72157674357350203/)\n\nI stress the \"some\" because I'm aware of how we differ widely in the kinds of coaching we each want. Some need a stern lecture and welcome same, if delivered professionally. I'm not adopting a stern manner here, nor a punishing tone.\n\nA sense of power you may develop has to do with your ability to shift your habits, or as we say in psychology, to express and / or extinguish them. Yes, my meaning of \"power\" is aligned with the old fashioned meaning of \"will power\". \n\nThe obverse of what I'm saying is \"pick your battles\" because indeed, some patterns are not especially subject to your will. There's that saying about knowing the difference being evidence of wisdom.\n\nWhen I tackle my \"addiction to\" (ingrained habit of consuming) sugar, a term with a refined meaning in modern lore, which I'll get to shortly, I focus less on the substance and more on the appetite, the phenomenon of having a sweet tooth. Then I get curious: what would I be like with less of a sweet tooth? \n\nPut more as a Bayesian: \"what would the world around me have to be like for me to be less of a sweet tooth (in it)?\". I'm inviting changes to the whole world, as experienced by me, as a result of my reshaping my appetites. That mere act of reshaping, I'm suggesting, gives one a sense of being powerful.\n\nSo here's where discernment comes in. Of course if we all had infinite will power, we'd move mountains and all become beautiful (which we are) and our ideal weight (as if there's just one). Short of moving mountains, do we have the power to resist, with an eye towards extinguishing, the craving for sweets?\n\nThe desire for intense glucose rushes, day in and day out, is what we really mean by an appetite for (addiction to) sugar, meaning pizza and pasta, bread, not just cake and ice cream. Phasing out carbs is what a diabetic is advised to do. Stop taxing your pancreas and start burning those ketones instead, throw those ketone logs on the fire, lord knows you've got a real pile of 'em.\n\nThe other reminder is not to make it a moral contest, with you against the devil, resisting temptation, and bad sinful you if you give in. Sure, that's a popular mindset to assume, when reshaping, but it's not the only one possible. The search for novelty and variety in a changing world might be more the driving undertaking. You just wanna see what happens if you stop doing this (not cold turkey necessarily) and start doing that (slow acceleration OK).\n\nPut another way, your aim is not to be a goodie two shoes, but to be powerful, but in a way we have a right to enjoy, an earned pleasure. The ability to reshape yourself is tantamount to your ability to exercise your freedoms, as a self. You grow more into your heritage, as a selfhood, in exercising your inborn ability to reshape.\n\nThen there's the mental habit of always thinking one needs to reshape this or that. Watch out for those ruts (those grooves) as well, meaning remember to question your own beliefs as to what habits you need to work on. Maybe you would like the habit of sending more postcards, drinking more tea, riding buses more often... or try listing an entirely different list of habits. The permutations are endless. \n\nPlay with reshaping what it means to reshape.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}