{
  "id": "3358163794195184997",
  "title": "AFSC Banter",
  "published": "2011-12-02T16:09:00.000-08:00",
  "updated": "2011-12-06T17:15:00.064-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjMKwCWB5YFmRwslKtLs-HsKA5wxrCt6k8IvrMpdo7rq_HE-jzhYPTTWmjVkgKRY1Tmu9a96Fyef4tM1LRKlE_WvKpvaDGvbso5_6_9lkszX4iuvVVIOygByi_6wjheG1keV38B/s1600/afsc_regions.png):: federated states ::Per my [squibs to Facebook](http://www.flickr.com/photos/17157315@N00/6429685325/in/photostream), there's been [much ferment](http://www.flickr.com/photos/17157315@N00/6429065659/in/photostream/) in Quakerdom and old alliances are being supplanted with new ones.  Twas ever thus.  In the grand scheme of things, Philadelphia is still an important town, and Cherry Street still resonates with some authority.  I'm not sure I can say the same for Washington, DC (WDC) however, which seems [in steady decline](http://worldgame.blogspot.com/2011/11/city-as-campus.html) as a [world capital](http://mybizmo.blogspot.com/2011/11/ayn-rand-sense-of-life-movie-review.html).The new maps have come out, of the new AFSC regions, as devised for North American states commonly considered to be part of a single Federation.  That means British Columbia is out, and Hawaii is in.  Guam and the Marshall Islands, important foci in [my AFSC work](http://mybizmo.blogspot.com/2009/06/prisoners-for-pelau.html), do not seem to have much focus.  East coasters especially are not known for their attentiveness to Pacific Rim details and affairs.  We take all these maps with a grain of salt therefore.  Philly, like WDC, has its characteristic thought patterns.The timidity of Christians in general is [a theme](http://mathforum.org/kb/message.jspa?messageID=7622852&tstart=0) I'd like to take up.  I think there's a desperate race to the bottom as each tries to \"out meek\" the other, in a bid to inherit the Earth.  According to Apocalyptic renderings, \"the meek shall inherit\" meaning if you just keep your head down and do a modest amount of good, then you'll have your reward in Heaven, and perhaps even on Earth, God Willing (InshaAllah).  Besides, who wants to be bossy?  Just a comfortable \"go along to get along\" attitude is what most people call \"liberalism\" these days, and many Quakers would count themselves among them. \"Geek\" rhymes with \"meek\".  What if we beat 'em to it?  \"[World domination](http://mybizmo.blogspot.com/2009/04/cywar-in-cyberia.html)\" was our stated goal as well.  Could the prophets have heard wrong, misplaced a syllable?  Something for theologians to mull over perhaps.At the other end of the spectrum, you have your \"dangerous Quakers\", but then a lot of those are far from Christian ([Praise Bob](http://controlroom.blogspot.com/2009/10/subgenius-devival.html)), in terms of branding.  These brands have not been well represented as there's a tendency to demonize, forgetting we're still talking about [Friends of Christ](http://worldgame.blogspot.com/2011/08/quaker-crossroads.html).  Having a \"Christ\" outside of Christianity may seem a contradiction in terms, but then Friends are comfortably free of most doctrines and breezily point out that Christ himself was not a Christian, as if that settles the matter.As an NPYM delegate, I'm supposed to help the AFSC keep up to date on what Friends are doing to fill the vacuum, now that Christianity has dropped the ball.  That's not my only responsibility of course.  I represent [different lineages](http://worldgame.blogspot.com/2010/10/school-spirit-hillsboro-story.html).  NPYM is an umbrella organization with many branches and sub-types represented.  Unless you're intimate with the history, you're probably not aware of how many brands of Quaker there already are.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}