{
  "id": "3196134948843485258",
  "title": "AFSC Stuff",
  "published": "2024-09-13T09:31:00.000-07:00",
  "updated": "2024-09-13T21:15:08.406-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53992445922/in/dateposted/)\nI worked with Martin for many years via AFSC here in Portland. Mostly I was a program clerk meaning the token titular Friend meant to help with the curriculum, which in our case was youth oriented and started out as a way to address tensions between two demographic groups in the high schools: Latinos and Asians. They had other names for one another. Our program was named LAAP (Latin American Asian Pacific program) or something like that.\n\nAnother role I played was as apprentice contributing editor for Asian Pacific Issues News published out of our Portland office. Towards the end, I was briefly editor in chief. This newsletter is today very hard to find, a collectors’ item. We used it as currency to exchange for similar newsletters from around the Pacific Rim. We’d all read each other’s stuff, synthesize and summarize, and recycle. Such is a media ecosystem.\n\nWhy was I doing all this stuff? I had my skill set as a curriculum developer and had been sent to Boston to learn from an AFSC youth program there, as well as to attend Daniel Ellsberg’s Manhattan Project 2.0, about cleaning up post the original Manhattan Project (at Hanford et al).\n\nLater, I tried to adapt my AFSC ideas, successfully implemented in the form of LAAP, staffed by two directors, one Asian, one Latino, to a different clientele piggy-backing on Glenn Stockton’s dream of an Institute of Integral Design. Glenn had enough skills to impart and inventory to share to fill a “maker space” (a term he despised — “maker” sounded too crude maybe, for craftsman). I would encourage learning moviemaking (skills I’d also like for myself)\n\nFor a short time, Portland AFSC itself was casting about for new digs, and we brainstormed this next chapter together (we had a committee). But the days of our youth program were over, at least here in Portland, and people moved on. Martin and I went our own ways but stay in touch over Facebook. I’m considered an AFSC Alumni Network guy.\n\nI did have another AFSC role I should mention: as representative of our Yearly Meeting (NPYM), I was tasked with flying back to Philadelphia for annual corporation meetings. I’ve written a lot about those corporation meetings elsewhere, including when chronicling My Dinner with Kiyoshi (see comments).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}