{
  "id": "4544191859752981762",
  "title": "AFSC and Ethnic Phobias",
  "published": "2012-03-02T14:06:00.000-08:00",
  "updated": "2017-03-18T19:09:48.019-07:00",
  "content": "We're getting briefed on some of the programs AFSC is engaged in. \n\nWashington DC has a way of channeling refugees to targeted parts of North America.  For example, after the USA ended its occupation of Vietnam, a lot of refugees from that region were directed to the Portland area. \n\nThe Center for Urban Education (CUE) where I worked, was involved in managing this influx.  More recently, the obliteration of Somalia (people still pretend it exists -- nationalism is a lazy ideology, with lots of inertia) has resulted in lots of Somalis moving to Minnesota, Tennessee and so on.\n\nAfter CUE, I did lots of program work with AFSC, as the program clerk, to work on tensions between ethnicities resulting from the various waves of immigration.  Latino students were not necessarily getting along with the \"Chinos\" i.e. Asians. \n\nLots of different cultures get stereotyped e.g. just as a person from Mexico might have a hard time distinguishing a Laotian from a Filipino, so might a Vietnamese not appreciate the differences between Mexican and Guatemalan cultures. \n\nThe education process is a lot about geography, learning the stories of the different human scenarios and their inter-twining.\n\nJiway Tung joined us by voice from Yogjakarta.  We learned about AFSC's work with partner organizations helping to promote some of the same inter-personal and leadership skills we nurtured in the Portland area.  Bringing groups together and doing things in common, as well as having separate programming, is a fairly useful activity.\n\n[Hawo's Dinner Party](http://www.shelbyvillemultimedia.org/modules/hdp/) was along the same lines.  Shelbyville gets introspective about being at an historical cross-roads.  Not so long ago, Anglos were a rarity in this region.  The newest arrivals, from Somalia, have rocked the boat a little.\n\nWe should remember that European cultures have immigrated in huge numbers over the last few centuries. There's no one way street when it comes to Anglos either -- they're everywhere by now (witness Australia). Helping disparate ethnic groups find ways to get along is important work everywhere. Often the schools are having a hard time coping.  That's where NGOs may step in, including religious groups of all stripes.\n\nThe Parliament of World Religions has a similar focus on inclusiveness, tolerance, getting along with aliens.  If we're visited by ETs (e.g. Martians), similar skills may be required.  Indeed, it's interesting to rank ethnicities on their ability to get along with other ethnicities.  The patterns repeat over and over, but the outcomes are different based on some variables.  How cosmopolitan are the people to begin with?\n\nMy \"schools for diplomats\" (a theme in these blogs) are really schools for everyone, as in a planet such as ours, where \"intelligent life\" has jet airplanes, lots of ships, satellites, television, everyone is a diplomat.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}