{
  "id": "3810232512916714826",
  "title": "Alien Boy (movie review)",
  "published": "2015-03-09T15:24:00.000-07:00",
  "updated": "2015-03-10T07:50:21.930-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/16581704658)\n\nJim Jim, who went by various names, was a work in progress.  He liked Mad Magazine and comic books, as I do, and was finding his way in the Portland punk rock scene, or trying to.\n\nJames ended up getting hospitalized for mental illness and was on a long slow road to recovery, with an address in downtown Portland (finally) when his life took a nose dive.  He'd gone off his meds and was needing more help than anyone had to give, given a network of friends is not always a real safety net.  He was passed being able to take care of his personal hygiene -- but had the potential to bounce back, under care, all talking heads agree.\n\nAt the bottom of his luck, though still with an apartment, a police officer and a social worker came to his door, knocking repeatedly.  He asked if a police officer were present (a chief terror), then he bolted, unpursued. \n\nLater, when urinating (when you have to go you have to go), different police accosted him.  Terrified of police encounters ever since getting beat up in Utah, he bolted again but these officers were not the nice kind and beat him badly, then used a taser, in front of many witnesses having lunch outside.\n\nThe police knew they had broken him, likely killed him, so the game after that was to make it look good.  Spin control started early, with allegations about cocaine on his person, as if that would explain their excessive force actions.  But the crowd wasn't buying.  Having witnessed a murder, the lunch eaters were upset (the waiter included), and thirsty for justice.  Police need to show more self control in a civilized town.\n\nJ. wasn't quite dead yet though.  The paramedics showed up and offered to take him to the hospital, but the cops, having broken his ribs in 26 places, were not eager to tell the medics they were the likely cause of death on the record, so the agreement was to waive the patient's medical treatment and remove him to the county jail where the cops could control the narrative.\n\nWhat followed was caught on tape on the prison cameras:  the police carrying a terribly wounded man around, not knowing what to do with him, and refusing him treatment, until he died in their care.\n\nThe public continued to thirst for justice for many years.\n\nImmediate family eventually got a settlement of over a million dollars, as the city needed to stick with the union and not let anyone get fired for brutality.  Losing a civil suit was the best they could do.  After all, the whole point of a police department is to be brutal, like a military.  People understand what they're paying for:  the [state's thugs](http://mybizmo.blogspot.com/2009/11/murder-of-fred-hampton-movie-review.html) (good guys) versus the [bad guys](http://controlroom.blogspot.com/2009/02/neverland-movie-review.html).  Thugs are supposed to be badass.  So the cops who committed the homicide were never charged, which is why we shouldn't call it homicide.  The court said not guilty.  Soldiers don't murder people either.  English is funny that way, very law-abiding.\n\nThe Mayors keep apologizing though (first Potter, then Adams), and the City keeps needing to settle on other cases of abuse.\n\nClearly the training is at fault, a finding made early.  Tackling a fleeing 147 pound man from behind because he was urinating on public or private property is actually not what the training suggests is appropriate.\n\nHowever a lot of this \"training\" is more hearsay than anything actual cops have been exposed to.  Portland cannot afford top-level training for its people, although even if only in self protection, the union should insist.\n\nLeaving people vulnerable because of inadequate professional skills is the great disservice.\n\nMy thanks to Multnomah Meeting's Peace and Social Concerns Committee ([PSCC](http://worldgame.blogspot.com/2015/03/meeting-on-grand-avenue.html)) for bringing this video to my attention.  I'll wave the DVD around at [tonight's APC meeting](http://worldgame.blogspot.com/2015/03/afsc-apc-meetup.html) (AFSC volunteers + staff) before returning it to Movie Madness nearby.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}