{
  "id": "2469138721783481542",
  "title": "Alt Worlds",
  "published": "2024-02-06T15:58:00.000-08:00",
  "updated": "2024-02-19T10:43:31.907-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53506510396/in/dateposted/)\n\n  from Bonnie DeVarco's presentation to TrimTab Book Club, Feb 3, 2024\n\nWould a sphere that focussed on city mayors more, be detrimental to our endeavors? That's not a tight enough question yet, as who is this \"we\" with endeavors? What \"endeavors\" are we talking about? Suspicions abound.\n\nIt's not like city mayors don't talk and compare notes already. Portland celebrates an end to the nuke weapons era, now about you guys? Clearly the problem of radio-toxins in need of safe storage has not gone away regardless, with or without an intelligible treaty situation. \n\nMayors might compare notes on the safety of their power grids, especially in light of Three Mile Island, Chernobyl, and Fukushima. But also in light of Maui. That's a part of the job, goes with the territory. Beyond electrical concerns one has transiting traffic, such as chem trains through East Palestine.\n\nBut then some avid cable TV view viewer might pipe up saying: only congressional representatives, and even in that case, only a few committees have any official government business prying into the affairs of the Department of Energy and associates. \n\nMayors are not invited to that clique. Don't make such calls into interesting, crowd-informing TV. Which lobbies are telling us that I wonder?\n\nI agree though, there's little consensus on how the circuitry must be designed. \n\nWould it be \"wrong\" to have a Refugees Channel, as I proposed? Would the religious denominations support it, if it were ecumenical enough to reach their laities? How are generous denizens of the first world going to take part in improving these people's lives -- versus trapping them with razor wire no one told them about -- unless some channel opens up between them?\n\nThe improvement I'd make to the Sanders-Yang idea of a socialist safety net (civilian instead of military) would be to (a) make college the norm, work-study the default and (b) make the UBI a scholarship that pays for it, without precluding making more of an income on top of that. At least the UBI level puts a floor under things, meaning lots of jobs building OMRs or whatever futuristic \"monstrosities\" (a term of endearment in this context). We already have the pattern in our socialist military, with base campuses.\n\nBut no, the screenwriters can think of nothing better than a scorpions in the jar scenario, between old laser eyes Biden (out for Maga) and Orange Jesus (Maga King). What a weird cartoon, eh? And yet they say I'm the one who's bizarre? Tell me about it bozos.\n\nHaving more mayors weighing in and doing Zoom (or other) calls, with cable and streaming both allowed, would boost a sense of camaraderie among municipalities along with a healthy sense of competition. \"What are you doing about the house-less\"; \"I dunno, what are you doing?\" and like that, but more substantial maybe, less Planet of the Apes.\n\nOK, so that doesn't sound like a credible option to you? It was just an example, an exercise in imagination.\n\nWhen I got to Manila for the rest of high school I was surprised to find some of the dominant corporations were fielding the sports teams on television, meaning the companies themselves were fielding teams, not just sponsoring them with lots of decals. \n\nThe Royal True Orange company, which likely had a parent I'm not remembering, had a team called the Pulp Bits. Their flagship beverage featured pulp bits in case that's not obvious.\n\nI've seen a lot of demonizing of the public-private partnership concept, on which my whole Project Renaissance was premised. By now I must have horns or something, given all the heaped scorn.\n\nGovernment would get out in front with the prototyping and research, in the nonprofit sector, and the donor funders would turn around and profit from the derivative products. Put that way, I'm guessing many readers will think \"well, that's hardly a new idea\". Exactly right. The military uses it today.\n\nI was gratified to see Bonnie making so much room for fat pipes between our school of thought (Bucky Fuller informed) and the General Systems Theory literature (GST). I've been milking that connection myself, as some of you know, but it's always heartening to find others who appreciate the continuity here, while roping in Gregory Bateson in the process.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}