{
  "id": "7881102919381909022",
  "title": "American Dream",
  "published": "2010-09-23T16:44:00.000-07:00",
  "updated": "2016-08-09T12:40:04.723-07:00",
  "content": "I'm at American Dream Pizza (not eating, plenty of food at home), chauffeuring my mother to and from the hospital. She's in relatively good shape, enjoying better eyesight as a result of cataract surgery. \n\nGlenn wanted to share some of his most recent breakthroughs, extending his more-than-a-decade studies of what he calls his Global Matrix. Per Quaker thinking, it's given to each of us to distill a one-of-a-kind dharma or teaching that is that of God, the gift of a personal angle. \n\nThe upside is we have a precious and unique point of view. That's also the downside, as a \"private language\" is a kind of \"black hole\". The good news is also the bad news. There's still a lot of bandwidth though, for cross-fertilizing ideas -- what Wanderers is all about, so Glenn was definitely in the right place this morning. \n\nSam Lanahan joined us (a rare occurrence), along with the self-proclaimed mayor of Bonnie Slope (a privilege). The room was actually packed.\n\nLet's see how I might map Glenn's thinking for Synergetics readers (yeah, right, pile the esoteric on top of the esoteric and see if that helps -- sometimes it does).\n\nPicture two unit-radius spheres, just touching. Each is a \"complex space\" inside, meaning we have operational models for thinking about [quaternions](http://www.4dsolutions.net/ocn/oopalgebra.html) (Hamilton) and octonians (Graves, Cayley).\n\nThe symmetries inherent in complex number space (which he links to Lie Algebra) give us polyhedra, [the figurative hallmarks](http://www.mathforum.org/kb/message.jspa?messageID=7227315&tstart=0) of spinnability (+2) as well as concavity/convexity (x2). \n\nThe paired Platonics and their derivatives occur in both of these \"kissing spheres\" which have a \"fixed point\" singularity where they touch.\n\nThe Lorentz Attractor enters in (a butterfly with tilted wings) along with personal biographical data: some time studying languages, cracking codes for the NSA, followed by a lonesome Arizona vista, developing a system in solitude, with repeated visits to the Big City for reality checks (quantum logic courses at PSU, Cascade Systems Society, Wanderers). Or to the Santa Fe Institute, for a two hours session [with Stuart Kaufman](http://controlroom.blogspot.com/2009/04/reinventing-sacred.html) lo those many years ago.\n\nI'd characterize Glenn's talk as a nutritious meme soup, a hefty stew.  He's a craftsman and whereas homemade mnemonic structures may not be the norm in academia, that's no reason to clamp down.  We've not had many centuries in which auto-didacts were in a position to share their art, when the content was most germane to the \"upper classes\" (so-called).  Times have changed.\n\nDuring the conversational period that followed I managed to get Sam's OK to show his book around. He and Buzz looked at the new eCommerce pages that make Flextegrity components available to the world. Bill Sheppard read aloud from Carl Sagan's book regarding the stellar and pivotal role played by the Paulings, in getting atomic bomb testing partially criminalized.\n\nI thank Trish for patiently enduring a tour of my blogs, as I explained some of what my life has been like over the past year or so, with special emphasis on the poster art of one James Jameson.\n\nYesterday I formed some paragraphs for the Quakers attempting to set forth more of the Food Not Bombs philosophy. I'm hoping FNB helps me fine tune my rendering such that I accurately reflect the group's dharmas. I'll write more about that in BizMo Diaries sometime soon.\n\nSpeaking of FNB, my heartfelt thanks to Lindsey Walker for working on my bike at Bike Farm yesterday, hauling it in her trailer, along with boxes of food for a North Portland disbursement site. Aside from occasionally borrowing my daughter's, I've been cycle-less since Tinkerbell was stolen over a year ago.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}