{
  "id": "2132696826103354777",
  "title": "American Psycho (movie review)",
  "published": "2013-05-25T23:16:00.003-07:00",
  "updated": "2013-05-28T01:18:17.375-07:00",
  "content": "I came to this movie after already having seen three seasons of Dexter.  That put me in a position to see the latter as inheriting from the former.  Both have opening credits involving food, mixing the ideas of human flesh and meat.  Likewise the Christian Bale character, Bateman, has an ongoing internal monolog (which we the audience hear), a prominent feature of the Dexter series.\n\nI find it funny that Bateman differs from Batman by just one letter, Bale the player of both (how like Bateman is Bruce Wayne in enjoying urban luxuries and amenities).\n\nThis movie is about identity and how slim to none are the chances of having one in this world of suited clones.  We could be in the tortured mind of any one of them, a Vice President, feeling a kind of predatory power over weaker and meeker types -- yet these were the strongest reminders of Bateman's own sense of powerlessness and so he hated them, sometimes hunted them.\n\nDominance over others seems the only way to compensate.  Having the best restaurant reservations.  Having the best suit.  Business card.  Accounts.  The characters mistake each other for others and/or assume one another's identities, at least in Bateman's case, and how is his any different (he wallows in his supposed difference, the classic solipsist).\n\nThe tip off that we're living in someone's interior comes with the trapped feeling of closure, of not being able to come out with some \"secret\" as such, as it's a real secret only if it can be in principle confessed (told, shared).  As the Bateman rampage goes more extreme, reality fails to respond properly.  He gets to the point of lucid dreaming but not waking up.\n\nHe's getting away with too much right from the get go.  We're in a dream from the start.  He's an ego on steroids, the imaginary projection of some Wall Street dweeb, full of insecurities.  The ATM tells him about the cat in his arms.  Things have gotten ridiculous.  He who spends hours on makeup and body beautiful rituals, is haunted by thought pictures (day book doodles), just like any other VP in the Big City.\n\nThe emptiness of a lying facade is transferred to the television at the end and the masquerade that is Washington DC.  Reagan is on, the viewer veeps taunt, evince sincerity, dismiss, and otherwise go through the motions.  Isn't Reagan some king of the actors, a past president of the Screen Actors Guild?  Do we sense jealousy then?\n\nHe's apparently lying about some crazy stuff going on, wherein some secret war against people in Central America was being funded by sweet talk with Iranians holding hostages, and the White House just was not really tracking that well, improperly supervising the nuthouse.  Not that it's gotten any easier.\n\nBut given what we've just seen from Wall Street, who's calling the kettle black in this picture?  Talk about glass houses.\n\nWillem Dafoe plays a great foil for Bateman's rising paranoia.  As the detective investigating a disappearance, he seems to be circling in, forcing a tighter and tighter story amidst a panoply of lies and speculations.  We had just seen him the night before in Lynch-directed Wild At Heart, another horrific movie.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}