{
  "id": "1435665481580711916",
  "title": "Amortizing",
  "published": "2017-01-20T22:41:00.002-08:00",
  "updated": "2017-01-21T01:46:20.142-08:00",
  "content": "I was watching one of those reviews of Uber, where they try to talk a would-be driver out of the deal, based on various starting assumptions.  One thing people forget to do is continue discounting the value of what to them is valuable equipment.\n\nIn my case, for example, I have this creaky-old 2011ish Mac Air that's been my workhorse through thick and thin.  It has no health insurance.  I could send it in for refurbishing at some expense, but in the accounting world I'd have been creating a savings account based on the obvious need for a next computer someday.\n\nOK, so I'm thinking in that direction. All I need to do is slip in the ice one more time, as they say.  I'll be starting another class soon though and as long as she's still running (the Mac Air), I'm going to keep her on my desk. She's wheezing though. Her fan is off kilter. The severity of the wheeze comes and goes. I know it could get so much worse.\n\nSpeaking of loss, did I mention the fish that are going or have gone?  We decided the horse faced loach was a goner quite awhile ago, when he failed to appear even at the usual low frequency. More recently, my top-feeder has died. Lower temperatures may have been to some extent to blame. Fish don't last forever though. Turnover is built in to their design.\n\nAlexia is studying bookkeeping at the college level, having gained some practical experience working with her mother, Dawn, my wife and business partner.  She was good at accounting and really understood the clients she worked for.  She had already taken on another partner and split off the bookkeeping in a way that could continue, after DWA was reduced to a checking account.\n\nOne of the DWA aliases, registered with the bank so people could write checks to it, still can, was 4D Solutions, which I map to 4dsolutions.net on the web.  Behind my logo lives the Oregon Curriculum Network (OCN), which I consider my not-for-profit way of helping Oregon in particular.  It's not that anyone in particular has adopted [this material](http://www.4dsolutions.net/ocn/xtals101.html). I'm more just joining the throng of earnest scholars who took to the web, like fish to water.\n\nProbably my most ambitious project, considered as a business plan, is Coffee Shops Network (CSN). Under that heading comes a \"charitable gambling\" operation that converts winnings at games into charitable donations to the coffee shop's list of charities it supports. A donut company might give you the token, with purchase, to try your skill in some way, and then back up your performance with charitable giving on your behalf. You've won the right to commit the donut company's dollar to the cause you've championed.\n\nGST used to be about \"fundraising thermometers\" a lot, on the web. That certainly happened, in the form of Kickstarter, GoFundMe and all the rest. I've been pretty strong at predicting things, but that's what hindsight is good at seeing.  We get to be right about stuff.  We get to be wrong about stuff.\n\nTalking with Alexia about bookkeeping a little has reminded me of amortization as a concept. Lots is coming back to me. I also used to write about Global Data the corporation a lot.  Going back in time in my blogs gives some examples of that. The goal was and is to provide a lot of global data to the world, however in practice it's Google we usually think about.\n\nMy style of thinking is somewhat informed by those years looking at the Hunger Project and looking at some of the Fernando Flores stuff around that same time. His thinking was centrally featured at the 2016 Pycon here in Portland, when one of his students delivered a keynote. I'll insert my recent tweet about that.\n\n[@LorenaABarba](https://twitter.com/LorenaABarba) [@deg511](https://twitter.com/deg511) your keynote at Pycon2016 was excellent and I think back to it often. [https://t.co/d0AXtx4noA](https://t.co/d0AXtx4noA)\n— Kirby Urner (@thekirbster) [January 20, 2017](https://twitter.com/thekirbster/status/822267530005790725)\n\nHey, right on cue, as I write about things breaking or falling apart, my kitchen sink just stopped draining. After wrenching apart some pipe, I've discovered wherever the blockage is, it's below the standard trap. Not good. Especially with guests coming.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}