{
  "id": "5145382740902052029",
  "title": "An Evening of Meetings",
  "published": "2007-11-13T21:32:00.000-08:00",
  "updated": "2007-11-13T23:35:31.662-08:00",
  "content": "Our Python Meetup at PDX Cubespace was quite successful, owing in part to our sponsor, [Kavi](http://www.kavi.com/), who provided some first class salad and pizza.  We took some of the excess [za](http://www.urbandictionary.com/define.php?term=za) over to the PHP group, meeting elsewhere in the building, returning the favor from [last time](http://worldgame.blogspot.com/2007/10/ppug-cubespace.html).Our featured talks:  [ReportLab](http://www.reportlab.org/), simplifying development, [Django](http://www.djangoproject.com/), and myself on open source in medical research.My main point was to distinguish an open source process, which inherits from the liberal arts ethic (tipping my hat to [Robert Lefkowitz](http://worldgame.blogspot.com/2007/07/oscon-9-conclusion.html) here), from its fruits, which might be shared tools or standards.Engineers have a tendency to actually brand their stuff \"[open source](http://www.opensource.org/licenses/)\" these days, whereas the medical community has other shoptalks.To some extent, merging the expertise of our communities is an exercise in translation.Jeff clued me about some recent announcements from Google about its intent to make on-line medical record keeping more of a reality, with Microsoft making similar plans.  Thanks Jeff.The beer part afterwards was fun though I didn't drink any, sticking to champagne with orange juice (not necessarily any less caloric I realize).  I had some good basic conversations about SQL Alchemy, Postgres and so on.It's not my style to try to sound all-knowing in when geeks talk turkey.  On the contrary, I'm more like the guy who asks \"what's a turkey?\"Immediately following, I buzzed over to Wanderers to catch the tail end of Greg's presentation, but it was over already.  I enjoyed some informal banter with my cronies before turning in.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}