{
  "id": "9044583332933294358",
  "title": "An OCEAN of BS",
  "published": "2018-06-04T10:28:00.001-07:00",
  "updated": "2018-06-16T08:25:59.024-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/3890131554/in/photolist-rETEMR-oCevSK-bviRwD-9BjcKG-9s3TSF-6XAiwP-6VKWzG)\n\nI'm making a pun in the title.  [OCEAN](https://en.wikipedia.org/wiki/Big_Five_personality_traits) is / was one of those personality test thingies.  Dime store psychology books (thinking of Lucy, the Doctor is In) traffic extensively in these \"discover yourself\" batteries of questions, so-called surveys.\n\nAnswer thirty questions, and voila, the Machine Learning model lets you know all kinds of stuff about your category.  Better than horoscopes!\n\nI'm not saying personality profiling is sheer bunk, quite the opposite.  Over time, the analysts learn to recognize patterns.  Lets assume those surveyed are taking the test in good faith.\n\nIn some fairly convenient on-line venue, such as Facebook, between games of Farmville and that other one I actually played, one fills out some intriguing survey, an OCEAN test.  One's answers go out the back door to a paying Facebook customer.\n\nWhat especially pissed people off is the customer also discovered who your Facebook friends were.  How embarrassing.  Now they'll target everyone I know.  Pretty soon, we'll all be talking about [the Kardashians](https://en.wikipedia.org/wiki/Keeping_Up_with_the_Kardashians).\n\nThose of you up on your political layer gossip already know I'm talking about [Cambridge Analytica](http://mybizmo.blogspot.com/2017/02/keeping-tabs.html) and its supposedly awesome powers to tip an election.\n\nThe Russians were flattered they got 2nd prize, but the UK was not about to take a back seat in the psyops department.  When push came to shove, they wanted the world to know of their prowess.\n\nGetting the press accounts out there, the social media, is a big part of the game.  Consider Sophia, the AI bot who got to address the UN and make Saudis proud of their government.  Sophia would not have had nearly such a successful career without all that clever PR.  Yet she's nothing but an audio-animatronic puppet, nothing like the breakthrough Deep Mind game changer.\n\nSupposing the UK or the Russians have such an established social science that they're able to engineer an election almost legally, but for loopholes that Facebook may have closed in retrospect, is supposing a lot, but Hollywood movies have paved the way, for movie-goers to have a hard time assessing the true state of the art.\n\nIn an age when even Cubans are able to target diplomats with frequencies beyond the range of human hearing, sewing seeds of suspicion right when the technocrats wanted to dial back to making \"America\" a bigger bully, who knows what is truly possible?  Time travel is just around the corner, and those in the know harness UFO-derived technologies to... fill in the blank.\n\nYes, I'm saying I consider the public very gullible, for buying that psychometrics has advanced so far so quickly.  Advertising works, I don't deny it, but then advertising, media campaigns, are more than just a few TV spots.  You need a narrative.\n\nStart with the side show [Internet Research Agency](https://en.wikipedia.org/wiki/Internet_Research_Agency) based in St. Petersburg, its Fancy Bear staffers barely able to speak English (like [Guccifer,](https://en.wikipedia.org/wiki/Guccifer) but unlike [Guccifer 2.0](https://en.wikipedia.org/wiki/Guccifer_2.0)), then cycle back to center ring and realize true English speakers, like Cambridge Analytica and CrowdStrike still dominate the world cyber-game.\n\nRussians can't hold a candle to the truly tech-savvy, such as Dmitri Alperovitch ([Crowdstrike CTO](https://www.voanews.com/a/cyber-firm-rewrites-part-disputed-russian-hacking-report/3781411.html)).  How reassuring, right?  But wait, don't [The Americans](http://mybizmo.blogspot.com/2018/04/the-americans-movie-review.html) (deep cover spies in a fiction TV series) speak like perfect American?   Maybe we're not out of the woods yet!\n\nOn the positive side, we have evil Russians (connected to the cyber-caliphate and ISIS) maybe tilting Superman's election without firing a shot.\n\nThey promised us we'd be entering a world wherein cyber war and cyber weapons would be the new big thing.  As a Quaker, that sounded like a step away from [doofus muggle](http://worldgame.blogspot.com/2016/06/pandering-to-muggles-editorial.html) outward weapons, so I haven't necessarily put up a lot of resistance.\n\nLets make the endless wars all cyber for a change, more like the computer games we grow up on.  Given the hell hole in which we started, that'd definitely be big progress!\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh_mgUyN9ue_frLkeTPBDFYo04rMdV8wa0buLbYjB_cXj2SVwjM-k36DZXkBHKnPc9NGArKAmX6mlVgd2-peRYlfbV4WN_XL7e8JheRgmqQtjBe9IU7V9zM6m3prKnllX3X-_hL/s1600/fancybear.jpeg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}