{
  "id": "2600272312114537169",
  "title": "An Uphill Battle Lost",
  "published": "2023-03-22T07:17:00.000-07:00",
  "updated": "2023-04-10T07:51:36.603-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhz28VEvD4zjhLu5dlILsl7MfZ3lGhllP6CPBEjz9lUxldYYbJRW217mmY3OmfVLju6g66xpttMgkL6QEGgJ6xc-pd_rYu03ilv5OIF3TPRT_U_gFl34Xi-FehkWO2KZORosjgb9V4BJx34qtd1GPgw51x7SFokWwgXIvvEcP5E0eYkH5mFAA/s574/Screen%20Shot%202022-07-03%20at%201.29.25%20PM.png)I'm back to teaching about the various Python ecosystem tools (3rd party) in widespread use by various professionals studying data.  The course is called Data Analysis with Python.  My managers are in Türkiye.\n\nMy final uphill battle on M4W was about recruiting the math PhDs frequenting this space into taking some interest in Quadray Coordinates, and by extension more of the Bucky stuff.  No dice.  \n\nTo his credit, Andrius put some hours into it, but didn't appreciate dealing with its fait accompli aspects i.e. he wanted to recreate the apparatus from scratch (a useful exercise) but in so doing made different aesthetic choices along the way.  \n\nMy preexisting literature proved a source of irritation.  He gave up in frustration.\n\nQuadrays comprise what we call a \"language game\" in a philosophical investigation modeled after one of Wittgenstein's, into the foundations of mathematics.  What if, instead of the XYZ apparatus of six spokes from an origin, plus and minus i, j, k, we had four spokes to the corners of a regular tetrahedron.  Might we not span space the same way, with vector addition?  Yet all the points are 4-tuples, not 3-tuples in this picture, with no need for negative numbers in the canonical representation.\n\nHow does such an apparatus influence adjacent concepts, already caught up in XYZ thinking, such as \"linear independence\", \"dimension\" and \"basis vector\"?  Do we gain any insights into how these \"math words\" achieve their meanings?  \n\nMore specifically, I use the quadrays apparatus to motivate reader appreciation for Bucky Fuller's \"4D\" meme.\n\nMy incursion into the M4W space (M4W = math for wisdom), with all that Bucky Fuller related baggage, seemed like crowding to Andrius, who already has his own philosophy he wants to share.  He's not in the mood to tackle an alien (aka Martian) alternative.  So I'm taking the hint and fading back, but not disconnecting.\n\nIn the meantime, the geopolitical sphere remains tense.  I'm not a fan of Lindsey Graham's either, and got some quantum of solace hearing Scott Ritter vent is rage on YouTube, regarding the senator's absurd warmongering.\n\nAndrius did offer at one point that he had some psychoanalytic technique up his sleeve, though he didn't call it that, whereby he can shrink any psyche in terms of some 24 components, given sufficient profile information.  Is this like Myers-Briggs?  He mentioned he could perform such an analysis on Bucky Fuller, having earlier suggested Vladimir Putin.  I suggested he take up the latter first, so we might see what such an analysis might entail.\n\nOne of the side projects of M4W involves Andrius looking to apply his techniques and insights into reducing violence levels in Eastern Europe (Western Asia).  People call it a proxy war and some liken it to the District's support for Saddam Hussein's army versus the Iranian one.  This was before the District turned on Iraq itself, based on some misunderstandings.\n\nThis focus on ending the retro dark ages tank wars in the Donbas is partly what got me onboard in the first place.  \n\nBut then the W for Wisdom turned out to be more a surrogate for something else called \"absolute truth\" which turned out to be a complex set of mathy language games that take quite awhile to grok (like quadrays).  Bait and switch?  No, I think it's more a matter of needing to be clear with any new people coming in.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}