{
  "id": "1130963969882010660",
  "title": "Anchorman 2 (movie review)",
  "published": "2014-01-19T17:40:00.001-08:00",
  "updated": "2014-01-19T21:47:58.806-08:00",
  "content": "I started my afternoon thinking to watch Bronies, a new documentary about the subculture of mostly males who like My Little Pony cartoons.  But it wouldn't boot in my DVD player.  I watched a Ground Hog Day special feature I'd never seen instead, this DVD being in my permanent collection, then returned the bum DVD for a trade, which I'll review later.\n\nHaving returned to Movie Madness a second time, I walked on to [Horse Brass](http://controlroom.blogspot.com/2011/08/wardrobe.html), an Olde English Pub style place, and had some yummy beers while reading Willamette Week, about what it's like to work at Voodoo Donuts (well written) and some movie reviews.  One of the reviews persuaded me Anchorman 2 might be worth the price of admission and I was [at Lloyd Center](http://controlroom.blogspot.com/2011/05/cowardly-capitalism.html) faster than you could shake a stick, whatever that means.\n\nI was disoriented for whatever reason and stumbled into two cinemas showing different Disney cartoons ([Nut Job](http://www.imdb.com/title/tt1821658/) and [Frozen](http://www.imdb.com/title/tt2294629/)) before I finally found Cinema 1, as in One.  Anchorman 2 had just started.  The old team was getting together and heading to New York to help GNN take news to the new 24 hour format.  [CNN](http://controlroom.blogspot.com/2010/02/news-we-could-use.html) was to some extent the target, but also Fox in that the CEO was \"Aussie\", but closer to Crocodile Dundee.  Not much like Ted Turner either.  [Idiocracy](http://worldgame.blogspot.com/2007/04/idiocracy-movie-review.html) in general is a target... I started to snore (literally) during the later climactic scenes involving Jaws allusions (lots of shark footage).\n\nWhat the film reminded me to write about, however, is another documentary I saw while down for the count with a lung-related illness: [Évocateur: The Morton Downey Jr. Movie](http://www.imdb.com/title/tt1822381/).  Believe it or not, I don't believe I caught a single episode of this talk show, though I did see a few of Oprah's and Donahue's. This documentary chronicles better than most the arc of US television, at least in one of its dimensions. Moral:  don't smoke so many cigarettes, it's not even cool.  Quit completely if you can. The animation, which added a lot, reminded me ever so much of [Ralph Bakshi's](http://controlroom.blogspot.com/2006/10/american-pop-movie-review.html).  I used to live in Jersey City, which would be your stereotypical source of audience members (that show owed a lot to its audience, its level of participation).  Again, not really on my radar at the time (Universe being non-simultaneous and only partially overlapping).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}