{
  "id": "4860008956607720193",
  "title": "Animal Electricity",
  "published": "2008-05-05T23:40:00.000-07:00",
  "updated": "2015-10-12T11:49:10.659-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgwOgHCkYGjCbjgNXWOk_h7iX7EUyKFr3lAG14rZD1bBqdTa-mJ1xy7rW9gO15LA8nDTzgAPT7eQMLufIYpbQDazna7DGve2G2nT5qrZ6-S__oyfE8Pv85JL_3ZuCpWULHZHfNt/s1600-h/pauling_lecture.jpg)Tonight Tara and I bused downtown for a lecture by Roderick MacKinnon, a professor of biophysics. Then we checked out the Cinco de Mayo scene on the waterfront, rode the ferris wheel.\n\nThanks to Julian for the heads up on this Pauling Legacy Award Lecture.  Oregon State has been giving out this award biannually since 2001, for outstanding work in areas related to Linus Pauling's research in chemistry.\n\nMacKinnon, like Pauling, is an X-ray crystallographer looking at molecules, albeit bigger and more complicated ones, such as these ion channels within the cell membrane, devices for releasing positive charge.\n\nI was telling Tara on the way over that a good study technique, often better than taking notes during a lecture, is to just listen with rapt attention and do a recall shortly thereafter. I learned this technique from my Evelyn Wood Reading Dynamics course in the Philippines.\n\nTiny \"ion pumps\" chug away in the background, [fired by ATP](http://mybizmo.blogspot.com/2015/10/more-tales-of-cell.html), keeping all those cell membranes charged up like capacitors. A lot of calories go into keeping up that electrical tension.\n\nThe mechanical discharge of potassium ions, through these various types of channel, variously  activated, is like a \"wave\" in a football stadium, where people progressively stand up and sit down, causing a ripple along the nerve or whatever.\n\nThe storytelling was very intelligible and historical, tracing the evolution of our understanding of electricity through a lot of big names, Ben Franklin's included.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}