{
  "id": "397585090618647757",
  "title": "Animal Rights",
  "published": "2008-05-25T21:11:00.000-07:00",
  "updated": "2008-05-26T08:02:58.735-07:00",
  "content": "I've been exploring my [Quaker animism](http://mybizmo.blogspot.com/2008/01/lunch-in-old-town.html) more, on Synergeo of late.  Plus I was just over at Jimmy and Kim's, watching this documentary about Fridtjof Nansen, the Nordic explorer.  His team had to kill lots of non-humans to stay alive, and sometimes felt really bad about it, \"like we were committing murder\"  he says in his journal.But you can't technically \"murder\" a non-human, right?  I never got a degree in \"White Man law\" as some Oregonians call it, so I can't really say that I know the answer.In any case, legal representation for animals makes plenty of sense, not necessarily as advocates of their owners (who may be part of the problem), and not necessarily as pioneers of new rights, although that is an important function of cases sometimes i.e. to set precedents.Just get someone trained and articulate before the judge to speak on the nonhumans' behalf, not to moralize so much as to expedite reaching an equitable solution.In other contexts, humans lavish attention and care on their pets, treat them with utmost respect.  Horses in particular, get a lot of appreciation, for what they give back.But an animal shouldn't have to be \"pleasing\" or \"affectionate\" or \"a moneymaker\" to deserve protection under the law, principles already established in the case of we humans (I at least know that much from my readings in Anglo jurisprudence).Of course the logical objection to this view is \"who will press charges on behalf of a non-human?\" -- we don't have many rules for that.However, in the medical profession we have the role of \"advocate\" in the sense of \"looking out for\" or \"in the corner of.\"  Often a spouse or good friend plays this role, accompanies a patient on appointments, provides coaching and oversight, helps the patient navigate the system.I have no problem envisioning a prenuptial agreement in which the horse owner couple agrees ahead of time, that in the event of a messy divorce, the animals will have independent advocates, much as we already have from child welfare agencies.Non-humans and children have much in common, in terms of their suffering severely abrogated civil rights, a fact many have remarked on besides me.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}