{
  "id": "1676977822722290092",
  "title": "Animation Classes",
  "published": "2018-10-09T12:13:00.001-07:00",
  "updated": "2018-10-11T13:12:47.966-07:00",
  "content": "The curated clips of high schoolers walking out in protest, in the Michael Moore film [reviewed below](https://controlroom.blogspot.com/2018/10/fahrenheit-119-movie-review.html), gets me thinking more about possible high schooler lifestyles.  I'm thinking beyond such questions as to whether to arm the teachers.  I look at the role of firearms in other writings.\n\nLifestyle and curriculum content are not wholly separate, by any means.  Suppose you learn at home three days a week, visiting community school buildings less hours.  Does this make you a \"home schooler\"?\n\nMaybe some of your time is [in a studio](http://mathforum.org/kb/message.jspa?messageID=10168568) for making videos, doing [cooking shows](https://worldgame.blogspot.com/2009/09/community-kitchen.html).  Video editing, camera work, health and nutrition, kitchen procedures (recipes and algorithms), all mixed together.  Store the videos to the school server.\n\nNot every video has to go to Youtube.\n\nI'm picking up two animations classes this week, 2D and 3D, in two different schools.  We think in terms of age levels and running in parallel to existing curricula.  The early grades seem to be plane geometry intensive whereas later we go spatial?  That's a rough approximation.\n\nIn 1997 I attended the ISEPP-organized [Math Summit at OSU](http://www.grunch.net/synergetics/mathsummit.html).  There, I heard a talk by Dr. Keith Devlin encouraging more connections [between movie-making and calculus](http://mybizmo.blogspot.com/2018/10/tweening.html).  A tiny delta t is like a frame of film, encapsulating some action.  Literally, action per time frame, in mechanics, is mvd/t, which is energy units (E).  But then how fast is the film playing?  Enter E per t, or Power.\n\nIntegration means accumulating small differences as governed by the changing variable, the dx or dt. I think of how [Fibonacci numbers](https://mail.python.org/pipermail/edu-sig/2018-October/012024.html) are accumulative.  What [continuous curve](http://mathworld.wolfram.com/FibonacciPolynomial.html) fits those, I forget?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}