{
  "id": "5860893943920507552",
  "title": "Annual Session (Day One)",
  "published": "2015-07-16T07:24:00.000-07:00",
  "updated": "2015-07-31T19:59:42.668-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/19541227340/in/album-72157655634700169/)\n\nSince getting the [new air flow meter](https://flic.kr/p/v9k8t9), maxi taxi (1997 Nissan, doors dented cosmetically, right side), the ride has been smooth, not lurchy.  Carol and I left Blue House (as named within the [FNB namespace](http://mybizmo.blogspot.com/2011/08/business-cards.html)) around noon, making it to Spokane by about 18:30, with a stop at Cross Roads truck stop near Umatilla / Irrigon, right where I-82 hops the Columbia.  The Caesar salad was enormous.\n\nBarry (Wanderer) drives to Spokane often and talks about the windmills, which he doesn't like.  But then the pylons were there first and he's OK with those.   Notably, one sees none outside the Gorge margins.  The farmlands are still using hydro-power, from the numerous dams.  Actually that's an oversimplification as the windmills feed the same grid.\n\n[](https://www.flickr.com/photos/kirbyurner/19680739728/in/album-72157655634700169/)\n\nI'd not been out this far by surface vehicle for so long that the windmills were new to me.  I'm more used to the farmland ones along say I-70 / I-75 in IN, IL, MS or one of those.\n\nFriends (the Religious Society thereof) were born in the 1600s so lets call them Elizabethan.  In the times of Shakespeare and the East India Company's rise to global power, a man named George Fox questioned authority in a big way, and served to focus what a lot of people were thinking at the time.\n\nHow this sect got branded \"Quaker\" is a bit of a story, however this was a lucky break as any ad man will tell ya.  \"The rest is history\" as they say.\n\nAfter a period of persecution in which Quakers faced [jail time or worse](https://youtu.be/PhsvqbCIaAs),\n they become vogue, partially owing to their success in banking and \nbusiness.  By the late 1700s, Quakers were making tons of money, and \ndoing it [without slavery](http://controlroom.blogspot.com/2013/12/twelve-years-of-slavery-movie-review.html). \n The industrial revolution was in full swing, displacing human labor as a\n source of brute strength.  \"Brain over brawn, mind over brain\" might be\n our mantra.\n\nGeorge Fox, like William Penn, another big name Friend, has lots of stuff named after him, including a university (at least one).  Penn State is a whole state (Pennsylvania i.e. Billy's Forest -- no one called him Billy AFAIK).\n\nWe're sharing eating facilities with a large number of athletic young girls in the middle of summer soccer practice.  Women's soccer was huge this year, a bigger magnet for viewers of that final World Cup game than even the final playoff NFL game or whatever.  The US team trounced Japan's in the final round, wow, what a goal (I caught up later, despite my Facebook-registered intent to catch it live).\n\nLots more soccer players than Quakers so far, have entered the dining area, but then that's true world wide.  I hope they leave me some breakfast.  I'll add to this account after we hear from the Friend in Residence (traditionally, an invited guest gives the keynote).\n\nOh wait, duh, basketball, not soccer.  Actually seeing the balls was the giveaway.  Oh, and the shirts.  What was I thinking?  I'll leave the above paragraphs to show how I come to false conclusions sometimes (but I am also self-correcting, given enough opportunity).\n\nGood chatting with (in order of appearance): Clint Weimeister, [Dave Fabik](http://mybizmo.blogspot.com/2011/07/checking-in.html), Ethan Berleman, Chris Cradler, Eddy Crouch (we used to work with AFSC together) and assorted University Friends Meeting folks (Seattle), plus one guy from Olympia.  Chris's [Larry](http://mybizmo.blogspot.com/2007/08/making-rounds.html) will be flying out later.  Greg, their eldest is with the grad school in housing close to Institute for Advanced Study in Princeton, which I used to jog through a lot, when a student.\n\nWhat I'll call the Zen wing of Quakers is actually very traditional in eschewing theology, preferring to let each Friend fill the void with whatever experimental brain-chatter.  The more Zen-like Friends see theology as the bureaucratization of faith by a hireling priest caste.  Our Society started out by purging itself of any priestly hierarchy in favor of a [rotational self-management scheme](http://controlroom.blogspot.com/2007/12/management-by-rotation.html), based on clerked committees, both standing and ad hoc.\n\nHowever, women especially love theology and that gender has banded together to form a more theologically-oriented group called the Women's Theological Conference.  They had some PR (book markers) at every table here at Annual Session, advertising their 2016 event.  Our [WQM Mens Group ](http://worldgame.blogspot.com/2015/03/wqm-mens-group-2015.html)is hardly [that together](http://mybizmo.blogspot.com/2008/07/together-friends.html).\n\nSome brands of Friend actually do hire pastors, going back to the kind of outsourcing familiar to most \"[steeple house](http://controlroom.blogspot.com/2008/09/business-trip.html)\" Christians (as \"spin doctor George\" referred to the churches of his day, somewhat disparagingly).\n\nI'm in favor of the Zen wing breaking off from and/or distinguishing itself from Christianity as away of underlining its freedom from theological concerns, but then right away we [get into philosophy](http://worldgame.blogspot.com/2008/06/literary-investigation.html), so what's the difference?\n\nPhilosophy has more room [for Gnostic influences](http://controlroom.blogspot.com/2014/02/gnostic-musings.html) is how I'd put it (Gnosticism in turn inherits a lot from Zoroaster and Hermes T. both).  The Jungians would understand I think.  Zen is more a psychology and a philosophy than a theology, ditto the Quakerism I practice.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}