{
  "id": "4908772982829062166",
  "title": "Annual Session (Part One)",
  "published": "2008-07-18T09:40:00.000-07:00",
  "updated": "2008-11-15T02:35:52.936-08:00",
  "content": "I joined a friendly table marked for Bible Study, sitting with a nurse, a vet, and a student of Chinese.  I listened in on what Jesus had to say on the divorce issue, per those up on this topic.My input was North Americans are mostly not married in the Biblical sense, given how different the culture from anything so Middle Eastern in flavor.  On the other hand, many if not most North Americans are rather anxious to project themselves into those Biblical characters, so it hardly matters about the anthropology here, as it's the high caliber of the storytelling that counts.I also suggested maybe removing Leviticus from the Bible as too steamily pornographic, too triple-X, but I didn't sense much agreement for that.  Anyway, no one really plans to monkey with the table of contents at this late a date, so my talk was a tad on the idle side (Wittgenstein:  language on vacation).We also talked about bicycle helmets quite a bit, about whether Oregonians were becoming more lax about using them, more like Floridians in that sense.Leviticus could maybe be made into a cartoon, like by [Ralph Bakshi](http://controlroom.blogspot.com/2006/10/american-pop-movie-review.html) or someone, probably already has been (like I'm not an authority on things Middle Eastern).There was a run on the coffee, with OSU staff realizing we're fiends for this drug of choice (Beanites ya know).Then Sarah and I then sat outside, talking about the [good old days](http://worldgame.blogspot.com/2006/09/more-about-quakers.html), about Dawn, [about karma](http://worldgame.blogspot.com/2005/04/bumper-sticker.html), about our spiritual journeys.The economist in the golf cart (a designated driver) thought NPYMers were becoming too much like ordinary Americans in wanting to \"do business\" in a plodding fashion, as if a mere $40K budget were anything worth more than a CEO's sneeze -- yet here we were, making it the business of all adult attenders, complete with auditorium and microphone, blech.I recounted the oral history I'd learned, which is that [NPYM](http://www.npym.org/) split off from [PYM](http://www.pacificyearlymeeting.org/) a couple generations ago precisely because the latter had grown too stodgey, was too caked with cruft (i.e. \"business\").FGC is more the role model here, in terms of focusing on the spiritual aspects of our Society, although we'd prefer to have our own event, aren't members of [FGC](http://www.fgcquaker.org/).So maybe we'll manage to take back our (sub)culture? The numbers are against us it seems.Larry, my [Bridge Pedal](http://worldgame.blogspot.com/2005/08/bridge-pedal-in-rear-view-mirror.html) pal and small airplane pilot, was planning to fly down for this meeting, arriving this morning, but still needed a ride to the airport.  I hope he found one, as it's a beautiful day for flying.Diane gave me $6 found on the floor near where I was sitting, given her by another honest friend.  It was probably not mine originally, so I used it in the Quaker book store on behalf of my NPYM [Interest Group](http://worldgame.blogspot.com/2008/06/literary-investigation.html), purchasing Pendle Hill Pamphlet 395:  Walt Whitman's Spiritual Epic by Michael Robertson, with $1 to spare for the Wanderers coffee fund.This is Tara's first year as an NPYM Teen, having graduated from Tweens already (time flies).  Andy and I discussed the nomenclature around these age groupings.  He prefers \"middle school\" versus \"high school\" as more descriptive, less ambiguous, than than \"Central\" versus \"Junior\" Friends (context matters).  Andy clerks our Teen Program back in Portland, whereas starting this month I'm more an \"adult ed\" kind of guy (as in [No Adult Left Behind](http://mathforum.org/kb/thread.jspa?forumID=206&threadID=1394506&messageID=5669653#5669653)).[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjo4k09bOFOSk4cfkNJSsczShIB5I_9BJeYkwC5Z7knfdMfNcrbdg9jBhda6_vFv-KMydp2qtIhByPGWjNT8h0svbNTKNRdRhKTw-skWHFJvNDdXX1iAT2V1vrwuBpSKZfq6Cky/s1600-h/p7190041.jpg)mom with FCNL lobbyist and Friend in Residence Ruth Flower",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}