{
  "id": "115721896235463012",
  "title": "Another Kinetic Saturday",
  "published": "2006-09-02T12:06:00.000-07:00",
  "updated": "2006-11-15T11:44:25.736-08:00",
  "content": "Lots of crazy pool happening today:  Portland Knowledge Lab is slated for an upgrade, so Tara gets the hand-me-down, which is already way better than any of our desktops @ home (some [HP multimedia jobber](http://mybizmo.blogspot.com/2006/09/back-to-school.html), gets it done); jet traveling family members; likely BBQ; coffee with Derek; laundry to do, other chores (some of them manly).Summer is turning to Fall and these last high-80s sunny days should be appreciated.  I'm not really looking forward to firing up the basement furnace and burning a ton of fuel oil to keep this place warm (a large tank sits under the driveway, semi-full of the Montag brand).  Maybe we'll come up with an escape route (what airlines allow O2 I wonder?).Last night: the initial [Invasion](http://www.imdb.com/title/tt0460651/) DVD, plus I taped and watched Danny (as we tend to call him in this household).  Quite the pile of televisions, not to mention a stellar career.  Bob too was fantastic in that role, with that style.I'm drawn to the [Jack Daniels](http://worldgame.blogspot.com/2006/03/returning-to-pdx.html) tasters for an analogy (they've had about the same number so far).  It must be really tough to just \"sip\" and not drown, given all those stories coming at ya, 24/7 365/365.  CBS has quite the control room, as well it should, being one of the oldest in the business.I'll add as a footnote that our reception ain't the best on local affiliate KOIN 6, because we get a ghostly broadcast signal (I think through the sensitive tuner) just a few seconds ahead of the Comcast cable feed, meaning we're always looking at \"the near future\" as a faint overlay.I know that sounds as metaphorical as all get out (clairvoyance?), but I'm speaking quite phenomenologically here, have it on tape.  However this glitch in no way interferes with my ability to appreciate the content, in my judgment.  Just don't consider me an archivist of record for this stuff, given its not-industrial-grade quality.Yep, lots of anchor action at CBS these days.  When they do the look back for [Couric](http://en.wikipedia.org/wiki/Katie_Couric), they shouldn't bleep over her [stint as a fish](http://www.imdb.com/title/tt0307453/) (also played by Nicole Balick in the [VG version](http://www.imdb.com/title/tt0457469/)).I'm glad to see FEMA is taking itself [more seriously](http://groups.yahoo.com/group/synergeo/message/28800) these days, post Katrina -- and it's not just hurricanes we try to plan around, out here in the Pacific Northwest (not just forest fires either).[](http://photos1.blogger.com/blogger/1134/545/1600/P9090091.0.jpg)detail:  school mural",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}