{
  "id": "113797344931592552",
  "title": "Another Quaker Story",
  "published": "2006-01-23T10:09:00.000-08:00",
  "updated": "2006-11-15T11:44:14.846-08:00",
  "content": "Bruce Kaad was over today, another [Ken Wilber](http://www.kenwilber.com/) fan, to pick up a ream of thank you letters going out to Friends and affiliated donors who'd been kind enough to kick in.  I used Microsoft Word and Excel to do the job, plus this Brother MFC-8820D, a truly excellent piece of equipment.Bruce is Treasurer of MMM, an uncompensated, rotating position, filled by nom comm through a clearness process in Business Meeting (technically another form of worship).  My wife is their hired gun, [TBC](http://bookkeepingcollaborative.org/) priestess of nonprofit books (the web site currently sports an Hawai'ian theme, an ironic lament given our rain forest weather (I'm not really complaining, much as I love Maui)).We're expecting visitors from the Bend area, other side of the Cascades.  Portland, as you know, is where the Willamette meets the Columbia, in [buttes](http://www.answers.com/butte&r=67) to the south (Mount Tabor, for example, but a short walk from here).  We serve as a major sea port, though nowhere near as major as Seattle / Tacoma. We're not a very large city, are the biggest in a chain of cities and towns stretching further south along the Willamette:  Salem, Albany, Corvallis, Madras, Philomath, Eugene.Our principle exports are technological in nature, which is why the moniker Silicon Forest (as distinct from Silicon Valley).  Our Hawthorne district saw the birth of such giants as Tektronix and ESI.  The latter company inherited a [first facility](http://mybizmo.blogspot.com/2005/09/planting-seeds-in-silicon-forest.html) from Jantzen (swim suit company) and then passed it on to Quakers when required to move.  [Doug Strain](http://worldgame.blogspot.com/2005/08/wanderers-2005830.html) was a big part of all that.Another regional headquarters for high tech would be Spokane and its Gonzaga University.  That's the home of [Cyan](http://www.cyan.com/company.php), makers of the classic Myst series, and Uru.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}