{
  "id": "5161704996028142327",
  "title": "Another Debate",
  "published": "2010-01-05T19:58:00.001-08:00",
  "updated": "2010-01-06T10:30:02.808-08:00",
  "content": "This is actually Wanderers 2010.1.5, if you're flying that airline, however I'm more the Martian this evening, coming late, leaving early.I've got the client laptop, so had to remember the pass code (WEP).  Bill Sheppard gave me a clue.  I asked in pen on a postit (sticky 3M) so as to not interrupt proceedings, which is all about systematic errors in GPS readings, Mt. Hood guy, lots of listeners.You need a minimum of two systems if you're going to prove the errors are systematic in the first place.[This debating coaches web site](http://debatecoaches.org/wiki/index.php?title=Georgetown_Day_%28DC%29_-_Alexandra_Evans_%26_Mia_Kunst) is interesting to me; I forwarded it around.  This might explain some election shenanigans?  \"Drill baby drill\"?  Was that Exxon or what?Barry:  an under-ocean DC line across the Bering Strait would never work. You'd need 10 feet of insulation plus there's nothing but wilderness on both ends.  He also despises windmills as flaky and loud, ecologically destructive (too many roads).  I also wanted to ask him for an opinion about [thorium reactors](http://www.cosmosmagazine.com/node/348/) -- some other time perhaps.Trevor has some great new information, such as show times in WDC, for the D.W. Jacobs play about Bucky.☂ D. W. Jacob’s play R. BUCKMINSTER FULLER: THE HISTORY (and mystery) OF THE UNIVERSE will be [performed](http://www.arenastage.org/season/09-10/the-history-mystery-of-the-universe/) May 28 - July 4, 2010 at the Arena Stage Crystal City in Washington, DC.  Doug tells me: “Crystal City has put out an international call for artists to create outdoor works of art around Bucky themes and concepts, etc.”  More information available from the [Arena Stage](http://www.arenastage.org/).I'm to meet with Trevor tomorrow, have some ideas to run by.  Our Private Undercover Party motif, developed through Duke's, might be just the ticket for a [teaser / preview of Tetrascroll](http://www.flickr.com/photos/17157315@N00/3483595185/) (a cosmic fairy tale).One of our Cascadia Wilders is relating her experiences with little handheld GPSs, what happens when a satellite goes goofy (because setting).  The more satellites the better, but you'll get sucky readings if the alignment is bad.  You need to know how to read that.  Digital math, an outdoor sport (sometimes) is / was gonna do that for ya.  In Alaska maybe?The client laptop is Windows7 with the latest Office.  Word is way different.  I spent the evening adding drop shadows to those two of Koski's, showing vZome with twisted greens, courtesy of Dave Koski.Aldona just walked in, armed with info on algae (a potential fuel source -- so much more space efficient).  Good seeing her.  Steve Mastin, Jon Bunce... some people I don't recognize.  That guy looks like retired brass, an unusual species in Portland -- I could be wrong.  Anyway, he looks familiar.  I'll call him Bob.The debaters seemed pretty certain that WDC was remiss in not accepting the offer of technical assistance.[Trevor cites Bucky](http://www.synchronofile.com/?p=357) in Playboy suggesting [homosexuality](http://mybizmo.blogspot.com/2007/09/more-ethnography.html) might be one of those gentle taps on the brakes Malthus favored, a godsend.  [Apocalyptic types](http://mybizmo.blogspot.com/2008/09/wanderers-2008930.html) prefer oblivion to utopia so they can say \"I told you so\" though.The new translation of Wittgenstein replaces Anscombe's \"queer\" with something different, even though that's what she heard, in English. Is this improving her translation or copy editing?  [Sean is right to ask the question](http://groups.yahoo.com/group/WittrsAMR/message/1367), even if it's much ado about nothing.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}