{
  "id": "7906700920437058437",
  "title": "Ant Works",
  "published": "2024-10-29T07:30:00.005-07:00",
  "updated": "2024-11-01T07:21:54.739-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhSSPc5WIhP7MO2D6E3FSUIh7AMk9wte0Gp7Jgort3V2hSkYDS8OkaNtG_yNkhOq21XJFnu6pT5mB6JhuXSKhcdBupl58tk16IUR3wC7PwrPHBDqB79FkeFRjDyXWbwrvAx7dFVWwLfqLCrU6QfY2hASxeFsu35anFj9BfppHEDu9xqvebD9khk/s1144/flappers_1.png)\nMy School of Tomorrow, in terms of curriculum, is not trying to be all things to all people. On the spectrum, it’s further from For Everyman (mainstream) and closer to Quirky Kirby (one guy’s take).\n\nFor example, in the course of learning more about Zelda Fitzgerald from her grandson, as his guest, I was constructing a mental timeline of that time between the wars, WW1 and WW2. H.G. Wells came to New York City for a confab on how to prevent further warring, post-WW1. \n\nHe’s writing in the first person, as a journalist on the ground, at the scene. He mentions his giddiness, the effect of being in a booming city, quite different from the mood in Europe.\n\nIn looking for something to quote from those writings, I came across his Empire of the Ants. That got me to reading and listening. He’d become friends with Joseph Conrad. Here we’re going up the Amazon to battle smart ants. Which takes me to ants more generally and the M4W “codacombs”. Ants, the many species thereof, is a core topic in that tunnel system.\n\nSpeaking of Zelda, what’s coming together is the graph connecting women’s suffrage, Dora Marsden, Prohibition, Art Deco, flappers, Great Gatsby, roaring 20s, H.G. Wells, feminism, Nick Consoletti’s mom, (a French woman who embodied independence — she comes later on the timeline). \n\nOrson Welles, Hearst, Homer Davenport, Silverton, New Thought, ETs, UAPs, science fiction, Martian Math… now add in all the Bucky stuff. We’re talking about a time period (the 1900s basically) consisting of partially overlapping world lines (time tunnels, scenarios).\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgxLc-avt02DpwiGrK3otTX_h1CnW41JpWDORmgpmUyid0pVnbTqwmVH4BGLBGpjB_Tjk_DxhDd1LRffZnKkJObvWcIt50CT8h0PymwvOkgQAMSAyK2x-U5i6CttNibdfHSUbiqjPeokHlk5cfPMQMU4rAb42sqiv74usv-Yc7ssP4-2_Y1wZTI/s679/Screen%20Shot%202024-10-29%20at%208.29.29%20AM.png)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}