{
  "id": "4405611395002857461",
  "title": "AntiRacism",
  "published": "2006-12-10T14:30:00.000-08:00",
  "updated": "2012-03-02T15:48:51.923-08:00",
  "content": "Scientific American did a cover story in December, 2003 questioning the dogma of races, zooming in to the genomic level, and finding genetic correlations among subpopulations, regionally mappable dispersions of this or that risk factor and so on, suggesting the \"race\" concept wasn't entirely empty.\n\nComing at it from [another angle](http://worldgame.blogspot.com/2010/12/close-to-solstice.html), the obvious superficial feature groups men hoped to capture with the Twelve Races idea (or was it Seven?), don't have any inherent genomic integrity, in the same sense that only twelve orders of a 52 card deck might be considered \"the pure ones\" -- except, of course, in some humanly contrived game of relatively fleeting historical interest.\n\nNature, however, escapes such easy schemata and gives us an exponential library of genomic possibilities, each specific human a checkout example from said digital library.  Presuming humans persist with this base template, a lot like King Kong's, the flexibility of our design will continue to undergo testing by the terrestrial and extra-terrestrial environments, with many new readings constituting a response.\n\nThere is no seven reading \"core syllabus\" from which all the others deductively derive, not really adding anything new.  This was the snobbery of the \"racial purity\" buffs:  they wanted to typify the archetypes while branding competing readings as \"mongrel\" i.e. tainted by degenerative impurities, ala [Dr. Strangelove](http://www.imdb.com/title/tt0057012/).  They feared a level playing field, needed this artifical bias twixt \"pure\" and \"impure\" to handicap the competition.\n\nSo yes, by all means lets correlate genes and risk factors, genes and other genes, following wherever the statistics lead us.  It's an empirical science and we have much to learn.  Making good on the promise of personalized medicine, wherein we craft unique treatments, depends on our getting on with these detailed genomic studies.\n\nThe science fiction layer was this \"just a few pure shuffles\" myth, which, even if nationally geographically based, isn't a good roadmap to the future, where inbreeding will likely reflect other proclivities, such as the desire to live with and raise other skiers, other specialized Olympians in one sport or [another](http://www.youtube.com/watch?v=bcu8ZdJ2dQo) (to take one example of humans forming voluntary affiliate subgroupings).\n\nLifestyle and ethnicity go together, with genomics along for the ride, a prehistoric substrate, still very relevant to medical science, but not especially useful to the various racisms, not really leverage or ammo for would-be [Ozymandius type](http://www.internal.org/view_poem.phtml?poemID=292) dictators over future breeding patterns.\n\nWe don't really know what all the interattractive ethnicities will be, have lost track already, there being even today so many from which to choose.\n\nRelated reading: \n[Re public education](http://www.mathforum.org/kb/message.jspa?messageID=5410940&tstart=0) @ Math Forum (December 2006)\n[Re teaching advise sought...](http://mathforum.org/kb/message.jspa?messageID=5459281&tstart=0) @ Math Forum (December 2006)\n[No Race, No Class](http://www.grunch.net/synergetics/terms.html#race) @ grunch.net/synergetics/terms.html\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh8BMo1HlZDYePsYchpu2GYJkOqUZ09PBghhu16yInfb506EPzP-2xxwp3JCW6tfFYcRvEytiqWV1H2h4bKky62oPFxLzqB4nHdZC-6Jv2WwPGDt7gY21Dy96UthuX_lJLboVZt/s1600-h/1203_cvr.gif)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}