{
  "id": "2793993333778682482",
  "title": "Anticipating Trends",
  "published": "2023-10-04T12:51:00.010-07:00",
  "updated": "2023-10-08T13:19:32.563-07:00",
  "content": "Fractal Universe (Mandelbulb 3D fractals)\n\nLong time readers know a lot about my strategy:  showcase field tested alternative curricula that reach out from a middle ground, which I call \"the high school level\" but which we might label the proverbial \"layperson's level\" even if they have a PhD in some NCR or exotic field. \n\nNCR = non-consensus reality (from Quantum Mind, Dr. Arnold Mindell). CR = consensus reality.\n\nThe high school level \"middle ground\" (cite \"radical middle\") is our best attempt at a CR, a shared  framework, an orienting mythos. In US history, we learn about the wars, revolutions, breakthroughs, transformations. We learn how we became a Nation of Refugees.\n\nMixed in to my amped up high school (which features Eagle Scout level challenges too, for any genders that want to attempt them) are positive futurist memes from our best 19th and 20th century thinkers, science fiction writers etc.\n\nFor these alternative curriculum streams to become better established, they need feeder creeks and rivulets, per the fractal nature of a river basin ecosystem. \n\nFeeding into my curricula are some exotic components that have become the focus of a few PhD'd devotees, here and there.  However we're not so \"degreeist\" as to insist on only Doctors of Philosophy doing the torch passing, meaning my School of Tomorrow's esotericists come in many flavors.  We've been influenced by software engineering, a field that advances based on inputs from practitioners in many walks of life.  We get lots of polymaths and autodidacts (\"comprehensivists\" in CJ's terms).\n\nNote: I've distinguished between esoteric and occult elsewhere. Given etymology, I consider occult disciplines to be those employing deliberate deceptions or at minimum some level of cryptography. Even your average shoptalk is a code language of a kind, which may lend an aura of cultishness. \n\nBut esoterica may simply be difficult to master, such as an athletic skill.  Professional trades may be esoteric yet traffic in ultra-clear training materials, with apprentices and everything i.e. there's no attempt to conceal.  I concede there's a spectrum.\n\nAn example of \"esoteric\" would be our inclusion of the Mandelbrot Set in the complex plane, where said plane is itself at the outer fringe of high school mathematics, conventionally. \n\nPublicists for said Set are into promoting and promulgating, not keeping secrets, yet the prevalence of calculator-based arithmetic, the paucity of array-based programming driving colorful screens (displays of the Argand Plane), works against these evangelists for Fractals in high school math. Mandelbulbs too.  \n\nLet's not forget middle schoolers. We don't need to postpone enjoyment of the aesthetics, until we get there in computer programming.\n\nAnother example of \"esoteric\" is all the time I spend with Pascal's Triangle, collecting threads already prevalent in the literature, but making sure the idea of a Grand Central Station gets a boost.  \n\nSome ideas keep being a destination, and Pascal's Triangle is one of them.\n\nThis probably all sounds fine and good but where is \"curriculum development\" and \"curriculum design\" in any national debate? We had a would-be Education President in the person of Bush the First, with Bush the Second more of an Alfred E. Neuman type character. We entered a \"for dummies\" idiocracy as time went on, with presidents more often than not in clown face mode.\n\nWe have high school teachers quitting their profession in droves (and telling us why on social media) with a sense an impossible level of performance was being market-demanded from them. Too much for too little, with others greedily piggybacking, not hoeing their own rows.\n\nHealth care workers feel the same way, on this first day of the Kaiser walkout (one of the biggest labor actions in US history so far).\n\nWhat we have in current debates is \"student debt\" and whether the lifting of the temporary stay on repayments, during the covid pandemic, is going to make some things go snap in the night. What camel backs will crack?  As Emily Jashinsky pointed out recently on Breaking Points, many took the social cues seriously and went for the four year degree, but on a speculative basis, betting their incomes out the other end would make this Faustian bargain well worth it. \n\nBut what if said four year curriculum were deficient in positive futurist memes?\n\n\"Positive futurist memes\" are among the most esoteric, as standing back from the human melodrama long enough to get a cosmic background for context, is not necessarily an easy task, especially when light pollution deprives so many of any literal look at the Milky Way galaxy. Out of sight, out of mind. We pretend that the loss of a cosmic context has no effect on our guidance systems. For how long will we deceive ourselves along those lines?\n\nSo what we're expecting, but can't predict for a certainty, is that debtors will look for cracks in the walls of their financial prisons, and will find fault with the lack of context they were expected to go forth with. \n\n\"Making money\" stops working if \"making sense\" doesn't underpin its value. How do Economists make sense of keeping up with payments on the national debt, in the trillions? And do this even while fighting major wars and providing entitlement programs to those who fight them and/or proffer their allegiance?  \n\nDo militaries ever go on strike?  Is that what we call a military coup? Did getting a four year degree come with enough problem solving skills to address these questions?  How about eight years then?  That's a lot of debt to pay back though.\n\nWhen the pendulum starts swinging the other way, it will become more about investing in our shared future and our young people especially. Instead of saddling them with debt, we need to give them a boost. What positive futuristic memes might we smuggle into our high schools for that to happen, past the miserly Guardians of the dreary status quo? Did they teach us the right stuff?  What was missing?\n\nTo make obvious how much you feel ripped off, show how much you welcome these new alternatives. Don't encourage further enrollment in the very institutions which failed to prepare you, for your life in the real world. Unless, that is, these very institutions demonstrate some dawning awareness of the \"right stuff\" and how to share it. \n\nMight there be some UBI (universal basic income) involved?  Pay me to learn Spanish, Russian... Japanese. Pay me to learn, in the form of immediate rewards, such as nutrition and a place to stay, even if not with cash. If I study biology, give me access to microscopes. That's what the military offers: a form of socialism. Universities aren't that different.\n\nWelcome to the Global U.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}