{
  "id": "4480746091936745846",
  "title": "Apollo Project",
  "published": "2017-02-06T11:20:00.000-08:00",
  "updated": "2017-02-06T19:36:13.673-08:00",
  "content": "If rumors are true, that US president Trump has appointed a moon landing denier as a science advisor, then I say hallelujah.  Whether the moon landings were a hoax or not is what the young people on Youtube want to talk about. Most of them were not alive at the time, and have grown up in a world of pretty realistic CGI. Add grainy television, covering over any gaffs, and wow, what a way to save money, when we finally \"go to\" Mars, right?\n\nMe? I'm still a true believer, think we saw Apollo unfold pretty much as advertised. But that's not the point, what I think. Do I wade in with my hours of rebuttals? No. Am I glad to see the US government reflecting peoples doubts? Yes.\n\nWhat may be closer to the truth is Apollo is the new stand-in for Nine Eleven, which is still fresh in our minds and the topic of so many Youtubes. Every theory is a conspiracy theory, no matter how you cut it.  In an age of Photoshop and CGI, of course the public is eager to debate what might be agreed upon, that's their right. Having seen Hunger Games, \"false flag\" is on everybody's lips.\n\nYes, I'm aware that some people might be holding their breaths for full disclosure about UFOs. DT will demand a thorough tour of Area 51 and then tweet about the frozen aliens.  As many adults have forgotten how many of their peers entertain such possibilities, as never knew in the first place. At least letting us know what's out there, in terms of belief systems, should be the State Department's job, not just National Geographic's, or the FBI's.\n\nI'm reminded of a cocktail party conversation yesterday, with a student of cults, which doesn't mean she's not also a practitioner. She's not one of those who studies something with an eye to wiping it out. Most cults don't have that long a half life to begin with, as they revolve around specific personalities, which come and go.  Once a cult lasts long enough, or gets big enough, it qualifies to be a religion. That's how we think in Asylum District.\n\nLets talk about the cults and acknowledge them, not sweep them under the rug. But then some holier than thou \"at least I'm not in a cult\" might be more of a namespace issue than anything.  import this. Python joke.\n\nMy point being, cults are frequently characterized by how they grapple with the big conspiracy theories of our day, and do they sustain their own.  What stories do these religions, or mini \"designer religions\" tell?  How much scientific scrutiny and/or skepticism will they tolerate?  The answers vary case by case.\n\nIf there's an inner circle knowingly keeping a detailed truth from becoming public, that the moon landings never happened, then that's a cult, and a powerful one, as I'd say most of us were successfully fooled (as I said, I'm still a true believer, partly because actually going to the moon might have been easier than pretending it were doable). Where and how? It's one thing to say \"it's a trick\" and quite another to know what the trick was.\n\nWhat makes these debates so interesting are precisely Apollo's archetypal attributes as a chief of rationality. He marched into Delphi and took over the oracular franchise, banishing and in some accounts slaying the old Python that used to run the place.  The rationalists had displaced Athena by some accounts, a direct offspring of Zeus. Or had they?  These battles stay eternal in some dimension.\n\nWere a major achievement of the rational mind, namely the moon landings, named for its icon, to morph in retrospect into something more occult, dead ending in the murky realm of PR and special effects, then Western Civilization, so called would be charting a new course with respect to the Greek pantheon.  Youtubers sense the high stakes and resent how \"mainstream media\" doesn't let them participate except as viewers.  Adding to the ranks of talented producers might be the way to hang on, if you're a more traditional broadcast network.\n\nPut another way, I think the lameness of the NIST response to pressure in the case of Nine Eleven has greatly lowered peoples tolerance for suspended disbelief. They feel deceived, even without knowing what's true. That sensation rubs off on Apollo, casting shadowy graffitti across his pedestal. \"If we can't believe you about Nine Eleven, how can we believe you about Apollo?\" is the question that's being asked.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}