{
  "id": "4169521256725928109",
  "title": "Approved:  Long Distance Membership",
  "published": "2013-05-19T16:05:00.003-07:00",
  "updated": "2014-10-28T17:34:46.007-07:00",
  "content": "Multnomah Meeting took an important step today in accepting a request for membership from a person who lives in closer proximity to other Meetings than ours, in another country.  This made the request somewhat different from that of a would be Isolated Friend, where local meetings do not exist, by definition.\n\nWhat is established by this move is a precedent whereby [Oversight](http://worldgame.blogspot.com/2012/03/considering-nomenclature.html) is empowered to usher through membership requests, minus the criterion that everyday attenders and/or members of the Meeting need to be able to visit with and/or serve on committees with X before X's membership is considered and accepted (or denied).  Perry recommended that our Faith and Practice be amended accordingly.\n\nRather then give [average attenders](http://worldgame.blogspot.com/2012/09/attenders-to-spirit.html) equal opportunity to meet X, it is sufficient for a smaller group within the Meeting to proffer a recommendation of membership and to go through a seasoning process, whereas for many in the Meeting, the person is \"sight unseen\".  This precedent could be useful if the prospective member is in prison for example (e.g. [Chelsea Manning](http://www.chelseamanning.org/)) and cannot be expected to travel to Portland, Oregon.\n\nAnother important precedent associated with this membership was our preparedness to accept X as a Quaker, a person within the Religious Society of Friends, with or without membership in a specific Monthly Meeting.\n\nAs someone privy to the Oversight meetings, I can attest that those who were most concerned that membership be primarily a geographically based institution were prepared to say denial of membership in Multnomah Meeting did not constitute a rejection of the claim that this person was already a Friend based on other criteria besides membership, and indeed the Oversight Committee was prepared to embrace X as such even if the business meeting had accepted its recommendation to stress geographic criteria and deny membership (for now, unless / until X relocated to Portland). \n\nHowever, this last point is hardly a dramatic shift in policy as we have increasingly come to see the institution of membership as but one way among many to signify one's commitment to the Religious Society of Friends.  To become a recorded member is to manifest a type of team spirit that not all Friends may choose, perhaps because not living close to an ideologically compatible Meeting (although if other meetings follow our lead, this may become less of a barrier).\n\nAs I wrote in my internal email to Oversight and shared later with Anne Hyde:\n\nMembers are telling the world that they \nwill not hypocritically and unaccountably contradict themselves and say \nthey're NOT a Quaker, e.g. if the going gets rough and Quakers seem more\n unpopular in some circles, for their unwillingness to countenance \nslavery, or dropping bombs, or whatever.\n\nIn becoming a member, one is publicly and in a communitarian spirit,\n saying \"I am a Friend\".  In contrast, someone who does not choose the \nbadge of membership is freer to do like Peter and deny his friendship \nwith Christ.  \"Are you a Quaker?\"  \"I attend, but am not a member\" -- \nthat's an \"out\" (a distancing) you don't have if you've publicly \nrecorded yourself as a member (in a \"world readable format\" as we say in\n these days of the Internet).  \n\nA member is publicly demonstrating a level of commitment.  \n\nNon-members\n are free to demonstrate a high level of commitment in other ways of \ncourse i.e. membership is not our only measure / criterion whereby \ncommitment is measured.\n\nPeople often compare it to marriage, \nversus simply living together and keeping whatever vows / commitments \nprivate.  Membership is more like a public vow of loyalty, though I \nwon't say oath.\nNow that we have \"membership at a distance\", I think the doors are more open to geographically distant individuals to enjoy membership status, even where Quakers and Quaker meetings are close by, but are perhaps of a different lineage or tradition.\n\nThis freedom gives individuals more ways to customize their membership, by possibly choosing a \"home base\" that is not close to one geographically, but does seem closer psychologically.\n\nIn the age of cyberspace and Cyberia, it stands to reason that distance is less of a factor.\n\nFrom Oversight minutes from our last OC meeting (before today's Meeting for Business):\n\nKirby emphasized the institution of membership could be designed differently to permit long distance affiliations, and that we were somewhat closing a door. \nThat door is now open more widely than ever before.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}