{
  "id": "5086910409249081704",
  "title": "Archiving Stuff",
  "published": "2018-08-23T12:53:00.002-07:00",
  "updated": "2018-08-23T12:57:00.719-07:00",
  "content": "A followup remark to the post below:  business English is going strong and \"Amerish\" (emphasis on \"mer\") was Gene Fowler's moniker for the not-actually-English the Americans have going.  Both of these might co-exist without the LAWCAP emphasis on the King (some private person) owning everything by default.  We shall see.\n\nI'm using Cyberduck FTP client to suck down a snapshot of my 4Dsolutions.net website, which has some unused (unserved) content.  I'll probably stash this 255 MB to a thumb drive for safe keeping, but then how \"safe\" is a thumb drive in the rough and tumble of someone's personal collection? \n\nAs I work on tying off loose ends, I think of Kenneth Snelson and how disciplined he was about archiving.  If our correspondence survives, it's likely thanks to him more than me.\n\nThe plan to warehouse a lot of my stuff at one of the schools is an attractive possibility, as in that context I could let go of a lot of it.  I'm also storing for others, mostly in my garage, but also in the basement.\n\nMel and Lindsey used to live in the basement (as house guests, not renters), per a previous chapter.  I have mostly Mel's stuff by now, and a box or two from Sunanda.  Lindsey did a good job cleaning out when she moved to Corvallis.  I keep her altar going in the back office.  Mel helps tend my altar for Dawn when they swing through.  I've lost touch with Micheal S. (that's how he spells it).\n\nEveryone faces these same questions, about how best to archive stuff in time capsules.  Some stuff we destroy. \n\nI've sensed the internet was more secure than my personal circumstances so most of my writings and digital pictures went to the cloud.  These blogs for example.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}