{
  "id": "1815691977278024310",
  "title": "Aristotle Was Right!",
  "published": "2010-06-12T21:53:00.001-07:00",
  "updated": "2024-02-05T07:58:36.907-08:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/4680326861/)\n\n[oops](http://groups.google.com/group/mathfuture/msg/85da4f8aeafca685?hl=en)\n\nI put an \"oops\" here because a tetrahedron is not a polygon, nor need its faces be equal.  \n\nOn the other hand, its four faces are polygons, and they might be equal.\n\nThe regular tetrahedron of four equilateral triangles is not a space-filler.  \n\nThe tetrahedral disphenoid, on the other hand, with four equal isosceles triangles, is a space-filler, meaning Aristotle was right:  tetrahedra do fill space.\n\nMisinformation [from Math World](http://controlroom.blogspot.com/2010/04/suggesting-change.html):\n\nA space-filling polyhedron, sometimes called a a plesiohedron (Grünbaum and Shephard 1980), is a [polyhedron](http://mathworld.wolfram.com/Polyhedron.html) which can be used to generate a [tessellation](http://mathworld.wolfram.com/Tessellation.html) of space. Although even Aristotle himself proclaimed in his work On the Heavens that the [tetrahedron](http://mathworld.wolfram.com/Tetrahedron.html) fills space, it in fact does not.\n\nIn fact the tetrahedron does fill space, just not the regular one\n\nPer Which Tetrahedra Fill Space? by Marjorie Senechal in Mathematics Magazine, Vol. 54, No. 5 (Nov., 1981), pp. 227-243:\n\n\"Aristotle did not state explicitly that he meant regular tetrahedra... some scholars continued to defend Aristotle on the grounds that he had not explicitly required regularity...\"\n\nAs well they might.\n\nWhat other tetrahedra fill space, all by themselves?  [Which one is minimal](http://worldgame.blogspot.com/2009/02/mite-fight.html), in the sense that it builds the others?\n\n[](http://www.flickr.com/photos/17157315@N00/4585728237/)\n\nWe started Radical Math in Portland, Oregon, offering [a first course](http://worldgame.blogspot.com/2010/03/radical-math.html) through Portland Free School on March 13, 2010.  Our venue:  SE Belmont around 30th, at Flipside (since vanished).\n\nRadMath teaches what we call Verboten Math, which is considered somewhat on the subversive side, not suitable for textbooks.\n\nMathematicians tend to welcome our stirring the pot, as argument and debate [stimulate interest](http://groups.google.com/group/mathfuture/msg/df1bd13047a4ae93?hl=en) in often dry topics. \n\nRadMath inherits from the Oregon Curriculum Network's [\"digital mathematics\" curriculum](http://wikieducator.org/Digital_Math).\n\n[Glenn Stockton](http://www.flickr.com/photos/17157315@N00/3261804560/) focused on Neolithic Math whereas I was [more into Martian Math](http://mybizmo.blogspot.com/2009/11/martian-math.html).\n\nWould you like to help sponsor?  Help produce mathcasts?\n\nGoing down in history as a true radical, in conformist times when diversity was threatened, might be your reward. \n\nWanna win some brand loyalty from some of tomorrow's freest thinkers?\n\n[](http://www.flickr.com/photos/17157315@N00/4680324919/)\n\nHow might you build your own ConceptNet for a specific knowledge domain?\n\nWhat \"graphs\" would you create, what \"webs\"?\n\nIn the case of a spatial geometry web, would you maybe have Mite, Syte and Kite as entries?:\n\nIsA(Syte, two Mite)\n\nIsA(Kite, two Syte) \n\nIsA(Mite, A A B).  \n\nMake any sense?  \n\nThis math is somewhat esoteric [by today's standards](http://mybizmo.blogspot.com/2010/06/moratorium-proposal-synergeo.html), but if you're [at MIT](http://coffeeshopsnet.blogspot.com/2010/05/buzz-about-shops.html), maybe you know what I'm talking about. \n\nOr is [this stuff](http://worldgame.blogspot.com/2010/04/radical-math-and-python.html) still verboten there too?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}