{
  "id": "3907668614258844478",
  "title": "Armistice Day 2016",
  "published": "2016-11-11T15:47:00.002-08:00",
  "updated": "2016-11-11T19:30:49.177-08:00",
  "content": "The theory or model put forward by the Armistice Day speakers today is pretty well spelled out in Addicted to War, a tome mom likes to distribute, used in some schools.\n\n[Outward war is obsolete](http://grunch.net/synergetics/gst2.html) given our present day technology, however many industrialists depend on heavy war spending to stay in business and adjudge the victims of war expendable collateral.\n\nMadeline Albright is [one of the champions](http://controlroom.blogspot.com/2016/11/identity-politics.html) of the \"expendable collateral\" view, having famously expressed her opinion that the mounting death toll in Mesopotamia had been \"worth it\" in terms of her own bottom line.  Whether infant mortality rates were really as high as she was told is [a separate question](https://psmag.com/the-iraq-sanctions-myth-5b05f6712df5#.ceyub3ufp).\n\nWeapons systems need to be tested, and sometimes there's just no good substitute for real human subjects. Panama provided tests for the Apache helicopter.  Iraq, Syria, Yemen and Afghanistan have become a playground for those who murder by bomb, drone and cruise missile.\n\nOne of our speakers [invoked Einstein](http://worldgame.blogspot.com/2010/07/einstein-omsi.html), known for his anti-nationalism.  Albert was asked to be Israel's first president however he wisely saw this as a trap in terms of his own personal integrity, even if his vanity was given a boost by the invite.  Besides, what would a theoretical physicist know about governing a country?\n\nAt the end of WWI, people were sick of war and agreed to end them. The Kellog-Briand Pact, ratified by the US, became the law of the land, as well as a basis for the Nuremberg Trials and the UN itself.  [Quoting from Wikipedia](https://en.wikipedia.org/wiki/Kellogg%E2%80%93Briand_Pact):\n\nAs a practical matter, the Kellogg–Briand Pact did not live up to its\n aim of ending war, and in this sense it made no immediate contribution \nto international peace and proved to be ineffective in the years to \ncome. Moreover, the pact erased the legal distinction between war and \npeace because the signatories, having renounced the use of war, began to\n wage wars without declaring them...\nTrue enough, but why blame the treaty?\n\nThe signatories, in refusing to declare wars while continuing to engage in them, merely exhibited their lack of moral fiber.  It's not the fault of the treaty that its signatories are so inept and lacking in integrity.\n\n[The Power of Nightmares](http://controlroom.blogspot.com/2006/01/power-of-nightmares-movie-review.html) was a fine documentary in charting how wars could be kindled based on tensions between cultures. Politicians, as well as journalists, have learned that getting wars going may be a part of their job description, if they want continuing support from the munitions makers.\n\nWhether a war is illegal or not is secondary to its ability to serve certain economic interests.\n\nSmedley Butler, a decorated US soldier who defended FDR against the Business Plot, expressed his disgust with what I call [Cowardly Capitalism](http://controlroom.blogspot.com/2011/05/cowardly-capitalism.html) in his short essay War is a Racket, oft quoted by the [denizens of OPDX](http://mybizmo.blogspot.com/2011/10/opdx-pdv.html).\n\n[](https://www.flickr.com/photos/kirbyurner/30622193750/in/album-72157674956209511/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}