{
  "id": "3106834158069952373",
  "title": "Arrowhead Math",
  "published": "2023-04-11T21:31:00.001-07:00",
  "updated": "2023-04-14T08:41:59.830-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjMn_iNUnVTkSb5QBgroh0WpoCiwkcZcCgxtqFxIiFFwexvpkentf0pU7KawVxSV7xJbLEB55YvZ8qxw9o5ay9WJIsmxBAQQOD3MoISBqhnaE8Dd48qb6ifCT3TwHdvrTu6D5G3xsVPuLAlIcE72Tm75cnCtCycDdimvEb27N5irWSHlRwlxg/s4032/CD26B0F6-EA6F-4819-A316-DAA7D1492B87.jpeg)\nMy arrowhead is what the ancient Greeks called a tetrahedron.  It might be regular, and when doing our home base, our tent, or teepee, it is.  \n\nThat’s the “tent tripod on the Earth” model, the bump or convex dent. Concave dents hold water and other fluids.  Then we have those flying caltrop looking devices, but more commonly the XYZ 6-spoke flyer.  \n\nThese flyers might have drone aspects, depending on the world we’re in.  Yes, computer game talk.  That’s a new anchoring shoptalk at FSI, with Gary our project lead.\n\nDo we need at least flyers for birds eye views?  A rule when world building could be that we have no disembodied viewpoints.  We do have tiny insect-like flyers.  \n\nAs a “first person” you’re enabled to “look from” these myriad viewpoints, but all are embodied and have their physical limitations.\n\nThe term “quadray” may evoke “quadcopter” and sure, we’re fine with a drone-friendly shoptalk.  The quadcopter is a familiar drone design. \n\nThe caltrop inside the regular tetrahedron, however, has any two of its rays at 109.5 degrees to each other (that’s rounded).  Here we get to jump into trig.\n\nHowever, before jumping into trig, our games exercise the notion of “vector sum” by adding these pre-existing rays in obvious ways.  The parallelogram model holds.  Connect the tips and reflect the resulting triangle.\n\nWe have six pairs, for example, that cancel each other except for contributing to the length of a bisector.  The six spokes of XYZ have now emerged.  The caltrop begets the jack.\n\nThen we have sets of three defining the edges of a quadrant.  They cancel (balance) by adding to the length of a ray out through the face center.  The four sets of three add to give the vertexes of the inverse tetrahedron.\n\nWe might add any pair (parallelogram model), then a third quadray (parallelogram again).\n\nThe tetrahedron and its inverse define the merkaba star (or stella octangula), likewise the corners of our duo-tet volume 3 cube.  That’s right, volume 3, and our tetrahedrons are volume 1.\n\nJumping into trig, we want students to remember the A modules, 12 right and 12 left.  The quadrays define  their spines.  The fact that the origin floats above the floor, 1/3 of the way to the opposite apex, gives us a tent pole to play with.\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiGq-uke7EjlWQPgSFfAQ9jiIsmErOMduFivjFUcG-FQu9A7FKLfCXVMRHDseJ-pN-POd9NqwdWLK7WDC3awxC6ypZY5EPJPeWJ81SA3lALSR_SaL01DgfgwzpNEd_TqF7wyWRuNFvIblo_z7EGXF-Iv1-UcRyolHleyA16A_dfMGUP1PBJkQ/s894/61699D16-9792-4505-830C-7E2AA929B0DA.gif)\nIn jumping to trig, we focus on the arccos (adjacent FE / hypotenuse CE) = acos(1/3) = angle CEF.  That gives 70.5287794, which, subtracted from 180, is our intra-quadray angle:  109.4712206.\n\nThe fact that Buckminster Fuller and friends would add substantively new language games around polyhedrons starting in the 1970s with the publication of Synergetics, when rectilinear orthodoxies were already well established, would give arrowhead math a subversive and/or discordant aura.\n\nDiscordant themes tend to set up a dialectic and drive discussion and debate in the direction of a new synthesis.  We see that happening in connection with Pentagon Math.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}