{
  "id": "5944942728727841808",
  "title": "Art Car",
  "published": "2016-09-16T19:24:00.001-07:00",
  "updated": "2019-06-16T19:32:53.109-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/29643902771/)\n\nGlenn had called ahead and we knew the staff was likely engaged in workshops.  Tomorrow is the open house.  We decided to visit in any case, having blocked it out, taking the art car.\n\nFor those new to my blogs, the \"art car\" is an old Nissan sedan I let a pregnant couple spray paint in a parking lot for some dollars.  The guy was right I was just letting it rust and some auto products on the market could seal in resale value, then leaking away.\n\nThe art car, also known as \"maxi taxi\" came after Razz, the raspberry-colored Subaru wagon, who's [final resting place](https://flic.kr/p/6QZCDj) before junkyard we drove by on the way out.  [Razz](http://mybizmo.blogspot.com/2007/02/another-superbowl.html) was driveable to the end, just suffered a mishap in the high desert, a story recounted somewhere in here I'm sure.\n\nNot like I'm rich or anything (I'm a teacher), more a case of the poor helping the poor, which published journals say goes on a lot in this world.  Community is more than just socializing.  Pet care, community gardening, creating new Biosphere type places:  humans engage in all that.  Even around here.  I'm fine with having an art car, though I may keep fine tuning the look.\n\nHedron is a maker space we found out about at Maker Faire (see previous post), an exhibitor in the 3D printer section (at OMSI, indoors).  I've been suggesting math teachers go against their own textbooks, somewhat the way some stronger [history teachers](http://worldgame.blogspot.com/2016/09/revisiting-911.html) do, using state mandated texts as examples or specimens, artifacts, not just regurgitating what's in them, not merely taking them at face value as it were.\n\nSo what if they never talk about the MITE (\"minimum tetrahedron\" cite Aristotle) in your geometry textbook? That doesn't mean you, a math teacher, can't go to Hedron and 3D print your own kits for classroom sharing.  Point out what's missing, as well as what's included.  The new generations are here to go beyond what earlier generations have accomplished, not parrot or ape them, duh.\n\nAnyway, a had my Pergamon Press bag (like a tote bag) full of plastic MITEs (some a present from D. Koski years ago) and left them a few, along with [the poster](http://www.rwgrayprojects.com/synergetics/plates/figs/plate03z.html) from the Synergetics Folio as included in the 2nd volume by Macmillan as well. That poster is the basis for a 3D printable kit the math teachers in project #CodeCastle will get to share about.\n\nThat color plate or poster is where the MITE is broken down into A & B modules — the kind of stuff I've taken to tweeting about.  I got this Pergamon Press swag bag at the First International Conference on Buckminsterfullerene in Santa Barbara, as a part of an [ISEPP](http://www.isepp.org/) fellowship, [BFI](http://www.bfi.org/) also supportive.\n\nT and E have same shape however surface : volume ratios change with size. Synergetics was a work in progress, no version control, has errors\n— Kirby Urner (@4DsolutionsPDX) [September 14, 2016](https://twitter.com/4DsolutionsPDX/status/776161245091160064)\n\nWe went to [Atlas](http://atlaspizzapdx.com/) later for pizza.  I grabbed a Mercury, the issue with [the Newcomers Guide](http://www.portlandmercury.com/portland/welcome-to-portland/Content?oid=16495991), somewhat tongue in cheek per Mercury's style.  They're reviewing the parks and saying Colonel Summers is a good one, but the editors take issue with the presumed reviewer's comment about \"hipsters\" plaguing the park, observing these are outright \"hippies\", a different species.\n\nThe joke is insiders writing for outsiders is another way of insiders showing off to other insiders.  I could go on and on about Colonel Summers park and my adventures there with Food Not Bombs.  Not far from the [Barley Mill](http://www.mcmenamins.com/313-barley-mill-pub-home), the McMenamins' first, on Hawthorne & SE 17th.  Of course in reality the hipsters er hippies are integral to Portland's color and charm.\n\n[](https://www.flickr.com/photos/kirbyurner/5031900343/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}