{
  "id": "9215466134601099320",
  "title": "Art History",
  "published": "2015-10-03T17:38:00.000-07:00",
  "updated": "2015-10-04T17:13:36.593-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/21738915279/in/dateposted-public/)\n\nGlenn Stockton has purchased the latest edition of Linda Dalrymple Henderson's book, The Fourth Dimension and Non-Euclidean Geometry in Modern Art.  I have an earlier edition (depicted above).\n\nShe's expanded her introduction considerably for the new edition, looking at published works at least up through 2009.\n\nLinda is correct in lumping Bucky with those claiming to work in a fourth spatial dimension, versus time, and quotes him regarding the tetrahedron providing his own justification for such terminology.\n\nIn Synergetics, simply turning a right angle number of degrees (90), going around a street corner, is not escaping into \"another dimension\".  A turn of 89 or 91 degrees would be no less significant, were true dimensions at stake.\n\nRather, we start with Kant and an admission of volume or space as a priori, with the passage of time thrown in to give the grammar of change.  Things take up room and persist in doing so -- that's our experience in a nutshell.\n\nHow many spatial dimensions is volume?  The conventional answer is three, building up by right angles, through height, width and depth.\n\nFuller's answer is to throw a tetrahedron into the picture as a whole ab initio, and to argue its faces and vertexes bespeak a primitive fourness.  \"A tetrahedron shouts four!\"\n\nThat's about all he's saying -- almost too simple to make it into the history books.\n\nIf you want the 3ness of 3D, look at each of the two complementary zig-zags or \"cobras\" that make any Tetrahedron, a Z of three connected vectors.  But the four points so connected define the alternative \"other\" Z, so 3 + 3 = 6 is more like it, but sure, a Z might be used for addressing purposes, giving 3-tuples. Space is \"Z-D\" (but what number is that?).\n\nThe conventional description of volume as \"3D\" relies on a \"jack\" of X, Y and Z axes, each one a next dimension.  From this \"jack\" (vs. a \"caltrop\") we get 3-tuple addresses.\n\nA fourth orthogonal is problematic (in the sense of oxymoronic), however 4-tuples are not, and these n-tuple data structures may be \"projected\" to something visual in ordinary space.  nD phase spaces have their Z-D analogs. \n\nA ball of n spokes from the center, whether orthogonal or not, may be declared \"independent\" with sliders set each to a specific level.  That's a \"point\" in an nD phase space.  Tighten the rules a bit, and you get a manifold or metric.\n\nFuller's math is not investing in having any [\"hypercross\" of four orthogonals](http://www.grunch.net/synergetics/hypercross.html).  The tetrahedron pure and simple anchors our talk of 4D in this logical model, not in some sleight of hand or science fiction. One may use [4-tuple quadrays](http://worldgame.blogspot.com/2015/09/compare-and-contrast.html) isomorphically with 3-tuple XYZ rays.  The caltrop spans Z-space (Z + N = Tetrahedron).\n\nDeveloping an alternative 4D namespace is not to find fault with, nor invalidate, [anything by Coxeter](http://worldgame.blogspot.com/2004/11/matrix.html), the grand master of multi-dimensional polytopes to whom Synergetics is admiringly dedicated ([with permission](http://mybizmo.blogspot.com/2006/09/quick-account.html)).\n\nFrequency (time/size involvement), added to angle (pure shape), gets us to five dimensions if we wish to avail of such tools, i.e. a tetrahedron persisting in time-size, the stuff of scenarios in \"Scenario Universe\" -- make sense?\n\nEnergy added to pure Platonic form (4D) is more the Synergetics template.\n\nWhen we have room for multiple namespaces, including exotic remote ones, such alternative beginnings get more room to breathe and show off their advantages, if any.\n\nSynergetics itself, once booted, helps us keep our minds open, to multiple namespaces.  Systems, fully omni-triangulated, may be plentiful, like bubbles, produced quickly and in great numbers.  Stay tuned.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}