{
  "id": "1421325918689566251",
  "title": "Artificial Scarcity",
  "published": "2018-04-29T04:08:00.002-07:00",
  "updated": "2018-04-29T04:27:29.401-07:00",
  "content": "[One of my Medium stories](https://medium.com/@kirbyurner/is-code-school-the-new-high-school-30a8874170b) takes us back to the Napster era, during which a nearby Silicon Forest police precinct, tired of always being the bad guy, set up Linux labs in the projects.  Brilliant idea.  South Africa was doing the same for its kids.\n\nThe police were asked to come into the schools to scare kids silly about FBI anti-piracy campaigns, while meanwhile a new creative commons was offering digital assets for free, and its technology was secretly powering capitalism already.  Why not tell kids about that instead?  Why were the schools keeping mum instead of joining in the revolution?\n\nThe engineering mindset probably grew a lot in those days, as young coders were confronted with many ethical dilemmas, around whether freely sharing copiable assets with one's peer humans was really as evil as some people said it was.\n\nIt's one thing when transferring a good means depriving the donor of continued access to that good, but another when the donor continues to have access.\n\nLegal culture is all about protecting IP and forbidding its use by others.  The engineers heard relief workers say humans were starving for culture (education) yet because of IP, the true capability of engineering, the miracle of the loaves & fishes, had to be attacked.\n\nAnyway, the police were seeing what the engineers were seeing and wanted to show kids a positive way forward wherein they would get to use computers without having to pay tolls at every turn, just to leverage what humans before them had left them as heritage.\n\nThis was a debate we had to have openly in engineering culture.  There's a layer in the archives where that's what a big part of the buzz is about.  That debate is in large degree behind us now, as we move to open sourcing lots more than software.  Humans are still starved for culture.\n\nLooking at humans [as \"muscle mass\"](http://worldgame.blogspot.com/2018/04/thermodynamics-earth-energy-budget.html) is not meant to say we should all go back to plowing with no assistance from tractors, however piloted.  I'm just taking the positive associations of body building and helping us appreciate humans more than we appear to.  Much of the economy is a deliberate attempt to deny people economic success.\n\nLayers of conditioned reflexing define our respective cultures.  The many programs out there, sitting on shelves, ready for broadcasting, provide grist for the mill, as we go back and explore the different eras.  The Alvin Toffler meme, about accelerating acceleration, means our debates go a lot faster now, what with the new infrastructure.  We don't wait for whole generations, to come to some resolutions.\n\nImpatience around humans demanding power over others based on threats of annihilation is not a new phenomenon.  The humans [in Robin Hood's time](http://worldgame.blogspot.com/2018/04/robin-hood-movie-review.html) were not that impressed by the social order either.  We have come some distance in the last few decades, lets admit.  Engineering has grown up a lot.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}