{
  "id": "3043330300510031678",
  "title": "Arts and Crafts",
  "published": "2010-03-31T23:45:00.001-07:00",
  "updated": "2010-04-01T23:45:14.443-07:00",
  "content": "Mr. Lanahan bought me breakfast this morning at Mt. Tabor Cafe.  We talked about his book.Later I joined Mr. Stockton in his studio on the Pauling Campus to continue building my instructors kit.  The assembly process takes time.I picture diplomats sitting around, doing something crafty together, shooting the breeze, talking of worldly matters.  The Paulings' commitment to peace, science and health sets the tone.One of the benefits of this workshop:  the other people here.  Here is an opportunity to compare notes, form bonds in a rarefied setting.Mr. Blake had not visited this studio before, nor seen this particular version of flextegrity.  He shared some lore regarding the technocracy movement, having recently had coffee with a local representative.  Trevor is a student of social movements and ideologies.Glenn and Trevor also talked about moss, a native species.  Both have been using it in urban gardens.A rack of gold icosahedra sit like cookies, baking in the sun on the porch.  The bright red Alpha Helix, a sculpture not far away, provides contrast.  Tourists stop and ask questions.[My uncle Bill Lightfoot](http://mybizmo.blogspot.com/2009/05/lost-in-oregon.html) stopped by.  He enjoyed checking out the flextegrity pyramid over dinner with Glenn and I at The Bagdad.  He shared about dog sledding in Wyoming recently.  Bill is 85.Back in the library, we talked at some length about Kenneth Snelson, the artist and a friend.Although best known for his awesome tensegrity sculptures, Kenneth has created some [truly amazing computer graphics](http://controlroom.blogspot.com/2008/07/more-curriculum-cartoons.html) and 360 degree panoramic photographs.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg4T1Um6n3tx-py8ZV0wTui0CnwvOGlfbQQQRn1hBkks7eHuLp1Z7Ib2I_43C6DEYKAWsAk5PgWrsSkjw95gW4VPq1UvsGkVC8f-nD7cmKPcpH35WGLhuv1kdZgc0iMV_GTMRdr/s1600/047.JPG)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}