{
  "id": "3841468679566035172",
  "title": "Assembling the Puzzle",
  "published": "2024-02-21T09:46:00.000-08:00",
  "updated": "2024-02-28T05:14:57.131-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/7161832030/)\n\nIf you've been following my (\"my\") emergent (self reshaping) curriculum you'll perhaps recall my graph linking Margaret Fuller to Ada Byron, around the time of Napoleon, after the American and then French revolutions. \n\nAt the same time, I started digging a tunnel from the present, towards this past matrix, including such luminaries as Buckminster Fuller, Walter Kaufmann, Richard Rorty, all contemporaries of mine although I'm living on into the 21st Century, being of a later generation.\n\nI'd already run into the US Civil War as a big deal in the American psyche. Now that I've been reading The Metaphysical Club and listening to its author on YouTube, I'm seeing more of how this tunnel goes. Issues of race and racism, Darwinism, Social Darwinism, feature bigly.\n\nAnother feature of my curriculum is I don't ignore Occupy, a movement those fascinated by the \"color revolutions\" seem to bleep over. Following Kaufmann, and waving the flag of \"place based\" education, I'm happy to count biography and autobiography as important inclusions. Kaufmann was always turning his critical eye back on the author, the journalist, the news publisher and its (perhaps ideologically driven) editors. Philosophy must continue to involve self reflection and internal disciplines.\n\nI've seized on Rorty's Achieving Our Country as potentially psycho-therapeutic  in that it restores the possibility of continuing the narrative in ways that uphold the values of one's heroes. If the US has to die and go underground, before its rebirth as a phoenix, it's not like we don't have a template. Sounds ancient Egyptian.\n\nWhere did pragmatism go? The conventional wisdom portrays the Cold War was a clarion call to zealots of all stripes. Pragmatism seemed too accepting of enemy viewpoints to matter.\n\nI'd say pragmatism left the university and went to Madison Avenue, where it took up the dark arts of advertising and public relations, as a student of Edward Bernays. \n\nPragmatists become \"social engineers\" (a term with negative connotations right out of the gate) and as such they gained their main clientele, the politicians. They founded companies like Cambridge Analytica, based on machine learning.\n\nInstead of harping on the word \"capitalism\" (a theory of capitals?), let's talk about the commercial sector, also known as the private sector. The idea that \"socialism\" equals \"no privacy\" is too unreflective to let pass as a truism. Political talk is semi-paralyzed with cliches.  \n\nOne's level of privacy remains an important measure, but perhaps not as a guide in some bipolar taxonomy i.e. \"do I live in a capitalist or socialist system?\" -- how about neither, how about both? How about we're not a slave to such \"ist talk\"?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}