{
  "id": "3491811969280161316",
  "title": "Asylum City",
  "published": "2019-06-12T09:25:00.001-07:00",
  "updated": "2019-06-12T17:43:25.534-07:00",
  "content": "The Asylum City meme traces back to Wild West times, when the goal of a community of refugees, from the Atlantic side, was not to create a whole state in some union, but simply a town, which might grow into a city someday.  Some towns were based on one activity, such as farming or mining.  Those based on multiple activities were the more likely to stick around.\n\nAnyway, Asylum City recaptures that spirit of wanting to start whole new cities from scratch.\n\nWe saw this again in Manhattan Project days, when warring camps of physicists established their own cities on several continents to pursue their experiments with the destructive potential of [radioactive materials](https://nbviewer.jupyter.org/github/4dsolutions/School_of_Tomorrow/blob/master/isotope_decay.ipynb).\n\nHanford was one of those towns, based near the Columbia River, which to this day is more radioactive than other rivers its size.\n\nAsylum City is about offering a new situation to refugees, yes, and it's also about showcasing prototypes of tomorrow and the Internet of Things (IoT).\n\nIf we build a really big one, I can see a quarter or various neighborhoods electing to test 5G technology (including Huawei's), and driverless cars.  Other areas are mostly about using bicycles and light electric motor conveyances, more like golf carts.\n\nCompanies showcase their latest wares.  We do have visitors, but we put them to work.  They come as volunteers, not as guests in some hotel.  Lots of Netflix get shown here, but also made.  Journalists have a field day in Asylum City, with some moving in for extended periods.\n\nWhere are we putting this city and have local authorities been consulted?  What planning agencies are involved?  Will my family be eligible to move there?\n\nGood questions, however as I mentioned, Asylum City is a meme at this point (and perhaps [a movie in the making](https://medium.com/@kirbyurner/asylum-city-the-movie-9c2e243f7fd6)), even though many existing cities, including Portland, Oregon, already take on the role of assimilating refugee populations.\n\nWhat's important is to remind more people that constructing whole cities from scratch, trying out new designs, is something people do.  There's a lot of that going on in Asia at the moment, but North Americans are still wringing their hands over decaying infrastructure such as in Detroit, not seeing how they can afford upkeep, let alone whole new towns.  They're prisoners of their own Economics to some degree.  Engineers favor GST (general systems theory) as the more scientifically informed and technologically fluent discipline.  We see a lot of hybrids, of GST + Economics, especially of the Henry George variety.\n\nOne inspiration for Asylum City is the proposed mega-project known as Old Man River (OMR).  If you know anything about city planning whatsoever, you know what I'm talking about.\n\nAnother inspiration was EPCOT, Walt Disney's original idea for Epcot, which gradually fell by the wayside.  Capitalism put more eggs in the weaponry basket, versus the livingry basket, and these days we're reaping what got sowed, a giant crop of worthless weapons and product placement wars (e.g. Apache helicopters in Panama, remember that one?).\n\nClearly I'm eager to recruit a large conscientious objector crowd, given my AFSC background.  Asylum City has that connotation.  We're giving economic refugees (refugees from Economics) a chance to find purpose and meaning outside of a military chain of command.  We'll be experimenting with democracy, including blockchain voting.\n\nPrototypes that work well will be incorporated into lifestyles \"far and wide\" (as flat earthers might put it).  Mistakes will be learned from (parody passive tense).  Tourism will be a major industry.\n\nA lot of economists are planning vast new prisons, which are like Asylum City, but they're drawing more from other sources for inspiration, such as a concentration camp literature.\n\nAsylum City has some real city planners behind it, and isn't just a sterile barracks or a honeycomb of prison cells.  We're not trying to perpetuate the least imaginative lifestyles.  Burning Man is more of an inspiration than the private for-profit prisons.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}