{
  "id": "3713458118767673425",
  "title": "At a Landmark Event",
  "published": "2015-08-11T23:48:00.001-07:00",
  "updated": "2015-10-02T10:52:21.257-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/19885971243/in/dateposted-public/)\n\nClose readers of my blogs know they're like a Russian novel in terms of the number of characters weaving through them, but that's life for a lot of us, not saying I'm special in attending to many threads or narratives, besides my own.\n\nAlong those lines, one Sara whom I've known since what we called \"the Gathering\" for short, 1980s, appears in [my account of a Quaker Annual Session](http://mybizmo.blogspot.com/2015/07/wrap-up.html) in Spokane, Washington this year.\n\nBy the way, while I'm on the topic of chronicling events, Melody (a Food Not Bombs co-conspirator) very kindly found me a working Nikon Coolpix to tide me over while the XQ-1 was in the shop.\n\nI switched back to an XQ-1 right about the [start of OSCON](http://controlroom.blogspot.com/2015/07/oscon-2015-begins.html), but neglected to set the clock properly.  My archive may have some discrepancies, up to where [Dr. DiNucci alerted me](http://worldgame.blogspot.com/2015/08/concurrency-again.html) to the issue a few days ago and I finally set it right in the camera.\n\nI asked about the photography policy:  none during the event.  I adjudged said event to be bracketed by more informal milling about time, during which Sara did some registrations.  I took my few pictures before and after.\n\nI was pleased to rediscover I could review The Forum for the reviewer price, and that records from est days were pretty [integrious](http://www.urbandictionary.com/define.php?term=integrious) i.e. they'd be able to verify my \"est vet\" status.\n\nI'd been to a Landmark event with Sara before, her graduation, some years back.  I understand her excitement about the programs, even if she had some issues staying awake through this latest, led by Forum Leader Naveed, our host for tonight as well.  She took intelligent action to counter any falling asleep.  Been there.  Getting sleepy is not a sign the training isn't working.\n\nNaveed Bhatti correctly pointed out this wasn't television (he could see us after all), however I marveled at how well Americans spontaneously do first take quality TV on the fly, once coached to be stars by their compatriots.  That's not intended to sound cynical, more admiring.\n\nI don't mean to single out Americans alone as having this talent and indeed I hear from mom that the Philippines has surpassed all of us in hip hop these days -- our disciplines travel around, more so in the jet age than ever.  However this was Ambridge Event Center on MLK in Portland, Oregon, so allow me the local coloring.  These folks were adorable, trust me on this one.\n\nWhich is why I was tempted to jump into the next available swimming pool (i.e. forum), but hey, lets look at the options.  I'm in the mood to mull.\n\nNaveed, of Pakistani heritage, was deeply into IT.  As the night progressed, he continued to provide vignettes from his personal life, as Forum Leaders have lives too and deserve to work on whatever.  Even if one repeats the \"same\" stories, it's always a new crop of listeners willing to keep an open mind.  Tuesday nights especially are an opportunity for Forum Leaders to get more autobiographical.\n\nNaveed knows people will speculate about the accent, or about whether he even has one, given he looks like he does. His English is pure Floridian (that's his homeland).  He's from Orlando, to pin it down.  His field, prior to joining the Landmark faculty, was fiber optics and related technologies, so he's a bit of a geek, he was quick to confess.\n\nI hope I didn't offend anyone (well OK, a few) in saying \"adorable\" just now, about those completing their Forum and sharing things they'd realized from the Friday through Sunday experience.  Tuesday, included in the program as a course completing experience, is also an opportunity to bring friends and family, fellow co-workers, whomever, to this guests-welcome event.\n\nThe Landmark enterprise has been successful in remaining secular yet friendly to religions.  One video we saw sampled from Clergy, Scientists, Artists, and other walks of life.  The talking heads delivered strongly positive testimony obviously, not that Naveed avoided the topic of skepticism in any way.  Suspicion is natural and part of human nature for a reason.\n\nClearly the Tuesday event is designed to mitigate any psychological obstacles to signing up, the tuition cost itself obviously a consideration.  That sacrifice fuels the event in that practically no one intends to be ripped off after signing up to commit to something about improving the quality of one's own life for a pretty penny.  The logic is tight and well known in the education community:  people are more open to accepting rewards they sense they've earned, through hard work and risk taking.\n\nHaving those just completing said course offer personal testimonials, and having invited guests join them, is a working recipe, not unlike how some restaurants build their business.  Since the early days, [est](http://controlroom.blogspot.com/2009/12/some-storytelling.html) was accused of using [\"hard sell\" tactics](http://www.motherjones.com/media/2009/07/landmark-42-hours-500-65-breakdowns).  Advertising in a billboard or TV sense is not among those tactics however.  Word of mouth is the way to go.  Slick advertising would actually undermine the practice grads get in applying their own spin, not that the videos they showed us don't constitute PR.  I went away with a colorful brochure.\n\nI don't want to say that Landmark has \"cornered the market\" on what it does, just that it does what it does quite well, which had been my experience with Centers Network in an earlier chapter.  I served as logistics supervisor and so on, as recounted elsewhere in more detail -- this was back in New York City, and in New Jersey before that, rewinding the tape to Princeton days and Walter Kaufmann etc. then fast forwarding, showing me getting into the Bucky stuff pretty quickly.  I was then living in Jersey City, teaching high school, and tracking Werner Erhard's career.\n\nRather than focus on competitive aspects of the human potential programs, both religious and secular, and including AA, I prefer to see Landmark as somewhat in [the Open Source ballpark](http://controlroom.blogspot.com/2015/08/revisiting-landmark.html), as community supported.  Sure, much is confidential, in terms of individuals' records, but 2.2 million people is not negligible and the whole point is to take the methodology back to work.  Oaths of secrecy are not a big part of it, just don't blab if you see Britney (or whomever) in your room.\n\nAt events like this, where people wore name tags prominently identifying their Landmark affiliation, it'd be silly to say total anonymity was a goal.  On the contrary, testimonials are worth a lot more when personally signed, i.e. when traceable to real people.\n\nSaying the Landmark Forum is \"secret\" is therefore way too melodramatic.  Listening with an ear for the possibilities a communication and/or relationship presents is worth more as a willingness and a skill, than as good avuncular advice, and intensive training goes beyond mere advising in these dense format sessions, or call them \"boot camp\" experiences.  \"You had to be there\" is a cliche for a reason.\n\nThe software industry likewise intensifies and concentrates in some places.  The Landmark Forum has elements in common with the \"sprint\" in software development circles, especially when conducted as in-person events.  Participants are there to add value, and to learn, not as passive spectators but as active contributors, even though in software that may mean little more than wiggling one's fingers over a keyboard.\n\nThe Panda Express company, among others, is happy to endorse the quality of the Landmark experience.  Quite a few companies are not especially shy about advertising their connection, with some offering tuition as an employee benefit.\n\nAgain, the [Open Source culture](http://worldgame.blogspot.com/2013/07/oscon-xv.html) is similar in having reached a truce or understanding in a kind of charitable activity that earns good will, yet advantages the participants in more specific and technological ways.  \"Lets agree on these public utilities and add value within\" -- that attitude becomes a source of a network's cohesion as a shared resource.\n\nIf we agree on [co-creating the playing field](https://mail.python.org/pipermail/edu-sig/2015-July/011289.html), then we can have our secrets within it.  We agree on the rules of poker but then -- and so then -- don't need to show all our cards (according to the rules of poker, MIT license or whatever).\n\nAlthough I did not wear my anthropology hat, not literally (I have a black Stetson we might call my Anthropology hat -- [reminds me to stay ethnic](http://mybizmo.blogspot.com/2015/08/all-math-is-ethnomath.html)), part of my motivation in being there was to update myself on this side of my culture.  What was the lineage like these days coming up on a half century?\n\nOf course to know the answers in more detail I'd have to review the course.  That's a real possibility. I'm examining my options as to where in the world would be a good place.  There's one in Seattle where they're translating into Farsi.  That looked pretty interesting.\n\n[](https://www.flickr.com/photos/kirbyurner/19886077493/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}