{
  "id": "440251874270524038",
  "title": "At Tom's",
  "published": "2012-06-03T13:59:00.001-07:00",
  "updated": "2017-10-14T20:04:49.146-07:00",
  "content": "Tom's is a good place to think of my grandpa Tom, the linotype operator who I knew as a champion shuffle board and solitaire winner.  [He and grandma Margie](http://worldgame.blogspot.com/2007/01/cracker-dog.html) were major characters of my childhood and youth.  I lived with them for an especially long stretch during my freshman year at Southeast High, in Bradenton, Florida.\n\nI've been [diving into fractals](https://groups.google.com/group/mathfuture/msg/c22653f9b619e6a1) with wild abandon, [the Mandelbulb](http://en.wikipedia.org/wiki/Mandelbulb) especially, and then [this other solution](http://youtu.be/is-dFvEZDlA), which I've watched I don't know how many times, comparing machines for smoothness of performances (though some of the glitches are in the production, which is eerie and gorgeous... enough positive adjectives to keep it a source of fascination, talking about the music here too).\n\nThe thing about school now, is you get a lot out of staying home if you're self disciplined and have a pretty good Internet connection.  And shouldn't your community be providing ways to get together and share with friends?  Yes, these houses are themselves pretty good in many cases, I don't deny it.  If you've got one of those places, consider having it made (whatever that means), in terms of having a great setup for learning.\n\nThe thing about learning, though, is it's interactive, not a spectator sport (though spectating may be part of it).\n\nMy order just came.  I don't usually eat in the bar section with the pool tables, but we thought that'd be fun so why not.  SH got liver.  Me, just some blueberry pancakes, nothing else, and [a Dead Guy](http://mybizmo.blogspot.com/2012/02/wandering-in-psu.html).\n\nTara is at Laughing Planet celebrating her time with the Nicaragua contingent.  Betsey, an Earlham alum (as is [Annis](http://controlroom.blogspot.com/2006/02/more-adventures-in-quakerdom.html), some others in our extended meeting, Cradlers, Merkins...), likes us getting another Friend for that place, so we're celebrating that too.\n\nI missed having my camera on me during these last great gatherings, most amazingly (for a host of reasons) the grand party at the Travis household.  Congratulations to both girls (of course women), Rachael (college) and Luci (high school).  Lynn and Tim are fantastic people with very admirable children.\n\nThe Snyders have pretty much finished their move to Portland; Joe sold his sheep. I haven't met their kids in awhile, all grown up.\n\nThe deep dive into fractals was not all together unprofessional; having authored my minimalist CropCircle Tractor Art in 2011, a Python module that does a Mandelbrot in ASCII, using \"tractors\" instead of \"turtles\" in wavy plains (planes) of grain (pixels). \n\n[Hyzy](http://mybizmo.blogspot.com/2011/07/checking-in.html) swept through, allowing the gossip that she's transitioning away from [Western Friend](http://westernfriend.org/), 2012 being her last as its chief -- a very responsible role in our community (means she's brilliantly skillful).  Hadn't seen Ron, or Dave in awhile, or Gayle.  [Tom](http://worldgame.blogspot.com/2012/03/corporation-meeting.html) I'd seen in Philadelphia.  Or Rachael... like a big family reunion.  I'd originally just come as chauffeur for Tara, not realizing I'd been invited, but Lynn said my invite had bounced.  Hey, nice.  Good fun.\n\nToday, Quaker meeting was packed to the gills.  [Lew's 99 chair layout](http://www.flickr.com/photos/17157315@N00/7012978349/in/photostream/) was pushed passed the limit most likely.  We remnant of Bob Smith's books was for sale at modest prices and I picked up one by an Anglo, exultant about some kind of Anglo race by the sound of it, somewhat ignoring the Philippines.  I'll use it as a reference sometimes.\n\nFrom Southeast High in Bradenton, where I was living with Tom and Margie, then in a motel -- me and sis both, going to respective schools -- I moved to Manila.  We were a UN family back then, with fancy blue passports. I was happy with the change of channels, even it meant less Star Trek.\n\nThe Boltons are who I really think about though.  I haven't seen Chuck or Mary in a long while, and it was like the first thing I said to Carol when she got off the plane, is that we should get by there soon, in this time of so many milestones.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}