{
  "id": "8711833717614450612",
  "title": "At WhereCampPDX",
  "published": "2011-10-08T16:45:00.001-07:00",
  "updated": "2021-02-16T19:28:31.877-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157627725390809)\n\n:: wherecamppdx ::\n\nThis geography focused unconference has been made all the more real by the fact that Metro is missing a valued coworker, [Mark Bosworth](http://findmarkbosworth.blogspot.com/).  He went missing in Riddle, Oregon when volunteering for Cycle Oregon.  He's a cancer survivor, about my age (a gray).  Lance Armstrong is paying attention, per Twitter.\n\nGiven a building full of geographers, mapmakers and so on, you would expect them to be thinking of how to support search and rescue, or finding missing persons.  How could our tools play a stronger role?\n\nZooming back, making the story become more generic, it's not always a given that someone missing wants to be found.  Finding people is a chief function of police, and paranoia runs high around tools for \"keeping track\".\n\nThe Wall Street Journal was recently talking up the FBI's ability to track cell phones, whether in use or not.  TV is packed with fictionalized superpowers that only adds to people's confusion about what's real (quite deliberately in some cases -- it's a lot less expensive to have people believe they're being spied on than to actually do the work, which may be impractical in many cases).\n\nIn the case of missing persons, with worried / anxious friends and family in the background, there's a lot of pressure to make \"finding\" easier, but that pushes against other scenarios wherein people are evading detection for one reason or another.  Perhaps they're being stalked, spied on, followed in some way?\n\nPrivacy, in the sense of going off the grid, being hard if not impossible to find, is a valued freedom many strive to defend.  The antithesis of a free country is one wherein you cannot hide, are under continuous surveillance.  On the other hand, some people relish a voyeur's access, why they called it [Keyhole (KH)](http://worldgame.blogspot.com/2005/08/more-from-oscon.html) originally.\n\nI mostly didn't say much in the session on this topic, until the end, when I pointed to my cuffka and suggested these could be pre-equipped with sensors and handed out to volunteers during those kinds of search and rescue operations when you want to leave a clear trace of who went where.\n\nA core frustration here at Metro is not having any place to aggregate data about all the searches that have happened to date.  Handing out devices, and collecting them later for downloading data and recharging small batteries, would take the emphasis off of personal phones.\n\nCuffkas might also be worn by hikers, other people wanting their positions to show up on [an LCD somewhere](http://mybizmo.blogspot.com/2006/12/caf-philosophique.html).\n\nIgal gave a great talk on virtual realities and their [associated geographies](http://www.wherecamppdx.org/wiki/2011/the_amazing_geography_of_fiction), pulling from a wide range of anime, manga and computer games.  Some were light hearted and fun, like the replica of Venice on Mars, with girl gondola guides.  Others were dark and twisted (more gothic and/or demented), with themes of madness and the [more surreal](http://4dsolutions.net/synergetica/veil.gif) side of life (some'd say \"bizarre\", others \"weird\").\n\nThe audience, for the most part highly media savvy, was quite responsive to this talk and quick to throw out other examples of virtual worlds (Narnia for example).  \"All realities are virtual\" used to be my sig, back when I was posting from pdx4d@teleport.com.\n\nOne of the realities was based on an old German town, down to rather small details.  Another reality involved French fighter jets.  This was geography gone wild (geography on steroids).\n\nDuring one of the breaks, I showed Igal the faux socialist realist memes I've been weaving into my Pythonic Andragogy, complete with Tractor Art.  Given he reads Cyrillic, we slowed down and zoomed in on some of my slides.  I gave him the whole presentation in under three minutes, including the [Cult of Athena slide](http://controlroom.blogspot.com/2010/10/new-atlantis-movie-review.html) at the end.\n\nGood practice for my next lightning talk opportunity.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}