{
  "id": "2630919243046318343",
  "title": "Athena's Sail Makers",
  "published": "2015-11-28T13:41:00.000-08:00",
  "updated": "2015-12-15T05:29:22.734-08:00",
  "content": "A subculture that saw a lot of importance in triangles might have two well known means to multiply. Imagine saying \"three by two\" and meaning not a ninety degree rectangle with opposite edges three and two, but a sixty degree triangle with edges three and two, the third side closing off said area, of six triangular units. \n\nEither way, with ninety or sixty degrees, we have a model.  Both operations may be quite familiar within a culture, the triangular way having more to do with textiles and sail making, or weaving covers for domes.\n\nWhat models of multiplication have we now?  Remember how complex numbers do it, on the Argand Plane.  Their real and imaginary parts project to XY, giving length, and these quantities multiply to give another length, and yet it's their angles (say alpha and theta) that add. \n\nSo we already have multiple models for multiplication.  Adding our sixty degree based operation just reinforces the same freedom:  to have \"multiplication\" mean various recipes.  Matrices \"multiply\".  So do we.\n\nI like associating the sixty degree based model with matters maritime, as sailing the high seas has always involved triangles, as well as economizing (\"more with less\").  The maritime tradition takes off into aerospace in later decades, incorporating [NASA's Apollo Project](http://worldgame.blogspot.com/2006/07/apollo-chronicles.html) with its mythical associations, of rationality, lucidity, intelligence and so on.  People spontaneously accept geodesic domes as normal, when NASA does them.\n\nThe advantage of our triangular picture of two by three, if you don't know, is that two by three by three (nine by two) becomes an eighteen-volume tetrahedron, two thirds of the three by three by three tetrahedron of volume twenty seven, all facets equiangular. \n\nA third number joining the multiplication takes us from surface to volume, just as in the rectilinear case, but by this route we come to a unit volume that's tetrahedral instead of a cube.  Our subculture works with that too.  They don't suffer from either / or thinking the way a dogmatist might.\n\nMight we / they want such a unit volume tetrahedron for some reason?  [In Synergetics](https://en.wikipedia.org/wiki/Synergetics_(Fuller)), we certainly do, and that's why we boot up with a triangle in the first place:  as a first step towards a rational and/or whole number volumes \"concentric hierarchy\" of nested concentric polyhedrons.  One twenty fourth will prove another important rational number, the volume of A, B and T modules for starters.\n\nNot that in adding all these whole numbers we thereby banish incommensurability (irrationality) or the surds.  We still have convergent series and the algebra of Phi is as strong as ever. \n\nYou know the drill (maybe): the Icosahedron of edges PV (prime vector) which is two PVR (two times unit ball radius) has a volume of 5 Φ2 √2.  The unit volume sphere still has Pi in it too (easily memorable):  π √2.\n\nPhilosophically speaking, we may not want to suggest that \"nature is using Pi\" (to how many digits?) even if Greek letters provide a convenient notation.  Numbers are approximations of realities, not the other way around.\n\nSails and sailing might be associated with a female goddess religion.  The conspiracy literature has already done a lot of work for us, in gathering the similarities between the Eve and Athena myths.\n\nAthena is a goddess of war, like Mars in some ways, but preferring strategy to brute force, and wisdom to hormonal imbalance.  Her victories tend to be \"at sea\" i.e. over the horizon from visible land, meaning invisible to the landlubbers. \n\nThe ocean, these days, has become cyber-space (a space of steering, triangulation, and [whole systems thinking](http://mybizmo.blogspot.com/2015/12/global-data-global-matrix.html)).  We could say that Athena wins with better music, if at all possible.  She prefers to solve with psychology.  Military leaders [came to Delphi](http://coffeeshopsnet.blogspot.com/2015/11/delphian-interlude.html) for the advice, however enigmatic, not outward weapons.\n\nTelling the story of this subculture, this ethnicity, should not pose too great a threat to existing STEM courses, given Anthropology is well able to merge narratives.  [Let STEM become STEAM](http://mybizmo.blogspot.com/2015/02/thirsters-2015226.html) for the purposes of enlivening our sense of history. \n\nDeliberately forgetting our metaphysical heritage would be the greater danger.  We should aim to remember, and in a context that's more than a jumble of semi-meaningless and unmemorable factoids.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}