{
  "id": "3726892357202057591",
  "title": "Authentic Scarcity",
  "published": "2018-05-04T23:36:00.002-07:00",
  "updated": "2018-05-05T17:38:09.542-07:00",
  "content": "I've continued [my conversations with ISEPP](http://worldgame.blogspot.com/2018/04/thermodynamics-earth-energy-budget.html) about World Game, which I use in its original sense of working to make sense of the world and to strategize accordingly.  War Game is similar, with the overhead of trashing infrastructure, destroying muscle mass, deliberately making things worse and weaker, in order to improve matters.  Yes, that's counter-intuitive I fully realize.\n\nDr. Charles Hall is typical of a trending cast of professionals trained in the natural sciences willing to raise their voices against conventional economics.  He's an emeritus who doesn't need to worry about ruffling feathers.  Those still striving for tenure or simply wishing for a modicum of job security, maybe can't afford to be so outspoken.\n\n\"Biophysical Economics\" means taking science seriously and thinking more realistically about energy budgets and the thermodynamics of it all.\n\nMy focus on [the PWS](http://controlroom.blogspot.com/2015/08/asynchronous-learning-engine-ale.html) (personal workspace) anticipates when the \"daily commute\" (a sloshing back and forth of a billion vehicles) will give way to people tightening their radius and watching more Netflix.  Families will have more together time.  Can that be all bad?  Telecommuting beats clogging the freeways.  Or look at how we bus kids to school when the best teachers are on Youtube, better viewed from one's PWS.\n\nHow many humans might we support via theme parks?  Or call them EPCOTs.  They want their driverless cars and HDTVs.  They want novelty, family life, fresh produce.  What if your greenhouse and your house were part of the same climate controlled structure?  Remember the [argon gas and Tefzel pillows](http://mybizmo.blogspot.com/2009/01/about-habitats.html)?  Has Silicon Valley improved on the Whole Earth Catalog?\n\nSuppose you had a warehouse with a pile of Soylent delivered by dump truck every few months.  Just add water.  No it's not made from people.  It's not like eating in a French restaurant, but at least you won't starve.  They're basically paying you to stay healthy.  You cost more when you're sick.  Breathing takes work.  That's physics.\n\nPeople work their whole lives to afford spacious homes and then leave them empty, to sit in offices and cubicles all day, playing the game of who's boss.  Don't tell me this isn't crazy, in light of the precious fossil fuels we're squandering for the privilege.  I'm not defending this species as rational.  Like any dumb animal, they're not likely to change their ways until they come up against an electric fence.\n\nSome folks believe in morphogenetic fields, or lets just talk about the Zeitgeist, or Holy Ghost in Catholic spheres.  Princeton was full of talk about the noosphere when I was there in the 1970s.  We put some faith in our collective wisdom, and intuition.  New England Transcendentalism went that route, more Aquarian Conspiracy.  But putting faith in something doesn't keep Planet of the Apes from dominating the programming.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}