{
  "id": "7139810937748918946",
  "title": "Autobiographical Interlude",
  "published": "2015-09-15T20:20:00.001-07:00",
  "updated": "2015-09-19T13:34:52.370-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/20834533734/in/dateposted-public/)\n\n:: [worldatlas](http://www.worldatlas.com/webimage/countrys/africa/ly.htm) ::\n\nHow did I get to be \"kicked back\" in the Steve Holden Chair of Computer Science (large recliner), here in the Blue House, Asylum District -- and what does that mean for humanity?\n\nThat sounds like a good B-movie opening; that's right we're low budget.  I'm not going to tell a story of how I amassed a great pile of drachmas (pesos, lira).\n\nJack, my dad, wanted to practice his profession with a blanker slate than a busy metro area like Portland could offer -- which makes sense given his PhD work was in regional planning for less developed nations (we could say \"Third World\").  By the end of the 1960s, after some good years in Portland, we ended up in Rome as a family, so he could easily commute to the \"project site\" otherwise known as Libya.\n\nFrom Rome we moved to Florida, with a few weeks in Ramallah, Palestine that summer, working with AFSC (a Quaker NGO, founded by a philosophy professor and Friends).\n\nI'd attended both Junior English School of Rome, and American Overseas School of Rome, which we called OSR (ASOR today).\n\nThen after Bradenton, we moved to the Philippines, arriving near the start of martial law under Marcos and cronies. I attend the International School (IS) in Makati.  Dad worked for the UN, USAID, University of the Philippines.\n\nAt that point, having finished high school, I branched off on my own trajectory, but continued visiting \"home base\" as it moved around, after that, to Egypt (Cairo), Bangladesh (Dhaka), Bhutan (Thimphu) and Lesotho (Maseru) in that order.  My younger sister pursued higher education in Ohio and New Jersey, ending up in Greater LA.\n\nMy dad was killed in a car crash in South Africa (RSA) in October 2000, and my mom, who sustained injuries, and was not expected to live, divides her year between myself and my sister.  She's in good health at 86 and continues her peace activism.\n\nCarol his a history degree from Ateneo de Manila, a Jesuit college.  She knows a lot about St. Francis and also his friend Jacopa, an admirer from a powerful family in Rome at that time (a period she intensely studied).\n\nNow I'm back in Portland, Oregon, have been since 1985, having left for Rome after 2nd grade.\n\nI was joined by Dawn Wicca, as a business partner and later as my wife, from the 1990s to 2007, when she died of breast cancer.  Dawn was survived by two daughters, one from her previous marriage.  She was from Ohio, then Florida, an activist in the women's self help movement, and a bookkeeper, specializing in non-profit accounting. \n\nFrom the Philippines I moved to Princeton for four years of university then kicked around the east coast, living in Jersey City, DC, Brooklyn, Queens, Apple Valley NC, before returning to Portland, by way of Bangladesh.\n\nDad's PhD work in planning had been at the University of Chicago.  He was completing that work when I was born, in 1958.  Both parents were Quakers by then, pacifists by leaning and training.  That accounts for the AFSC work, which I continued in my own way.\n\nCarol (mom) was active in Women's Strike for Peace, and later WILPF (Women's International League for Peace and Freedom).\n\nPost Princeton, I continued my interest in \"futurism\", encouraged by the example of my dad (his big picture plans for Libya and other countries were about anticipating needs for the next fifty years or so). By high school I'd become an avid reader of science fiction, and movie goer.  These traits are reflected in my blogs.\n\nMy foci at Princeton were myriad, though with philosophy paramount.  The combination of futurism, philosophy and international affairs (which I studied through Woodrow Wilson school courses) remains an evident source of thematic content in my writing and life's work.\n\nMy Quaker background led me to [such writers as Kenneth Boulding](http://www.quakerquaker.org/forum/topics/friends-ideas-about-poverty?commentId=2360685%3AComment%3A136699&xg_source=activity), and later Dawn and I joined a group called Quaker Economics led by Joe Havens.  Joe's wife Teresina was an avid student of Buddhism and we were also members of her group.\n\nDawn and her first daughter joined me on a trip to Bhutan during which we visited the temple to Tara at Tongsa, for which figure our second daughter was named.  She is now college aged.\n\nIf I start talking about my career I'll start sounding like I'm giving my resume.  I might as well just [link to it](http://grunch.net/kirby-urner) instead.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}