{
  "id": "4726090895168539595",
  "title": "Back on the Grid",
  "published": "2017-03-14T13:57:00.000-07:00",
  "updated": "2017-03-15T22:11:55.001-07:00",
  "content": "The above Youtube is sooo cute, these little orange guys with one eyeball.\n\nI was just getting ready to post on Facebook | Quakers, that we should hire this crew of thespians to act out some anti-patterns we get in Quakers. Then I thought, why not blog that thought instead.\n\nBut lets not brand every pattern an anti-pattern. When oldster grandparents collude with the youngest to help them wrest power from their middle aged parents, what's that? One could say: evolution doing its job.\n\nNotice the ruling cast has a big mouth but no eyes or ears, while the passivists are just one-eye with ears, have nothing to speak with.\n\nAbove the ruling cast (caste) are the controllers, the corporate personhoods, with eyes and multiple arms, very polytheistic. Talk about division of labor!\n\nI bet H.G. Wells would applaud this cartoon, likewise Orwell. Anyway, I do.\n\nGood work Amy Goodman, always love having your voice. She's another Sigourney Weaver type in how she stands up to those Aliens (corporate persons). She's not a cowardly capitalist always picking on the little guy, the defenseless, like True Korea.\n\nI'm eating lots of potatoes today. I bought a whole bag of 'em then let 'em sit in the cupboard, getting all sprouty. I'm trained not to waste.  Waste not, want not, right?\n\nFried potatoes for breakfast, mashed potatoes for lunch.\n\nWe're coming up on St. Patrick's Day and I'm pretending I'm Irish. Time for another Sierra Nevada Pale Ale (true, not Guinness, but then we're pretty mulatto about our beer).\n\nSpeaking of ethnic heritage, I've gone to battle for the Turks at some level, defending the right of trained Sufis to help Americans better like math and science. I consider that a wise investment in our collective future as a planet, don't you?  Apparently some do not.\n\nTurkish people seem rather polarized about these folks. I'm reminded of Chinese and their Falun Gong.  \n\nWe have a suspicious public that doesn't understand why some Chinese Peace Corps would want to help raise living standards for the people of Flint, Michigan.\n\nTheir thinking is more like Lesley Stahl's in the [linked 60 Minutes](https://youtu.be/GJvWP7wBkFs). Why would Americans be getting science from Sufis in this day and age?  She found that counter-intuitive.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}