{
  "id": "6888092320327944897",
  "title": "Back from the Future",
  "published": "2019-07-17T12:39:00.003-07:00",
  "updated": "2019-07-17T13:48:06.337-07:00",
  "content": "I'm taking the view, here at OSCON, that I'm visiting from the future, looking for signs that we might be choosing a smart way forward, and not choosing a dystopian future.\n\nThe movie 12 Monkeys follows this plot line.  They sent a guy into the past to figure out what went wrong.  The premise of that movie is we already knew the future, and it was dark indeed.\n\nCurrently, I'm learning about how the mega-fires in California last year were a result of grid failures.\n\nA frequency control algorithm running on the edge (at the end user end i.e. on the client), as well as on the server side (generator) is supposed to deal with the spikes.  In short, the plan is to escape vendor lock in and go open source with the IoT smart grid.  California is allocating a lot of money to this plan.\n\nThe old grids are incapable of dealing with reverse flow energy coming from the DERs, or distributed energy resources (wind, solar...).  The challenge with these energy sources, of course, is they're highly variable, like the price of bitcoin.  The original distribution networks were never engineered to accept a lot of power from such sources.\n\nCalTech is supposed to save us with calculus.  Open [OPF](https://www.cei.washington.edu/seminars/optimal-power-flow-for-future-smart-grid/), the visualizer, is going to help vectorize (spread the news of) these innovations.  You'll be able to simulate how your community would not have burned up, had this IoT smart grid been in place.\n\nThinking back to SimCity, I'm thinking how children and dabbler amateurs will not have easy access to these fancy tools, designed to be used by universities and national labs.  Even though Open OPF is open source, I don't expect to get it running on my laptop. Something simpler, showing how, when phase and frequency get out of whack, or whatever it is, you get heat instead of usable power, would make more of a simple game.\n\nSimple videogames, about real world subjects, are like documentary films, a genre.  I'd say a somewhat rare genre, compared to all the fiction games we get.  Simulations are needed at every turn, such as when playing blockchain games.  That's what Ganache is all about (a tool featured in my second tutorial on Monday).\n\nI didn't get to ask my question, which would have been whether DERs give us more opportunities to disintegrate and create self monitoring smaller grids that don't even attempt microsecond load balancing on such a huge scale.\n\nThe macro grid still exists in this scenario, but not everyone is a customer.\n\nI was thinking back to my crude drawings of Asylum City.  I joined the lunch table where open source and cities were the focus.  I talked about my interest in the \"cities from scratch\" idea.  Two from our table were from Mexico City, where earthquake tremors were recently felt (same in southern California).\n\nNone of the geeks at this table had ever heard of Sophia, although once I described it they knew the topic area was \"[uncanny valley](https://en.wikipedia.org/wiki/Uncanny_valley)\".\n\nBack to the session... No one talked about how peak loads might be offset by a more global grid.  That would allow more transmission across time zones.  Of course that's a World Game meme of longstanding.\n\nThe speaker managed to suggest that Germany might be doing something wrong in piping in natural gas from Russia, but it wasn't clear to me in what sense that might be a mistake.  Some bold mayor took his town off the mega-grid, which was fragile.  Back to my question about going with smaller more easily managed grids (town sized?) in some circumstances.\n\nOf course storage technology figures in to all this.  I think we all have the vision of a wind farm and solar panels, coupled with batteries, providing energy autonomy to a region.  If the macro grid still needed to tap in to buy power, or vice versa, this could happen, maybe.\n\nAn electric car is a battery on wheels.  Do we have the storage capacity to power a small town for several hours?  Are the batteries managed at the household level, at the town level, or both?\n\nSome of the people after the talk went up front to talk more about the big picture.\n\nI met Sheri Dover of PDX Code Guild.  We haven't crossed paths since OSCON 2018.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}