{
  "id": "4480438044382635422",
  "title": "Back to Basics",
  "published": "2008-08-11T11:16:00.000-07:00",
  "updated": "2008-08-12T22:24:54.478-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgSfkjLi0GuU_47i-BTEX-vtbSr3L0bv6idDr0om6ZNw4BXHRgOOtiY2dteU1F7bPiixf9JqKLZyuPzlgd37DZ8vnvVbuohAcPvzxMRSZc5jhfLm0OT7qFdA7woGDg5U-1spYq3/s1600-h/mathgrrrl.png)I was relieved to hear [Danica McKellar](http://www.sciencefriday.com/program/archives/200808084), one of our TV-literate \"gnu generation\" of mathematician, inveighing against the misuse of prosthetic calculating devices in the early grades.  The equivalent in computer world is jumping right to a drag and drop development environment without knowing anything about what's happening under the hood, be that [SQL](http://mathforum.org/kb/thread.jspa?threadID=1784103&tstart=0), HTML or [Visual Basic](http://mail.python.org/pipermail/edu-sig/2008-August/008696.html).Know-nothing grads of such \"house of cards\" curricula then get jobs as \"programmers\" with most employers none the wiser -- until real change happens.  Without mastery of the basics, one becomes overly dependent on out-sourced IQ.This idea of \"the future\" as some place where people [just sit back](http://worldgame.blogspot.com/2008/06/wall-e-movie-review.html) and push buttons, leaving \"real thinking\" to nebulous others (high priests?), was all premised on the [bankrupt Artificial Intelligence program](http://mybizmo.blogspot.com/2008/04/philosophy-posting.html) (remember [HAL](http://www.youtube.com/watch?v=UuYedeR-Tiw)?).  In actual fact, we need thinkers, not robots, and not helpless dweebs who can't multiply their way out of a paper bag.Of course knowing the times tables eventually becomes second nature, just more reflexes at the end of the day.  But the point is you've learned to train your own body and mind (good precedent!), like an athlete does, through hard work and perseverance.  Indeed, mental arithmetic could be taught as a [subcategory of physical education](http://mathforum.org/kb/message.jspa?messageID=5381881&tstart=0), a twitch game, using interesting streaming media for feedback -- there's a lot of that already.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}