{
  "id": "8548988585315423844",
  "title": "Back at Laughing Horse",
  "published": "2010-03-05T20:13:00.000-08:00",
  "updated": "2010-03-06T14:22:23.487-08:00",
  "content": "A lot goes on around here I don't know about, duh.Just tonight I learned that one reason Lindsey was able to join the Laughing Horse Collective, was that some holocaust deniers had managed to jump on board and stage an event here, then departed, creating vacancies.  There have been some lasting repercussions.This news seemed kind of freakish, as the collection is packed with holocaust videos, many of which have come through HQS for review.  I bought a copy of Hilter's Willing Executioners here (to the best of my recollection), [mom a book on Hitler youth](http://controlroom.blogspot.com/2006/04/back-at-zoo.html).[I'm doing door again](http://worldgame.blogspot.com/2010/02/crisis-line.html) tonight, a no-alcohol event.  This benefit is for Laughing Horse itself.  Julia is here too, advising potential customers.  She also paid back some of her IOU ($15), made a note in the book.Regarding the Fuller syllabus, I've had our state-free world projection on display here (briefly, like at Circadia), but won't claim the political left has made him an avatar, any more than the political right has (Laughing Horse leans left, in case you were wondering, calls itself radical).Around Portland, Fuller (a subversive and a radical) has gotten more attention through OSCONs (not only through me), Esozone (through Trevor especially), and of course through [Portland Center Stage](http://groups.yahoo.com/group/synergeo/message/57830).I would certainly like OMSI to get in on the action, perhaps with some tetrahedral mensuration sculpture and/or some [cool dwelling machine exhibits](http://worldgame.blogspot.com/2006/01/location-scouting.html).  Something both futuristic and humanitarian, consistent with our Portland spirit (which Portlandia personifies (she's a radical too)).Getting more synergetics-informed geometry on that Omnimax screen would remind us to keep thinking outside the box.  Some of us have been dying to see something along those lines.Lindsey's friend is helping with the door, so I'm able to focus on [the Wittgenstein thread](http://www.freelists.org/post/wittrsamr/Family-resemblance-and-Mathematics) I was following earlier today.  Wittgenstein was a contemporary of Hitler's; not saying I believe they were acquainted, although [some say they were](http://controlroom.blogspot.com/2009/10/triangulating.html).[Mike D. of Duke's Landing](http://worldgame.blogspot.com/2010/02/back-at-dukes.html) is here next to me (he's a member of the Collective).  He's been upgrading the company XO, got us a developer key.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}