{
  "id": "4662641886965414619",
  "title": "Back at Cubespace",
  "published": "2009-01-29T15:13:00.000-08:00",
  "updated": "2009-02-10T02:06:57.132-08:00",
  "content": "[I'm geeking out](http://mybizmo.blogspot.com/2008/09/geeking-out.html) around town again, hoping to snarf five PHP books before sundown, praise Allah for O'Reilly's Safari.These have been heady days.  I phoned the office of a heart surgeon, talked with the secretary, hoping for permission to use his name as a reference, having collaborated on [that application for the operating room](http://worldgame.blogspot.com/2007/05/more-basement-archeology.html) years ago.Too boring for ER or Gray's Anatomy:  Kirby in scrubs, 2 AM, plugging away in Microsoft FoxPro at the observation station, all darkness and empty theaters, nothing going, reams of xBase reflecting in my glasses, pre-iPod (CD players in the theaters though).By day, I'd be out of their way, except those few times when perfusionists called me in for a font change or something, a way of keeping alert during a sometimes long procedure, for which they are highly trained.Open heart surgery is a little like open source programming: many eyeballs praying for easy fixes for complications (aka \"shallow bugs\").  Surgeons have a cool bag of tricks, more every day, plus sometimes an angioplasty is sufficient (like with a stent or balloon).[I'm still debating about OSCON](http://mail.python.org/pipermail/portland/2009-January/000586.html), whether I should give a talk this year in San Jose (Silicon Valley).  Would anyone be interested?  Do I have a budget?Attracting Grunchies to cosponsor [my Oregon Curriculum Network](http://worldgame.blogspot.com/2008/09/responding-to-critics.html) has been like pulling teeth (mine).  No one thinks there's any commercial potential in tetrahedra I guess, [aside from Lipton](http://worldgame.blogspot.com/2006/11/artifact.html), or at least not [4D ones](http://coffeeshopsnet.blogspot.com/2009/02/glass-bead-game.html) -- 3D is OK, as long as squares get to go first and qyoobs get all the respect they deserve.[Hooray for qyoobs](http://www.wiley.com/WileyCDA/WileyTitle/productCd-0471122610.html), I love [Big Brother](http://mybizmo.blogspot.com/2008/07/more-explorations.html), V-sign etc. (flag waving -- [not white though](http://mybizmo.blogspot.com/2006/10/more-technoinvective.html)).I accepted an invite to join another book review team, another \"animal book\" maybe, University of Michigan connection.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}