{
  "id": "5909555856917848096",
  "title": "Back to School",
  "published": "2017-09-11T15:19:00.001-07:00",
  "updated": "2017-09-12T21:25:50.150-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/37006998796/in/dateposted-public/)\n\nI'm expecting my mentor and personal trainer, Patrick, to come over and remind me how it all works through his control panel.  I've only \"flown\" (piloted) his rig once and remember Mac shortcut combos were translating to surprising combos on the Windows server.  I need to practice which combos to avoid next time.\n\nPatrick and I were co-workers through many of the O'Reilly School of Technology years.  We're both friends with Steve Holden, a former neighbor, and citizen of the UK.  Steve was a major player in getting the early flagship Pycons off the ground, imitating EuroPython which came earlier.  A nonprofit named the Python Software Foundation grew up around Pycons as the organizing entity and eventually became what it is today, with Steve one of the first directors, later chairman.\n\nI've been dividing my attention between hurricanes and quaternions, not as distant-apart concepts as that may sound, though granted hurricanes are energetic phenomena whereas quaternions are metaphysical assets, a tool in the computer graphics library for making things rotate, around any axis, in what in XYZ-talk we call 3-space.\n\nXYZ-talk extends into Coxeter type n-space, wherein real number-lines are imagined to be mutually independent through a common origin, as many as we need.  IVM-talk is different, is what Bucky hatched in Synergetics, with a little help from his friends.  IVM-talk has only a toe-hold, or beach-head or one of those, vis-a-vis contemporary academia.  We're more likely to read that Bucky was crazy (quirky) or Synergetics is pseudo-math here in 2017.  I've got the two talks somewhat mixed together.\n\nOK, Patrick has come and gone.  We sat on the back deck overlooking the C6XTY sculpture garden. The truck will be here tomorrow, to haul most of it away.\n\nI then went upstairs to watch CBS Evening News, to get some overview on Irma.  Today is of course September 11, my wedding anniversary, as well as a day the metaphysical climate changed dramatically.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}