{
  "id": "3304726020077902637",
  "title": "Bagdad Meetup",
  "published": "2016-11-05T11:01:00.001-07:00",
  "updated": "2017-11-28T12:28:02.723-08:00",
  "content": "I enjoyed a productive meetup with Nathaniel Bobbit at The Bagdad last night.  He's widely read, and in more than one language, having studied Heidegger in Spanish, Husserl too maybe.  He'd been married to a Spanish non-English speaker at one point.  He's looking at tackling Russian these days, an admirable challenge for a man in his early sixties (we're close to the same age, as I'm in my late fifties).\n\nWe talked about whether Bucky Fuller could be categorized as a \"transcendentalist\" or not.  The [common wisdom](https://en.wikipedia.org/wiki/Transcendentalism) is that school of thought was tied off a long time ago, to be succeeded by \"pragmatism\".  He clued me about The Metaphysical Club, a [Pulitzer Prize winning book](https://www.goodreads.com/book/show/28202.The_Metaphysical_Club) on the latter, by Louis Menand which I can get for my Kindle for under $10.\n\nActually, it's hard to get Fuller squeezed into any camp of philosopher, despite his mind-brain distinction and frequent used of \"metaphysical\" within his corpus, I think largely because he patented and built artifacts. Philosophers don't putter about with cars or domes, right?\n\nNat hadn't known about Fuller's meetup with Ezra Pound towards the end of the latter's long life, when he'd mostly given up making public appearances and was living in Italy.  Ezra first met Fuller in Spoleto and then attended his talks near Venice.  Some of these details appear in The Pound Era by Hugh Kenner, and in Humans in Universe by Anwar Dil.\n\nMr. Bobbit also clued me about the work of [Patrick Hanks](https://en.m.wikipedia.org/wiki/Patrick_Hanks) in corpus pattern analysis, wherein one uses computers to tease out how words are actually being used (usage patterns).  [I recall a talk](http://mybizmo.blogspot.com/2009/01/ppug-2009113.html) on Python's being used for that.  The \"[semantic web](http://controlroom.blogspot.com/2010/06/aristotle-was-right.html)\" was a different, though I'd argue related project.\n\nI hadn't known of Edgar Allan Poe's invective against the transcendentalists of his day and understand how that'd lead to raised eyebrows around his [Eureka: A Prose Poem](https://en.wikipedia.org/wiki/Eureka:_A_Prose_Poem) — was he being satirical?  I'm guessing it was more a case of feeling he could do a better job.\n\n[E.J. Applewhite](http://mybizmo.blogspot.com/2005/02/ayatollah-of-tetrahedron.html) saw it as in the same ballpark as Fuller's Synergetics in two volumes (Macmillan) which had also threatened to become a prose poem if not properly shepherded.  [Applewhite](http://mybizmo.blogspot.com/2016/08/necker-cube-guy.html) also compiled the four volume Synergetics Dictionary, a kind of corpus pattern analysis vis-à-vis the Fuller namespace.\n\nSpeaking of Python, I met someone at the Quaker meetinghouse who uses the teaching of science to teach English as a Second Language (ESL), and I asked her if computer programming were ever used in that way.  Object oriented thinking requires a kind of generic precision, a kind of grammar, based around the new punctuation of \"dot notation\".  We have these noun.verb() and noun.adjective forms, where nouns will have types, even ancestries.\n\nESL students tend to like the level playing field aspect, of all learning something new together.  The namespace keeps the English from wandering off into a tangle.  We have our attributes, properties, behavior, inner state.  We even have a 'self' in Python.  Of course other languages besides English could piggy-back on computer science, as a way to introduce themselves coherently.\n\nI clued Nat about the Bubbles, Globes and Foam volumes, relatively new in English (translated from German).  Fuller is in the [proper names](https://en.m.wikipedia.org/wiki/Peter_Sloterdijk) index.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}