{
  "id": "8655497996832563268",
  "title": "Bait and Switch",
  "published": "2009-05-12T15:58:00.000-07:00",
  "updated": "2009-12-06T14:58:37.396-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEig96zqmHWfvongxp_pRfxa6Um9GEnIf-cBnmTtBxDuugeqRyNBmkhng4DhRIOblj75iMj7O2aZpXhNhd4dnHN4EDsDbZMVvJBMHJDjnnfTWSyK-VT8PDAWHeudBjjm1cd20lYM/s1600-h/bert_and_osama1.jpg)So, it looks like the lobbies have finally succeeded in getting USA TV watchers to stop babbling about Osama Bin Laden, and start fixating on Swat Valley instead -- with more valleys where that one came from.The enemy is now the Taliban, whom were not the masterminds behind the [WTC](http://www.slate.com/id/2060207/) Pentagon 911 attack, let's remember (invaded Iraq [because why again](http://controlroom.blogspot.com/2007/08/liberal-islam.html)?).  No, these were rather the [heroes against Soviet expansionism](http://mybizmo.blogspot.com/2007/12/charlie-wilsons-war-movie-review.html), then called majahadeen and/or freedom fighters, their fundamentalism overlooked as not a key issue in that election campaign (don't they have a right to religious freedom? -- the USSR is totalitarian and says no, so we must fight them).Their fanaticism is the core issue now though i.e. they're not supposed to hate the USA on penalty of death, and the Swat Valley looks like some [giant Mormon compound](http://controlroom.blogspot.com/2008/04/erratum.html), full of abused orphans in need of rescuing by remotely controlled drones (from some bunker in Texas?).That's a long way from seeking \"the bearded one\" in some concrete bunker (like Saddam had), a rather exhausting enterprise plus never [a big employer](http://controlroom.blogspot.com/2008/12/iron-mountain-revisted.html), unlikely to pay many bills.  The Brits took one look at playing \"man hunt\" in that terrain and got out, long ago.But speakers of Washington DC's brand of legalese (a dialect of punditry) are getting imaginative again, threatening to bomb this or that population \"into the Stone Age\" because hey, these people might be some kind of threat maybe.There's more than a little hypocrisy in this position, but if you put on your [Manifest Destiny helmet](http://mybizmo.blogspot.com/2009/07/public-debate.html) (to go with the mirror sunglasses), then all that nasty \"thinking about it\" magically goes away.  No [inconvenient truths](http://controlroom.blogspot.com/2009/03/cubespace-anon.html) need apply.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}