{
  "id": "6291486999933138682",
  "title": "Banning Nukes",
  "published": "2017-08-10T11:46:00.004-07:00",
  "updated": "2020-08-07T17:45:01.284-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157684980151720)\n\nPortland has joined a lot of cities, as cities stand to lose the most.\n\nThe uber-cowards plan to head for spacious luxury apartments in various gated mountain suburbs, there to send out hapless journalists at the point of a gun to see whether Planet of the Apes or 12 Monkeys has come true or not.  In the meantime, they'll eat nachos and swill Bud.\n\nPortlanders don't savor that genre of science fiction as a their real future and so push back, joining a broad alliance of city mayors and others, signalling in the history books we were never on board with the selfish oligarchs.\n\nThe oligarchs have various pretenses or ploys they float as trial balloons, trying to gauge the public mood. Recent results have been disappointing from their point of view.  A nuclear conflagration is harder to get started even if the UN Nuclear Weapons Ban Treaty is just something on paper.  So are a lot of things \"just paper\" (like money for example, other entitlements?).\n\nThis year, our memorial event (remembrance ceremony) featured a Buddhist invocation, several speeches, and a second indoor event in nearby NW 70 Couch Street.  We were permitted to take pictures, and indeed spreading visualization memes was part of the intent.\n\nI fought rush hour coming home from the day job, where mom was waiting.  My mistake to think the Hawthorne Bridge could be any better, now that Morrison is one way each way, but no way from the east side, short of joining I-5 somewhere north, which is crazy.  But then traffic-wise Portland has succumbed to North America's chief ailment:  addiction to one-driver commute lifestyles (leads to opium addiction, heart disease...).\n\nUsually, with no evening events pending, I don't have to fight rush hour.  I know a friend with a swimming pool just off Boones Ferry, plus have Lake Oswego friends scattered around I can visit.  The game around rush hour is to avoid it completely.  Fortunately the day job starts around noon, and the drive is then typical, at posted speed limits.\n\nCross references:\n[2016: Hiroshima Day ](http://mybizmo.blogspot.com/2016/08/hiroshima-day-august-6.html)\n[2015: Disarm Day 2015](http://worldgame.blogspot.com/2015/08/disarm-day-2015.html) \n[2013: A-Bomb Day](http://worldgame.blogspot.com/2007/08/remembering.html) \n[2010: Hiroshima Day](http://worldgame.blogspot.com/2010/08/hiroshima-day-2010.html)\n[2007: Remembering... ](http://worldgame.blogspot.com/2007/08/remembering.html)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}