{
  "id": "2883635330472762338",
  "title": "Barack Obama: The Power of Change (movie review)",
  "published": "2008-12-22T11:46:00.000-08:00",
  "updated": "2009-05-15T02:05:30.804-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhUsKOrPjaw35d-yykYOe5TPSBmQtYO5_XHmNWLMnop0od1Wto_wG0nMQDEzoHSmdVNIDqaAMUpydhdbqif6vdS4C2eVhDYFCYv5J1-BDTID5hpbDw_dtzi1Sxn4F2rbe76Z_5B/s1600-h/obama_change.png)Coming off a brilliant and [magic-filled Solstice Party](http://www.flickr.com/photos/17157315@N00/3124601800/), planned by Tara and Elizabeth, I've decided to be somewhat old and sick, although I did venture out to Movie Madness with the girls, snagging this documentary selection of important interviews and speeches, including by Oprah and Michelle, both of whom definitely rival Barack when it comes to presence at the podium.There's a tension here I think it's well to investigate:  working class families want a social contract that rewards hard work fairly, with livable lifestyles, whereas keeping the government's end of the bargain will require brilliant, creative imagination.But aren't \"we the people\" that very government?  How do we get off being any less responsible than Barack, as individuals?  He needs us [as co-conspirators](http://controlroom.blogspot.com/2008/07/making-history.html) in the dreaming, not as docile \"just tell me what to do\" blind followers, and he's very clear that this is what he needs i.e. this is how [democracy](http://mybizmo.blogspot.com/2008/04/homework.html) was designed to work.In other words:  [you too](http://worldgame.blogspot.com/2008/11/sparking-investments.html) are called upon to exercise your powers as a participant and player in our [many-state experiments](http://mybizmo.blogspot.com/2008/09/nation-of-writers.html), as \"[virtual presidents](http://www.grunch.net/synergetics/usaos.html)\" responsible for your own freedoms, both protecting them, and exercising them.Like, the limelight might shift to you all of sudden (as it did [to Sarah Palin](http://worldgame.blogspot.com/2008/09/political-remarks.html)), with Michelle's voice asking:  and what were you doing not after you became famous for fifteen minutes, but when you [lived in the shadows](http://mybizmo.blogspot.com/2005/12/another-interesting-day.html)?  Her answers are proud.  [Not everyone](http://worldgame.blogspot.com/2005/01/dark-side.html) is that ethical or selfless.There's a strong belief among \"the working poor\" (as one namespace would have it), in these [inner circle elites](http://worldgame.blogspot.com/2008/08/elitism.html) of the super rich, the ones who never wanted weekends or paid holidays, who believed in [a Charles Dickens industrialism](http://controlroom.blogspot.com/2008/09/please-sir.html) that worked people to exhaustion, then cast them aside, with only lip service about their care, [treated army veterans](http://www.flickr.com/photos/17157315@N00/1429517776/) much the same way, as expendable, a means to an end (theirs).  \"Welcome to the machine\" we sing -- a place like [Chicago under Prohibition](http://worldgame.blogspot.com/2008/12/repeal-day.html) (or Batman's Gotham), cruel and uncaring, ruled by some nebulous mob, a distopian oblivion.In contrast, there's this thesis in psychology about \"conditioned reflexes\" which holds that whereas these inner circle behaviors may still exist ([upper deck Titanic](http://mybizmo.blogspot.com/2007/01/who-killed-electric-car-movie-review.html)) at the level of mannerism, or [habits of mind](http://controlroom.blogspot.com/2006/03/politics-princeton.html), no well-integrated, intelligent personality actually bases its identity in these obsolete and completely selfish ways of thinking at this point.Put another way:  nobody powerful really thinks like that anymore, that is if they're truly in it for [the long haul](http://www.flickr.com/photos/17157315@N00/3124614374/) in any way.  Oprah is a good example.  She's like no one found in any novel by Dickens.  We're in an entirely new era, and there's no turning back the clock, no nostalgic escape from \"the fierce urgency of now\" as Barak so eloquently puts it.That's the tension I'm sensing.  In electing Barack, are we gearing up to fight these inner circle elites, or are we more getting ready to confront our own [habits of mind](http://mybizmo.blogspot.com/2006/03/math-wars-continued.html), exorcise some inner demons ([racism](http://www.grunch.net/synergetics/terms.html#race) just a beginning)?  In speaking truth to power, whom do we imagine might be in that mirror?  Where lives this \"military industrial complex\" Eisenhower warned us about, if not in our own [mental machinery](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html)?Who made \"us\" the \"leader of the free world\" for starters?  At least you have the right to [ask the question](http://controlroom.blogspot.com/2006/07/math-makeover-ad.html).  \"Because that's what they told me to think (and to say)\" -- might be an honest response, and the beginning of an open-ended, self searching investigation (a response to a query, as [we Quakers](http://mybizmo.blogspot.com/2008/07/some-quaker-pr.html) might say).Do I really buy there's this \"working poor\" of [simple hombres](http://controlroom.blogspot.com/2008/12/iron-mountain-revisted.html), just wanting to get up every morning, receive their marching orders to do the right thing (whatever's expected) in exchange for a little dignity and security, a livable lifestyle?  Whatever happened to those freedoms, especially that freedom to dream?  Did you surrender those then, and without a fight?  Are you really those fearful cows in [some Fast Food Nation](http://controlroom.blogspot.com/2006/11/fast-food-nation-movie-review.html)?  That's not the America we're longing for, and Michelle is very clear that's not her dream ([mine either](http://groups.google.com/group/soc.religion.quaker/msg/6f7ad7521f54e817?hl=en&dmode=source)).Both these obstructive \"[inner circle elites](http://controlroom.blogspot.com/2008/05/econotalk.html)\" and heads-down herd animal \"working poor\" seem somewhat dubious self parodies ([like Mr. Burns](http://en.wikipedia.org/wiki/Montgomery_Burns) versus [Homer](http://controlroom.blogspot.com/2007/08/simpsons-movie-review.html)), not secure grounding for any believable policy writing.  They're the stuff of soap operas, [rather farcical](http://worldgame.blogspot.com/2008/10/anyway.html), or quaint musicals perhaps.The political namespace is littered with such antiquarian phraseology, as we found out about \"lipstick on a pig\". We like to [think in a junkyard](http://controlroom.blogspot.com/2007/11/science-friday.html).  If we sound like our ancestors, parrot their chatter, then we must be in charge.That's no way to run a railroad.  We need [authentic leadership](http://worldgame.blogspot.com/2004/11/wont-you-join-us.html), not hollow \"sounding like [a know-it-all](http://controlroom.blogspot.com/2008/12/nato-professor.html)\".  Only time will tell if we've turned that corner, although I tend to agree with Oprah that the evidence is now in our favor, that we've successfully made it around the bend.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}