{
  "id": "1744678374773921998",
  "title": "Base Housing",
  "published": "2022-04-18T22:30:00.003-07:00",
  "updated": "2023-12-08T00:08:28.364-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgzSI_-rpe8eUlCEHI1A5ie8cHnySRWFNxIf64r1J9lxEgFwwPepdTjAXSb_yMsInBYb5GkeCGAxtut4NkQUEMjehiJoChTPv082ihTz-B32GuIhsW_RIOUP771ETjhQ_ve_oHYU96BCiS-R1XlfhE34UPQ7EYcYOaJoV6vPR_ZDDlpBXU3zA/s400/quakernomics.jpg)I fall into [the skeptics camp](https://kirbyurner.medium.com/4d-solutions-memorandum-2713e8967e4d) when it comes to \"real AI\" as some call it, oxymoronically.  \n\nThat doesn't mean I'm unimpressed by what I'll call AI proper.  \n\nOn the contrary, what artificial intelligence has accomplished in my lifetime is as much if not more than we should have expected.  Breakthroughs in linear algebra ala University of Toronto lead to a revolution in voice recognition,  recommendation engines, Alpha Go.\n\nWhere I look is to institutionalized wealth such as in the military, but also such as in resort hotels. The guests don't own, and yet they share, the facilities. Ditto on a cruise ship. The opulence is a collective experience, as may be the experience of ownership, as a shareholder.  \n\nAll of which is to say:  believing in institutional wealth is not \"anti capitalist\" nor \"anti socialist\".  This relationship, of self to wealth, is as old as organized religion, with its shared houses of worship and ceremony, feasts.  Hello, Father Divine.\n\nWhat \"institutional\" might mean, in the case of housing developments, is a certain amount of uniformity, even conformity.  We saw that in the case of Levittown, Long Island, New York, widely recognized as the first modern American suburb.Every Apple Mac or Air of a certain era looks like every other.  Models of cell phones look and work the same. Yet when it comes to architecture, we're often encouraged to express our individuality by commissioning a custom home.  We're talking about the rich and privileged here.  But might we be privileged without being rich?\n\n\"Rich enough to actually own\" is precisely where we don't have to go in the case of \"base\" and/or \"campus\" housing i.e. we might accept the privilege, yet without the curse and/or responsibility of private ownership.  We don't need to design the cruise ship.  That's for the cruise ship designers to undertake.\n\nThe book Quakernomics tends to idealize the notion of a \"company town\" (or \"corporate campus\") but only because that's what Quakers of the period were idealizing. The more prescient could see and almost taste a future in which those operating the facilities would not experience themselves as under the tyranny of some ruling class.\n\nToo good to be true?  A lot of skeptics think so, and believe driverless cars or even \"real AI\" might be easier to achieve. \n\nAfter generations of mobile homes of various design, one might imagine the experimental encampments, the hexayurts or whatever, would not be too much of a stretch.  Indeed, we've seen such encampments appear.\n\nBut just envisioning these mirages, as it were, does not replace the hard work of self governance or self management. \n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjYzXYHD8RDIaP2YnhN2XQJwBL5HYznqb7tDWwNnaZATrwEfehFfAQ_7F2y0uTDOGcmN58Y-wLgGP2A04LHh-RYvp4SEPkLYUfbyOuZ5_H0LWJSelqx64BB8VHCGDVLfILX787bfjlmO0w9LSkvLSsMdAr8gxV4Cg1Bxxd46_6vP9VpYedHNA/s540/dome_village.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}