{
  "id": "2250928532898937866",
  "title": "Base Tours",
  "published": "2011-12-20T11:18:00.000-08:00",
  "updated": "2016-11-11T16:08:13.101-08:00",
  "content": "As some of my readers know, I saw the Occupy camps as a recruiting opportunity. \n\nHere in Portland, we specialize in disaster relief operations.  The explanation for that is somewhat regional in that we live under the threat of impending doom, as a major earthquake is expected, if geology is any guide. \n\nAnother explanation is the pioneers who started coming here after the Lewis & Clark troupe were hardy campers and [camping](http://worldgame.blogspot.com/2011/10/wherecamppdx.html) has never been far from the surface.  That may be why Portland's was one of the largest Occupy demos, and one of the best organized.\n\nThe so-called [Elk Club](http://youtu.be/fwqFKEWV84M) (the people who took the park and lived there in a demonstration community in the shadow of the Elk Statue) is rightly proud of its little window in the sun.  We [decided to end the demo](http://mybizmo.blogspot.com/2011/11/endgame.html) before the eviction notice.  When the evictors arrived, the [A Camp kitchen](http://controlroom.blogspot.com/2011/11/virtual-opdx.html) and medical tents were already gone, as was the Food Not Bombs tent in B Camp.\n\nYou've probably heard of \"eco-tours\" (already popular) where tourists travel with experts in various aspects of ecology.  They visit both hopeful cleanup sites and disaster sites.  Hanford is of course on the list (there's already an interpretive center) as is OMSI (for a taste of Portland's science mindedness).\n\nThere's a different kind of tour I'll call \"human rights tours\" where you have these international groups coming through looking at the USA's prison systems.  Of special interest are the holding pens for so-called \"illegal\" immigrants (per Anglo-Euro jurisprudence) and what work is performed there.  The USA is known around the world for its prison-centric militaristic culture and many want to see it first hand, in some cases just to see what they're up against.\n\n[Recent meetings](http://worldgame.blogspot.com/2011/12/protecting-lawyers.html) with PBI and Amnesty International folks etc., me wearing an [AFSC / NPYM hat](http://controlroom.blogspot.com/2011/12/afsc-banter.html), have given me some ideas for steering the new recruits.  The workshops will dovetail with the weapons inspector programs, a grad school major expected to be popular in this region, as a part of environmental sciences.  The disaster relief and cleanup industry is already targeting visitation sites, with assistance from whatever agencies.\n\nBy this means, I think expanding travel opportunities for campers is in the cards.  It's not \"seen one seen them all\" by any means.  A given Elk Club veteran might start with some local visitations and then loop through a few more distance locations before returning to a local theater or meeting hall to deliver a report.  We expect hundreds of such reports, becoming thousands as more become involved.  [Where the IAEA fits in](http://controlroom.blogspot.com/2010/12/storyboarding-engineers.html) I'm not sure, given it seems to have been banned from operating in North America (we have [queries to State](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html) about this).\n\nWhen monitoring a site, you need to camp out nearby, using [whatever gear](http://worldgame.blogspot.com/2005/01/more-about-bizmos.html) and sensing equipment the university has provided.  How supply lines are managed depends on the scene of course.  You might just use the local Wal*Mart, and / or you might need off road vehicles, perhaps electric (less noise, less footprint) to navigate to the kitchen.  Some camps will grow a lot of their own food, perhaps with assistance from various biodome models (designed for permaculture).\n\nThe medical tent might need special equipment for over-exposure to whatever toxins had been determined to exist in this environment.  GIS / GPS servers will be aggregating this data. \n\nOutfitting all the frack sites with sensors is already jobs aplenty for an FDR-scale CCC.  Anyone who thinks there's a shortage of work opportunities should think again.  [Foreign aid agencies](http://mybizmo.blogspot.com/2011/12/eye-care.html), as well as church networks, have their role.  I should draw on more contacts in Vilnius for more church involvement.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}