{
  "id": "8961336906680098025",
  "title": "Big Data",
  "published": "2013-09-15T15:28:00.000-07:00",
  "updated": "2013-09-16T10:55:52.388-07:00",
  "content": "I'm all for swapping stories about which family had what, [whether slaves were involved](http://worldgame.blogspot.com/2012/10/revisiting-slavery.html), midnight brewing, 'til the cows come home, on into the wee hours.  Having big data crunched together and visualized helps historians structure a layer, a layout, in the multi-layered timeline we're always building.  There's way too much to ever capture so we need to be smart about what we keep and just can't.  Yes, I'm guilty of speaking quite generally.\n\nI guess I'm saying I'm not uncomfortable with family histories being out there.  I'm reading Royal Babylon at the moment (downloaded to Kindle), on advice from a friend, and I'm sure that's coloring my journaling.  I like demented cartoons too, what can I say.\n\nRegarding Quakers for example, and the arguments around slavery leading up to and through the US's Civil War [tm] -- a terrible battle of wills, and fought against a Biblical backdrop, in terms of painting a long term destiny for one's self (those tended to be their images -- nothing radioactive yet) -- I'm fine with revisiting those.  Keep going over the texts, playing the old records, yes.  But they won't sound the same, as your own tastes continue changing.\n\nThe intersection of Friends and Native Americans post the Civil War is on my plate as a focus and I'm not even a paid historian or anything.  I just find myself wading in these waters and need to know more of the landscape.  It's not that I came to the planet pre-loaded with encyclopedic knowledge.\n\nGetting a different version of history than the one you're getting.  That's always useful.  Patronizing people say it's not good for you, drives you crazy, too confusing.  I say better to get used to that: multiple tellings.  It's neither a crime nor a problem to be solved.\n\nI said at my workshop I don't think we do nearly enough with timelines on the Internet.  We could be doing a lot more towards integrating chronologies.  Then you realize what you're up against:  people aren't necessarily ready for such and such to be known.   Crunching data too hard is like hiring too many Colombo's, detectives actually good at their jobs.  It's not like you're even looking for trouble, it just comes when you squeeze the sponge.\n\nNevertheless, historians have a job, which is to tell us a story that really helps us make sense of what happened in a way that serves going forward.  That sounds like a tall order, but I'm just trying to establish a rank. \n\nGreat storytelling reminds you of the generalized pattern integrities -- to lapse into Bucky-sounding. Historians, like investigative journalists, need to dig, and not believe the first version of events somebody feeds them.  Keep looking, keep digging.  Be skeptical.  I'm OK with that ethic.  I appreciate detectives and crime solving, or even just plot discovering (stories need not be of criminals to be interesting).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}