{
  "id": "4659513748218586981",
  "title": "Birdman (movie review)",
  "published": "2014-12-28T05:29:00.000-08:00",
  "updated": "2015-01-06T07:41:52.593-08:00",
  "content": "I got to Columbia River Brewery (CRB) early and checked in [via Swarm](http://worldgame.blogspot.com/2014/12/about-smartphones-again.html), leaving a record in my Facebook profile.\n\nHollywood Theater, a nonprofit with a loyal membership, including friends of mine, was doing a brisk business this day after Christmas, 2014.  Matt and I were there to see Birdman.  [I saw Wild](http://mybizmo.blogspot.com/2014/12/wild-movie-review.html) on Christmas Day, also showing here, but I saw it at Lloyd Center.\n\nWe both admired Michael Keaton in Beetlejuice and I saw a lot of continuity in the character.  A raving psychotic who should be supervised, or at least not be given openable windows, is allowed to pursue a dubious career in theater, at least in his paranoid / locked-up own mind.\n\nHis daughter does her best with this guy but is showing a lot of birdman tendencies herself.  Both achieve some notoriety, with her registers being more cyber-spatial (Cyberia-focused); she's following Twitter and all that.  Having [seen Wild](http://mybizmo.blogspot.com/2014/12/wild-movie-review.html) the day before, this young one's character reminded me of Cheryl's.\n\nMatt and I had mostly critical things to say about the movie, but really we were talking about the whole melodramatic / theatrical culture.\n\nI'm not exactly a quietist, as a Quaker, but on the quietist-to-ranter spectrum, I'm more a quietist than this theatrical bunch, prone to expletives, like the [Nixonian](http://worldgame.blogspot.com/2005/01/assassination-of-richard-nixon-movie.html) White House.  I'm certainly [known to rant ](http://mybizmo.blogspot.com/2012/09/a-short-rant.html)sometimes, giving vent to invective.\n\nBut then, to be fair, this cast needed to survive on Broadway and pump it up incredibly, every night, for eager audiences, any one of which might contain a powerful media critic of enormous influence.  That's a lot of stress.  Show business drives people nuts, and likewise attracts nuts to its swirling core (cite The Zero Theorem -- [nutty and fun](http://controlroom.blogspot.com/2014/10/the-zero-theorem-movie-review.html)).\n\nWe decided to hit Laurelwood Pub, adjacent Rheinlander, which used to occupy the CRB location nearer the theater, only to find it was packed to the gills.  We checked the pub I often go to after Hollywood, but that was packed too (not a work or school night).  CRB was comfortably busy with just cleared booths.  I got War Elephant Double IPA and a sandwich, Matthew a salad.\n\nBirdman is over the top intentionally I'm sure and with enough psychoanalysis we could get something spinning around the secret psychic powers (shades of [Stalker](http://mybizmo.blogspot.com/2007/10/zone-movie-review.html)).  I'm going to leave that to other critics.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}