{
  "id": "4155280512160559266",
  "title": "Black Panther (movie review)",
  "published": "2018-02-21T22:45:00.000-08:00",
  "updated": "2018-02-25T13:37:14.667-08:00",
  "content": "Deke and I thought winter had missed its last window and no snow was in the offing.  Man were we wrong.  So far we've enjoyed two days of white fluff, today more dramatic than yesterday, and they say more is coming.\n\nGiven the whole city shuts down when any snow happens (Portland wimps out, doesn't have the cold muscles Minnesota does), I thought maybe Bagdad's matinee showings of Black Panther might be somewhat lightly attended.  Wrong again.  The place was packed.  Deke and I picked interesting seats, balcony throughway, plenty of leg room, not cushy.\n\nWonder Woman and Black Panther have much in common.  Both are from hidden worlds, relatively peaceful, yet highly disciplined, and metaphysically advanced.  The Wakanda culture has control of psychedelics, in addition to a huge supply [of Unobtainium](http://mybizmo.blogspot.com/2009/12/avatar-movie-review.html), called Vibranium, which they've obtained in abundance (in metaphor, a wise spirit, rare on earth).\n\nIn both cases, a nasty degraded outer world, ours, crashes into their utopian sphere, and in both cases a spy features, as one who makes it through to the hidden Valhalla.\n\nIn Black Panther, it's the CIA white guy, someone already in on the secret, but only partly. An Australian counterpart perks his interest in finding out more of the backstory.  He gets his wish by putting himself in harm's way for a Wakandan, and thereby comes within their sphere.\n\nBoth the Amazonians and the Wakandans have to grapple with the nasty business of trying to help a nasty world.  The Amazonians see this as a mission whereas Wakanda has tried hard to stay out of it.  I'm left wondering how much the average Wakandan ever learns about Korea.  I suspect the fact of an outer world is kept a secret among the ruling caste. On the other hand, its military seems ready to fly around the planet... Compassion for common humanity is what leads the rebels to willingly share their Vibranium.\n\nNow that Marvel has planted so much imagery, one might hope for more backstory.  I'm not sure why the Oakland guy ordered destroying the psychedelics, a sign of less control.  If it were easy enough to get growing again, why the melodrama.  If that was really the last, only crop, then are they out?  No one seemed all that worried about it.  Lots of loose ends.\n\nIf you want to see all the movie snippets possible make sure you stay until the very end.  I'm talking about well after the speech at the UN, where we get a glimpse of some whole new character, another outsider, making his debut.  Like I said, the film raises way more questions than it answers.\n\nGiven the South African vibe, I can understand where Marvel might be coming from with Wakanda, aka Ubuntu and high technology. The promise of positive futurism in Africa is still there, even with the AIDS epidemic (about which many movies are still being made).  Cities that are fun to live in and aren't violence prone, like Oakland, will benefit from a true valuing of what the geek economy is bringing into the equations.  I'm not saying Ubuntu is a weapon.  On the contrary, the King of Wakanda was not promising to share weapons at the UN, just advanced civilian stuff (like Ubuntu).\n\nThe idea of superheros and superhumans hearkens back to Gnostic tales of the angels, some of which made it into the Bible.  Satan's people were lightyears ahead of humans, like ETs with advanced civilizations.  Through their eyes, one sees through the eyes of a misanthrope sometimes, and this paradoxically aids human intelligence.  We come to appreciate our weaknesses, to marvel at ourselves as uber-weak.  This helps us grow.  Comic books have always helped people appreciate religious teachings, even if the pantheon is often pagan in the sense of \"some unbelievable system\".\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjfr5VZjaNDkZLPRFIunEDn3qtia95hjJV0NHoAKHoitpKgDWmo2NjBJ4Kc0CbDUFxtvY4ykIfXMsrSPHtZFPKueaYID_-9YSVKBZFSPaQjKiGRM9qQewuXH4k-W6Vz1Bn4rwVT/s1600/africa-art.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}