{
  "id": "4629604280940027547",
  "title": "Blockchain Voting",
  "published": "2017-01-18T20:00:00.000-08:00",
  "updated": "2017-01-19T00:58:32.745-08:00",
  "content": "I was bringing up blockchain voting in a Quaker forum, as an example of a promising technology. Farm house Friends still put more faith in old fashioned paper balloting with visible counting, and in a one room school house, this can work.  Perhaps paper ballot counting scales much further, without limit, for the sake of discussion.\n\nBlockchain has excited people for different reasons. What a financial playing field requires is a set of rules that are self-enforcing, in the sense that cheating should be next to impossible, even in theory. With strong encryption, such schemes became feasible.  Gambling casinos are a first good example, as they depend on the mathematics of probability to stay profitable, not on sleight of hand, even if stage performing magicians are among the attractions.\n\nThe example most cited up to now is Bitcoin, which came with clever terminology and a self funding model of a self booting currency.  \"Bit miners\" around the world would learn of the different transactions at different times, more how Facebook works. Not every Friend sees updates to your profile at the same time, but after awhile, everyone knows about them.\n\nThe question then becomes, which sequence of events, which chronology, is real?  Instead of making the players prove their case, each one hiring an army of lawyers (good for middle men), a contest is held (about every ten minutes), of a brute force nature, meaning if your computer is capable of monster computations, you win the contest often enough to make transaction-tracking worth your while.\n\nIf your bitcoin miner computer wins the contest, it's paid some bitcoin, and its version of events (of transactions, their sequence) gets added to the globally shared blockchain, the one true narrative account. The point of doing it this way is precisely to rely on some shake of the dice that no one controls. Agreement gets created. Trust builds that the transactions are secure.\n\nMicro-payments between individual parties becomes possible, without the usual and more expensive amount of overhead. Sending remittances home, from family members working abroad, is one of the most used applications of this technology.  The currency converts into bitcoin at the source, and out into perhaps some other currency at the intended destination.\n\nHow does all this apply to voting though?  That's an excellent question.  Lots of talented social engineers have been exploring the ramifications of blockchain technology on electronic voting.\n\nBefore Measure 97 went down to defeat, on the State of Oregon ballot (November, 2016), I was having fantasies of showcase facilities where rotating groups of students, with faculty (more advanced students) could come to learn about [the new tech](http://worldgame.blogspot.com/2016/05/the-blockchain-and-global-u.html).\n\nHowever I hadn't thought through who goes where exactly. The mostly unused Sunnyside Methodist Church (or \"[ghost church](http://worldgame.blogspot.com/2016/06/ghost-church.html)\") had given me some ideas. I was thinking in terms of teacher training, having watched over my dad's shoulder (he was an education system planner) and having some sense of the workflow.\n\nIn other words, say you're at Cleveland High School and learning about how polling and voting works, or doesn't. The school has some voting machines and equipment for counting ballots, with the school routinely bringing questions to a vote. \"Who believes in UFOs?\"  Yes, that's a poorly designed question, however if the goal is to work out with equipment, the point of the question may not be the point of the exercise.\n\nWe go through a lot of effort to authenticate here and there.  To our banks.  To our medical service providers.  One would think a citizen of a nation is by definition entitled to specific on-line services, including the right to vote in various elections by means of [a smartphone application](http://controlroom.blogspot.com/2016/07/the-last-colony-movie-review.html).  The fact that the USG gives us no means to authenticate as citizens to perform our civic duties, is evidence that USA OS is still more on paper than a socially engineered reality. Lets hope better days are ahead.\n\nSome readers may have been inwardly objecting, from the top, that Quaker practice is not about voting, so why would blockchain voting be pertinent in a Quaker forum in the first place.  To clarify, I'm accepting that Quakerism does not define the public sphere and that my civic duties as a voter do not fall outside the scope of my duties in general.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}