{
  "id": "1075278275932885480",
  "title": "Blockchain for Fiat Currencies?",
  "published": "2022-12-25T23:17:00.009-08:00",
  "updated": "2022-12-26T08:19:55.425-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/40140789202/in/photostream/)\n\nI'm in student mode here (as I am at least 80% of the time let's presume), sitting in Econ class (or is it GST?).  I'm learning about the blockchain in the context of Bitcoin and Bitcoin mining.  I get the elegance of the scheme, and yes, its limitations.\n\nSo my question is:  can't we play this with dollars too?   Or any specific currency for that matter? \n\nWhat the blockchain solves, is any hanky-panky based on writing checks before others clear, thereby engaging in money creation, which only banks are allowed to do, supposedly under regulator scrutiny.\n\nThe blockchain or shared ledger provides a set of uncookable books, if implemented correctly\n\nThe different block-makers learn of transactions over a time period, and box them up in a tetrahedral block (just to get that tetrahelix image going).  \n\nA contest is held, and the winner gets to add their block to the veridical strand of \"what really happened\", and gets paid in the process.\n\nWhen prototyping, I tend to think in terms of \"theme parks\" (don't we all?), but also \"refugee camps\" and other overlays.  On this campus, whatever dollars you like get committed to an electronic wallet that you now get to spend.  Maybe you're paid through your wallet?  \n\nThey're dollars, not Bitcoin.  Fiat can play this game too, with the same incentives (i.e. \"no cheating\").  Am I wrong?\n\nWhat are the advantages of using your dollars electronically?  It's up to the theme park to make that clear.  The experiment may not be about anonymity.  On the contrary, everyone has access to everyone else's expenditures.  That just happens to be the game here.\n\nMaybe instead of \"theme park\" we should introduce our mixed use skyscraper, the one with work, home and play, shopping, medical care, and funereal services, a columbarium, all in the one tower or campus complex (\"all under one dome\" might be the expression).\n\nMy other observation, about \"blockchain\" as a meme, is that it represents \"omni-triangulation\" i.e. our power to squeeze lies (misinformation) out of the system is increasing exponentially in light of increasing fluency and monitoring.  \n\nGetting away with fraud is getting harder in principle, thanks to techno-integration.\n\nA lot of what's happening is those accustomed to relying on deception are encountering new learning curves, some of which are proving too steep, breaking the banks as it were.\n\nWhen you're done at the theme park, whatever you have left in your electronic wallet, that you didn't spend, is still usable.  Withdraw it for cash at the ATM if you like.  There's no \"currency conversion\".  Everything stays M1.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}