{
  "id": "7629919327669054328",
  "title": "Blue House Tour",
  "published": "2016-12-19T11:37:00.000-08:00",
  "updated": "2016-12-19T11:51:16.643-08:00",
  "content": "Lets focus on the office spaces in this one.  I'm not showing the Raspberry Pi 3 workstation in the basement because it's accessed through the local network.  No one needs to go down there to see its screen, which I may just unplug and use elsewhere.  Or not.  It's usable as a temporary office as is.\n\nThe Winter Office might sound like it's for winter use, and that would make sense, but I'm thinking it more as the cold office that has links to the outside world.  It's under the upper deck we restored.\n\n[](https://www.flickr.com/photos/kirbyurner/30939261943/in/dateposted-public/)\n\nBecause the Winter Office may run at freezing temperatures, I keep it behind a closed door, running a space heater to heat the Downstairs Office (there's a whole-house furnace but in this day and age I consider running that an unnecessary luxury).\n\nA fish tank right outside has only a small heating device, so I abet that with warmer ambient air, though on a fluctuating schedule.\n\n[](https://www.flickr.com/photos/kirbyurner/30907265034/in/dateposted-public/)\n\nFinally, the Upstairs Office: also with a cold blooded creature, the pet snake.  This is where I do a lot of my work.\n\nI'm able to sleep there on a futon if I need to, turning my bedroom into more of a guestroom if that's desirable.  I've had a few guests, from Brazil and [Indonesia](http://controlroom.blogspot.com/2016/08/basement-revolutionary.html).  The upstairs has its own restroom.\n\n[](https://www.flickr.com/photos/kirbyurner/31711486906/in/dateposted-public/)\n\nUnder the guest room (the Downstairs Office also doubles as a guest room), I have a large workspace equipped to share media.  People come over to watch DVDs sometimes.\n\nWhen the temperature is suitable, I may quit my office and work there instead.\n\nWhen others come over to work on projects, a question is whether they need a computer.  In that case, the Winter Office might be a best bet, as it has a guest account already set up.\n\nMostly I'm just supplying fast Wifi, including 5G in the Upstairs and Winter Offices.  We share a smaller bandwidth channel elsewhere.  People bring their own devices (BYOD), like at a coffee shop.\n\n[](https://www.flickr.com/photos/kirbyurner/31376209920/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}