{
  "id": "2466659155086530876",
  "title": "Board Games",
  "published": "2011-08-09T10:34:00.000-07:00",
  "updated": "2011-08-09T14:49:58.595-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjeLFxiTEMcHAJj_2W9GGBdVakOc_kl0HfAQ7ehHRzR5Mxgqtsgq6Ip2Meqlzuo2Fe0JW8Kaszv8UvdbxCvCk3UAcMZlD6kJdtbGq6umvRVH73esrMWoobYRmcCvfgAYVYk_ZeV/s1600-h/remodel_picture.jpg)[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjeLFxiTEMcHAJj_2W9GGBdVakOc_kl0HfAQ7ehHRzR5Mxgqtsgq6Ip2Meqlzuo2Fe0JW8Kaszv8UvdbxCvCk3UAcMZlD6kJdtbGq6umvRVH73esrMWoobYRmcCvfgAYVYk_ZeV/s1600-h/remodel_picture.jpg):: multnomah meeting :: Jay and I were chatting at the park about a possible Food Not Bombs board game: a map of some city, different kinds of pieces.  Yes, it could be a computer game, like Sims -- it should still have a map though, lots of 'em. Blue House is of a specific type, a subclass of \"FnB machine\" ([thinking in terms of programming now](http://controlroom.blogspot.com/2009/08/urban-edibles.html), object-oriented).  We're not specialized to store or refrigerate more than average, whereas some network households may focus on storing and sorting, more like our warehouse suppliers.   Given warehouses are already in the business of storing, I'm always looking for ways for the households to not absorb any more waste than necessary.  A \"just in time\" supply chain means perishables are picked up and used in a timely manner with little need for long term preservation.  The focus is on throughput not stockpiling or hoarding.  Each kitchen has its FnB stores (shared and/or partitioned).  These kitchens may be institutional (e.g. [St. David of Wales](http://worldgame.blogspot.com/2010/10/active-day.html)) or based in a private residence (e.g. Pink House). Blue House has produced some specialty krauts, other pro-biotics, but our kitchen is not pressed into service in the prep window, some three hours before a park serving.  We're an asynchronous supplier of specialty items.  Some of our bike rovers are likewise well connected to specific kitchens or stores who appreciate FnB as a valuable community service (which it is). Our 1950s vinyl kitchen with stainless steel counter tops looks made-for-TV, and I could see doing some shooting here for the training films and promos, but when it comes to food prep our role is to serve as a gateway to one of the institutional kitchens:  the one at the Quaker meetinghouse, formerly [an Electro-measurements (ESI) property](http://mybizmo.blogspot.com/2005/09/planting-seeds-in-silicon-forest.html) and before that one of Jantzen's knitting factories.  The Friends have done [extensive remodeling and expansion](http://controlroom.blogspot.com/2008/01/launching-mother-ship.html) over the last 50 years or so. We might call those \"supply houses\" and a bike with trailer might be routed to go by one or two enroute to a church or meetinghouse.  Or a bike with trailer might dash over to a warehouse supplier.   Most warehouses dealing in produce have a walk-in refrigeration unit with a palette or more of produce slated for composting, yet still with some fresh, healthful items for which no one has a use -- until the waste mitigation system is installed (here's a bike with trailer), at which point many vectors point away from that palette to various kitchens and distribution sites. [](http://www.flickr.com/photos/17157315@N00/5382897441/)  The idea of a control room taking feed from GPS devices, with helmet mounted web cams and ear buds (\"that looks like a good box of avocados, how about grab it?\") feeds the next generation science fiction version.  This goes with the fleets of [biodiesel powered trucks](http://controlroom.blogspot.com/2011/08/fnb-on-fb.html) running on Asian restaurant cooking oil, bringing CSA goods in, taking compost and combustibles out. Connecting my past work with [trucking and routing](http://controlroom.blogspot.com/2010/08/tomorrows-guis.html) (optimizing delivery schedules) to FnB is part of the larger scale waste mitigation effort.  When resources are tight and need to be shared, with some solutions more optimal than others, far more serviceable, there's momentum to develop the simulations and get into anticipatory design mode. [Blue House](http://mybizmo.blogspot.com/2010/10/oh-superman.html) is close to community kitchens and provides overnight parking for some of the bike trailer fleet (SkyBlue chiefly).  We also do low level carryover, some refrigeration.  My inventory in the staging area currently consists of squash, zucchini, cucumber, tomatoes, some fruits, carrots.  These were retrieved from the park yesterday and will be picked up by the Tuesday crew later today. My goal has been to render the model [with sufficient transparency](http://worldgame.blogspot.com/2011/07/fnb-urban-studies.html) to support transferability and scalability (scaling down as well as up).  I put a lot of emphasis on the [learning opportunities](http://worldgame.blogspot.com/2010/10/onward-urners-et-al.html) the free school provides for those wanting to master cooking for large groups using a somewhat \"just in time\" approach. [](http://www.flickr.com/photos/17157315@N00/3807729509/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}