{
  "id": "5353890060246981473",
  "title": "Bombs Away",
  "published": "2014-09-23T06:54:00.004-07:00",
  "updated": "2014-09-24T17:23:47.851-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/15130834419)\n\n[WDC](http://controlroom.blogspot.com/2013/08/city-of-morons.html) is doing what it does best again:  [bombing](http://www.cnn.com/2014/09/22/world/meast/u-s-airstrikes-isis-syria/index.html).  There's always a cloak of \"coalition members\" (e.g. [CNN](http://worldgame.blogspot.com/2013/08/chicago.html)) to keep our socio-paths in DC from seeming too Unabomberish, but I think that's a transparent rain coat at this point (apologies to Mark Allyn).  We know the Pentagon to be a bastion of mental illness and there's not much anyone can do about it, other than \"sit back and eat pizza\" (as I used to put it, back when bombing Belgrade was the cruise missile fiesta du jour, under Clinton).\n\nHowever we should also move further west in our analysis, closer to [The Heartland](http://worldgame.blogspot.com/2014/07/visiting-heartland.html) as it's called e.g. Ohio and Michigan, where you have many immigrants from the Middle East with strong views and extended families.  Atrocities by self-proclaimed ISIS members (or branded as such by media) trigger demonstrations [in Detroit](http://mybizmo.blogspot.com/2014/08/visiting-downtown-detroit.html), which in turn make \"bombs away\" an acceptable policy, a cathartic revenge killing, characteristic of Christians who haven't turned the other cheek since the crucifixion.  Why should they?  No one else does, except maybe Buddhists sometimes.\n\nThe phenomenon of immigrants with an ax to grind is a standard pattern.  Organized crime was about to capitalize in Havana when [Castro](http://mybizmo.blogspot.com/2006/08/blaming-castro.html) spearheaded a revolution, and Florida has ever since supported ostracizing Cuba, a policy the rest of the world pretty much ignores.  Many Syrians in the US have their own [axes to grind](http://www.washingtonpost.com/world/us-attacks-islamic-state-in-syria-with-five-middle-east-partners/2014/09/23/b78ad7e8-c8f2-4aa8-aaa7-ec92572f6716_story.html) e.g. with [the Assad regime](http://mybizmo.blogspot.com/2014/08/thirsters-again.html).  Their lobbyists become a source of white papers, just as refugees from Saddam's government were milked for justifications for invading Iraq.  The war profiteers are eager to test the F-whatevers of course (F-22s in this case).\n\nAround AFSC there's this fixed view that the military is for those too mentally incapacitated to survive in a civilian ecosystem.  The gangland-mercenary lifestyle becomes an end in itself and killing sprees get you merit badges on your resume and/or colorful threads on your uniform / costume.  There's an esprit de corps, a camaraderie, that develops around bombing, both suicidally and otherwise.  Terrorism begets fraternalism, with token women as brothers.  ISIS and the Pentagon have much in common in that way:  both provide career opportunities for fratricidal morons.\n\nOf course not everyone in the military is a rank idiot.  Starting wars is easy whereas getting them to wind down takes expertise and diplomacy.  The idiots all say war becomes necessary when diplomacy fails, but then outward war is by definition a failure, so it's eventually back to diplomacy again, this time perhaps more in earnest by people ready to try living as a civilians again, perhaps desperate to do so having tasted the no-win dead end that is war.  So we'll recruit a military person from time to time, as a war-stopper.  Quakers attract a cohort of ex-military in every generation who believe as [Smedley Butler](http://worldgame.blogspot.com/2011/10/esozone-talk.html) did:  that war is a racket.\n\n[](https://www.flickr.com/photos/kirbyurner/15336982635)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}