{
  "id": "114090026465927097",
  "title": "Boosting Bandwidth",
  "published": "2006-02-26T13:30:00.000-08:00",
  "updated": "2009-04-25T20:03:29.162-07:00",
  "content": "[](http://photos1.blogger.com/blogger/1134/545/1600/mathworld.jpg)A Math World(click for larger view)So if a picture is worth 1K words, then 30 frames/sec = 30K words/sec. That's a lot of info.Of course the real differences between frames may be small (static background).  MPEG capitalizes on that.  Gregory Bateson:  information = differences that make a difference.An MTV generation has grown up on fast cuts, slick editing, making music [on a multitrack](http://worldgame.blogspot.com/2006/02/conundrum.html) (if privileged), but then comes formal schooling and a sudden slow-down.One can hear the gears shearing, the cultures clashing.Like in math class: the... teacher... talks... really... slowly... as she squeaks out some chalkboard algebra, back to the room (spit ball, paper airplane -- [anything to add bandwidth](http://video.google.com/videoplay?docid=337915401775060679&q=mathematics+nashville) (starvation is painful)).Nothing dances, nothing moves.Typical adult response:  kids have been spoiled by TV, can't concentrate, short attention spans, need drugs (the legal ones).  Oh and Johnny, I'll be late coming home from work:  watch TV or something.How about we try meeting them at least half way?  I'm thinking of math movies, DVD clips, flashy shorts with high production values.  Abacus, subtract in base 10, then in base 8.  Play Tom Lehrer's [New Math](http://www.sing365.com/music/lyric.nsf/SongUnid/EE27EF26A4F581BE48256A7D002575E1) in the background.  Lots of video collage (mix in some history:  sputnik, Eisenhower, [Weisenheimer](http://www.toontracker.com/funnyco/funnyco.htm)).Then let kids dream up their own, editing/recombining from a growing stash of stock footage.  Mix 'n match.  Hip hop TV, and with some real academic content.Slow down for talking heads, sure (caution:  heads talking).I'm not saying only teach this way.  But at least let's give it a try.  I've seen so few good examples to date ([Power of Nightmares](http://controlroom.blogspot.com/2006/01/power-of-nightmares-movie-review.html) was pretty good, showed off lots of media literacy, but not much in the way of math).I know this culture is capable of more, much more.  We take pride in our media savvy, yet so often refuse to use it except to push an easy credit, consumer-based lifestyle, combined with fantasies of being one of those smart people on TV (some doctor, cop, or lawyer -- rarely a priest anymore, unless it's Robert de Niro on late night cable, or maybe [TBN](http://www.tbn.org/)).The rest of the world watches our endlessly dumbing it down and rightly wonders:  how low will they go?[Sesame Street](http://walkingthesea.blogspot.com/2009/04/sesame-street-old-school.html) was something of a breakthrough, but Big Bird doesn't know anything about icosahedra, vectors, or complex numbers (or if he does, he isn't sharing).Related posts:[Math on video.google.com](http://mathforum.org/kb/thread.jspa?threadID=1339786&tstart=0) (the early days) @ the Math Forum[Another Alien Curriculum](http://www.4dsolutions.net/ocn/alien.html)[Follow-up thinking on edu-sig](http://mail.python.org/pipermail/edu-sig/2006-March/005865.html) @ [python.org](http://www.python.org/)[Follow-up thinking on math-teach](http://mathforum.org/kb/message.jspa?messageID=5112846&tstart=0) @ Math Forum",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}