{
  "id": "2693232933942782005",
  "title": "Bravo Michigan on Bold Experiments",
  "published": "2015-05-22T17:29:00.003-07:00",
  "updated": "2015-05-22T17:56:26.439-07:00",
  "content": "I may have gotten the story a little wrong and will apply corrections in future blog posts, allowing misapprehensions to continue registering here, but my current understanding being that high schoolers in Michigan are guaranteed by law at least one distance education class as a part of their public schooling experience. \n\nPublic Act 205, passed in 2009, allowed the formation of full-time online schools for the first time in fall 2010. In 2006, the Michigan Legislature was the first in the nation to pass a requirement that students have an “online learning experience” before graduating. [ [source](http://www.kpk12.com/states/michigan/) ] \n\nIs that opt in or opt out and what if one wishes more than one?\n\nIn any case, the Nexus Academy solution looks promising in that it solves the need to authenticate identity.  Those of us in distance learning know a weak spot is what if the student lets her dog do the homework instead. \n\nMost realize they cannot fake it for long on the job, so why fake it now, but adults are more likely to realize this than children maybe?  Not that teenagers are children exactly.\n\nIn any case, certified testing centers are a need at all levels for all ages.  The science wants control and supervision, not some going overboard on some \"honor system\".  Authentication is required, perhaps with biometrics.\n\nOne might imagine a combination of experiences, inside one of these centers for some activities, outside for others.  You need not imagine yourself cooped up for days on end, as for academic credit you're required all over the map. \n\nWhat is distance learning anyway?  Thirty feet away can be pretty far, in human terms, in a room of five hundred. \n\nA lecture hall is distance learning?  Might as well be.\n\nActually no, there's an audience / speaker rapport that makes live talks a bonus, same with music.\n\nAnyway, it would be up to Michigan whether an obstacle course in cyber-space such as mine, or some other DL activity, would count for credit per the State of Michigan.  That's not my decision, as an online teacher, and besides who want's to learn lambda calculus anyway?\n\nBut the very idea of a Nexus Academy wherein I might have students, even if I'm in faraway Oregon or St. Louis, does inspire me, whether it's really practical in the short haul or not.  Thank you USDLA for opening my eyes to the possibilities (that's a conference my school sent me to, and a membership organization).\n\nRaining in Portland, did yard work today.\n\nDecision-making is by many methods, and who has access to all that many boardrooms?  We have our finite experiences.  Democracy does not just mean once a year elections, or once every three or four.  People learn to vote when going out on a group date and picking a restaurant. \n\nBut then if you're Quaker and use consensus, maybe you never choose?  \"Let someone else program it\" might be how the unprogrammed would do it, but presumably \"expectant waiting\" is more intelligent than that.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}