{
  "id": "8093388652460052914",
  "title": "Breakaway Republics",
  "published": "2022-06-07T15:58:00.009-07:00",
  "updated": "2022-12-05T10:36:37.533-08:00",
  "content": "The Feds seem to have no sense of urgency with regard to the various breakaway republics, mainly because that's not the terminology we use.  Never mind the sanctions, and the fact that they throw our people in prison for what our republics consider non-criminal behavior.  \n\nThey attack us.  Their president sent his border patrol to Portland to \"quell\" our supposed siege of the Federal building (not at all what was happening, but never mind).\n\nHowever, since Prohibition, Gangland has learned to use soft power and bribes DC to keep up the illusions.  They need their drugs too.  Once the crime bosses have the goods on the politicians, they'll do as they're told for the most part.  A lot of them have expensive habits that must be catered to.  Most would call this \"symbiosis\" and thank the Supreme Court for making bribery a lifestyle.\n\nWe've also endured our share of coups.  The upset against Gore, settled in the Supreme Court, was a soft verdict, affirming the Court's jurisdiction if nothing else.  \n\nThe JFK / RFK / King assassinations were hard core and to present those as connected with any coups d'etat is to stray into Man X country i.e. to sound like Prouty.  Prouty cites Bucky in his book JFK regarding the Malthusian motivations of a self styled cabal. \n\nWe're suddenly in Esozone, hello Paul Laffoley.  The secret history channel and all that.\n\nI think the west coast is fine with being the West or Far West.  \n\nBack east, we have the East, where they think more like Euros and/or the Anglos aka the Yukes, i.e. the UKers, with puritanical Yanks their descendants. \n\nThe EU is in the eastern hemisphere lets remember (as is Ukedom aka Ukraine).  \n\nThey think their \"western civilization\" is something distinct from Eurasian civilizations, as if Europe  weren't part of that very same continent.  However when the easterners got here, there was already a west here to greet them, and not one to be \"won\" so much as \"won over\" (in some dimensions).  \n\nWe're still here, absorbing a melting pot, fusing ethnicities.  Portland is your gateway to the Pacific Rim (PacRim), with its own center of gravity.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}