{
  "id": "7470328015638865065",
  "title": "Buddhist Heritage",
  "published": "2018-01-25T14:58:00.000-08:00",
  "updated": "2018-01-31T07:55:12.628-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/28072421899/in/dateposted-public/)\n\n[I posted another essay to Medium](https://medium.com/@kirbyurner/east-meets-west-a-philosophical-narrative-90652dd094b9), a sprawling network of interlinking self-published writings, with an easy interface.  I've posted quite a few \"stories\" over the last several months.\n\nHey, just got a call from a Friend in the Meeting, wondering how I was doing.  Thanks guy!\n\nMy essay plays up the Buddhist heritage in my neighborhood as a prelude to discussing Bucky Fuller's critique of the \"three dimensions,\" the holy trinity of elementary school math.  \"Co-dependent origination\" suggests neither height, width, nor even depth come to the table alone, independently. They need each other too much to ever come apart, even conceptually.\n\nThis ain't the first time I've practiced tilting at the \"3D windmill\" and indeed I've squandered many hours investigating \"dimension talk\" under different lighting.  This was the first time I fashioned a link to a core Buddhist concept perhaps.  I'm wondering what the consequences will be.\n\nI told the Meeting guy that I'd dutifully appeared for a follow-up doc appointment today, only to discover I was a week early.  There's nothing especially urgent about my medical condition at this point, so I'm content to wait.  \"Expectant waiting\" Quakers say, as they sit in stillness, waiting for the future to be revealed.  We know it will be.\n\nLast night I taught my Python class for four hours, then stayed up reading more Dahlstrom (English professor, WW1 memoirs) and Sloterdijk (German philosopher).  Today I teach another Python class, only for an hour, to some eager middle schoolers.  I need to drive to that one.\n\nWeeks ago, I'd notice huffing and puffing a lot more, walking from my parked car, up the hill to the public school.  Shortness of breath had become an issue.  I was monitoring, but not making the requisite appointments for a professional diagnosis.\n\nDelay is want landed me in the ER. The upside of that strategy is I got a lot of state of the art treatment in one fell swoop.  At this point, shortness of breath is not an issue.  I even ran a few blocks, not a problem, trying not to be late to my non-existent appointment.\n\nToday I spent a lot of time listening to [Marshall McLuhan related tapes](https://youtu.be/t6HyFyMjlXA), or watching videos of the man.  He talked a lot about television and its impact, in an age before the Internet, which latter is a synergy of TV and telephone.  Telephone is point-to-point whereas TV was at first broadcast.  Nowadays we \"dial in\" to get our media \"on demand\".\n\nCo-dependent origination is a broad concept, saying basically nothing has \"self nature\" in terms of existing wholly self-sufficiently, independently of all else.\n\nOur accepted orthodoxy in mathematics is that height, width and depth are independent dimensions that may be conceived of in isolation.  No one seriously questions this dogma, including me, as I recognize the utility of XYZ.  That doesn't mean we're prevented from conceiving alternatives.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}