{
  "id": "2574386952962671277",
  "title": "Bugs in Synergetics",
  "published": "2016-08-02T13:27:00.001-07:00",
  "updated": "2016-12-15T19:23:40.306-08:00",
  "content": "Fuller had to retract a dream come true volume five sphere, arrived at in Volume One of Synergetics.\n\nVolume Two, also published by Macmillan, had the course correction: the volume five rhombic triacontahedron (RT5), not a sphere, and not to be confused with either the RT5+ (a little bigger) nor the SuperRT, its phi-up big brother.\n\nRT5 = 120 T modules (volume exactly 5), T volume = A, B volume.\n\nRT5+ = 120 E modules (volume at exactly unit-sphere radius), same shape, different surface:volume ratio.\n\n[Mind the Gap](http://coffeeshopsnet.blogspot.com/2011/01/storyboarding-lcds.html).\n\nSuperRT is the one comprised of an Icosahedron criss-crossed with its dual dodecahedron (pentagonal, i.e. Platonic). The Icosahedron has the recognizable 18.51... for its volume.\n\nThese two have tetravolumes we may express with Phi as a factor as well:\n\nIcosahedron = 5 Φ2 √2\nPent. Dodecahedron = (Φ2 + 1) 3√2\nSuperRT = 15√2 \n\nWe believe in intersecting Platonic pairs (duals) if that's OK i.e. not too not-Platonic a relationship.\n\nThe tetrahedron (volume 1) self-intersects to form a cube.  The octahedron, and said cube (duals) beget the rhombic dodecahedron, with volumes 4, 3 and 6 respectively.\n\nThat late discovery of RT5 vs. RT5+, or T and E mods respectively, did not expunge the record of his earlier barking up a different tree. Or was it the same tree, just better rendered on second pass?\n\nEither way, he needs to acknowledge his mistakes, with Volume One already gone to press.  The two volumes are meant to be interleaved, based on section numbers.  He's able to perform a kind of primitive version control, checking in patches.\n\nSynergetics 985.01 marks the start of a trouble spot.  The powering is off by three, with S3 accounted as just S.  He gets close to a volume five sphere using S3 to the third power, and takes full advantage.\n\nThen later, he confesses to a subconscious demon nudging him down this tortured path, while the exigencies of life keep him mired in denial. I'll add some blank lines for readability:\n\nThis operation is\nrecorded in Sec.\n 982.55\n of Synergetics 1, where I misconceptualized\nthe operation, and \n\n(without reviewing how I had calculated the constant\nfor converting XYZ to synergetics)\n\nredundantly took the number 1.192324, \n\nwhich I assumed\n(again in mistaken carelessness)\nto be the third-power value of the synergetics-conversion\nconstant, \n\nand I applied it to the\nvolumetric value of a sphere of unit vector diameter\nas already arrived at by conventional\nXYZ-referenced mathematics, the conventional XYZ-coordinate\nvolumetric value for the\nvolume of a sphere of radius 1 being 4.188, \n\nwhich multiplied\nby 1.192324 gave the\nproduct 4.99__\n\na value so close to 5 that I thought it\nmight possibly have been occasioned\nby the unresolvability of tail-end trigonometric interpolations,\nwherefore I tentatively\naccepted 4.99 as probably being exactly 5, \n\nwhich, if\ncorrect, was an excitingly significant\nnumber as it would have neatly fitted the sphere into\nthe hierarchy of primitive polyhedra\n(Sec.\n 982.61).\n\nMy hindsight wisdom tells me that my\nsubconscious demon latched tightly\nonto this 5 and fended off all subconsciously challenging\nintuitions.  \nRobert Grip saves the day, and with youthful enthusiasm, shows up bearing a water-bearing sphere, just to snap him out of his daydream-fixation:\n\nAt this point a young associate of mine, Robert Grip — who was convinced that I was misconvinced — and who knew that I would alter my position only as confronted by physically demonstrable evidence, made a gallon-sized, water-holding tetrahedron and a sphere whose diameter was identical with the prime vector length of the tetrahedron's edge. The water content-the volume of the sphere was indeed 4.43 units  — 0.57 less than 5.\n\n\"...convinced that I was misconvinced\"...  nice one. \n\nSo then begins the saga of the E module, and its relation to the T module.  That's about where [David Koski](https://flic.kr/p/KDXtKe), still a young guy in Santa Monica, fades in with the phi scaling.\n\nMeanwhile the A, B, T, E and S modules (the latter another gold mine of relationships, unexpectedly — VE:Icosa :: S:E is how it goes, volume-wise) settle in for the long haul as no longer just new kids on the block.  They've become playmates.\n\nUnderstandably, Fuller was grabbing as much low-hanging fruit as he could in those two volumes, not wanting to miss glaring areas of application for his new tetravolume-based conceptioning.\n\nHe was avowedly and proudly intuitive, permitting himself to speculate, sometimes wildly, an in the name of science or future science.  Future generations could mine it for what it was worth.\n\nHe knew a period of assessment was ahead.  Buckminsterfullerene was a posthumous discovery, a fitting dot for the prior period, of just getting it out there.  Wolfram did something similar with A New Kind of Science.\n\nHe didn't want to be accused of not reaching for the stars.  He cast his nets widely, with a little help from [Ed Applewhite](http://mybizmo.blogspot.com/2016/08/necker-cube-guy.html).\n\nReaders such as myself and David Koski inherited a story already well-along in the telling.\n\nThese bugs were already being talked about, and written about as the curtain went up on our chapter.  I'm not revealing new information, as we've seen, woven into the pages of Synergetics itself, shared on Internet since the 1990s, by Robert Gray.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}