{
  "id": "114850723578263600",
  "title": "Business Strategies",
  "published": "2006-05-24T16:56:00.000-07:00",
  "updated": "2009-11-06T22:05:41.182-08:00",
  "content": "So after a blue sky Wanderers' this morning, during which there was much talk of urban flora and fauna, possums, the ocassional [wayward coyote](http://www.dogsinthenews.com/issues/0202/articles/020215a.htm) and such, three of us adjourned to my garage for further brainstorming.How could our east side [produce row](http://www.nwbrewpage.com/orpubs/ProduceRow.html) host veggie-loving think tankers in search of strong open source solutions, along with good beer (affordable, if not entirely free)?Per the recent [POSSE meeting](http://controlroom.blogspot.com/2006/05/lucky-lab.html), we'd need at least wireless.  The consensus:  it's not all about about Beaverton (or [Nike](http://www.animationmagazine.net/article.php?article_id=5432) either).  We already have [Free Geek](http://www.freegeek.org/) in the right district.  Nor are we closed to meat-lovers.  Lucky Lab has a sandwich called Vegetarian's Nightmare.What Free Geek got right was the big dance floor with a sound stage up front, plus ample projection facilities.  When [a media company](http://controlroom.blogspot.com/2006/05/personal-workspace.html) shuts down for the day, some workers want to party, and that may include projecting choice pieces from the archives, be these from current projects or from days-gone-by.  Smaller screening rooms are likewise used for this purpose.Like many architects, geeks seek large warehouse type spaces, well suited to scenery changes,  with ergonomic desks and ample access to kwhs.  This is what [Jerritt Collord](http://wiki.personaltelco.net/index.cgi/JerrittCollord) tried to get going in Northeast.  He was ahead of his time.  Portland has been somewhat slow on the uptake I suppose -- a pitfall for towns that consider themselves more sophisticated than they are.  Jerritt's talent was certainly recognized out in [Hillsboro, West Precinct](http://www.4dsolutions.net/satacad/docbook/pdf/).[Glenn Stockton](http://worldgame.blogspot.com/2006/03/global-matrix-wanderers-meeting.html) also discussed the cultural anthropology behind the pant crease, how it signified \"store bought\" and therefore had to be put back with a hot iron after washing, to continue sending the right message about the wearer's social class.I'm sure there's a lot more to the story, including from a military angle (uniforms).  Likely [jeans](http://en.wikipedia.org/wiki/Jeans) will remain popular attire in the new PDX Tech District though.The health care sector is a likely primary consumer of our open source bioinformatics.  I used to don a blue uniform, with shoe covers and a hair net, when working after closing time in CVOR.  This was back when I worked for David Lansky at CORE (Center for Outcomes Research), on such projects as CLAIR (Cath Lab Angiograms and Interventions Registry) and CORIS (Cardiac Outcomes Research Information System).Suits connote \"clueless\" among many techies, though I've been wearing mine a lot lately, permanently creased with silicon.  But the old [IBM dress code](http://www-03.ibm.com/ibm/history/exhibits/waywewore/waywewore_1.html) never really caught on in our neck of the woods.  Maybe we're just too much into [henna tatoos](http://images.google.com/images?svnum=10&hl=en&lr=&safe=off&q=henna+tatoos) and jewelry or whatever, not to mention spiky hair.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}