{
  "id": "5421857010289764318",
  "title": "Calculus Mountain",
  "published": "2008-04-28T09:39:00.000-07:00",
  "updated": "2012-04-17T11:30:09.979-07:00",
  "content": "Those of you who've heard me inveigh against Calculus Mountain, such as in the YouTube above, will maybe think I'm anti-calculus or think it shouldn't be taught.\n\nThis is not the case.\n\nFor one thing, teaching calculus was my bread and butter out of Princeton, my first job with a BA in philosophy (Rorty my thesis advisor, [Kaufmann](http://mybizmo.blogspot.com/2008/02/philosophy-101.html) one of my referrals to Erhard's philo, which I studied on the side, in tandem with [Wittgenstein's](http://controlroom.blogspot.com/2006/04/wittgenstein-again.html) with Victor Preller et al, some grad work at St. Peter's in Jersey City, making the transition to a [Dominican run school](http://mail.python.org/pipermail/edu-sig/2008-April/008525.html)).\n\nBut also, I'm in agreement with many in the Physics First and First Person Physics movements, that calculus, having grown up in the context of Newtonian mechanics, has a natural context within physics, so we should use that in K-12, with \"pure calculus\" (minus any physics application) left for some later time, for those college majors electing such degree paths.\n\nWe currently waste way too much time on calculus in high school, in some faddish, almost occult desire to equate this subset of math concepts with the whole shebang.  Strong candidate alternatives are already in field testing, with promising results.  The USA is not monolithic and there will be no \"one size fits all\" replacement, so don't expect big headlines regarding some big switchover.  That occurred years ago, as a part of the rise of digital over analog technologies more generally.\n\nRemember, the steam engine reached its pinnacle in sophistication long after the writing on the wall had already appeared, spelling diesel (now it spells a lot of other things).  Calculus as currently configured is already well past its pull date, but still hangs in there, bless its little heart.\n\nAnd again, I'm not for a purge.\n\nI'm for physics getting a better toehold, chemistry too, both united [in biology](http://worldgame.blogspot.com/2005/01/brainstorming-about-pedagogy.html), and have no problem with relaying Newtonian mechanics in a somewhat classical form, abetted with [VPython](http://mybizmo.blogspot.com/2008/04/plotting-with-vpython.html), [YouTubes](http://video.google.com/videoplay?docid=-3849910741753677908&hl=en) and so on (plus maybe real visits to [roller coaster parks](http://worldgame.blogspot.com/2005/09/powells-on-hawthorne.html), if we do our [FPP curriculum](http://mybizmo.blogspot.com/2006/04/more-first-person-physics.html)).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}