{
  "id": "3797777149141306894",
  "title": "Car Stories",
  "published": "2015-06-29T16:43:00.000-07:00",
  "updated": "2015-06-30T23:04:02.711-07:00",
  "content": "A well-known plus to renting a car now and then is one gets in a time machine and travels to the far future, the present, 2015 (as of this writing, duh).  Normally I drive a 1997 Nissan, a quality vehicle that I still appreciate.  But it needed a [new mass airflow sensor](https://flic.kr/p/v9k8t9) and so I called up Enterprise and booked a car for a day.\n\nThe rental was a 2015 bright red Toyota Corolla with a lot of frills, including radio controls on the steering wheel, rear view camera, great mileage (to Salem and back on a quarter tank).\n\nCarol and I both caught something probably contracted by Lindsey in her air capsule coming from China [to Bay Area](http://mybizmo.blogspot.com/2015/06/at-pdx-again.html).  Or who knows anymore.  In addition, I'm susceptible to seasonal allergies in these hot summer days in the 90s (F-scale) so I'm likely to be a basket case anyway, given the right pollen mix.\n\nI tried Sudafed and Claritin both, but stayed pretty miserable and tried not to get too close to people at the Salem Meetinghouse.  Carol was likewise in a state, and as a guest speaker, co-appearing with [Dr. Linda Richards](http://controlroom.blogspot.com/2008/09/wanderers-200892.html), she actually had a workout, whereas I was just an audience member.\n\nWe'd started the day [with Paul Barker](http://worldgame.blogspot.com/2015/06/quakers-2015628.html) at the Stark Street meetinghouse, so two meetinghouses in one day.  I'd call us dedicated circuit riders.\n\nHowever mom and Linda were not on strictly Quaker business, more were representing Women's International League for Peace and Freedom ([WILPF](http://worldgame.blogspot.com/2014/08/wilpf-congress-detroit.html)) to Followship for Reconciliation (FOR).\n\nCarol's specialty is demilitarization whereas Linda teaches history of science.  Both have given excellent Wanderers presentations at [the Linus Pauling House](https://www.flickr.com/photos/kirbyurner/sets/72157600254540815) in Portland (connected with ISEPP).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}