{
  "id": "3839142867509578007",
  "title": "Carol Addresses Thirsters",
  "published": "2013-10-03T23:14:00.000-07:00",
  "updated": "2013-10-06T00:27:39.928-07:00",
  "content": "[](http://www.flickr.com/photos/kirbyurner/10102193153/)\n\nCarol visits Thirsters @ McMenamins\n\nThis fairly low key weekly conversation group has recently switched digs, moving from the McMenamins on Savier in NW to the McMenamins on Broadway in NE.\n\nCarol regaled them with stories about her work for civil / human rights and Constitutional democracy in the Philippines, Bangladesh, Egypt and Lesotho.  She talked a lot about the Transformation Resource Center (TRC) as being one of her very favorite NGOs.  She never mentioned PAFID by name, the NGO she helped resurrect in the martial law Philippines to counter the land-grabbing polices of Colonel Elizalde and his cronies.  Yes, this was in the Marcos period.\n\nWhy did the US back Savimbi in Namibia again?  She has always freely questioned so-called \"US foreign policy\".  The succession of presidents made a difference.  Under Carter, her work was more celebrated and acknowledged.  EB asked her why she got \"kicked out\" of the US Embassy in Maseru.  Again:  a change in personnel, and anyway rotation is the norm in embassies, where few last as long as five years (as she had).\n\nCarol and TRC had a lot of input during the hammering out of the Lesotho constitution in the aftermath of the insurrection by those voted out.  These people started burning down the whole country and surrounding nations had to intercede militarily, which they did without a bloodbath, though killing occurred.  Hammering out an agreement after that took about three years.\n\nShe played up the role of Quaker conflict resolvers, indigenous South Africans, in the ending of Apartheid.  My parents had great admiration and respect for the RSA (Republic of South Africa).\n\nShe talked about meeting dad and their collaboration as expats.  He was more the technocrat social engineer (sounds evil -- regional and education planning mostly), while she would work as a volunteer, more like Descartes, by which I mean she had more leverage when not subservient to a boss.  She could follow her intuitions more and whereas mom is often mixed up about matters of fact (in my opinion) she is capable of good judgement (\"discernment\" the Quakers call it).  One of the Thirsters made some insightful remarks along those lines.\n\nI talked to Doug a lot, Peace Corps vet from Liberia in the 1970s, left before the Civil War.  He'd been back in DC for President Carter's inauguration.  I chose that day to see the Tutunkamn Exhibit -- while the new prez and his wife were strolling down Pennsylvania Avenue in a parade.  Looking at ancient Egyptian stuff at the same time was not disrespectful, but an acknowledgment of our bonds to civilizations past (and maybe consult de Chardin about our bonds to the future).\n\nThirsters obviously enjoyed this presentation.  Carol has good command of her subject.\n\nI was fairly social with people but also brought along The Rajneesh Chronicles.  I'm about half way through maybe?  Anyone like me who fantasizes about eco-villages in rural Oregon should study this anthropology, or call it \"true crime\" (how the book tends to get filed at bookstores -- and not without reason mind you).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}