{
  "id": "2512418429028886766",
  "title": "Celebrating Wicca",
  "published": "2009-03-17T08:03:00.000-07:00",
  "updated": "2009-03-22T09:21:36.305-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/479692733/)You wouldn't suppose we'd be celebrating Wicca on St. Patrick's day, but in our family this is a day for remembering and honoring my dear partner Dawn Wicca, a mother, sister, valued friend for so many, bookkeeper of high commitment and integrity with a long track record of grateful clients, whom she treasured.She was also a spiritual teacher and practiced Celtic disciplines.  Her business, Turning the Wheel, a subsidiary of DWA (like 4D Solutions) was all about inviting a few families to our back yard and patio, to do handicrafts, share lore, maybe dance the Maypole if appropriate.  We never did the bonfires on this property, however we're not the only family living out these traditions, so yes, bonfires were lit, safely and with no sense of ill will towards fellow creatures, humans included.Part of the lore is one of non-capitulation to later forms of Christianity that seemed to insist on monopolistic powers (not all Xtians do), with no tolerance for defiance.  Some people insist that St. Patrick's disbarring of snakes from the Irish homeland was a thinly veiled dig at Druidic cultures, which found their ways more constricted, less accepted in public with the spread of more Roman Imperial forms of thinking.  Writing in counterpoint:I realize there's some irony in speaking so kindly of Python on St. Patty's day tomorrow but of course in my family we're glad to have Celtic lore alive and well, and besides there weren't any snakes before that so helluva job guy!  Might make some fun skits (\"did you get rid of the tigers too then?\").When Dawn joined Quakers, not just to keep me company but in honest appreciation for the stars she discovered ([Teresina Havens](http://mybizmo.blogspot.com/2008/07/together-friends.html) for example, who lead a seminar on Buddhism), she wanted her Clearness Committee to understand that she didn't profess to be Christian (Jesus didn't either) yet she was a sincere scholar who immersed herself in his mysteries, studied the people around him (his friends), and didn't this constitute possibly being a Friend of Christ, an Amigo?  The Clearness Committee thought yes, Christianity is not a requirement for Friends, Christ's own shining example making that clear.The girls will be joining a small circle this evening, whereas I'm giving the aforesaid talk, out on the heath, a ghost warrior (these \"math wars\" I fight are highly metaphysical you've gotta admit), still bearing my Dawn's standard with both pride and gratitude.Apropos Python, Guido's computer language, the link to snakes is more than a name collision, but the link to Druids might be a stretch.  I comment on that in a recent letter [to Aimée](http://mybizmo.blogspot.com/2006/05/tie-die-project.html):Admittedly, Python (the computer language), is maybe more Dutch than Celtic, but there's more to this battle I'm waging... which certainly have [sic] Celtic elements e.g. this drawing is by some famous Celtic drawer guy:[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgIxsIrZWP8yivh2uVTynkjtkX5PDPPGo9nuDLuIbSYp6Zn7lVJGcpdI9cEfqVdhabRduWZPqBc84JWC6EWN4zUrXnIZbUZFvM24a6QHd_NiW84F-G9PYDaqdnL_jYn76AMDkCA/s1600-h/pearce.gif)Fig. 321.01 Universe as \"A Minimum of Two Pictures\"Drawings by [Mallory Pearce](http://www.amazon.com/Celtic-Animals-Coloring-Mallory-Pearce/dp/0486297292)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}