{
  "id": "8098622448072986939",
  "title": "Chaotic Times",
  "published": "2018-06-14T17:17:00.001-07:00",
  "updated": "2018-06-16T08:58:50.390-07:00",
  "content": "I'll wade into [the swamp](http://controlroom.blogspot.com/2016/12/countermeasures.html) a little and talk about the recent meetups twixt top politicos in their respective nations, namely the G7 in Canada, and Singapore events.\n\nThe World Cup is going on now as well.  Rosalie tells me the USA team didn't make the cut, no [not a boycott](http://controlroom.blogspot.com/2018/04/cowardly-congress.html), just didn't qualify.  The sports bars around here are still crowded with soccer fans however.\n\nIn summary, that's my own picture of what's going on.  The picture of some superpower moralizing about bad guys and imposing sanctions is getting old, with systems needing to inter-gear and get on with keeping wheels turning.\n\nThere's no time to play these games.  India needs its oil from Iran.  South Korea is tired of war games against the northern half of the same peninsula.  The 1900s status quo all seems too silly.\n\nHowever, to bolster the public perception that political leaders are indeed the leaders, and not the chaotic forces of [general systems](https://medium.com/@kirbyurner/gst-in-the-global-u-f893a52bfe6a), there's an instinct to go along to get along.  The politicos need to ride the horse in the direction it's going, as that way they're seen to lead.\n\nThe Americans have elected someone allowed to be crazy and unpredictable, which is what the recipe calls for in chaotic times.\n\nWorld events in the internet age do not bottleneck through customary \"halls of power\" and yet people in nice suits with lots of accessories need to strut their stuff anyway.  The public figureheads do a kind of dance, put on a show, that helps the rest of us answer a perennial question:  \"what time is it, really?\"  The politicos (professional scapegoats) help close the loop in various feedback cycles.\n\n\"Chaos\" used to mean something bad, back in the days before we learned about dynamical systems.  Now we know that rigid rhythms mean rigor mortis.  The politicos show signs of life now and then, to keep from seeming too scripted, too programmed.  I get it.  Celebrities do the same.\n\nWe have lots of work to do, [around refugees especially](http://worldgame.blogspot.com/2018/06/refugee-camp-science.html) (I use the term broadly, to encompass the domestic unsheltered).  Eugene, Oregon is investing in tiny houses.  I don't know if Micheal Sunanda got one.  He and I have lost touch.\n\nMy plan to work with MercyCorps to showcase the latest and greatest in emergency housing, somewhere near PDX, [a tourist attraction](https://medium.com/@kirbyurner/tourism-for-academic-credit-9a5524dbb24), may be showing signs of gaining traction.  [EPCOT West](http://controlroom.blogspot.com/2016/07/epcot-west.html) we call it.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}