{
  "id": "83633118933664880",
  "title": "Chicken Littles",
  "published": "2016-07-23T13:41:00.001-07:00",
  "updated": "2016-07-25T14:14:04.805-07:00",
  "content": "One might think those into exploring the logical foundations of mathematics would have their interest piqued by the suggestion of a different way to model multiplication of two or three numbers.\n\nWe learn from childhood that a \"square\" number is like 2 x 2 whereas 2 x 2 x 2 is a \"cubic\" number.  But who dictated the two rods of length two needed to be at 90 degrees?\n\nSuppose we placed them at 60 degrees, might that be an area of 4 as well?  Could 2 x 2 x 2 = 8 be shown with three rods emanating as if from the corner of a regular tetrahedron instead?  These are not hard questions to think about actually.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjO8djChhlIUDS2oIOSEZR5ppaHKV_u0u4BASlK0O1-Ok5Pd0I4byZR8M_t0Jt_9Tdz7J3k4RhHYLrb6RoysPsqyXwxExnRw_7o0nEaHuI7pyfOJi-R2_kN2guZxR6iIJfb9jXE/s1600-h/tetship1.jpeg)by [Hollister (Hop) David](http://clowder.net/hop/index.html) \n(with attribution to me)\n\nR. Buckminster Fuller, with something like 45 honorary doctorates (meaning these institutions gave him a free degree to help prove its worth to others, as a standard-setter), considered the efficacy of [measuring in tetravolumes](http://controlroom.blogspot.com/2015/07/ramping-up.html) one of the most important mathematical discoveries of his career.\n\nHe built up a whole philosophy, as mature as any one person might fashion in a lifetime, [around the tetrahedron](http://worldgame.blogspot.com/2016/07/verboten-math.html), at the center of his metaphysics but also of his numeric and geometric computations.  The domes came out of that work.\n\nDid any philosophers pick up on these cues?  Or did they cop out by saying Fuller was an architect and it's the geodesic dome he'll be remembered for, not the mathematics?  Then maybe the next step is to attack his originality in that area, and use the word \"charlatan\" a lot.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjZXbJGtBScLbjYazir_-I0Bh7SgKQc4g6dh_G6csNQmXYk_Hr65VVmLIspfjk0B5AfRiLF649ARA5UPUlNWSS51hMzaA1-v4jegfkwGgf5o0lXZXmaO16eUL00RqNvlZYdr43l/s1600-h/tetship.gif)\nI picked up on the core philosophy, as did a very few others.  We've made some further discoveries since.  That's exciting for us.  But is \"a very few\" enough?\n\nGiven how much of the American Dream for a better tomorrow was wound up in Fuller's brand of global utopianism (cite Disney World's EPCOT's Spaceship Earth), doesn't it appear these deliberately short attention spans, and a willingness to parrot \"the authorities\" might have other, deeper motives?\n\nLowering expectations for the future seems more in line with what the [Great Tragedy Directors](http://grunch.net/synergetics/gst2.html) have in store for Spaceship Earth.  They've already scripted out their version of an End Times, and anything even remotely hopeful and utopian represents a disruption of their timeline.\n\nHow long do we keep postponing Armageddon?  There's some impatience to get on with it.\n\nPhilosophers with a longer view of tomorrow get shoved to the sidelines by the distopian schools.\n\nTo check whether your own school is distopian, more a part of the problem than a part of the solution, find out if any of Fuller's Synergetics is ever excerpted and discussed.  Is it on any syllabus whatsoever?\n\nConsider jumping to a different school, with a stronger philosophy department, if not.\n\nStill one of the best publications on Synergetics out there:  [https://t.co/SBmQMJTFur](https://t.co/SBmQMJTFur) [@BuckyFullerInst](https://twitter.com/BuckyFullerInst) [@buckminfuller](https://twitter.com/buckminfuller) [@BuckyFuller_](https://twitter.com/BuckyFuller_)\n— Kirby Urner (@4DsolutionsPDX) [July 23, 2016](https://twitter.com/4DsolutionsPDX/status/756931759690747904)\n\nMe teaching philosophy to adults:  [https://t.co/AZGOtYS3RE](https://t.co/AZGOtYS3RE)  Free School, Portland. 2010\n— Kirby Urner (@4DsolutionsPDX) [July 25, 2016](https://twitter.com/4DsolutionsPDX/status/757684923905953792)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}