{
  "id": "96494196564745221",
  "title": "Chronicling",
  "published": "2024-12-14T22:54:00.000-08:00",
  "updated": "2024-12-16T05:36:40.967-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/54206286268/in/dateposted/)\n\nSome kind of registrar changeover is happening in the background, as ownership of my 4dsolutions.net account has become a property, supposedly backed by a server hosting a lot of Oregon Curriculum Network stuff, going back a long ways. A Pioneer in Open Source. At this moment it's working.\n\nAnyway, I'm maybe sounding nerdy cuz I just met a nerd from a parallel universe, except more criss-crossing than strictly parallel. He knew well my old code train from those days: the dBase train, in turn a descendent of Vulcan, at JPL. \n\nWe chug-chug-chugged right into the Microsoft tunnel (some might say mouth) and transformed into Visual FoxPro, a different animal in some ways, but for the likes of me, a smooth enough transition, and to a popular platform. My GUI apps looked swank, back in the day (no, I don't think we said swank then either). \n\nIn that story the \"we\" is the subculture using dBase, yet finding ourselves onboarded into the Microsoft universe (com objects...). The bigger picture is Borland bought the rights to the original dBase lineage, which had already been cloned by Clipper and FoxPro and some others. Microsoft bought up FoxPro to compete with the Borland branch, the shared language, Xbase more technically, expected by some speculators to have a longer half life.\n\nThis guy at the Xmas party, said he spoke perfect German, but of the Saxon variety, whatever that means. It meant something to their tour guide in Dresden that time. We were also talking authors (Borges, Vonnegut...) and English words with both liked. The guy and his wife had been on a tour in Dresden specifically themed around Slaughterhouse Five.\n\nMostly though I'm following threads in a different rug, as they don't say in German. I weave my signature baskets, incorporating various themes.\n\nI don't actually have the proverbial complete picture on the state of legacy dBase and FoxPro, whether either has had much staying power. I'm not advertising myself as some authority on that topic. I do know that Microsoft officially pulled the plug on Visual FoxPro (VFP) in 2015, having migrated us up through a version nine. A new architecture was emerging. Web servers would be taking it from here. The new design was called the LAMP stack and the pricing was novel too: have at it, it's free.\n\nBy \"different rug\" I mostly meant different medium, more Youtube than books, and instead of cable. I'm one of those households with no cable, which doesn't mean I'm entirely ignorant of cable, just that I see it filtered through the lens of a critical eye, that eye which refers to your slice of the pie as \"legacy\". What gives, cable? Both have advertising, which one can turn off for a fee. In what sense are scrolling media in sync with the video stashes? They sync up quite a bit.\n\nI'm a small time YouTube maker myself. I use Camtasia. You will find examples of my videos scattered throughout these blogs.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}