{
  "id": "3257186547791784018",
  "title": "Cider House",
  "published": "2015-11-24T23:12:00.000-08:00",
  "updated": "2015-11-26T21:42:49.732-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/23235498531/in/dateposted-public/)\n\nOne might logically surmise I'd been here before, a new establishment just blocks from my house.  But other times I've tried, I've found it really crowded, as in no seating.  At least they're doing a good business.  Given my no beer diet, this was an appropriate place to meet up with Trevor.\n\nTrevor's experience doing archive work began in earnest with his tackling the writings of one George Walford and his peers regarding their newly invented subject of Systematic Ideology.  When I first met Trevor, decades back, he was already steeped in that project.\n\nHe has continued to grow in that role, more recently sifting and compacting the Buckminster Fuller Virtual Institute collection by Joe Moore.  Next to Applewhite, Joe was one of the key archivists of Fuller-related \"collateral\" as Ed referred to such materials.  Ed had worked with Bonnie on other aspects of the same challenge.  Joe chose Trevor as an heir for his collection.\n\nThis time, when we met at Cider House, [Trevor](http://controlroom.blogspot.com/2010/03/arts-and-crafts.html) had taken on at least two more projects, one for the City of Portland, involving a special collection within the library, with some very rare and great books (even an ancient stone tablet) and another involving papers donated to an academic institution by a famous columnist alum.  He'd flown back east in connection with the latter project.  He loves his new Apple watch.\n\nI kept it to one dry cider < 7% alcohol as my Internet radio show was soon to begin.  That's not really what it is, it's a class that I'm teaching by sharing audio and my screen, in real time.   Tonight we looked at Python generators, using triangular, tetrahedral and icosahedral numbers, Pascal's Triangle, then Fibonacci numbers for a lab.  The time went by quickly.  I somewhat lost track of it.\n\nOne of Trevor's older websites had become so popular that it fit Google's profile of a spam site.  How could one person be that prolific?  Rather than fight the shunning that occurred, being listed as a spam site, he took that as a cue to drastically reshape the content.  That's life on the Web:  rolling with the punches and morphing if need be.\n\nI meant to [work in Lucy](http://mybizmo.blogspot.com/2009/03/field-trip-to-seattle.html) today, in my talk on classes having ancestor classes.\n\n[](https://www.flickr.com/photos/kirbyurner/23267848896/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}