{
  "id": "5421745058980987228",
  "title": "Circuit Designs",
  "published": "2012-10-23T02:07:00.002-07:00",
  "updated": "2012-10-27T17:59:04.853-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiLvjrHfIg4mk6YHMxttJsfqZPeolCfYk-CLYGAvohf-tO1mVxiufEyoGuS-cHXUH9ugPsO0xB2pp1AuanVkFRAdTdKLv3AL8QFQclZWzu-t1BFyqCpH2lAk03oFhfuLztBtngI/s1600-h/laffoley_purgatorio_1975_xl.jpg)[Il Purgatorio](http://mybizmo.blogspot.com/2008/10/cosmic-tourist.html)\n\nWhat's somewhat ungainly about Quakers is membership in the global community is usually through one's local meeting.  You join a local chapter (they're not called that) to become a recorded member of the Religious Society of Friends.\n\nThat may sound fine on paper but what of the discontinuities?  You may feel called to Quakerdom, but in your mind that means a proudly isolated [esoteric lineage](http://mybizmo.blogspot.com/2009/08/quakers-101.html) that might not even be Christian (which you feel good about, Christendom being violent, perhaps unsalvageable).  Ah, but the local meeting would never accept a heathen-pagan like you.  Fat chance you'll ever get to join the Religious Society through any \"door\" within a radius of five hundred miles, not with those beliefs.\n\nLikewise, what happens if you're already a member of the Religious Society but then either get disowned by your meeting, or you resign because of changes in local policies.\n\nAll of a sudden, your unprogrammed meeting gets the itch to go pastoral, and the chairs get rearranged.  You feel plenty alienated and promptly resign, but not because you want to separate from Quakers as a whole.  You just can't abide this local change in flavor.\n\nSome groups in Indiana do things around water that would scare the bejeezus out of so-called Liberal Friends.  So what if you're hungry to join FGC style Quakers, or [College Park Association descendents ](http://www.quaker.org/liberal-history/bean.html)(Bean, Brinton... Hoover) and there's no branch of that type in your area?  Up a creek without a paddle?\n\nI might propose the term Limbo Quakers for those caught with no Monthly Meeting, for one reason or another.  Disownment, resignation, or never achieving clearness in the first place, on the part of the meeting maybe, could all be reasons for remaining a Limbo Friend.  Your meeting was not ready for your \"relationship\" or your \"family\".\n\n[Like on American Dad](http://mybizmo.blogspot.com/2006/12/american-dad-plot-synopsis.html):  there's an ET in that family, what does the Bible say about ETs?  Can ETs become Quakers?  No human being is illegal (AFSC's contention), so all aliens must be legal aliens, unless they're not human.\n\nThere's a Catch-22 in all this.  Someone is convinced they're a Quaker of exactly the type described in the Faith and Practice of meeting X, but meeting X is far away, and one of the criteria for membership in meeting X is geographic proximity.  You need to participate in the life of the meeting, get to know the folks, before they welcome you with open arms.  There's a process.  But you need to be there.\n\nSuppose a family moves close to meeting X (like choosing a school district) precisely to access the Religious Society through this chosen front door, only to relocate back to wherever?\n\nAnd there's no friendly meeting where they go back to.\n\nMust they surrender membership in meeting X then?  Not usually.  Hand-offs are to friendly meetings.  Limbo Quakers are left alone, as \"isolated Friends\".\n\nThat doesn't mean local Quakers are unfriendly (though it may).  It might mean there simply aren't any local Friends.\n\nFriends are obscure, especially the non-pastoral variety (are they even Christian? -- it's not all or nothing).  Why should there be Friends locally?  It's not a given.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}