{
  "id": "8314383178387941489",
  "title": "Citizen Diplomacy",
  "published": "2020-03-20T14:03:00.000-07:00",
  "updated": "2020-03-20T15:45:59.383-07:00",
  "content": "I suppose the idea of \"global citizen\" sounds hokey as it never had any legal meaning, even if the UN Declaration of Human Rights underlined the self evident:  that human beings matter above and beyond the hokey melodramas they're made to star in.  They're a phenomenon of Nature, it sounds silly to point out, I realize.  We trash Nature, and are taught to laugh about it.\n\nAnyway, enough moralizing. The point here is that of course a diplomatic crew, by job description, is acquiring and communicating intelligence about the terrain it traverses, in service of T4P and whatever sponsoring commercial carrier.  Nothing to stigmatize here, or get upset about.  There's no point screaming \"espionage\" when you're simply doing what everyone expects of you.\n\nGathering intelligence is a part of your business and way of adding value, which doesn't mean you just wander off over private property trying to ferret out secrets.  You become privy by being invited, and by proving trustworthy with the information (which sometimes means sharing it, perhaps without attribution to an original source, per the journalistic code of ethics).\n\nProwling around in the ambassador's office after hours, with a flashlight, is more private detective work than diplomatic. We need not confuse roles.  Not that diplomats can't be sneaky, or good at prying loose clues.  However our truckers have to get on to the next check point or place of business.  The analytical picture will develop from multiple reports.\n\nThe diplomat is familiar with \"official channels\" which is where the official truck stops come in. You'll have approved ways to be on panels, give talks.  If you've got a pet peeve, expect a track for that, if only the hallway track and ad hoc interest rooms.  Geeks bring their \"unconferencing skills\" to the table (thinking Barcamps, OS Bridge and so on).\n\nYes, there is government presence.  Why wouldn't there be?\n\nConsistency and safety checks happen.\n\nThese are not \"anything goes\" hubs (these rucker havens, these asylum cities) of no discipline.  On the contrary, keeping a busy world hub going, with truckers coming and going, requires a tight ship to some extent. Think of a well run airport (PDX comes to mind).\n\nThat's not to say R&R is out of bounds either.  Even tight ships may have their cinemas and swimming pools.  Counter-culture cultures abound.  Diversity happens.  The cosmos is cosmopolitan. Truck stops may have dance and theater, in many languages.\n\nFor those just joining us, the year is 2030, lets say, and truckers have become accustomed to freelancing on a global basis, which doesn't mean without loyalties.  You may be your own business and still have a preferred list of customers, or a list of \"goods\" you would like to not be complicit in handling, plus you're not for being deceived.\n\nSome drivers, let's say the better ones, won't transport poached animal products on principle and even advertise this fact.\n\nAt the core of our Global Trucking Network (GTN) is the network of Truck Stop Hubs (TSHs), which have evolved quite a bit from their early days along the Federal freeways (the I-system) of North America.\n\nThose freeways still require a lot of maintenance, even with the \"zombie truck\" fleets (what we've also called \"driverless\") but then so are trains (e.g. subways) often robotic and just as intermodal.\n\nGlobal University talk is a jargon and paints us all as students and faculty, we know that.  Long ago, specialization took specific forms, such as in Victorian England.  Some people were aristocratic and tea-cuppy, while others did so-called \"dirty jobs\" that needed doing, amidst many that were largely unnecessary.\n\nTrucking stayed necessary, even unto the Era of Extreme Automation (people argue on when that started).  The class associations that used to set off university people as distinct from truckers, didn't survive the transition to a next century.\n\nIn addition to performing as students and faculty, we engage in maintenance, admin, janitorial and security.  Thanks to work-study, all jobs are part of some academic program or other.  You may certify as a black belt in some, a newbie in others.\n\nThe Quakers thought a lot in terms of nominations and rotating duties.  Your community would provide you with opportunities to become well-rounded, an investment in pooled abilities.\n\nIn that spirit, I've been focusing on trucking as a citizen diplomat activity.   You'll find some of my writings on Medium.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}