{
  "id": "1437666955341541564",
  "title": "CitizenFour (movie review)",
  "published": "2014-11-12T20:11:00.000-08:00",
  "updated": "2014-11-13T13:07:10.803-08:00",
  "content": "Big slow-moving bureaucracies that can't do their own thinking are easy targets for the faster thinkers, human individuals, brains with integrity, geeks or what have you.\n\nThe NSA is easy to crack and spy on, its mostly military-minded leaders none too bright and none too keen on protecting the Constitution, which they most likely know little to nothing about.\n\nGoogle is easy to spy on as well, as is Verizon.  These companies have little to no ability to protect against serious investigative reporters, let alone geeks.\n\nThe table-turning [of Wikileaks](http://mybizmo.blogspot.com/2013/12/new-years-2013.html) etc. is obvious:  the real intelligence community owns the unimaginative bureaucrats, the laughing stock victims of professional spying.\n\nNo, I'm not saying Snowden was a criminal, guilty of espionage.  Like [Manning](http://controlroom.blogspot.com/2013/05/approved-long-distance-membership.html), he's a bright kid who wants to uphold and defend democracy.  He thinks for himself.  Unlike most generals.\n\nSo what do we learn from \"spying\" on [the NSA](http://worldgame.blogspot.com/2005/12/big-foot-strikes.html): that most of its people are average Americans e.g. they get along to go along and aren't particularly principled.  So what else is new?   The technology is new.\n\nI remember researching \"PGP guy\" ([Zimmermann](http://en.wikipedia.org/wiki/Pretty_Good_Privacy)) versus Bobby Inman (then head of NSA).  Should ordinary citizens have a military-grade skill set?  The opportunity, the freedom to have that, is what counts.\n\nOrganized government, like organized religion, says no.  Who asked them though, right?\n\nAnyway, PGP plays a role in this movie, as does encryption as a general theme.\n\nThis film could be shown in high schools to:\n\n(a) inspire patriotism and respect for geeks and\n(b) motivate more learning of maths, [crypto](http://4dsolutions.net/ocn/clubhouse.html) in particular.\n\nI saw it with Carol and Melody at Living Room Theater #6 in downtown Portland, a couple blocks from the main Powell's.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}