{
  "id": "5024434138631788918",
  "title": "City of Morons",
  "published": "2013-08-28T10:23:00.000-07:00",
  "updated": "2018-05-11T23:33:22.748-07:00",
  "content": "Washington DC ([WDC](http://worldgame.blogspot.com/2011/11/double-feature.html)) wants to give its prime contractors an opportunity to test new infrastructure, such as permanent bases in Iraq, and is therefore ramping up to attack targets in an area formerly known as Syria.\n\nThe nation-state system is [in a shambles by 2013](http://controlroom.blogspot.com/2013/08/a-bomb-day.html), with out-of-control Washington DC bombing whatever and whomever it likes, enjoying it's \"superpower\" status (a psychopathic state of mind).\n\nThe City of Morons should not be trusted with guns, let alone missiles or heavy weapons.  But everyone knows that already.\n\nMaybe chemical weapons were used, but for Washington DC to say \"UN, you don't need to check, we have the evidence\" is not going to impress anyone.  That's what they said to the UN in Iraq.  They were lying.  They lie all the time.  We tune them out as just noise.  DC is known to instigate wars based on false reports of events, starting with the Indian Wars at least.\n\nThat city's continued banking on the credibility of the USA, a once proud nation it insidiously helped to destroy, just makes it look more pathetic than ever.\n\nI agree with this statement from Foreign \nMinistry spokesman Alexander Lukashevich:\n\n\"Attempts to bypass the Security Council, to once again create \nartificial, unproven excuses for an armed intervention in the region, \nare fraught with new suffering in Syria and catastrophic consequences \nfor other countries in the Middle East and Northern Africa.\" \nYou won't bring the dead back to life by not allowing the UN to make its own investigations.  And if \"retaliation\" is what's needed, how about something other than wanton murder?  Find those responsible and prosecute, don't compound crime with more crime.  Duh.  Chemical weapons anywhere, like nukes, are [a disgrace](http://controlroom.blogspot.com/2006/02/jihad.html).  Send them back to the junk pile and destroy them.  Do it now.\n\nStart another war without allowing independent investigation of the evidence (again) and you further endanger the very people you claim you want to help (but we don't believe you -- you only help yourselves; you suffer from \"cruise missile build-up\" and want to release the tension).\n\nDC just doesn't get how untrusted it is, how vile and putrid its track record, how deep its hypocrisy.\n\nCascadia to Syria:  we're sorry.  We may be next.  They've already done a lot to destroy Hawaii and [the Pacific Rim](http://controlroom.blogspot.com/2013/11/pacific-islanders-meet.html), including with radio-toxic chemicals.  By using DU, they commit chemical warfare on the environment daily, and many die as a result (no one knows how many).\n\nFollowup two years later:\n\n[NYT backs away from \"vector analysis\" smoking gun theory](https://consortiumnews.com/2013/12/29/nyt-backs-off-its-syria-sarin-analysis/) (Dec 19 2013)\n[Questions linger regarding sarin attack](https://consortiumnews.com/2015/09/16/was-turkey-behind-syria-sarin-attack-2/) (April 6, 2014)\n[WDC funds both sides in Syria Civil War](http://www.latimes.com/world/middleeast/la-fg-cia-pentagon-isis-20160327-story.html) (April 1, 2016)\n[Rush to Judgement](http://controlroom.blogspot.com/2018/04/rush-to-judgement.html) (April 8, 2018)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}