{
  "id": "502194181660940105",
  "title": "Claymation Station",
  "published": "2025-02-06T10:09:00.000-08:00",
  "updated": "2025-02-06T19:30:09.307-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgcZh65IRpAO02m9KtsrT4pf7Om8u6d5J65c3yYYJJb93CHOqFmKizcwR9meC1S6Vq4s87ZQhfTtGdez0072O-DFBpcXJCwUyeOUsBFIKqxt_jm0WmI6ht2v9BgrV_lrmmBuO3HGnAsvkqAfnSag13jMq2McrqfOuJgsPH-hWyIAxPIS7qd-Zst/s1024/claymation_station.png)\nYesterday was about Claymation i.e. stop-action movie-making using clay figures. One builds a flip-book i.e. a film with delta t determining frame rate or frequency. Shoot for at least 24 frames per second for that smooth motion appearance. There's also the \"claymation look\" where the video is actually developed using ray-tracing with clay-like textures. I don't call that \"cheating\", I call it \"emulating\".\n\nWhat do my clay creatures do? I was thinking of snakes as the default denizen of our somewhat stark and austere geometry world, each representing a quantum of clay. The regular tetrahedron, or regtet, what we call \"home base\" in our geometry, made of four unit-radius balls packed together (also clay) is likewise our unit of volume, our quantum. It rolls out into a snake.\n\nWe make cubes too of course. The duo-tet cube, so-called, is actually three snake's-worth of clay mushed together. It's called a duo-tet because of the Merkaba, the 3D version of the 2D Star of David. These patterns get used in sacred geometry scenarios over the centuries and so have all these names. We're not trying to hide from this heritage, but nor need we brand our work as \"religious\" in nature, though we're free to.\n\nA 3-snakes cube plus another snake's-worth, creates the 4-snakes octahedron. Then we have the 5-snakes rhombic triacontahedron (RT). Any time we have a shape, we're free to scale it up and down, called growing and shrinking, such that it hits other volume stop points. \n\nThe RT stops at volumes 5 (120 T modules), 5+ (120 E modules), 7.5 (120 K modules) and at 21.21 where it is comprised of radius-2 icosa edges and its 30-edged dual, the pentagonal dodecahedron. The icosahedron has edges 2R and volume 18.51..., expressed in surds as $${5}{\\sqrt{2}} {ϕ^{2}}$$.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}