{
  "id": "4224007076035134958",
  "title": "Cloud Atlas (movie review)",
  "published": "2012-11-12T22:45:00.000-08:00",
  "updated": "2013-04-03T10:19:16.737-07:00",
  "content": "Good literature provides many doorways in and out, this movie no exception.  I'm not dismissing or dispatching a movie in \"reviewing\" it.  That doesn't mean \"always behind me\" as if there's no more this work has to teach.  I'm not saying that at all.  [Like Being There](http://mybizmo.blogspot.com/2006/01/being-there-movie-review.html), I keep going back to it.  Movies can haunt one.\n\nI've been a Halle Berry fan from the beginning, sort of [making fun of myself](http://mybizmo.blogspot.com/2009/01/about-habitats.html) in the process.  Tom Hanks, great actor.  These are contemporaries.  [Jane Fonda](http://worldgame.blogspot.com/2012/06/our-week-in-indy.html) is part of it (no, she's not in this movie).  We shared a time.  These were celebs I grew up with.\n\nWhere I want to go with this movie is here: instead of spreading it way out in time, lets yak about \"from one day to the next\".  The masks stay the same to some degree but isn't it like \"another lifetime\" between chapters.  Your own life is like this movie, in having its \"same people\" but not quite.\n\nConnecting to an earlier viewing, same theater, days before:  karma is conservation of momentum.  In the namespace of this movie, we could add.\n\nThe preview was [about Lincoln](http://worldgame.blogspot.com/2012/11/lincoln-movie-review.html), the upcoming Spielberg rendering.  I've been reading up on the Civil War on my own, not because I knew about this movie.  Meaning I was primed to see the theme of slavery in New Seoul.  Beyond slavery, to utter parisitism.  I've been studying intra-Quaker dialog around that time.  Abolitionists were known as \"immediatists\" and \"comer outers\".  The good old boy Quakers were more like \"we'll get around to it, it's not like you tell us what to do\".  Not that they owned slaves themselves by this time (they'd divested over a generation or two) but they didn't want to be seen as \"anti-gummint\" and \"the gummint\" was saying slaves was A O K.\n\nWhat keeps the movie watchable is it rewards on many levels, including with good humor.  There's a happy Hobbit House flavor to some of the comic interludes (\"It's People!\").  The eye candy is good.  It occasionally hits a B-movie sweet spot that says \"yes I know I'm an illusion\" which for this audience works great.\n\nI stumbled out of the theater to a text message reminding me of a friendly gathering I could be at.  I was led to go and hopped off the 4 with a realistic plan.  But then my GPS system confused me by moving the dot in response to the entered house number, persuading me my original plan was bogus.  I hopped back on the 4 (another one) and, after a shopping-for-mom interlude, took the 14 to what in my imagination might be \"Fosterville\".  It wasn't, and the party was nowhere near.  I was in a dark neighborhood with no good excuse, but not a dangerous neighborhood, as really nobody cared.\n\nAnyway, back to the movie, this was proposed as a kick-off media event for a new Quaker group I'm attending.  Instead of all reading some book and yakking about it, we all watch a film or video.  But just as people may read alone or in small groups, so may we not all see the movie as a gaggle.  It's not like you'll see a whole posse of Quakers walking in to Seven Psychopaths.  That'd probably empty the theater as too strange.  Not that we'd all dress alike or anything...\n\nGreat epic science fiction, something I think the 1950s science fiction writers would have really appreciated, some of them still around.  Asimov, Arthur C. Clarke, Heinlein... that long list of pioneering contributors to graphic novels, comic books, full on prose, all in confluence with anime / manga in retrospect, with Japan suddenly a great hub for science fiction.  Korea too of course, not trying to play favorites too hard.  Earthians.\n\nI don't think the animals changed a lot over the span of this film.  The people had some, but they were pretty recognizable.  In H.G. Wells and other places the frame goes so far forward that we're dealing with a rather different cast of creatures.  That could be right here on Earth.  Like by the end of AI. \n\nTrue, the fabricants were the living sex dolls who maybe took over later?  I may have missed some things the book version explains.  That all these worlds tightly fit together was not so important to me that night, although I did notice the music house and the lock away house were the same building.  Some of the players had me fooled.\n\nThe guy on my left, probably older, was pulling out his cell phone and I was filled with annoyance.  Yes it's a 2 hour and 44 minute film.  That's long.  I think he was perplexed and using his phone for orientation.  Stern Quaker that I am, I thought about balling him out and pounding his cell phone under my heel but of course that's all meditative AVP imagery, as I had no intention of shifting my weight.  I simply got back to the story with Hale Berry and somewhat forgot he existed.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}