{
  "id": "5838968219653852171",
  "title": "Coal World",
  "published": "2013-07-30T21:32:00.000-07:00",
  "updated": "2013-08-11T18:33:59.106-07:00",
  "content": "[](http://www.flickr.com/photos/kirbyurner/9488241961/)\n\nThe hunger to burn carbon is in a race with another hunger to burn the released carbon dioxide, which is plant life's hunger.  Is glaciation brought on by wild burning, as soils weaken for lack of minerals?\n\nIs another \"glacial dusting\" in order?\n\nThat's an old climatological theory, not one of mine.  I have some glacial dust in the garage I'm pretty sure.  A fertilizer.  Microbes like it, they say.\n\nSome readers know the theory I'm talking about, better than I do.  Hamaker-Weaver, right?  Yes, [Wikipedia confirms](http://en.wikipedia.org/wiki/John_D._Hamaker).\n\nThe hunger to consume coal is pulling it down the Columbia by barge through terminals yet to be built.  Cascadians are up in arms and their flag has been flown in a Food Not Bombs bike trailer, where our King of Cascadia (a guy named Pepe) signaled his displeasure.\n\nThe revolt was in Vancouver, Washington and well attended.\n\nWe have a surfeit of electrical power and have no need for dirty coal ourselves.  This is all deal-making wherein we Cascadians (add to spellchecker) pay the costs, bear the brunt of those  \"externalizations\" economists talk about (a degraded ecosystem).\n\nOr were you relishing the smell of coal in your nostrils.  You've just been chomping at the bit at the bit for that taste?  Better than beer.  Coke and Coal go together, don't they.\n\nHowever I have neither video nor stills (yet) from this protest event.  Check cold storage at Facebook.\n\nWe've got the flag (one of many) her at Blue House for continued use with Sky Blue (one of the trailers).  You may remember how it featured October 6.  She's down at the same park this evening, with the old office chair left behind.  This is the regular beat, with service from Base R2D2 (sounds like Star Wars).\n\nNo, I've been caught up in OSCON and doing my day job, confining the radius of my photography to Oregon State, with a lot of shots of my plates (as in \"dinner plates\" -- fancy meals I've been having).  Today was Sushi Land, on break as chauffeur (medical appointment for a Friend).\n\nI do have a few shots of Lindsey starting off, with the \"PepeMobile\" trailing the other trailer.  It'd be switched to Adam later. This was last Saturday.\n\nWe would prefer to export clean energy as we do with that Inter-Tie, DC to LA.  We have generators idle a lot of the time, with vast amounts of wind coming on line.\n\nSo where's the real time smart grid we were promised?  Is there a Smart Grids for Dummies?  Bonneville was pretty much closed down because of the hiring scandal recently.\n\nSpeaking of electrical power, yes those server farms do drink it down.  We used to do more aluminum, until Google came along, then also Facebook.  The hydropower is plentiful and racks need to be cooled, just as your body needs to radiate to keep you happy in that comfort zone.\n\nElectronics have their comfort zone too.  The move to photonics and/or a graphene economy may lower the average temperature, but that remains to be seen.  By how much?  I'm not posing as some expert.  Just another guy with a microphone, asking questions.\n\nFinally, a thought about \"nursing homes\".  Let me focus on one of the best ones around here, [Terwilliger Plaza](http://www.terwilligerplaza.com/).  Wanderers went there for a party, and recruited new Wanderers from their midst.  Doug Strain lived there.\n\nYou could think of it as a university complex.  Do you think a 70 year old brain is too old to tackle Erlang, a computer language?  What if she or he has already learned some other languages?\n\nWe don't allow ourselves enough opportunities for such experiments.  Cruise ships have turned the corner maybe, in harboring intellectuals, but couldn't we do better for our elderly?\n\nMore piped in TED Talks might sound like a small thing.\n\nOr what about in prisons?   Build your own infrastructure if you have to.  Focus on finding better ways forward.  That's a sharable mission.\n\nAt San Quentin they studied General Semantics, under the direction of the warden.  I met Gene Fowler (poet ex con) through that program, or one like it.  He got to hear a Bucky talk.\n\nYou can find missing puzzle pieces if one is at least allowed to look.  Give nursing homes more bandwidth and help 'em search for, and find, those marbles they've supposedly lost -- or maybe never had in the first place (says the joker).\n\nFriends care about prison conditions / philosophies and old people.  Joe Havens took on \"treatment of the elderly\" as his protest issue, the focus of a hunger strike.   We need to up our skill level around taking care of old people, as that's going to be all of us making it to that age, in this lifetime or another (if you'll permit a multiplicity of life stories in your experience, even if only experienced \"vicariously\"). \n\nAnother job for the Chinese Peace Corps: helping Americans get it together to take care of themselves.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}