{
  "id": "8214031265076167832",
  "title": "CodeCastle: Escaping the Base 10 Ghetto",
  "published": "2016-07-07T13:04:00.001-07:00",
  "updated": "2016-07-09T14:37:53.193-07:00",
  "content": "I was born in the 1950s, around the time Russians first launched a satellite.  The US military had yet to do so and a crushing sense of maybe falling behind set in, one response to which was to shake up the mathematics curriculum with New Math as it was called.\n\nSome brains in the University of Chicago came up with their SMSG curriculum, which phased in many novel concepts, including that numbering, or counting, takes place in a \"base\".\n\nEngineers and rocket scientists had long before embraced this notion, but K-12 still reflected more agrarian origins, with lots of different units, many of them non-metric and non-decimalized (tea and table spoons, pints and cups), but with little formal reasoning about \"bases\".\n\nAs they say about fish not knowing about water (because they swim in it 24/7), so might we not see our arithmetic as \"base 10\" in particular.  What would it mean to count in another base?\n\nThis topic was taken up as early as 2nd grade, the grade I was in when I first learned about \"place value\" and \"number bases\".\n\nTom Lehrer (a mathematician as well as songwriter) came out with his New Math song around then (above).  I wasn't sure why it was so funny to the grownups, as it was mathematically correct.\n\nThe lessons learned from the New Math experience inform my designs for #CodeCastle, some \"Pi in the Sky\" institution (pun intended) that isn't as top-down as SMSG was.  How might we help K-12ers escape their time warp and join us in the 21st Century?\n\nBy the time I returned to the US from overseas in the 1970s, New Math was in a shambles.  NASA had mounted its Apollo program and put astronauts on the moon, in fulfillment of president Kennedy's promised stimulus package.  Mission accomplished.\n\nNo longer suffering from a sense of falling behind, though willing to truck out a \"missile gap\" to scare up funding, the New Math was largely shelved by school administrators.  Remnants permeate the curriculum to this day, but the backlash against it had been intense.\n\nTeachers did not feel prepared to embrace all these innovations.  The learning curve was too steep.  Something more retro was adopted, then made more fuzzy.  The so-called New New Math was made center stage by the 1980s, with its own set of critics.\n\nIn moving towards a Common Core, for [the convenience of big publishing](http://worldgame.blogspot.com/2016/06/pandering-to-muggles-editorial.html) especially, assurances were given that we'd not be returning to the \"bad old days\" of New Math, where \"bases matter\".\n\nEverything will be comfortably in our familiar Base 10.  Leave it to college courses, or accelerated electives, to go beyond. Don't require it.\n\nGiven industry is by now mostly powered by binary numbers, expressed in terms of hex numbers, this decision to \"ghettoize\" K-12 as a Base 10 backwater, was controversial.  Weren't they off on the wrong track?  Decimals run on binary rails in digital computing.\n\nFortunately, two additional facts worked in favor of high tech industries:\n\n(1) the Common Core sets a floor, not a ceiling and the teaching of hexadecimals is easily added\n\n(2) school systems are appreciating the need for computer science friendly STEM courses and adapting to include them.\n\nIn Oregon, my #CodeCastle initiative ties to #IP28, a ballot measure aimed at increasing taxation levels on specific categories of business, according to a formula based on sales.\n\nIt's not a consumer sales tax, although special interests fighting the measure suggest that it is, knowing Oregonians have a record of defeating anything they consider a \"sales tax\".\n\nPromoters of IP28 say it's about improving schools.  If that's so, then the businesses asked to up their ante might do well to make sure those improvements are real.\n\nEarmarking legislation is in order.  Teacher training is in need of funding.\n\nA role model teacher spends as much time learning and researching, studying, as teaching.\n\nIf the pie chart of a teacher's day is all teaching and grading, doing admin and lunch hall duty, then at least a third of the ideal day is missing.\n\nI also think we need to role model adults getting along, collaborating.\n\nAt least two adult teachers per high school classroom would make a lot of sense in many cases, sometimes both in the room, other times spelling each other.\n\nNeither teacher need be junior to the other, in terms of rank or experience.\n\nOf course the latter reform suggests a much bigger budget than even IP28 would allow.  We would need a stronger education culture in Oregon, with the means to sustain a quality school system. Lets work together on finding ways to achieve this ideal.\n\nIn 2015, we saw that NASA astronauts still considered hexadecimals important in that Matt Damon used them to save his own life as the left behind astronaut in The Martian. \n\n[](https://www.flickr.com/photos/kirbyurner/27569956504/in/dateposted-public/)\n\nSoyuz docking with International Space Station in July 8, 2016",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}