{
  "id": "7096252232543261277",
  "title": "Code School + Gift Shop",
  "published": "2016-04-30T10:04:00.001-07:00",
  "updated": "2016-05-01T09:24:58.890-07:00",
  "content": "Designing an on-line Gift Shop is often the last thing a small business wants to take on, as their professional interest is likely not in learning to code such a thing.\n\nCompanies like [Weebly](https://youtu.be/ZOeyYAfKXLI) and [Rakuten](https://youtu.be/tF7HXJJjRvY) are about solving the [Supermarket Math](https://groups.google.com/d/msg/mathfuture/eCn2ZS5lry4/Vmvm1aO_KgAJ) problem of making it easy to have a website, including one that features a shopping cart with checkout features.\n\nOn the other hand, a Code School is where people go precisely to learn how to implement such services as an on-line Gift Shop, and moreover schools traditionally come with \"swag\" advertising their brand (T-shirts, hoodies, mugs, backpacks and so on).\n\nSo the question becomes:  does a given Code School \"[eat its own dog food](http://www.investopedia.com/terms/e/eatyourowndogfood.asp)\" and roll its own Gift Shop, or does it outsource [to CafePress](http://www.cafepress.com/) or whatever? \n\nIn order to show the world that Code School students are [learning the skills](https://mail.python.org/pipermail/edu-sig/2016-April/011453.html), any number of virtual Gift Shops might be kept on the shelf (on the rack) for students to hack on.  A way of building one's profile is to showcase one's contributions to said projects.\n\nSome of these on the shelf shopping applications will actually do front line duty in real time.  A given Code School might swap out the Ux on occasion.\n\nAn existing open source project, [such as Shoop](https://www.shoop.io/en/), [Oscar](http://oscarcommerce.com/) or [Cartridge](http://cartridge.jupo.org/) written in Django + Python, might be a good starting place.  Students learn by modifying an existing project.\n\nOther applications may permit a kind of \"virtual shopping\" wherein shoppers \"practice\" using the Ux for free, a way of testing features and building community, with virtual money against virtual goods.\n\nThese prototype test beds might only face in-house, but why not make some public facing, as well as open source?  Good advertising, kudos to the school, if the shop shares some good ideas and/or interesting implementations thereof, perhaps even in \"exotic\" computer languages, such as Haskell and Go.\n\nHowever, there's a more elaborate plan lurking just beneath the surface here.  Lets remember Friedrich Froebel, the inventor of Kindergarten, and his strategy of connecting the schooling process to gifts.  Bucky Fuller attended such a school and had an early breakthrough with the \"peas-works\" gift, leading to gaining the privilege of patenting the \"octet truss\" in the 1960s. [1]\n\nAs a student moves through schooling, rewarding that student's progress with gifts makes a lot of sense.  Gifts may be tools of the trade, like a microscope or telescope, faster bandwidth, better access to the Internet, a personal workspace, an office.\n\nIn the military, people say \"rank has its privileges\".  These privileges may be granted without need for cash awards.  Code Schools might think in terms of linking various milestones to specific rewards, perks or privileges.\n\n[1]  Cole Gerts, Poet of Geometry, 2013 Option-G Visual Communication ISBN 978-0-615-87344-2, page 13.\n\n[](https://www.flickr.com/photos/kirbyurner/26702240685/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}