{
  "id": "6436239055340731733",
  "title": "Coffee Shop Meetings",
  "published": "2010-01-17T16:59:00.000-08:00",
  "updated": "2010-01-18T20:35:21.981-08:00",
  "content": "Regarding TT (teacher training), [I diagrammed a workflow](http://www.flickr.com/photos/17157315@N00/4283502713/sizes/l/), pretty primitive, while waiting for Rami, an MVP Oregonian ramping up around Django.This is all based on old news though (from last summer), mixed with a little recent email.  Were I a journalist, I'd probably be called into the editor's office, to be asked if there's really a \"there\" there.Django is a content management system (CMS) that allows developers to build more full featured web platforms, such as ThinkSpace.Django is written in Python and provides a free and open source library of tools one needs for talking to databases and presenting well styled web pages to the user.  You also get session management, user authentication, an admin back end.These tools come as a tightly integrated Python package (in site-packages) and work right out of the box.  The rest is your own secret sauce.In a separate meeting at Starbucks, I learned about the Red Card, while explaining my philanthropic gaming idea, basically a \"U drive\" lottery system, with shop patrons taking credit for their donations to charities.  You'd need the right banks to accept the incoming funds and convert them to EFTs as a service.Speaking of coffee shops, I was in Lyrik again this morning, hobnobbing with Joe about Flextegrity again.  We pulled up the folder and [rolled through some slides](http://www.flickr.com/photos/17157315@N00/sets/72157623211669418/show/).   Last night was a grand opening for some new pieces, several of which sold.If I stick with photography, then the story comes to you, perhaps in far away Japan.  It's not either/or though.  Local venues make sense.  Lindsey is always strong-arming people towards Muddy's, which I appreciate.  Aimee and I are thinking of going there next time.I was glad to see Allison Randal is getting nominated to the PSF Board.  +1.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}