{
  "id": "5520583144201967479",
  "title": "Cold War Stories",
  "published": "2016-11-12T21:38:00.001-08:00",
  "updated": "2016-12-15T19:16:20.699-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/30913235716/in/dateposted-public/)\n\nLong time readers of my blogs will maybe have seen how I bring up [the \"U2 incident\"](http://worldgame.blogspot.com/2009/02/u2.html) from time to time.  This is another one of those times.\n\nDavid Talbot cites L. Fletcher Prouty, or \"Man X\" — played by Donald Sutherland in Oliver Stone's JFK — as especially knowledgeable about the U2 incident.\n\nHowever David sticks with the conventional narrative, that missiles hit this supersonic spy plane at high altitude, whereas Prouty himself calls that story line [into question](https://politicalassassinations.wordpress.com/2010/05/05/cia-documents-show-us-never-believed-gary-powers-was-shot-down/).\n\nProuty sounds a lot like a prototypical \"9-11 truther\" in calling the basic physics into question, wondering aloud in several passages, how Gary Powers could have survived.  Did he eject before the missiles hit?  Why did he have all that incriminating ID on him?  Might he have simply landed the plane instead?\n\nThe operation certainly cost Allen Dulles some respect and judging from Prouty, that may have been a principal aim. Not everyone was suffering from blind hatred for Communist Russia, certainly not Lee Harvey Oswald, who'd also worked in the U2 program in Japan. A smart Marine, he was curious about what life might be like in the USSR.\n\nAllen had only partial or limited control over operations but had promised the moon, having seen regime change in Iran as proof of his superpowers.\n\nThe former OSS was never altogether sold on the idea of dominoes in Vietnam either, witness [Daniel Ellsberg of RAND](http://worldgame.blogspot.com/2014/01/spiralling-onward.html), a strong patriot who simply didn't buy the old guard's fading worldview.  Ditto Ralph McGeehee.\n\nTrying to bully or intimidate these people, already skilled, doesn't always produce the intended results.\n\nEisenhower was under a lot of pressure after WWII to use the \"nuclear advantage\" for something meaningful.  The Devil's Chessboard chronicles how irresponsibly John Foster Dulles, as Secretary of State, blundered about on the world stage, confusing Tunisia with Indonesia while threatening everyone with nukes.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}