{
  "id": "5769546983178527518",
  "title": "Computer Anatomy",
  "published": "2007-06-10T16:49:00.000-07:00",
  "updated": "2007-06-10T16:52:45.371-07:00",
  "content": "My last upgrade to Camtasia Studio cost me easy access to sound features within the application, owing to my exotic integrated RealTek circuits, stardard on these HP Pavilion a1630ns, but that still doesn't mean there's a huge intersection of app users willing to press for a solution (by running diagnostics, sending screen shots and so on).In the meantime, as new C stuff is hammered out, tech support advises that I slip into something more Soundblaster-compatible. Here's the polite letter, which I'm not complaining about, simply sharing:Hi Kirby,We found that this is a specific issue with Realtek intergrated sound card. We are currently working on ways to accommodate the rare integrated type of sound cards that seem to have issues with Camtasia. In the meantime I would recommend purchasing a Sound Blaster sound card as we have always had good success with those working with Camtasia.Please let me know if you have any questions.Kind Regards,MikeTechSmith SupportOK, so I could dissect the Santa Cruz card out from [KTU2](http://worldgame.blogspot.com/2007/04/upgrades.html) in the basement -- the unit swapped in to replace Jennifer, once I repurchased the latter from Derek for display in the Pauling House as a generic, well performing Ubuntu box (from where I'll sometimes post to my blogs, such as during Wanderers meetings, like when not lugging my wireless Toshiba Satellite) -- and transplant it into [KTU3](http://worldgame.blogspot.com/2007/01/ktu3.html).On the other hand, those [Camtasia movies](http://www.youtube.com/profile_videos?user=urnerk) were more \"proof of concept\" and're still out there doing work, so I'm not all that knickers-in-a-twist (as Brian might put it) over the vacation I'm getting from making more mathcasts and/or pilots for [~M!](http://worldgame.blogspot.com/2007/01/m.html). Let's give would be sponsors ample time to evaluate the merchandize. I don't believe in being too pushy.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}