{
  "id": "4643379512511840884",
  "title": "Competitive Gaming?",
  "published": "2009-03-22T19:31:00.000-07:00",
  "updated": "2009-03-24T08:49:22.424-07:00",
  "content": "In a post queued for tomorrow on [the CSN blog](http://coffeeshopsnet.blogspot.com/2009/02/launch.html), I take up the subject of [proprietary games](http://coffeeshopsnet.blogspot.com/2009/03/proprietary-games.html), cite a somewhat violent one ([Half Life 2](http://worldgame.blogspot.com/2004/12/interface-designs.html)).  I know cynics are thinking I might be hiding behind [AVP talk](http://worldgame.blogspot.com/2009/02/avp-again.html), using Quakerism as a mask, while giving a green light to tastelessly violent video games of no socially redeeming value.  Am I selling out to make money then?The question is misconceived in the sense that I'm not playing traffic cop, am not some uber-censor handing down edicts on what people might play.  Personally, I'm looking forward to cooperative, team-building sports, not necessarily indoors, that make use of new toyz.[Geocaching](http://controlroom.blogspot.com/2005/12/we-win.html) is certainly a start, already has group aspects.The question about proprietary games \"in principle\" is more properly a concern for [the CIO](http://mybizmo.blogspot.com/2008/07/more-wild-west-biz.html) probably, but I'm already somewhat aware of his thinking on this issue.  Engineers want layers of open source at strategic levels within the chip-to-cloud stack.  Closed off, veiled and/or private levels (as in proprietary) are not an anathema.  It's only if private interests become greedy and seek to exert some kind of stranglehold on resources held in common, that we must be prepared to defend our freedoms.I'm so far unable to see Milk, even though it's close by at The Bagdad.  Too much happening, no frills allowed.  I appreciate getting the invitation though.  Someday I'll have a social life again.  As things stand, I'm grateful for congenial coworkers. Increasing the supply of qualified personnel remains [a top priority](http://controlroom.blogspot.com/2009/03/from-top.html).  I'm seeing [some positive signs](http://www.nytimes.com/2009/03/17/science/17comp.html?_r=1&emc=eta1), amidst a lot of [unrealism](http://mybizmo.blogspot.com/2009/03/noodling-and-doodling.html).I'm glad the FWCC meeting went well.  I appreciate hearing from attenders Eddy and Leslie, as well as from [Nancy herself](http://mybizmo.blogspot.com/2009/03/quaker-mvp.html).  Had I not been so immersed in  [Wanderers Retreat XVII](http://worldgame.blogspot.com/2009/03/ostara.html), I might have made at least part of it, even though Canby is a ways (just south of [Oregon City](http://mybizmo.blogspot.com/2006/07/deq.html)).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}