{
  "id": "3260293825997758452",
  "title": "Competing Solutions",
  "published": "2006-12-17T11:54:00.000-08:00",
  "updated": "2008-11-15T02:36:58.411-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgon4FrKUouDW4CDubsHFgK0pmcaTUFlykuVDk8jti1Y9y-UtCI8ITv211EflOD4HnkPwqK5vKADQxFJuPxmItuedPht3PmPpE93ITa_KQYp5EGm8pZOJAOZkhWbSj43Z3qjWb7/s1600-h/sanmiguel.jpg):: san miguel, socorro :: I'm laptopping from Socorro, New Mexico, using a line of site antenna to New Mexico Tech, with an authorized static IP. I've been comparing notes with local faculty on various topics. For example: the right handed XYZ coordinate system is far more standard than the [left handed one](http://mathforum.org/kb/thread.jspa?threadID=1508615&tstart=0) used in [POV-Ray](http://www.povray.org/) -- but we already knew that, didn't we?So how should we improve students' education in America, make it \"world class\" as we say? My thinking has evolved in the direction of improving the average teacher's job description, less directly in terms of money, and more in terms of what opportunities for further education it provides.Teachers need to role model the paradigm life long learner to their students. Inservice training, long a feature of the job, needs to become a relatively larger slice of the pie, in terms of the time and energy devoted thereto. A larger cast of players needs to take responsibility for giving teachers [better overview](http://worldgame.blogspot.com/2006/01/more-re-public-education.html), a better grasp of what goes on in various walks of life.In this way, my own [geek culture](http://worldgame.blogspot.com/2005/08/more-from-oscon.html) will get more of a footprint in K-12. More teachers will become aware of such innovative solutions as [Pythonic mathematics](http://www.4dsolutions.net/ocn/cp4e.html).Won't this approach lead to increasing rates of teacher loss to private industry and/or public service, as teachers learn programming say, on the public dime? Yes. We need to build that in to the model. Young, energetic grads, closer to grade schoolers in age and presumably culture, get into teaching as a way to continue their own educations. Perhaps only a minority stick with it as a life-long career.Why should that be a problem?According to this model, the job is more attractive up front, including as a stepping stone to other careers, so recruiting new teachers is suddenly that much easier. The military uses elements of this approach, with the draw of \"the best toys.\" [Civilians](http://controlroom.blogspot.com/2006/07/civilian-technology.html) like toys [too](http://www.lindsaybks.com/bks4/wartoy/index.html). A summer camp for teachers might feature [newfangled shelter solutions](http://worldgame.blogspot.com/2006/01/location-scouting.html), permaculture, hands-on access to tomorrow's [high tech brands](http://www.4dsolutions.net/).[Master teachers](http://controlroom.blogspot.com/2006/11/revamping-remedial-math.html) that stick with it for the long haul become mentors for the relative newbies, perhaps roving the country in [bizmos](http://worldgame.blogspot.com/2004/12/whats-bizmo.html), helping to establish the new schema, based on what's already found to work in [other regions](http://mathforum.org/kb/thread.jspa?threadID=1507401&tstart=0) of the country.Relevant essays:[Re: Reality Check](http://mathforum.org/kb/message.jspa?messageID=5439833&tstart=0) @ Math Forum[                 Re: What Is 21st Century Mathematics?](http://mathforum.org/kb/message.jspa?messageID=5444502&tstart=0) @ Math Forum (Dec 19, summary, autobio)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}