{
  "id": "1330720446878127402",
  "title": "Conehead",
  "published": "2022-11-21T08:23:00.004-08:00",
  "updated": "2022-11-22T07:11:15.976-08:00",
  "content": "I'll summarize these couple hours so you don't need to watch them, not that I'd try to talk you out of it.  Times 2 speed?  Or sample.  That's what I do a lot.\n\nThat said, I come off like a conehead, a term you may not know, so time for Wikipedia, right? \n\nMore literally, I'm holding the camera very close to my face in extreme closeup, but from an angle that makes my forehead towering, so I look like a conehead, and to some extent sound like one too, no doubt.\n\nThe backstory is I only got clear on the time of this event right when I'd just decided to walk to a food pod for food cart Thai food, then come home and fix Carol's dinner.  Dr. D. was in the mix.  How could I do that and be on Zoom at the same time?  Answer:  phone apps.\n\nI've used Zoom for years, but never saw a need to cram all that bandwidth into the palm of my hand.  However with Bluetooth and Airpods, not only was I able to tune in the meeting, I was able to jump in as a talking conehead.  Peter Meisen was in a similar situation:  surrounded by peep noises, yet poised.\n\nSo yes, I managed to move forward on several fronts (cooking and other logistics) while having my head popping up somewhere near Philadelphia.  CJ couldn't be there this time.  Shrikant was his usual good humored self.  Everyone was pleasant.  They're very civilized back east, although Shrikant said he'd spent a decade in the Pacific Northwest and could attest to our having our own version of culture.\n\nI was all thumbs however, this being my first time to use Zoom in its phone app format.  I kept swiping the entire app off the screen, meaning I'd kill it and have to sign in again.  That happened at least twice.\n\nThe bottom line is I've been tracking (as in lurking in on, usually after the fact on YouTube) this 52 Living Ideas meetup for some time now, as I recount in my self intro.  I've hosted backyard meetups of folks loosely known as Wanderers, with Shrikant and/or CJ on the iPad, sharing the picnic.\n\n[](https://www.flickr.com/photos/kirbyurner/51483680831/in/album-72157719856979729/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}