{
  "id": "8551126394327466964",
  "title": "Connecting the Dots",
  "published": "2007-07-09T17:07:00.000-07:00",
  "updated": "2007-08-11T15:53:39.653-07:00",
  "content": "The talk went OK I thought, in Zeta (all the rooms have Greek letter names).The gist:Students like to be clued in regarding technology, especially when it represents the promise of better living standards.  [Calculators](http://mail.python.org/pipermail/edu-sig/2007-July/008028.html) shouldn't artificially delimit what we mean by \"technology in the classroom.\"Understanding of computers, how they're programmed, gives a deeper appreciation for \"how things work\" in many walks of life e.g. data bases are prevalent.Mathematics and computer programming need to be better integrated from an early age.  The object oriented paradigm (OOP) brings some unifying heuristics to basic mathematics, as we're able to cast polynomials, vectors, polyhedra, rational numbers and so on as \"math objects.\"Working backward from a vision of the future in which many more people are much more computer literate, we need to ask ourselves:  how did we get here (a more enlightened world) from there (the dark ages past)?[P4E](http://controlroom.blogspot.com/2007/07/programming-for-everybody.html) succeeded not because everyone had to learn Python or had to choose computer science or programming for their profession.  Rather, we converged problem solving skills with coding skills, code being another kind of mathematical notation (the machine executable kind).Our integrated approach also involved [connecting the lexical to the graphical](http://worldgame.blogspot.com/2005/01/text-drives-graphics.html), keeping the so-called left and right hemispheres of the brain integrated.For eye candy I had my [hypertoon](http://worldgame.blogspot.com/2006/05/tv-commercial.html) projecting as people took their seats.  During the talk I rotated the Beryl desktop cube a few times, switching to various websites.For example, I demonstrated looking up [1, 12, 42, 92...](http://www.research.att.com/%7Enjas/sequences/A005901) in Sloane's [On-Line Encyclopedia of Integer Sequences](http://www.research.att.com/%7Enjas/sequences/).  We might use such sequences to motivate writing a few [Python generators](http://www.4dsolutions.net/ocn/winterhaven/section3.html).I didn't actually have time to run any of my source code, nor even explore it in much detail.I only got two questions, one about whether I get any income from my teaching (yeah, some) and one about H.S.M. Coxeter and his possible influence on my  curriculum writing (he's one of my heroes, helped give focus to polyhedral numbers).There were some microphone problems and page up/down weren't working in OpenOffice so I kept resorting to the mouse wheel, which was awkward.P4E: [slides](http://www.4dsolutions.net/presentations/connectingthedots.pdf), [paper](http://www.4dsolutions.net/presentations/urner_europython_2007.pdf), [4dsolutions](http://www.4dsolutions.net/), [edu-sig](http://mail.python.org/mailman/listinfo/edu-sig), [CP4E](http://www.4dsolutions.net/ocn/cp4e.html), [OEIS](http://www.research.att.com/%7Enjas/sequences/), [Kusasa](http://www.kusasa.org/), [PyMath](http://www.4dsolutions.net/ocn/pymath.html), [Mathematics for a Digital Age](http://www.skylit.com/mathandpython.html), [math-teach](http://mathforum.org/kb/forum.jspa?forumID=206)  HP4E: [Hexa-wuh?](http://mybizmo.blogspot.com/2006/10/hexa-wuh.html), [EuroPython 2005](http://mybizmo.blogspot.com/2006/08/hp4e.html), [Hexapent Turtle Shell](http://worldgame.blogspot.com/2006/06/666.html)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}