{
  "id": "1285424186761833879",
  "title": "Consider the Parallels",
  "published": "2022-06-25T18:34:00.006-07:00",
  "updated": "2022-06-25T18:34:48.158-07:00",
  "content": "[copied from Facebook] \n\nSo was The Revolution of Dignity, which ousted an elected president (facing new elections shortly) a \"successful\" Jan 6, by the standards of its instigators? \n\nHad Trump been successful, wouldn't far right nationalism have triumphed?  But no, some states would have questioned Stop the Steal had it really thrown the electoral process into swing state managed ad hockery and chaos. Bernie never said they stole it from him, nor had Gore. The mob ruled that February in 2014. They stormed the place and got their way (thanks to months of planning).  An insurrection, and  one way more violent than the maga one.  Lots of shooting. Surrounding states were appalled, some of them, as now marijuana would never be legalized (how it feels to speak the language of an underclass). What if Oregon had started to move towards greater autonomy after Pence's decision to channel Trump after all, in this alternative reality? Were we going to blame the Venezuelan voting machines after all? The socialists of the world were tipping it to Biden and brave Pence had stood his ground. Oregon's people are already quite alienated (the prez sent his border patrol to quell the wall of moms and leaf blower dads). Their biggest industry (one of them) is prevented from using the banking system.  Sanctions destroy the lives of ordinary people while the rich get to smoke their dope unimpeded. Anyway, how do we prevent too many \"compare and contrast\" pieces looking at 2014 and 2021?  Any linking of these two attempted mob takeovers of government on behalf of a ruling cast, could just further confuse the politics of the two countries. Fortunately, \"we\" have a great way to flush away unwanted thoughts by inducing amnesia.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}