{
  "id": "3735121978720515089",
  "title": "Consumer Story",
  "published": "2012-06-07T13:00:00.005-07:00",
  "updated": "2021-07-27T16:45:58.122-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157630014045833)\n\nFinding a yellow toilet is not the easiest thing in the world.  I'd fatally weakened the old one, by adding a big rock to the tank.  The rock swelled, making it impossible to remove without shattering the tank.\n\n[The Hollywood Aboy](http://www.aboysupply.com/t-hollywoodstore.aspx) located a yellow Kohler, following up on some sleuthing by other household members.  Today, the new toilet arrived but minus one critical washer in [Accessory Pack 1024390](http://www.facebook.com/note.php?note_id=341296099258401).  Mick tried to find a kit at George Moreland but no dice.  The washer is somewhat special in slipping over the screw head, making the tank flush ([heh, English](http://mybizmo.blogspot.com/2006/11/flushed-away-movie-review.html)) against the bowl.\n\nAboy had too many in the queue to field my call for help in anything close to real time (my call was returned late the next day), so Mick stopped his clock and just made it his business to locate the part.  Kohler is a big name, you would think there'd be such a supply in this town.  Lets see what tomorrow brings.\n\nNo wait, Mick just called.  He thinks he's found a compatible washer.  Lets see if this story has a happy ending today then.  Today is Tara's 18th birthday for real (legally / officially), although we celebrated big time [last night](http://worldgame.blogspot.com/2012/06/another-big-day.html).\n\n[ Brief interlude helping the daughter of an emeritus stats prof at University of Illinois, Urbana-Champagne.  He didn't know Jerry Uhl well (an inspiration [behind NetMath](http://netmath.illinois.edu/coursesoftware)) but they did go the first grade together in Pittsburgh.]\n\nHey [Mick](http://www.micksplumbing.com/sinks-faucets-toilets.html), good job.  Thanks for being a cheerful, hard-working and patient guy.  The new toilet looks like it will use a lot less water, even compared to when the other tank had a rock in it.\n\nCoincidentally, my sister Julie is having toilet work done today as well, in her abode within Greater LA.  Carol flew off to Philadelphia.  We were [at PDX](http://www.flickr.com/photos/17157315@N00/7163402917/in/photostream) by 6 AM sharing breakfast [at Beaches](http://www.flickr.com/photos/17157315@N00/7163404039/in/photostream/).  She's on her way to Pendle Hill for the AFSC board members retreat.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}