{
  "id": "2951632561252095406",
  "title": "Contraband",
  "published": "2009-07-14T19:01:00.000-07:00",
  "updated": "2012-01-05T11:01:46.981-08:00",
  "content": ":: therapy ::\n\nLotsa school teachers get outraged by the deplorable content of some Youtubes, and I agree these videos about bullying seem amusing only to prosecutors, happy to get state's evidence handed to 'em on a plate like that.\n\nHowever, finding outlets for aggression is an age-old challenge and not everyone wants to morph into a world class NFL player, what with all those later-life weight problems, even with high salaries, constant public adoration.  Guitar and hotel room trashing rock stars tend to flame out too quickly, with similar problems in aging.\n\nI actually encourage violence against inanimate objects as potentially therapeutic, enjoy hitting my \"[Dr. Phil pillow](http://mybizmo.blogspot.com/2009/05/more-developments.html)\" sometimes, even if only mentally. So go ahead and brand me a heretic, for encouraging such as the above.  Like just today I wrote, in the Math Forum no less:\n\n[That example](http://mathforum.org/kb/message.jspa?messageID=6783034&tstart=0) was simply to blow calculators and their wee little screens out of the water.  We call them \"hamster brained\", use other epithets, maybe show Youtubes of running them over in a car, get that aggression creatively channeled.\n[What was I thinking](http://mathforum.org/kb/message.jspa?messageID=6784166&tstart=0)?\n\nYes, my [AVP polemics](http://worldgame.blogspot.com/2007/12/avp-2-movie-review.html) are controversial, including in Quaker circles, explains my moves to start up a remote brand, protect Friends from the consequences of my experiments [in rocket science](http://mybizmo.blogspot.com/2008/05/rocket-science.html).\n\nMostly I'm considered a fairly safe operator though, and I'm guessing most of these calculators were already broken, and if not may I recommend first turning them on and destroying them while lit?  Could we get some sparks please?\n\nNo, it's not the same thing as book burning.  A skillful judge would see the difference, even a white one, snicker (sorry, obscure historical allusion).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}