{
  "id": "2059579333495055777",
  "title": "Cooking Show",
  "published": "2009-06-05T08:29:00.000-07:00",
  "updated": "2009-06-07T09:58:53.647-07:00",
  "content": "I'm volunteering more time on the Home Economics classes I'd like to see, in this case [a cooking show](http://mathforum.org/kb/message.jspa?messageID=6740132&tstart=0) for the school intranet, devoting plenty of focus to both energy and health issues i.e. energy comes in many forms and \"more salt\" isn't always what your batteries need.How do I expect to compete with other text book publishers and their lip service people?  In part by not competing with them, in not offering [dead tree wood pulp](http://mybizmo.blogspot.com/2009/06/saving-trees.html) as a primary distribution mechanism.  I push hardcopy costs to the end user, keeping the server side in a version controlled environment, quickly patchable when errors are found.  There's no waiting an eternity for the publisher to fix it in \"the next edition\" (if you're even that lucky).[Cardinality vs. Ordinality](http://mathforum.org/kb/thread.jspa?threadID=1949077&tstart=0) is another important thread weaving through Supermarket Math.  You have all those products, but \"sorting by preference\" or even \"price\", top-to-bottom, makes no sense.  Whose preferences are we talking about when no one samples every product in the store, plus what would it mean to compare apples to oranges (actually, there it makes sense, in that people may have strong preferences ([I like them both](http://mathforum.org/kb/thread.jspa?threadID=1949352&tstart=0))).  Once you get into a single universal sort of some set, you're in an ordinal situation.  Rank in the military is often cited, but here again, we have several branches plus [room at the top](http://mybizmo.blogspot.com/2006/03/math-wars-continued.html) for many subspecies of civilian (in the USA model at least).You might think your stereotypical geek wouldn't be thinking about health issues, as aren't geeks these [overweight males](http://controlroom.blogspot.com/2007/08/simpsons-movie-review.html) who just sit and stare at screens all day, eat junk food with wild abandon, pay little attention to the physical plane (except maybe the one they're designing?).  I'd say that's more the \"nerd\" stereotype whereas geeks tend to be lighter weight [Japanese](http://coffeeshopsnet.blogspot.com/2009/02/outreach-to-japan.html) (Korean... Filipina) XXs, organizing in covens to get our Coffee Shops Network coded up by 2012.  I have very few guys on that project, almost none here in North America (they don't allow Synergetics here, by fiat or edict I'm not sure, but just check any university catalog for confirmation (fortunately we have the Internet and skilled translators, so the work proceeds apace, albiet slowly)).Note:  last night's storm hit our Belmont US Bank branch pretty hard apparently, computers down inside, not just the ATMs.  They've resorted to paper.  This may mean I'm a little late on some monthly payments.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjkFYzGRKvIRBHP7HRiDa08Ne_znpOAiXelEvGnw3b0JrFexdTb-PhdHNSbiy51XnYJsPcQlayzGtsCGU8pBTVpBaKl7fxb_gND14t-Cqf1beXiyvzop3mljxDqmMEFF0JOU6Yo/s1600-h/pinoy_group.jpg):: finalized version ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}