{
  "id": "2877082402784818343",
  "title": "Corporate Refugees",
  "published": "2009-07-09T11:09:00.001-07:00",
  "updated": "2009-10-25T22:49:16.944-07:00",
  "content": "You've likely heard the litany, about heads-down managers with blinders, worried only about the next quarterly statement, the long term not their problem, so what will work in the long run hardly ever gets tried (it's the short run that matters).The problem may be less that they're greedy, spoiled, feel entitled, and more that they simply don't have any good ideas or real management capabilities. Just bossing people around, telling them to do impossible things, giving pep talks, is hardly managing.Are your bosses like that guy who breaks glass and talks dirty [in Charlie Wilson's War](http://mybizmo.blogspot.com/2007/12/charlie-wilsons-war-movie-review.html)? Remember, that was an actor, a good one, with screenwriters behind him. People who act like that for real get carted away by security and put in a hamster cage, with Xanax snax through a slot, signed by [a doctor](http://worldgame.blogspot.com/2009/06/wanderers-2009623.html).Frequently, someone highly intelligent, a service sector engineer, will become a cog in this machine, and get over stressed, because the overall design is unworkable and that becomes transparent after awhile. It's a living wage and a dead end at the same time, and that's crazy-making. [She](http://worldgame.blogspot.com/2005/01/rebuilding-iraq.html) might go to her boss and say \"I want out\".Multiply this a number of times and you get what we call a \"brain drain\" in [cybernetics](http://en.wikipedia.org/wiki/Synergetics_%28Fuller%29), a feedback loop, and pretty soon some silos are Pointy Haired Bosses all the way down, not a Dilbert among them.In entrepreneurial cultures, such as Republicans foster (in talk if not walk [1]), an escape valve for the talented and gifted, not always the rich and famous, is to form a \"spin off startup\" that works to right noted wrongs aboard \"mother ship\". Iterations happen faster and the companies get [leaner and meaner](http://worldgame.blogspot.com/2004/12/school-business.html), or develop whatever [exaptations](http://mybizmo.blogspot.com/2009/07/lailas-birthday-movie-review.html) serve in the larger bioregion. At least that's the press.Portland is fortunate in having an entrepreneurial culture and a steady influx of talented refugees burning out in Lower48. They'll never work for a Pointy Haired Boss again, at the risk of going postal, but if you have Dilberts at the top (both XX and XY), then you might get a second look.The fact that they're not teaching [the Bucky stuff](http://mybizmo.blogspot.com/2009/07/screen-tests.html) in high school out there, is just another metaphor for the brokenness of this \"next quarter\" way of thinking, so-called \"business as usual\" (more it's [a freakish anomaly](http://controlroom.blogspot.com/2005/01/why-civilizations-fail.html), as longer lived cultures make longer term investments, including America's indigenous ones).This is less an indictment of the [USA](http://www.grunch.net/synergetics/usaos.html) than of [LAWCAP](http://mybizmo.blogspot.com/2008/05/carrier-movie-review.html), a post-WW2 internal gear works and puppeteer for its version of the USA. When that gear works seized up, became semi-paralyzed, it became more obvious to all that the men and women behind the curtain weren't really governing so much as helping themselves to the returns on past investments, made by relative giants, e.g. J.P. Morgan, FDR, Vannevar Bush, Walt Disney, other larger-than-life figures.[1] a famed quip of GWB's was that \"the problem with French culture is they have no word for entrepreneur\". [ Yes, I tend to put quote marks inside the period, based on Friend Thatcher's rants around Quakers for some years, made enough sense. ]",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}