{
  "id": "2362962488030821993",
  "title": "Cosmic Consciousness",
  "published": "2013-02-02T22:48:00.002-08:00",
  "updated": "2023-11-28T08:51:48.406-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157632677730922)\n\n:: a mashup of meetups ::\n\nDick Pugh graced Wanderers with his standard spiel, the one he takes on the road, with help from NASA.  He does a great job, as one of the world's leading experts on meteorites.  In more ways than one, it's a discrete science, a perfect niche, as there aren't really that many big ones you might own.  Only 6% are the iron type.  Most are rocks or hybrids.  Two days have gone by, and I didn't take notes.\n\nThe giant (or relatively large) hard thing breaks apart and leaves a field, usually.  It hits at an angle, leaving an oval pattern of stuff.  That's what the meteorite hunters look for, less for craters, which just don't happen that often.\n\nThe Earth's surface, being lush, or under water, masks some of its craterous features, plus its atmosphere really does burn up a lot of the smaller stuff.  Really big things that hit at cosmic speed are in a category of their own, and are Earth changing.  On the smaller side are the giant impact craters.\n\nOur small group was very privileged to handle so many certified rocks of extraterrestrial origin, many of them as old as the solar system or older.  Many have pedigrees and history.  Most are discovered, a few have known impact times.\n\nI encourage people to study meteorites and what they remind us about our solar system environment.  Seeking the \"shooting star\" as they're called is also a reason for getting outside at night under clear skies.  \"No child left inside\" is the Outdoor School slogan (something we have here in Portland).  Get off yer duff and go watch some space debris burn up in the biosphere.  Go alone or with dear ones.\n\nBecause a large mass will break apart, it can look just like a lot of windows of the same giant craft.  I recall when freeway goers including myself were treated to this illusion just south of Seattle one night, as if a great UFO had been sighted.  Cars pulled over, and a sight it was to behold.  The Seattle Times said later it was space junk breaking up, [something Russian](http://www.youtube.com/watch?v=1kvHl5Qcnzc) maybe.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}