{
  "id": "1441273408603305830",
  "title": "Countermeasures",
  "published": "2016-12-29T19:27:00.004-08:00",
  "updated": "2016-12-29T22:14:16.090-08:00",
  "content": "some USers remain skeptical...\n\nThe Obama White House did not need to wait until the requested analysis was completed, before showing it means business when it comes to punishing perpetrators. \n\nLike when we first heard reports from Syria, of chemical weapons being used: the White House [knew immediately](http://controlroom.blogspot.com/2013/08/city-of-morons.html) who was behind the attack, and barreled ahead big time, UN investigation be damned.\n\nWhat Russian spies helped uncover, about the Democratic Party, apparently proved [so heinous and repulsive](http://mybizmo.blogspot.com/2016/11/election-postmortem.html), that the public recoiled en masse and joined the Trump train to drain the swamp.\n\nSo the question now is whether the Russians did us a favor.  That remains to be seen.  USers have at least learned an important lesson:  we're a Banana Republic like everyone else, not immune from foreign meddling.\n\nThis historic revelation, that Russia forever changed the course of American history, using tricks well known to [Nigerian bankers](http://controlroom.blogspot.com/2016/10/bed-time-stories.html), is going to have repercussions around the world.\n\nSome surveys suggest USers themselves remain skeptical of the [seventeen intelligence agency](http://controlroom.blogspot.com/2016/10/emerging-cyberia.html) consensus, the same \"intelligence community\" that made both Colin Powell and George Tenet, and eventually the US president, seem [so like idiots](http://worldgame.blogspot.com/2010/01/more-geopolitics.html) on the world stage.\n\nI understand why [the president-elect](http://mybizmo.blogspot.com/2016/12/political-cartoon.html) is reluctant to sign his name to this narrative.  Anyone hoping to \"make America great again\" would think twice about surrendering to this tail of defeat.  Russia is more of a world power than we realized maybe.\n\nGiven what we now know about [the DNC](http://worldgame.blogspot.com/2016/12/library-science.html), might that be a good thing?  Time will tell. Obama himself, judging from a last press conference, seems to think a new grass roots movement will help rebuild its image, in the wake of the latest rout.\n\nTrump has been saying all along the Obama administration was being outplayed by Putin.  He's been hankering for a fresh start, without the baggage of so many botched opportunities.  With the US losing momentum with its \"regime change\" agenda, this might be a time to figure out a new strategy?\n\nMe? I voted for Hillary because I supported the plan [with Iran](http://worldgame.blogspot.com/2016/12/radical-islam.html) to create thousands of new American jobs in transportation.  [The Iran Deal](http://www.quakerquaker.org/forum/topics/iran-is-officially-anti-nuke-wmd) is good for American workers.\n\nAs we learned from [Susan Lindauer ](http://worldgame.blogspot.com/2016/09/maintenance.html)(a CIA asset in the lead-up to 9-11), Iraq was prepared to buy millions of Made in the USA automobiles before Colin Powell messed up and persuaded us to attack the wrong country. The weapons testers were not happy with that Iraqi offer and railroaded us into war without telling us about it.\n\nLets not keep making the same mistake in thinking DC really has our best interests at heart.  If that were true, we wouldn't be where we are today. \n\nStarting a stupid war with Iran would kill American jobs waiting in the wings once long haul trucking routes are restored to former glory.\n— Kirby Urner (@4DsolutionsPDX) [December 30, 2016](https://twitter.com/4DsolutionsPDX/status/814639263199293440)\n\nTransportation engineers in training have that Istanbul-to-Kabul route to camp along, the El Camino of long haul trucking. Khyber Pass extra\n— Kirby Urner (@4DsolutionsPDX) [December 30, 2016](https://twitter.com/4DsolutionsPDX/status/814631780158296064)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}