{
  "id": "6655532594243168012",
  "title": "Countdown to Zero (the game)",
  "published": "2010-12-02T08:32:00.000-08:00",
  "updated": "2012-01-12T22:36:43.155-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjPL_bXOIcgPtDHODLk4EX-Sp5LcedlcCjhidb95GY_RBGiACjBF7cpYSObyrjOTFXWESaox6Q4BIMgyTkAxqRXhIhdJpN4ukc5GIachsSFo8Fp2gtmLum2DKS1TsQhk2wywUq5/s1600/geodesic_hillsdale.jpg)\n\nplayground dome, Hillsdale, Oregon\n\nAs I was remarking to [my fellow think tankers](http://groups.yahoo.com/group/synergeo/message/63687), you do not copyright titles, so we are really talking about a whole genre of game, with many internal axes or criteria, such as \"how much math?\".\n\nThe idea of a game based on a movie is not in any way new, of course, so I'm not loudly tooting my horn about this non-innovation.  As a role playing game, you probably have a choice, each with a wardrobe (imagine dressing your Sim).  You might be an FBI agent on a sting operation, somewhere in Colorado, with control panels to [IAEA](http://groups.yahoo.com/group/synergeo/message/63822), Interpol and CIA.  Your wardrobe includes [snow shoes](http://www.flickr.com/photos/17157315@N00/6682356631/in/photostream) (optional accessory).\n\nFor those who didn't catch the movie, [Countdown to Zero](http://worldgame.blogspot.com/2010/07/countdown-to-zero-movie-review.html) is a sobering policy film, a documentary, in which several powers that be, across the political spectrum, line up behind this policy of criminalizing and eliminating all nuclear weapons.  Actually, [the criminalization phase](http://controlroom.blogspot.com/2007/11/defending-usa.html) might be more of [a medicalization phase](http://groups.yahoo.com/group/synergeo/message/64770) where we chalk up WMDs to PTSD and treat the \"[military industrial complex](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html)\" like any psychological complex in need of treatment.  That's for game designers to decide.\n\nAnother axis is realism.  To what degree is this set in the future, when presumably sensors are better, and infra-red webcams more affordable?  More to the point:  what actual datasets are publicly available giving known sources of weapons grade fissile materials?  Where are the dumping grounds?  The testing zones?  Much of this information is already available to the eco-tourism industry, which is bringing people through [Hanford, WA](http://controlroom.blogspot.com/2008/09/wanderers-200892.html) and to Nevada.  Visits to retired missile silos make for great photo-ops and [new uploads to Flickr](http://www.flickr.com/search/?w=all&q=missile+silo&m=text).  \n\nWhen it comes to realism, you'll want to work with colleges and universities with a focus in environmental sciences.  Serious schools take such studies seriously, if declaring an interest and attracting students on that basis.\n\nThe math does not have to be inordinately difficult.  The concept of \"half life\" is fairly easy to get across, and students will better understand why producing all these toxins was considered criminal behavior.  Many of the cleanup jobs are themselves life threatening and require special wardrobes and access to sensors.  The role playing done through the game is actually preparation for real life for some stellar players -- another reason to take the math seriously.\n\nRelated reading:\n\n[Storyboard / Simulation](http://groups.yahoo.com/group/synergeo/message/63947)\n\n[Background viewing?](http://mybizmo.blogspot.com/2010/12/santas-elves-movie-preview.html)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}