{
  "id": "757164163328680014",
  "title": "Cowardly Capitalism",
  "published": "2011-05-28T21:26:00.000-07:00",
  "updated": "2011-07-21T23:02:17.537-07:00",
  "content": "Cowardly Capitalism (CC) is the type that's risk averse and can't accept the idea of going head to head with non-profits or other governments when it comes to [providing world livingry services](http://controlroom.blogspot.com/2009/02/broad-brush-strokes.html), such as rental cars, jet rides, hotel accommodations, education and health services.  A military is allowed to have these services, but only in exchange for agreeing to carry out immoral acts, much as the children are expected to do overseas.Brave Capitalism (BC), on the other hand, is not threatened by the idea of a government running its own airline or rental car company, hotel chain, hospital chain.  Just another kid on the block. Governments manage according to different ideologies than most businesses.  Some won't do well with trains, others will be stellar.The ridiculous myth you get from the whiners is that it's all or nothing.  They talk about \"nationalizing the oil\" or \"nationalizing the banks\", as if a government couldn't have just some banks and not others, or just one of the major oil company brands, a rental car company.  The USG didn't need to take over Avis or Hertz, to have its own niche.Switching military over to civilian circuits, like when NASA went more Mouse in Orlando, is a great way to leverage existing skills and assets.  The USG already operates a lot of guest housing [near airports](http://controlroom.blogspot.com/2011/07/this-ones-for-you.html).  We could have more meetings on bases, \"we\" being civilians without obvious rank, not trying to crowd that seniority system or pretend to certain kinds of training.  We're special in other ways.I was ranting about this when Dave called from Minneapolis.  We have this rivalry going, about which city is more on the forefront in ways we treasure, such as bicycle friendliness.  I think our drivers could be more courteous, but so could our cyclists.  When I come to an intersection along Springwater Corridor, the drivers often stop right away, eager to prove they're on board with these urbane values.  I was on said Corridor just recently in fact, even though EmoKid (the bicycle) is losing about a pound a minute from her front tire.TinkerBell was stolen you may recall.  We have crime in Portland.  Our family car, Robin, was swiped as well, from the Lloyd Center Theaters parking lot, while I was seeing the movie Troy. After that, we got [Razz, another Subaru wagon](http://www.flickr.com/search/?w=17157315%40N00&q=Razz&m=text).  Razz met her end in the high desert, no one hurt, still drivable.  She was totaled, at which point I found [another car in the neighborhood](http://www.flickr.com/search/?w=17157315%40N00&q=Taxi&m=text) rotting in a driveway, the owner having come to Portland with an expressed goal of weaning herself from motor-vehicle dependence.  I was just trying to do a reverse lookup on her license plate when I again encountered Cowardly Capitalism.This is publicly collected information, made available [from government sources](http://controlroom.blogspot.com/2009/10/open-source-dot-gov.html), but rather than allow you the people to access it directly, you get to be told that the data is there, but you need to subscribe for X dollars to some private data service, a dot com, in order to reach this dot gov data.  It feels slimy and gross.  What filthy little businesses want to charge me to access my data about my own car, or other cars that share the road.  If you pilot big metal at high speed on public roads, don't expect to stay anonymous as a matter of personal rights.  You're not anonymous behind that plate or license.  Anyone can pony up the $40.  But they shouldn't have to.   If this were really a Land of the Brave, we'd be defended against such smarmy commercial practices.  Cowardly Capitalists are aided and abetted by those \"on the inside\" who are cowardly in the same way.  They join government precisely to undermine and defang it, a kind of mole.Lets allow the government to have a rental car agency.  The bookkeeping will be transparent. It'll be a profit center, helping pay for the hospitals.  Lots of summer jobs.  Some electric options. Discounts if you have a valid USG passport (retro nationalism has its perks, citizenship still matters in some ways).Once some of the other government companies are in play, we'll have [more attractive career segues](http://worldgame.blogspot.com/2009/01/repatriation.html) for ranking personnel.  Some may just keep doing what they're doing, in perhaps repainted university facilities, transit centers or whatever.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}