{
  "id": "3975466612720545900",
  "title": "Cowardly Congress",
  "published": "2018-04-12T11:24:00.003-07:00",
  "updated": "2018-04-12T11:29:05.730-07:00",
  "content": "I've been enjoying the spectacle of the DC senators lashing out against Facebook.  Cambridge Analytica, which grew out of the UK psyops establishment, is exactly the kind of operation these senators sought to demonize and use to justify sanctions -- against Russians.\n\nWhen it turns out the UK was being far more effective, something we already knew, there's no talk of sanctions.  On the contrary, it's now Zuckerberg's fault.  The UK, which burned the White House and helped with the assassination of Lincoln, is our friend.\n\nThe shrill rhetoric of these politicians, especially that joker-clown Lindsey Graham, the new Jesse Helms, is pretty disgusting.  I'm happy to heap scorn on their whole way of thinking.  Shoot first, ask questions later, and pretend that's somehow called leadership.\n\nSpeaking of disgusting, check out this [horrible crap](https://www.rand.org/blog/2018/04/hit-russia-where-it-hurts-take-away-world-cup.html) from the RAND corporation, by one of its shills.  More rushing to judgement.\n\nThe Winter Olympics was pretty scary to hawks in the US, as the two Koreas started acting more in unison.  The World Cup might be similarly disastrous.  The Pentagon jobs program, of supplying mercenaries to vultures feeding off the US corpse they failed to protect and defend, might be further jeopardized.\n\nSpeaking of the two Koreas, president Trump announced his interest in a meet up sometime in May.  With all these diversions, is that still on track?  I don't hear \"journalists\" asking that question.  Lets get on with that meet up.  Trump needs to meet with Putin again too, and he knows it.\n\nI was encouraged when Trump called Assad an \"animal\" which is literally true.  I like animals, it's just humans I sometimes can't stand.  Such craven beasts.  Religion hasn't helped much.  They're bloodthirsty creeps and now can't wait for a next big fight, which somehow is supposed to solve something.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}