{
  "id": "2533024714715807789",
  "title": "Cramming and Cleaning",
  "published": "2010-04-15T11:33:00.000-07:00",
  "updated": "2010-04-20T15:16:45.288-07:00",
  "content": "I've been looking at \"cramming and cleaning\" as two of my principal activities of late.  I've got [a teaching gig](http://worldgame.blogspot.com/2010/04/python-gig.html) coming up, so feel a need to cram.  The other challenge is digging out from under a pile of stuff in a respectful manner.  I didn't throw away my old notebooks (yet), and other media are gradually aggregating:  books to the \"time capsule,\" photographs to a room upstairs.  I'm under orders from a sponsor not to rent a dumpster (bad for PR to take the easy way out).Speaking of sponsors, my thanks to one of them for a cell phone upgrade.  The previous one was providing \"half duplex\" some of the time (they could hear me, but I couldn't hear them).  This next one, an LG, used and still in good shape, is more both robust and includes the full keyboard I've come to expect from the Samsung.Given I lug a laptop or netbook, I'm still not in the market for a busy \"apps phone\" with all the bling. Per [my CSN writings](http://coffeeshopsnet.blogspot.com/2010/04/smart-bar-lcds.html), I tend to aim for bigger rather than smaller LCDs.  [Hypertoons on an iPhone](http://coffeeshopsnet.blogspot.com/2009/05/hypertoons-from-csn.html) might look cool though.On the nationalism thread (one of the subjects under study in this campus household), I've been wondering about getting certain classes of student ID approved for trans-boarder traffic.  Some people, classified as refugees, have fallen through the cracks of the nation state system, find gaining citizenship (documentation) an almost impossible barrier.  A \"reboot city\" consisting of high turnover housing and skills training courses (like a college) might provide its graduates with student ID acceptable in at least some other locales.Along these lines, I once [made the suggestion](http://mybizmo.blogspot.com/2009/08/psf-posting.html) on the PSF list, that Python Nation (a 2nd world) issue passports.  These would be souvenir / gift shop items that one might get stamped at a Pycon or EuroPython or other venue.  The idea of actually using such a document to get through customs would actually be more prototypical of the \"virtual nations\" idea.  Yes, I see \"identity politics\" at work here; we're looking for ways to add freedoms, to improve the average global university experience.[ With all these gigabytes available, we should aim to start a thorough and helpful medical record for any new life, regardless of ethnicity or economic circumstances.  This would be an opportunity some might refuse, out of distrust or in obedience to some religious precept.  Better to refuse an opportunity than to not have it in the first place though.  Electronic medical records in some schemaless document management system (e.g Tokyo Cabinet) might make the most sense.]As long as one's persistent veridical identity provides some kind of audit trail as borders get crossed, a lot of bureaucratic requirements will be satisfied.  A person with a valid passport and internationally certified student / faculty ID might use either. The Facebook-like chronology (perhaps of border crossings and nothing more), would show if both were linked to the same identity.  Scanning the ID retrieves the record within the custom agent's browser.  Iconic flags and decals would decorate the average tourist record.Refugees with accepted documentation, yet still with no citizenship within any UN-recognized sovereignty, might nevertheless get opportunities to visit various campuses in the course of their work / study scenarios.  If Harvard had a satellite campus in Uganda, maybe Harvard students could go there using Harvard ID, just as Ugandans enrolling in Harvard through this satellite might thereby gain the credentials to visit Cambridge through a special gate at the airport.A doctors without borders HQS in Siberia might offer valuable training opportunities, complete with airstrip.  You might not need a passport to go there through Russian airspace, by agreement with authorities.  Similar facilities and/or transit centers might dot the globe elsewhere.  Your chronofile might still show you'd been there and elsewhere.  The average quality of [the information on tap](http://controlroom.blogspot.com/2008/10/on-tap.html) would actually be less sketchy than it is today. We currently live in a dark time when the so-called \"undocumented\" (more Global U students) are provided with little to no practical recourse in the face of the same unrelenting pressures to move about the globe as those bringing the pilgrims to Plymouth Rock, others to destinations in the Middle East and so on.  People are not trees, are not rooted so much as routed by God's will (if you'll accept a religious moniker in this context -- how [many pilgrims](http://worldgame.blogspot.com/2010/04/globalization.html) think of their leadings).Speaking of Doctors Without Borders, my congratulations to Vino Vixens on Powell for hosting a fundraiser for this group the other night.[](http://www.flickr.com/photos/17157315@N00/4511219759/)[](http://www.flickr.com/photos/17157315@N00/4511219759/):: musicians at work ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}