{
  "id": "1726666757770449392",
  "title": "Critical Path",
  "published": "2016-01-10T15:53:00.000-08:00",
  "updated": "2016-01-31T23:24:51.356-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/24277083086/in/dateposted-public/)\n\nI'd join this reading program, hosted by the BFI, led by one of its board members, however I'm booked for a gig of my own that same evening.  Malesh.  Another time maybe.\n\nCritical Path comes between Synergetics and Grunch of Giants, and follows the Hegelian pattern of some Pure Logic giving rise to History (a narrative telling, with a point of view, or many, polarized, and partially overlapping), which latter telling seems pretty twisted, leaving us worried Synergetics might not be the last word in the logic department (\"ongoing corkscrewing\" more likely -- it's not defining itself as a terminus).\n\nOr is complaining about \"weird and twisted\" a deliberate miss-framing of a poetically licensed work?\n\nLike what's this about humans specializing towards Idiocracy, passing monkeys going the other way, towards Planet of the Apes?  How did we get beamed here as information again?\n\nFuller's stars don't just shine at night, they program, for lack of a better word.  Lets at least agree their information is structured, if only spread out over signature frequencies.\n\nThe elements \"talk\" (broadcast) and why shouldn't they?  Spectrometers pick up information on what stars are made of.  Clearly the stars do inform the planets, in ways more than just by helping to drive photosynthesis.\n\nIn later chapters, Fuller definitely plays the Cold Warrior, moving his chess pieces around his global World Game board.\n\nBut then isn't \"cold war\" just more \"cryogenics\" in a synergetical sense, something meticulous and computational, like game theory?\n\nHow much of this is more smoke and mirrors?  How much enciphered?  Is \"explorations in the geometry of thinking\" a little bit like living through Lost?\n\nThey're always taking us down blind alleys, these tale-twisting bardic old people ([Tribal Elders](http://controlroom.blogspot.com/2016/01/the-seventh-seal-movie-review.html)).  Some level of suspicion is not out of place, if only as a defense of a personal namespace.  We each give voice to a Universe, Carl Sagan a case in point.\n\nBucky shares lots of good inventions.  Like that's a really cool idea for a Geoscope in view of the UN building in NYC.\n\nHis plan for the US Expo Pavilion in Montreal was similar but ended up featuring the pure geometry of the dome (a slice of a geodesic sphere actually) instead.\n\nThe District of Columbia (WDC) crowd grew leery of Expos after that, given their fall from sophistication in some new [cycle of American thought](http://mybizmo.blogspot.com/2016/01/cyberia-next-space.html).\n\nThe USG [peeled off](http://controlroom.blogspot.com/2014/12/wheres-fair-movie-review.html) from the Worlds Fair organization, following a different drummer, following Orlando perhaps i.e. Disney's EPCOT would be the permanent tribute to America's exceptionalism.  Or did America vanish into the singularity of Tomorrowland even before the USSR did?  Let historians debate such questions.\n\nThe [Geoscope / Mapparium](http://controlroom.blogspot.com/2005/02/mapparium.html) now have their software incarnations ala Google Earth and [Terraserver](https://www.datamapper.com/algorithms), with [ESRI](http://controlroom.blogspot.com/2012/03/occupy-silicon-valley.html) providing a Dymaxion-skinned view, not a requirement, where global data is concerned, but certainly a nice-to-have.\n\nSome schools of hermeneutics consider it impossible to have \"literal truths\" about the uber-murky past or future, not because we don't know the literal truth so much as our language is not designed to express it.\n[](http://controlroom.blogspot.com/2016/01/think-outside-box.html)\n[The box we think in](http://controlroom.blogspot.com/2016/01/think-outside-box.html) is pretty strict and quickly stops makings sense when outside of.  These schools see myth not as a substitute for truth, but as an encoding for which no key is yet available, but yet may prove decipherable to some degree, to professional oracles and others similarly predisposed.\n\nThe stuff about humans and dolphins inter-twined is meant more as a friendly arm around a fellow mammal, a set of species the seagoing have long spun yarns about.   \n\nCritical Path has its whales, required in any oceanic myth aiming to spring up from first principles, embracing at least some of what we know.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}