{
  "id": "115825293204591077",
  "title": "CrossCultural Workouts",
  "published": "2006-09-14T12:40:00.000-07:00",
  "updated": "2016-06-12T14:16:49.493-07:00",
  "content": "It'd make more sense to park a generator next to a gym, wire HVAC, and do multiuser video games on flatscreens with Iraqi troops, USAers together, mixing it up on screen.\n\nBut only after a lot of basic reflex learning curves.\n\nIt's no fun to frag people with only teenager level skills.  You want adult level gaming sometimes, especially when training future officers.\n\nOnce we have a level playing field, in terms of basic skills, we'll recruit lots of hybrid teams:  Americans and Iraqis against other Americans and Iraqis.  Hey, it's already like this.\n\nThat whole Sunni-Shi'ite thing:  I think Americans should back away from that slowly.  You don't want to get into this episode of [Alien World](http://controlroom.blogspot.com/2006/01/quotable-quotes.html) where the alien needs surgery and you're just a human doctor -- or vice versa.\n\nThere is no \"military solution\" in that namespace, so let's not even pretend that we're looking for one.  That's up to the Imams to spin and control.  Pumping in outward weapons just amplifies and feeds the craziness level, makes their jobs harder yet.\n\nOne thing I'm not doubting:  all these people have courage.  The Iraqis and Americans are sincere about wanting things to work out, Iranians, Syrians, Jordanians, Israelis... you've got real commitment and dedication, a willingness to serve the greater good.\n\nWhere I would focus is on artifacts, which is what Saddam's Castles were and are (a branded franchise).\n\nMosques will always exist, not just in Baghdad, but in Arizona.  So will Synagogues.  No great world religion is going away any time soon.\n\nThere's also no \"setting everything back\" to this point where other traditions were just in oblivion, off the radar someplace, never in our own [backyard](http://www.answers.com/backyard&r=67).\n\nWe're all in each others' backyards by now.  That's just where our clever inventiveness as humans has gotten us.  We should be celebrating.  Yay, we're a planet.  Yay, we could still make this work.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}