{
  "id": "254828433468449317",
  "title": "Cryptic Crossing",
  "published": "2024-05-22T01:34:00.000-07:00",
  "updated": "2024-05-22T15:25:48.531-07:00",
  "content": "The problem with the unit edge unit volume tetrahedron is it came up against the Bayesian priors. \"We can't be wrong about the unit cube\" and indeed that's true, and therefore we can't be right about it. Truisms ain't true in the empirical sense. One doesn't discover such a tetrahedron, one defines it into existence.\n\nHowever there's a popular understanding around mathematics in particular, that adheres to orthodoxies more generally: that there's one right way with some bemusing alternatives. \n\nThis attitude started to waver in maths with the invention of so-called non-Euclidean geometries. What appeared as cracks in the structure, the edifice, were coming from Cantor's corner too.  The priesthood was all about closing ranks and plugging the holes. \n\nThe only window open, through which to discuss incompleteness, would become Godel's.\n\nThe way to counter the Bayesian priors was incremental. We had to keep adding to the apparatus, showing applications and advantages. The natural sciences were cooperating. What would the world have to be like for this model to explain this evidence?  \n\nWhat evidence?  The nucleocapsid of the virus at first. 10FF + 2 got some airplay in the NY Herald Tribune.\n\nPositive whole number addressing of CCP balls looked pretty interesting. The \"quadrays\" apparatus provided those. Linear combinations of {2, 1, 1, 0} would get us to the Waterman Polyhedrons (a set I helped name, with no objections from Steve).\n\nThat children might work with fractions such as 1/8 (Mite) and 1/24 (A & B), with the concept of congruence abetted by chirality (left and right, inside out), while getting more comfortable scaling and rotating polyhedrons, was exciting to a few teachers. Very few.\n\nIn these terms, of internal modeling and inferencing, we'll be addressing \"bleeped over the Bucky stuff\" as an historical topic, the whys and wherefores. \n\nPeople have these Bayesian brains deeply stuck in some ruts, and for good reasons. Until those reasons grow stale and the brain's neuroplasticity gets called upon. Time for an update sleepyheads. \n\nDon't let those three horses, Height, Width and Depth, drag your bandwagon off the road. Make the sign of the Z (zig zag zig). \n\nZ + Z ⋈ 4D\n\nYou can keep saying \"space is 3D\" though, as XYZ is mucho useful. Then dive off the deep end into any number of Coxeter (spatial) dimensions. You'll wash up on the shores of Natural Language Processing, ready for Word2Vec (and Doc2Vec). King - male = Queen - female etc.\n\nWhat has to go is the \"room for only one way of thinking\" school (mindset). Share the road. Impoliteness on behalf of \"absolute truth\" is nothing if not butt-ugly zealotry. Sometimes God's little monsters ain't pretty to contemplate.\n\nBack to the bleeping: being overspecialized, most boomers assumed other boomers were looking into it, but few were, certainly not the most self admiring. The resulting vacuum or dead spot (dead air) only grew, adding a phony hollowness to an already crumbling (shall we say charlatanical) world view. \n\nOnce it became safer to question boomer authority, people under thirty started to pick up on what had been censored, made verboten, deplatformed. That was an eye-opener.\n\nSo does all this cultural crumbling mean all the old orthodoxies are about to be swept away? Of course not. \n\nHeavy stones with high inertia never turn on a dime, let alone the Titanic. Enjoy the ride!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}