{
  "id": "4282305041778494997",
  "title": "CS-enabled Algebra",
  "published": "2014-03-05T00:22:00.000-08:00",
  "updated": "2014-03-05T00:53:36.533-08:00",
  "content": "We've enjoyed [a rollicking debate](http://mathforum.org/kb/thread.jspa?threadID=2620194) on math-teach recently.  I reiterated a long-time position, that high school students deserved math credit for a discrete math sequence of topics we could provide, as an \"excuse\" to piggy-back the sharing of newer math notations used by various global subcultures, such as Intel and HP.\n\nWhat do I mean by \"newer math notations\"? Simply: computer languages.\n\nMany of them (by no means all) use \"dot notation\" a grammar of noun.verb() and noun.adjective (or call it property, or attribute).  The period or dot is important.  A.b means A has some feature named b, maybe its age or its level of enlightenment.\n\nWith [dot notation](http://mathforum.org/kb/thread.jspa?threadID=2026679&tstart=0), you've got behaviors responsive to arguments, and you've got persistent state, and no, that's not the only lingo out there, just one of 'em.  A CS-enabled algebra would be friendly to this ethnicity's lingo, among others (not exclusively).\n\nI've suggested our economy in Cascadia, high technology intensive, could benefit from a school system that allowed for these alternative for-math-credit courses.  They'd be elective in the same sense trig and stats have been elective.  Yet three years of math credit is mandatory, in Oregon, for a high school diploma.  You have various ways of adding up to that.  The goal:  make discrete math courses count (some say \"digital math\" courses -- the labels are not that critical).\n\n[Cascadia](http://en.wikipedia.org/wiki/Cascadia_%28independence_movement%29), if you've not read Wikipedia, is [the Pacific Northwest coastal area](http://en.wikipedia.org/wiki/Pacific_Northwest) north and south of Seattle, some say all the way to the Bay Area, some draw a line at Arcata.  It's more a science fictional jurisdiction and one of the \"nine nations of North America\" popularized by urban legend and some key writers.  Northward, we could reach well into British Columbia, so-called.  These are thought experiments you may indulge in, as a way to review some geography if otherwise bored.  Good exercise. What other nations might you name?\n\nThis script was not my solo creation.  On the contrary, I was overlapping with high school computer science teachers anyway, joining the annual programming tournament [at Willamette University](http://worldgame.blogspot.com/2006/03/sao-spring-conference-2006.html) through Free Geek.  [When I presented at OS Bridge](http://opensourcebridge.org/sessions/34), the Software Association of Oregon was in the audience and it was from SAO that I learned of the concrete proposal to wedge in a discrete math course or sequence, geared for high schools.  Teachers from all over the state were encouraged to brainstorm about content of this for-math-credit offering.  We had a [day long meeting in Sherwood](http://worldgame.blogspot.com/2009/08/education-planning.html), a neighborhood south of Portland out toward Wilsonville along I-5.\n\nTo sum up, I sometimes cast myself as an [unregistered lobbyist](http://mybizmo.blogspot.com/2009/06/lobbying-again.html), not often seen in Salem, yet definitely with an agenda.  [My Oregon Curriculum Network](http://www.4dsolutions.net/ocn/) has consistent / illustrative content.  Determining where I'm coming from is not that difficult, per the aforementioned math-teach thread.\n\nIf you want to join in the debate, I encourage finding regional colleagues, as the issues we raise tend to manifest in different ways by region.  Having solutions in one area does not automatically imply a translatable result.  There's no one-size-fits-all panacea.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}