{
  "id": "3646362074755148410",
  "title": "CubeSpace Anon?",
  "published": "2009-03-20T08:04:00.000-07:00",
  "updated": "2009-07-18T11:09:06.795-07:00",
  "content": "I'm tempted to stay with [the cube farm](http://controlroom.blogspot.com/2008/10/looking-ahead.html) today, have some quality time with VPython, which has a lot of new features.  However, sometimes it's about damage control 24/7, as when USAers are bitching about their economy yet still spending $10 billion a month or whatever on military bonuses for \"doing the wrong thing\".  It's not like there's much patience or understanding out there, for how to have it both ways.The analysis coming out of Japan is typically manga-seeming:  once Texans saw those homey green-style freeway signs around Baghdad on their televisions, the limbic system kicked in, truckers going \"hey, we could drive on those roads, make big bucks\", and the rest is history.  [The truckers invaded](http://mybizmo.blogspot.com/2006/10/forgiveness.html) (hiding behind [neocon fabrications and lies](http://mybizmo.blogspot.com/2009/03/uncovered-movie-review.html)) so they could feed hungry families back home, pay for air conditioning.There was never any \"military strategy\" or ideas about \"saving face\" -- stuff for the Pentagon and diplomats to worry about i.e. \"not our department\".  \"Don't mess with Texas\" was the main thing to say, seemed to justify everything, [Enron included](http://controlroom.blogspot.com/2008/06/concept-car.html).Of course Iraqis know how to drive trucks, so there's an easy solution, once USAers decide it's not worth their $10B per month to act out their inner [Roman imperial](http://mybizmo.blogspot.com/2008/05/defending-homeland.html) monster truck-driving children (the \"superpower\" fantasy, driven by Marvel comics).  Stick to your own NAFTA highways and [I-69](http://www.i69info.com/) why don't ya?Like I said, Japanese intelligence has these like \"[comic book](http://controlroom.blogspot.com/2008/06/iron-man-movie-review.html)\" explanations for everything, lots of shelf space [at Powell's](http://www.flickr.com/photos/17157315@N00/3369851410/).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}