{
  "id": "3629836304498917616",
  "title": "Curriculum Necklaces",
  "published": "2021-08-11T09:03:00.009-07:00",
  "updated": "2021-08-11T11:19:20.007-07:00",
  "content": "Screen scraping some of my own postings, amalgamated with a couple typos fixed. CJ was asking whether transcendentalism was a theology, i.e. focused on some deity or deities.  D.W. Jacobs wrote I cogent reply, saying transcendentalism was more a philosophy than a theology.What I wrote:Conventionally (parochially) Transcendentalism was a literary movement, centered around Concord MA, that was tied off during, or shortly after, the Civil War between the two sets of states, the pro and anti slavery, with territories up for grabs.The Philosophy shop talks have largely not embraced Transcendentalism as a thing, preferring to leave it in Literature, which is why Emerson doesn't get a lot of air time, despite Nietzsche's admiration for the guy's raw \"Zarathustraness\" (Nietzsche comes after Emerson, and before Hitler, going crazy around the time Hitler is born).Connecting Bucky Fuller back to his great aunt Margaret and using Synergetics as a \"next bead\" on the Transcendentalist curriculum necklace, is not something anyone is doing aside from me, to my knowledge.My curriculum, in recent times, has reconnected to a teacher from Princeton days (1976-1980), Richard Rorty, and his slim tome (borrowable for free at [archive.org](https://www.blogger.com/#)) entitled Achieving Our Country.[Rorty]( https://worldgame.blogspot.com/2021/05/riffing-on-rorty.html) confesses to being a leftie by upbringing and sympathies, but he sees a path back to German idealism through such as Emerson, without mentioning Transcendentalism by name. One could read it as an earnestly nationalistic (in the sense of patriotic) work, which surprised a lot of people (didn't seem fashionable). Anyway, he advances the idea of an indigenous (as in American) leftism that isn't a Marxism. Imagine that. I think Bucky dovetails.Then, I've been watching the Dalai Lama on Facebook a lot and seeing what he hopes and wants for India: \"pool all your collective wisdom from the sacred traditions (of action and inquiry) but secularize it, bring it to that neutral ground where you're not advancing the agenda of some religion\" (paraphrase).Lots of people say stuff like that, but coming from him of all people... Anyway, again I think the Bucky stuff dovetails as he's calling for a design science revolution, which I think of as the ongoing open source revolution, an engineering project, not some revivalist sectarian carnival. Bucky is not a messiah. A bodhisattva maybe, like Richard Stallman.Rorty's lefty liberal (in the best sense) patriotism fits well with Grunch of Giants, for its revolutionary globalism. I string these two works on the same \"curriculum necklace\" (so-called \"reading programs\" -- like beads on a string).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}