{
  "id": "6981267693907729156",
  "title": "Current Events",
  "published": "2023-02-10T18:14:00.006-08:00",
  "updated": "2023-02-10T18:26:27.119-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52639214741/in/datetaken/)\n\n:: senators: TikTok is not your toy ::\n\nYes I've been paying attention to the Twitter Files.  I'm especially interested in the pressures exerted on the company (i.e. Twitter) to prove the narrative that lurky jerky bots were a problem we needed defending against.  I hadn't been aware of the Hamilton 68 subterfuge, nowadays dragging a lot of people down given its exposure as fraudulent.\n\nOf course I'm tracking the Sy Hersh story on NS2, eager to see if I can keep working in a crazed BP PM. UK I mean.  BP, whatever.  I don't saddle Uncle Sam (US) with the blame, mainly because he's long dead. A resurrection story might be in the cards.  \n\nAs a global OS (operating system), USA values have worked their way into the woodwork, with the grain of popular public opinion.  That's not nothing.  Democracy still smells like roses, even if still over some distant horizon at this point. \n\nHow is the human brain a democracy?  Some would say it's not, but I'm not so sure, starting with the bicameral nature of the design.  \n\nIn practice, democracy seems to feature polarity, meaning warring factions, meaning opposition.  Where there's opposition we find alliances and yes, \"strange bed partners\" (they'd mix it up at the Grange too -- what those dances symbolized, about life as a process).\n\nDoes opposition among the parts result in a dynamic equilibrium at the level of the whole?  Most true cyberneticists will certainly posit that possibility, and even give examples, such as the adversarial court system.  That's not to say every warring mess of factions evolves into a self governing self assembly.  A kind of phase change occurs at that point.\n\nBeyond the left-right brain dichotomy and the proverbial war between the lobes (is it proverbial?), we have other internal brain organs.  Calling the brain a \"single organ\" is semantics more than logic.  Much as a car engine disassembles into separate subsystems, so do brains.  \n\nYou might say \"that's an oligarchy then\" and I might agree with you.  A democracy is never so simplistic as one voter, one vote.  The term has more to do with its rate of turnover and anti-fragility.  Like the blockchain, in principle, its tough for any one faction to pin it down.  You can only fool so many people for so long, to dumb down a well known Lincolnism.\n\nA lot of landlords are coming under scrutiny for their decisions to endanger the rest of us for their personal benefit.  I'm talking about the warlord train owners and their devil may care attitudes.  Suppose the devil does indeed care?  Did you really want that kind of attention?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}