{
  "id": "3351307721106070881",
  "title": "Curriculum Writing",
  "published": "2021-07-07T10:01:00.010-07:00",
  "updated": "2021-07-07T11:39:38.877-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjHBDb62p1yWi2Sm2wrkBd-v8xHscLD3PbGyoGOalL7MMwcdTRnyhxm15YoLhMBi7Gl72KJ4vwjVY260o75Ofh317nkI7uLksnLiR4u-0CLDRufAv1kQyHLgcZBlimLm-uB02IG/s640/29144752547_1266a35e14_z.jpg)\nThe workflow of being a professor and adopting a write-as-you-go approach to teaching, means getting a pipeline of textbooks flowing, with a captive focus group (to put it cynically -- in actuality they signed up voluntarily, for a front row seat). Anyway, it's a well known design pattern on which many capitalize, not only the teacher-author.\n\nIn the world of \"free and open\" the wheel spins even faster, as authors publish their updates through notebooks hosted on Github or one of those.  The world of wikis and repos now permeates academia, with librarians staffing a front door or gateway, in terms of providing training.\n\nMy latest project recapitulates old themes:  lets preview high school math through the lense of learning a computer language.  The executable scripting notation helps explicate the ancient Greek letter typography, involving capital Sigma to signify a looping construct, with a subscript.  \n\nWe write our own Sigma function in Python, passing in \"any callable\" (function or lambda expression) for driving a specific sequence.  Sigma provides the framework, of a start and stop index, and whatever index-driven expression, for producing the successive terms to be added.  Summation is the overall theme, ditto for the calculus Riemann Sum symbol, Sigma's analog.\n\nSeeing the scaffolding in Python helps students bootstrap their appreciation for the original notation.\n\nThe process of using LaTeX in the context of a Jupyter Notebook teaches \"school of tomorrow\" level skills.  We can use it in Blogger as well, provided the MathJax Javascript library, invoked per this blog posts, comes through.\n\n$$\n\\sum\\limits_{i=1}^n i^2 = \\frac{n(n+1)(2n+1)}{6}\n$$\n\nYou know how when your children learn to drive, and the professional driving school teachers invite the parents i.e. you?  \n\nPerhaps you have no experience with that, but in any case my point is how driving gets taught, evolves over time, and parents deserve the updates, if only to appreciate how their children are being trained.  \n\nSide mirrors splayed further apart.  Headlights always on.  Etc.\n\nImagine going through something like high school, revisiting of the basics, as a fully grown adult, every ten to fifteen years or so, because of how quickly things change.  You might be adding a career change on top of that, reinventing yourself yet again.\n\nSince I went to high school in the Philippines, in the 1970s, they've proved the AKS Primality Test, meaning when we get to Pascal's Triangle, we really should take advantage and show off how prime row numbers evenly divide the other numbers on that same row, whereas composite row numbers do not.  \n\nThe Triangle's rows are self numbers, lets not forget.  We use a Python generator to get them.  The entries get big fast.  \n\nThe Binomial Theorem hangs its hat here, as do several figurate and polyhedral number sequences.  Even the Fibonaccis may be discovered in the shadows.  \n\nPascal's Triangle has long been a Grand Central Station in our shared curriculum.  \n\nNow AKS takes its place, along with RSA.  That's right, we're making a grokking of public key crypto an attainable goal by senior year.  By way of Fermat's Little Theorem and Euler's generalization thereof.  \n\nEuclid's Algorithm kicks off the season.  \n\nIf this doesn't sound like any high school your remember, welcome to the club.  I'm sure you never learned about Quadrays, either.  During a summer enrichment course, we get to preview what most will have missed.\n\nThese are mostly well-trodden pathways, just not usually associated with high school in our more left behind Global University communities. \n\nInto the mix come my Four Flavors, per Heuristics for Teachers.  \n\nI'm prone to think in terms of: \n\n- Supermarket (logistics, databases)\n- Casino (probability, prediction)\n- Neolithic and (historical, visible)\n- Martian Math (futuristic, ephemeral)\n\nFrom a science fictive Martian vista we pluck ideas for our Earthian markets today, and design programs around risk mitigation (prototyping, test piloting) and adoption (continuous integration).  \n\nOur living standards, still thankfully Neolithic in some welcome ways, benefit from our projecting what we'll need to be packing for Mars.  Projecting about Mars helps us terraform Earth.\n\nWe're doing meetups twice a week online, over an eight week period.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}