{
  "id": "8521213136067647831",
  "title": "Debate in 97214",
  "published": "2010-09-01T23:16:00.000-07:00",
  "updated": "2010-09-05T14:55:35.440-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/3919858391/)(click for larger view)A topic for debate in our neighborhood, given the New Seasons is to open soon, is whether we're on board with [a planned campaign](http://en.wikipedia.org/wiki/Boycotts_of_Israel) to discourage the selling of products with a Made in Israel label.I'm concerned the plan is hypocritical, as the same kinds of injustices the [campaigners](http://mybizmo.blogspot.com/2010/07/marketing-campaigns.html) decry are practiced in the name of the USA as well, so Made in USA products should be boycotted by the same reasoning.When many USAers were practicing discrimination against [those of Japanese heritage](http://www.grunch.net/synergetics/kiyoshi.html), rounding them up and [sending them to camps](http://worldgame.blogspot.com/2005/02/adult-first-day-program.html), confiscating their property and so forth, some private companies made a special point of hiring Japanese, trying to compensate for these gross injustices (for which [the USG](http://www.grunch.net/synergetics/usaos2.html) later apologized).  So it pays to look beyond any Made in the USA label and to scrutinize the specific companies involved.Take Ben and Jerry's for example.  [The parent company](http://coffeeshopsnet.blogspot.com/2009/11/kudos-or-karma.html) may be European, but those hippie era home grown Vermont-based values still permeate the subsidiary.  If I were wanting to discourage the USA's persecution of Japanese Americans, would I boycott Ben & Jerry's?  Not likely.Our [2 Dickinson Street cabal](http://worldgame.blogspot.com/2005/05/princeton-25th-reunion.html) was certainly on board with, and a co-organizer of, the divestment campaign aimed at getting Princeton to drop from its portfolio any companies that profited from South African apartheid.I'm concerned that going by nation-state labeling only encourages [nationalistic pigeon-holing](http://controlroom.blogspot.com/2005/11/more-map-talk.html). People start identifying with so-called \"nations\" in neurotic ways, basing their entire identity on what \"nation\" they represent.  Why not go by zip code or county or sports team?Taking nations too seriously is a form of mental illness [according to Albert Einstein](http://worldgame.blogspot.com/2010/07/einstein-omsi.html), who could have been the first president of Israel.  Those of us interested in [doing God's will](http://www.grunch.net/synergetics/gst1.html), having [a Promised Land](http://controlroom.blogspot.com/2010/02/wanderers-201022.html) that's healthy and happy, recognize that nation states are not \"of God\" in the first place.I'm on board with [disavowing these Doctrines of Discovery](http://controlroom.blogspot.com/2010/03/wanderers-2010316.html), or any idea that land held by Christians or Jews or Muslims is somehow \"redeemed\" versus other land held by others.  That's atavistic, antediluvian, dark ages thinking.  God is too great to be captured and/or represented by any one human religion, a teaching of many religious thinkers.Israel has no more \"right to exist\" than the United Kingdom, Iran or the USA.  They're all equally [human contrivances](http://controlroom.blogspot.com/2010/06/ruminations.html), awkward and ungainly social institutions, doing as best they can, muddling through the day.  Humans, being rather pathetic creatures, have a terrible track record when it comes to so many institutions.  That's a lot of history in a nutshell.  Misanthropists have a field day when it comes to history, saying \"I told you so\" with every turn of the page.Vain and silly humans may be proud of their social constructs, but they're no more than theater at the end of the day, the stuff of [soap operas](http://worldgame.blogspot.com/2010/08/sharing-darkness.html).What's the opposite of a boycott, where you consciously reward brands or companies you think are doing a good job?  [Carrot Mob](http://coffeeshopsnet.blogspot.com/2009/06/carrotmob-helps-merchants.html) is a step in the right direction there.That's what I'd like to see more of.  If you're a radical or activist of some kind, come out with a list of products you think we [should](http://worldgame.blogspot.com/2006/03/returning-to-pdx.html)[ buy](http://worldgame.blogspot.com/2006/03/returning-to-pdx.html), if \"voting with dollars\" is the game you wanna play. That guy who wrote Fast Food Nation [spoke in Portland](http://controlroom.blogspot.com/2006/05/fast-food-nation.html) (I went with my youngest daughter), and dared to mention [Burgerville](http://worldgame.blogspot.com/2008/10/meandering-about-town.html) as not so terrible, if you really wanted that kind of food.  That took guts I thought.  It's much easier to criticize than to [endorse](http://mybizmo.blogspot.com/2007/01/another-day-in-matrix.html).  That's why cynics have such easy mental lives, as it takes little imagination to be cynical about everything.  Just being a \"cynical journalist\" takes little courage or skill.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}