{
  "id": "4792803910960402151",
  "title": "Deep Learning",
  "published": "2024-01-14T06:09:00.000-08:00",
  "updated": "2024-01-14T07:01:43.358-08:00",
  "content": "Something valuable I got from the Buckminster Fuller corpus: no need to pile on. Like he was saying his gift was to find his niche and stick to that, not jumping on the next bandwagon that came by, another kind of hobo one could say. He was more solo.\n\nI'm somewhat echoing the oft said phrase: choose my battles wisely or; not gonna die on that hill. I picture a hill of zombies like in that movie World War Z with Brad Pitt: do I want to pile on in that way? You could say it's the diva in me that suggests I avoid choruses.\n\nOn the other hand, I'm happy enough as the lurker, meaning the attendee who isn't present to make a splash but simply to take in, as an observer, an eager learner. I like being a student and I'm willing to listen to others with more to say. They have their niches just as I have mine, and I seek them out, to hear them vent in their native languages, so to speak.\n\nI'll sum this up saying I'm \"university minded\" meaning I still treasure the mindset that boldly ventures, and is neither plodding nor hurried. We're speaking of an eternal ideal clearly, as life itself tends to be \"too this\" and \"too that\" (e.g. plodding or hurried) such that \"just right\" sounds more like a fairytale.\n\nWhen it comes to \"math camp\" I'm not saying I'm the fat kid everyone likes to tease because he's slowing them down, and peer pressure serves as leverage. That's an archetype for sure, but I'm a stronger athlete on the playing field we're talking about. That being said, I'm hardly a \"good at everything\" skydiver ski champion. I suck as a skier and tried jumping from an airplane (not diving, i.e. static line) only once, as a part of a fundraising stunt.\n\nI have my limitations in other words. Oft times I'll be reaching back in my autobiography for something to contribute, and that can sound narcissistic (there's a rant I could go on) to the point of egomaniacal. Especially when I repeat the same stories. However I've grown more tolerant, with age, of people rifling through their own memory bags. As time goes by, stuff accumulates, the tetrahedron grows (subdivides).\n\nMachine learning (deep learning in particular) shows off the same principle: reliability comes with age and sensitivity both. The algorithm is as sensitive as it will ever be, from the start, shall we stipulate, yet the model only really gets good with age. Age does not represent deterioration so much as specific shaping to a specific purpose, like a lump of clay becoming a statue of some phase space (namespace) such as \"dog or cat?\".\n\nOur global university language of today (such as it exists: on a spectrum) uses \"journalist\" somewhat synonymously with \"student\" i.e. you don't have the right to punish me for citing sources, I'm simply journaling about what I've learned. I take notes, you read them, no crime in that. The journalist had a kind of immunity for being a wide open channel for opposing views, meaning both sides in a debate (polarized) would get represented. When a journalist refines the bias in a more niche way, that's an indication that the journalist is now ready to profess in certain areas, more as a professional (guild member) than as a well-informed (educated) layman.\n\nWhen it comes to the professoriate and the guilds, a different politics applies, as these tend to vie with one another, true, but also tend to form alliances. We might call this Think Tank Alley, a kind of geekdom. Here live the people the journalists like to interview, as sources. The way one climbs the rungs in journalism is by means of curating sources in ways that somehow advantage the sources. At this point I would defer to others to profess about ethical journalism. What are the rules again?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}