{
  "id": "3581022313358833067",
  "title": "Deep Cleaning",
  "published": "2015-12-29T18:32:00.004-08:00",
  "updated": "2015-12-29T18:34:21.149-08:00",
  "content": "I've been in overdrive deep cleaning the kitchen, still have a ways to go.  I have original 1950s style pastel yellow, pink and light blue vinyl wall paneling + a stainless steel counter + painted metal cabinetry + an avocado green Magic Chef stove.\n\nAll this 1950s stuff is quite vintage at this point, and it shows.  The cabinets are tinged with rust and corrosion, indicating \"well used\".  Properly scrubbed, they're still shiny though, even if not \"like new\".\n\nOur family moved in twenty years ago, taking over from the Kinglers, whom we suppose installed the wood stove in the middle of the living room (we gave that to Dawn's brother).\n\nI popped in a VHS tape showing us enjoying life in 1997, about two years after we moved in.  Sorting through VHS tapes was another holiday project.\n\nBlast from the past:  cleaning in a consumerist culture often means discovering interesting appliances that have fallen by the wayside, such as a WelBilt Bread Oven Model ABM600.  I don't find anything wrong with it (so far).  I got some yeast and dry nonfat milk, bread flour, to test it with.\n\nTara cleaned her room when she got here, to make it more suitable.  She's been resting between social engagements by taking in old episodes of Star Trek Voyager.\n\nLindsey has likewise been deep cleaning in preparation for the big move to Corvallis.  She officially moved out some months ago, but went to Nepal.  The next move entails actually evacuating the basement, where the bulk of her music equipment has been stowed.\n\nI use a stiff brush with 409 on the vinyl and metal, after clearing off all items held with magnets.  Two 24\" florescent tubes had gone out, which I replaced.\n\nI'm wondering if the personal frozen dessert maker, a hand-cranked one-portion cooling device, could be re-purposed into a Martini cooler.  I forgot to buy olives for the test.  Next time.\n\nI'm not a big Martini guy, have probably had fewer than twenty of those in my fifty seven years of life.  However, I'm open learning new things.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}