{
  "id": "8845880257403127475",
  "title": "Deficiencies in the English Language",
  "published": "2015-07-12T07:19:00.000-07:00",
  "updated": "2016-12-02T13:08:16.313-08:00",
  "content": "The BBC interviewed some bloke last night who used to be a BBC journalist and so needed to be unbiased, but was now in a new position, as a pundit, and so could come right out and say that Iran is seeking nuke weapons.  He was open about shedding his former journalistic guise and becoming more openly biased.\n\nThe pundit was talking about ongoing negotiations in Vienna to establish a \"breakout box\" inside of which Iran would be boxed, not allowed to break out.  This is the Standard Model used within Washington DC circles (e.g. within the Beltway) as well.\n\nWhat's missing from the analysis, as usual, is any calculation as to what's in it for Iran to paint the Rogue States (the nuclear WMD states) as minions of a Great Satan, the hubristic desire to hold a Sword of Damocles over the rest of humankind, to arrogate the role of a \"Do as I Say or Else\" supreme bully.\n\nPeople with nukes tend to threaten, [gloat](http://worldgame.blogspot.com/2015/07/comments-on-news.html), lord it over, strut, puff etc. (it's a syndrome) -- we've seen it in the White House, and lets talk about [Tony Blair](http://mybizmo.blogspot.com/2007/09/lampoon-harpoon.html).  Saying nuke WMDs are \"[against Islam](http://controlroom.blogspot.com/2006/02/jihad.html)\" is a setup to portray Christians, Jews and secularists as morally inferior i.e. susceptible to the military-industrial complex (a meme virus).\n\n[Eisenhower himself](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html) warned us of this susceptibility.  Iran, not just South Africa, stands for hope, sanity, and a better tomorrow in this picture.  Islam is about a better future, not Tyranny by the Rogue States, with the same criminal, murderous weapons that Iran should never have ([Iran agrees](http://www.quakerquaker.org/forum/topics/iran-is-officially-anti-nuke-wmd)).\n\nEven if Iran is secretly building a bomb, or wanting to, it's poor journalism to not even sketch for the listeners how Iran might actually have a motive to lead the [Ban Treaty movement](http://worldgame.blogspot.com/2015/07/july-4-2015.html), and to embrace not only non-proliferation, but criminalization of existing nuclear arsenals, an agreement most UN nations have already signed.\n\nWouldn't that be good PR, to help leverage a ban on nuke weapons worldwide?  Iran would be seen as a moral leader, victorious against the reprobates and backsliders, the less humane.\n\nPolitically speaking, it adds to Iran's gravitas as a principled nation and great civilization, to take a stand against nukes while allowing for atomic power.\n\nDoing so from a position of strength makes it a conscious choice.\n\nThe US wants to paint itself as victorious in \"forcing\" Iran to submit to inspections.  But what about the US itself?  It has no intention of submitting to anything, and that's where its hypocrisy is both self evident and self undermining.\n\nThe US position well explains its continuing loss of credibility, day by day, which the BBC is striving valiantly to shore up, given [that Special Relationship](http://mybizmo.blogspot.com/2012/07/big-fix-movie-review.html) and perhaps loyalty to another English-speaking culture.  But hasn't all this shoring up become uncomfortably transparent?\n\nIn fact, imputing such a motive to Iran, to be a religious leader seizing the moral high ground, which might have an endgame wherein Iran-trained weapons inspectors gain access to syndicate facilities in Colorado someday, once the Ban is imposed, connects a lot of dots already out there, such as the Nuclear Free Zone we know Iran proposed, but which the WMD nations derailed for the region.\n\nGreat Satan wants His nuke weapons without restrictions of any kind.\n\nGreat Satan has actually used nukes against Japan and [Micronesia](http://controlroom.blogspot.com/2013/11/pacific-islanders-meet.html).\n\nYet through misdirection we're made to think Iran is the hypocrite.  Very clever?  Maybe just dumb?   How long can it last?\n\nThe longer [Iran's rhetoric](http://worldgame.blogspot.com/2015/06/quakers-2015628.html) and actions match up, the more Great Satan seems engaged in delay tactics around preventing any [Countdown to Zero](http://controlroom.blogspot.com/2010/12/countdown-to-zero-game.html) clock from ticking.  Tick, tick, tick...  Austria is already strongly in favor of a Ban Treaty.  Is that why they're meeting in Vienna then?\n\nI'm not at all surprised that CNN hasn't the courage to explain the PR situation to the American viewers, easy to fool, none too bright, par for the course. \n\nHowever, I'm a little surprised the BBC won't let its global listeners even sample this line of reasoning, which is well-known outside the Anglo-speaking sphere.\n\nMaybe tonight?\n\nWill they get anyone more conversant with the actual dynamics of the situation, for balance if nothing else?\n\nOne almost thinks the English language, or \"[forked tongue](http://controlroom.blogspot.com/2006/01/serving-from-algebra-city.html)\" as some call it, is incapable, almost as a software issue, of revealing its own inconsistencies and hypocrisies.  It'd be too undermining.\n\nPerhaps the BBC is really just for superficially intelligent listeners.  Certainly real intelligence services would need to keep score at [a deeper level](http://mybizmo.blogspot.com/2015/03/nationalism-and-jobs.html), if planning to stay relevant on the world stage.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}