{
  "id": "120573499833965355",
  "title": "Design Science 2.0",
  "published": "2012-08-19T20:54:00.001-07:00",
  "updated": "2012-08-19T22:15:10.450-07:00",
  "content": "Yes, that's a somewhat tongue in cheek allusion to Tim O'Reilly's invention, Web 2.0.  Actually he was just captioning an important plot twist (AJAX), thereby catalyzing it (by naming it).\n\nMight DS2 be up for designing new religions?  The question is rhetorical, per Triumph of the Moon, in the Wicca is one of several \"designer religions\" of recent vintage. Or call it \"social engineering\", or call it Disney World (another example).\n\nYouTubes of Mecca are interesting, even for people that go there.\n\nLots of Iranian kids are feeling drawn to their older-than-Islam heritage.  No different here, w/r to Xtianity.  The best religions are still ahead of us?  I don't think it's necessary to defend that claim.  There've been some good ones.\n\nTo add more religions is not to destroy existing ones, or if they're that fragile... there's always room for another tribe.  I was discussing these matters over cider, beer and cigars this evening, contemplating choices.\n\nI mentioned appreciating a positive spin on \"witches\" as well as \"wizards\" and keeping the links with geekery, tools use, health sciences, technology.  Witches were / are STEM teachers, role models for girl and boy scouts both (one needs models across genders).\n\nI don't know if putting a lot of attention on geometry makes it sacred, but from Synergetics I'd inherit its relevance to a grammar (in Wittgenstein's sense of a logic or language game).  The U = MP idea still looks pretty usable.  \"Metaphysical\" in the sense of what's not \"physical\" in the sense of wiggling needles.\n\nBut then polygraphs consist of wiggling needles, lets remember.  Neuroscience is building its inventory of instruments.  Lying or tainted truth takes its physical toll sometimes.  We pay a physical price for trafficking in misinformation, as propagators of meme viruses.  On the other hand, nature has many ways to divert attention.  She's a master of disguises.  Masks.\n\nThese are hardly new planks for a religious platform., but then we'd expect plenty of continuity.  Eternal / perennial philosophy is what it is, with an institutional framework.  I've been thinking in terms of coffee shops and didactic game playing, a casino for channeling surplus while building both brand and cause loyalty.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}