{
  "id": "7309241800031889981",
  "title": "Differential Equations",
  "published": "2013-10-07T21:40:00.000-07:00",
  "updated": "2013-10-07T23:46:34.814-07:00",
  "content": "[](http://www.flickr.com/photos/kirbyurner/9929301944/)\n\n:: hexagonal awareness \n\nby Glenn Stockton ::\n\nI wrote to Tara about \"interlocking deltas\" today, something that's been occupying some attention on my walks, or call them \"walking meditations\" (Quakers have that too, or call it \"worship walking\").\n\n\"Delta\" is a Greek letter, a little triangle, and signifies change, perhaps the smallest change possible.  The idea that \"change\" is discrete, comes in quanta (all or nothing bits, yes or no at some level), is similar to the notion that \"substance\" is discrete i.e. \"atoms\", with \"atoms\" boiling down (reducing to) \"energy events\" by most accounts.\n\nPeople argue about whether \"matter is energy\" (Kenneth Boulding and I did some of that) perhaps imagining they're holding \"is\" constant (there are three words at work here, not just two, plus is it an empirical question or a matter of a priori stipulation?).\n\nWhen you plod along linearly, you accumulate distance, lest on a treadmill at the gym, in which case \"distance\" is measured for you (and displayed).  Accumulation shows as a slanted line, and accumulating accumulation, as in adding consecutive numbers, becomes a triangle, or area.  So a first power becomes a second, and a second power change becomes a third.  That's \"integration\" (accumulation) where as \"differentiation\" is going the other way (back down to plodding).\n\nOn today's ascent of Tabor I met up with Glenn, not by prearrangement but nor entirely by surprise.  He'd found some new puzzle pieces, regarding planetary geology.\n\nPlate tectonics used to be laughed at, but now there's this other theory, that the interlocking plates, without changing relative position, also slide around as a whole, like an outer crust would be free to rotate.\n\nBy how much?\n\nI didn't manage to pin that down but lets just say that polar ice weighs a lot and the physics of precession might just make for a kind of axial realignment to compensate, during periods of heavy glaciation.  This would again be independent of the relatively ellipsoidal orbits at a maximum -- or is it, entirely?\n\nI don't claim to know.\n\n[](http://www.flickr.com/photos/kirbyurner/10141318394/)\n\nBecause of oscillations of the axis and where the ice buildup happens most, parts of Antarctica have been sometimes uncovered.  The idea that human civilization might have flourished there between ice ages has its supporters, among them a Canadian couple.  Glenn had their book.\n\nI snapped a few pictures and then moved on, this being a Monday and all.  It may not look like I work eight hour days (or more) but I do.  Getting it all in takes some packing.\n\nThe Bagdad is closed now, [as I was saying it would be](http://worldgame.blogspot.com/2013/09/world-war-z-movie-review.html) soon, for the remodel.\n\n[Jen](http://www.flickr.com/photos/kirbyurner/6218988286/) has joined our household again as she did for some months last year, using Carol's room.  Carol is still here so she's got the livingroom.  Lindsey's music studio is still in the basement though she's not around right now.  I've got the upstairs split between bedroom and office, while the real office still waits for insulation (my job) and dry wall (contracted).\n\nI share the office with a python, very active at the moment.  I should take him out... nah, he's pretty shy, some other time maybe.  The office opens out on a deck, newly redone with a fantastic fence and durable \"rubber\" cover.  No leaking downstairs anymore.  I paid for all this by grading mountains of student work.  I'm paid as a gatekeeper, per the [Project Renaissance model](http://grunch.net/archives/41).\n\n[](http://www.flickr.com/photos/kirbyurner/10151148216/)\n\nI noticed Lyrik has turned over again, used to be [Fine Grind](http://www.flickr.com/photos/kirbyurner/sets/72157618669074193/) (under Jody), before that Wired.  Keiko, our Brazilian of Japanese heritage worked [with Joe](http://www.flickr.com/photos/kirbyurner/sets/72157622228719807/) on [the Lyrik enterprise](http://mybizmo.blogspot.com/2009/10/from-lyrik.html) (half coffee shop, half art gallery).  I didn't make it to the restaurant, with its steam punk menu, and now it's gone, an opportunity not taken.  Accelerating acceleration and all that.  Differential equations again.\n\nI remember when visiting Holden in DC, his then wife was talking about a pay delta.  She was talking about a security guard and his family, her business being property management of premium DC real estate.  Anyway, I appreciated that use of \"delta\" too.  So many little triangles out there, signifying miniscule differences.  But they add up they do.  It's amazing how a little leak can fill a bathtub full of water.  Been there done that.\n\n[](http://www.flickr.com/photos/kirbyurner/10141620783/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}