{
  "id": "6067870851784349747",
  "title": "Dire Straits",
  "published": "2009-12-22T06:32:00.000-08:00",
  "updated": "2010-04-10T18:15:13.847-07:00",
  "content": "As a latecomer to the ISEPP board (not a paid position), I feel its within my job description to explain our situation.  We've lost the ability to retain Glenn Stockton as our Pauling Campus maintainer, with Terry himself looking at collecting unemployment.  I don't yet know how this will impact the lecture series.Liberty Hall is throwing a party, nominally Project Omega.  The politically minded groups who paid rent for this establishment are no longer able to do so.  This is a good bye party.  Lindsey is playing the role of music coordinator (a volunteer job).There's this sense of shutting down all over, as we run low on ideas.  Has the \"[invisible hand](http://worldgame.blogspot.com/2008/08/elitism.html)\" of free market forces come disconnected from its brain?  Is capitalism self-strangling?As we roll into the New Year and start taking stock of our first 21st century decade, we have little choice but to look down the road a piece.  We'll be staring at that Times Square buckyball again (by Phillips), perhaps uncomprehending of [the heritage](http://synchronofile.com/?page_id=21) it represents.[](http://photos1.blogger.com/blogger/1134/545/1600/timessquareball.jpg):: Times Square [New Years ball](http://www.cbsnews.com/stories/2006/12/31/national/main2318298.shtml)[ ](http://www.cbsnews.com/stories/2006/12/31/national/main2318298.shtml)::I hearken back to my meeting in London with Alan Kay and those other high minded people, yakking about a brighter tomorrow, for South Africa mainly, where I have ties [through Quakers](http://worldgame.blogspot.com/2009/05/time-for-reconciliation.html) and [family history](http://www.wikieducator.org/User:KirbyUrner/Autobio#Family).I hadn't seen [Idiocracy](http://worldgame.blogspot.com/2007/04/idiocracy-movie-review.html) yet, but in retrospect see that movie as reflective of Alan's concerns (mine too).  This isn't about genetics (that was in spoof), but memetics (transmitted ideas).  One either successfully passes the torch to coming generations or one drops it.The Renaissance I'm seeking to spark, in a conspiracy with other buckaneers, really depends on having a cerebral press, other intelligent media, willing to actually look at some mathematics and science for a change.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhkmRV2qP4XyCXrJ1G93jZ2utupcv-mD-6s06CPw8fCrpirRthyphenhyphendY2BmPzmylBrrAsNuLm3VE-OVPbiDXiLyGNLhgqIS0ef9pRw2tNABVvhgAVfV-sNtkl-ukbM3D0ZeNGHqrTJfw/s1600-h/flatworms.jpg):: flatworms by M.C. Escher ::(geometry of nature)Newspapers frequently do this, with some stories more challenging than others to wrap one's thinking around.  This story is really not that difficult to relay though, at least in its basic elements.  I hope this blog post is proving my point.A high civilization might share it through buzz in the coffee shops, along with whatever retro French existentialism.  This stuff works well on LCDs, which are omnipresent in gyms as well.  How about on [the backs of cereal boxes](http://mail.python.org/pipermail/edu-sig/2009-December/009708.html)?[](http://photos1.blogger.com/blogger/1134/545/1600/vols.gif)\"relative volumes\"(Python + POV-Ray)The simple whole number volume relationships I've long sought to popularize and share through the schools have by now enjoyed a half century in publication.  Dr. Arthur Loeb wrote up something for The Math Teacher way back in 1965 (Remarks on Some Elementary Volume Relationships Between Familiar Solids, Vol 58:15).Robert Williams, citing the above work, along with Fuller's Synergetics itself (still in manuscript in some St. Louis archive, dated 1960), gives the gist of our \"concentric hierarchy\" in his 1972 Geometrical Foundations of Natural Structure:  A Source Book of Design (Dover).[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjvu16C7ls8uCsPOJ9xPt99sovEEsMm-uJ41adpvTsSLx5aQz_yed2mU-S0rUIAh4kFIBqz58R95jjiC3o1PYkcSlomk-rWdNzLiEDncethZKdaoi5yfoQElpH6HcY6XZk-Cq3M/s1600-h/williams.jpg)True, he messes with Fuller's meaning for A&B particles (modules), changing it slightly, but he does so consciously (page 136, footnote 20).Posting to Synergeo, quoting from my private correspondence:What amazes me so much is these simple whole number volume relationships, so central in Fuller and based on a unit volume tetrahedron, have now been in the literature for like half a century!These seem like such elementary and basic discoveries, and yet the culture doesn't pick them up or propagate them, does not share them with children, plus bleeps over the lore (stories) behind them.  The history just isn't shared.Figuring out why this history isn't shared, and whether there's any chance of changing this status quo, is a central interest of mine.Is it that we have to resurrect Polyhedra as a worthy topic?The journalistic account is brought more up to date by Siobhan Roberts  in King of Infinite Space, which details the sometimes strained, sometimes friendly relationship between Bucky Fuller and Donald Coxeter.Beyond personalities however, she investigates what in Fuller's thinking might have merited the attention of such a pure-minded geometer (not an architect, not a defense contractor like Bucky was, back in those radome days).Without specifying the formula (S = 10 * f * f + 2), she cites Coxeter's admiration for this basic discovery, simple enough to prove:Coxeter told Fuller how impressed he was with his formula -- on the cubic close-packing of balls.  And he later took pleasure in proving it, noting in his diary one day in September 1970: \"I saw how to prove Bucky Fuller's formula,\" and publishing it in a paper, \"Polyhedral Numbers.\"  Of course more than anything, Coxeter fell in love with Fuller's geodesic domes.What Siobahn does not go into, however, is Fuller's dissection of the space-filling trirectangular tetrahedron (called a MITE in Synergetics) into his own A and B modules (distinct from those in Williams).  In my view, this is the more critical link, twixt the work of these two individuals.[](http://photos1.blogger.com/blogger/1134/545/1600/abmod.gif)A&B modules, by Richard HawkinsSynergetics is dedicated to Coxeter, yes, but where does it actually cite his work directly?Answer:  in the caption to [Figure 950.12](http://www.rwgrayprojects.com/synergetics/s09/figs/f5012.html), which is all about the MITE and the shapes you might build with them.  He cites page 71 of Coxeter's Regular Polytopes directly.  Why?  Because in Fuller's own thinking, this is one of his major breakthroughs.Furthermore, since he's the only one using these modules and since it is he who has named them, the attention to his ideas he so longed for would now be a done deal.[](http://www.flickr.com/photos/17157315@N00/3320963850/):: MITEs Cube withpg. 71 of Regular Polytopes  ::His ideas would accrue all the academic respectability owed to them and Synergetics would not simply be shelved and forgotten as \"a lot of nonsense\" (Coxeter's initial reaction, on confronting this [philosophical work](http://mybizmo.blogspot.com/2006/09/quick-account.html)).  His other works would remain influential by extension and we'd be off and running towards a better tomorrow, a brighter future for our Spaceship Earth (or Global University).[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgiCMaog0BZEZD8hUIHCGtJLr-gChgnT7wceoY7McPK_SiY8PyFbS5COlp6SBVYrU23Cypmul1dDZKv-cvQfyur4mZkllfaq_D2APxYfA2KuC-e-b_OyGrojSbt5wbamGkC4RW_/s1600-h/autonomous.jpg)Autonomous living unit, 1949 Buckminster Fuller © Buckminster Fuller InstituteAll worries about [megalomania](http://www.grunch.net/snelson/) aside, one can see where Fuller would have gotten his hopes up around these A & B modules.  He harps on them again in Cosmography, a posthumous work that [Kiyoshi Kuromiya](http://www.grunch.net/synergetics/kiyoshi.html) and [E.J. Applewhite](http://mybizmo.blogspot.com/2005/02/ayatollah-of-tetrahedron.html) worked hard to get out there.Any journalistic account might pick up the story here, but you see how it's somewhat difficult and cerebral.  Pictures make it easier though, and the literature is sprawling and readily on tap, with much of it on-line.I would think that some technical writer wanting to make a name for himself or herself would have no trouble getting this past an editor.  But you'd need an educated readership.Returning to King of Infinite Space, I notice Walter Whiteley, director of applied mathematics at York University in Toronto, may have views similar to Alan Kay's, regarding our descent into idiocracy.  Quoting from Roberts again:For Whitely, it all comes down to underlining how visual perception builds into reasoning in the brain...  \"Failure to do and teach mathematics visually is excluding numerous people and making mathematics harder,\" Whitely concluded.  And he conjectured that the dearth of the visual, the decline in classical geometry over the last hundred years, has had a regressive effect, resulting in \"the geometry gap.\"  This is much like \"the ingenuity gap,\" a concept raised in the book of the same name -- by Thomas Homer-Dixon, director of the University of Toronto's Trudeau Centre for Peace and Conflict Studies -- chronicling examples of people and societies facing a crisis of ingenuity or know-how, which leaves them unable to solve problems of their own creation.  Whitely's thesis holds that in the realm of science, the sedentary, mathematical areas of our brains, and the consequent lack of ingenuity -- the inability to solve problems and make discoveries -- results from an ignorance of visual and geometrical tools.That sounds a lot like a passage from [Jared Diamond's book](http://controlroom.blogspot.com/2005/01/why-civilizations-fail.html) Collapse: How Societies Choose to Fail or Succeed.It's all about what stories one tells, or does not tell, when passing on a culture.  We face time pressure, deadlines.  Journalists know what I'm talking about.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhymYXaldL-yv9J7ZqZcn4zPmGdWTltWNpVdtOYnVesOw3r-TYyZce-ogKOhyRQ36idvBhgA8K8A3k_8pcZ7z_4fYgaxyXPuzgLZ4U1DldyLcdrtan1cjW1aUmt6IUgt__Xc0au/s1600-h/volumes_table3.png)[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg-zPEypgi6zG6elObVU6TD-gM7Vy4imq_11cMRDi4knDMUhhSDHYJXkxQdoJKRJ_MT06ylmm-aLVmpT2PeMPfiGkN2Yw9aPhyIG1mrZ_gDooZ2yTrRkQmETKpYZjrPqV3l7wsh/s1600-h/mite.gif):: Mite (minimum tetrahedron): ([A+](http://www.rwgrayprojects.com/synergetics/s09/figs/f1301.html), A-, [B-](http://www.rwgrayprojects.com/synergetics/s09/figs/f1601.html)) or ([B+](http://www.rwgrayprojects.com/synergetics/s09/figs/f1601.html), A+, [A-](http://www.rwgrayprojects.com/synergetics/s09/figs/f1301.html)) ::Copyright © 1997 Estate of R. Buckminster Fuller",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}