{
  "id": "8922646258446012048",
  "title": "Dirty Wars (movie review)",
  "published": "2013-07-03T20:19:00.000-07:00",
  "updated": "2013-07-04T11:17:00.310-07:00",
  "content": "Having recently read [Mary's Mosaic](http://controlroom.blogspot.com/2013/05/murder-mystery.html), which drew me back to the writings of Col. Fletcher F. Prouty, I could appreciate the historical trajectory taken up by this film.\n\nJFK's bitter disappointment with the CIA, when it failed to murder Castro, led him to memo the Pentagon saying that the Joint Chiefs would, in future, be the president's assassins and henchmen.\n\nThis was a new idea for the Eisenhower generation (Gen. Krulak's crew actually tried to keep Diem away from his executioners), but in Obama's day, the DC president has his military death squads, his hit teams, just what JFK dreamed of.\n\nScahill's thesis is that the White House is using its secret powers to create [exactly the enemy it needs](http://controlroom.blogspot.com/2006/01/power-of-nightmares-movie-review.html), a diffuse network that defies its will but is fairly easy to target and kill, often [by remote control](http://controlroom.blogspot.com/2009/06/killing-field.html).  [Endless target practice](http://mybizmo.blogspot.com/2009/12/scholarly-christmas.html) with [the latest weapons](http://controlroom.blogspot.com/2013/02/report-from-afghanistan.html) is the consequent opportunity, which means [jobs jobs jobs](http://controlroom.blogspot.com/2008/12/iron-mountain-revisted.html) for the weapons engineers.\n\nCase in point, Awlaki starts out the peaceable all-American Imam, incisive with criticisms yet voting for Bush.  Then al-Awlaki watches the post-911 farce unfold, with Americans begging to be lied to and misled so they might feel good about the display of extreme ineptness that followed, with the City of Losers in the driver's seat.  He becomes more bitterly negative.  \n\nAt some point, he made the kill list, but has not yet been killed (in the movie).  Jeremy sees he has a real story here, watching a Nobel Peace Prize winning president pull the trigger on a Malcolm X like figure, and then kill his 16 year old boy.   \n\nNowadays we're watching the Oval Office go after Snowden while making similarly ironic remarks about his being a danger to other Americans.\n\nThe Yemeni journalist who first broke the story of a cruise missile attack in Yemen, the same story Scahill is covering, is someone the White House takes a personal interest in keeping behind bars.  \n\nScahill has a hard time believing it at first, but finds the public memo.  \n\nHe was at first skeptical that special forces were extracting bullets from their victims to conceal evidence, and using [NATO](http://mybizmo.blogspot.com/2010/08/foss-in-afghanistan.html) to tell the cover stories (\"the Taliban did it\").  \n\nBut then he saw the evidence (\"the American Taliban did it\") and NATO finally admitted it when it became that obvious.\n\nIt's Andrew Jackson and the Indian Wars, sightly updated, and with the whole world infested with Indians and their sympathizers.  Sovereignty means nothing. \n\nWith vastly superior fire power, night vision, helicopters, you get a blood sport that's more thrilling than computer games, but not necessarily much more dangerous.  \n\nYou get a pay check, the president's gratitude, and you get to kill lots and lots of people, and torture others.  What a sweet job, if you're into that kind of thing. \n\nThese \"American Taliban\" as they're known (e.g. [JSOC](http://www.military.com/special-operations/jsoc-joint-special-operations.html)) will likely get more recruits as a result of this film.  Killing with impunity is an attractive occupation for many a psychopathology.  Apparently there's some correlation with having a beard.\n\nIt must feel great to have a president (and a vice president) on board, with the bleachers full of adoring, flag-waving fans -- including that war lord in Somalia, gushing with admiration for DC's world class cruelty.\n\nI took my 84 year old mother to [this film](http://dirtywars.org/) (she's the one who first told me about it). Living Room Theaters served us snacks.  Then Tara joined us and we went to Jake's, the seafood place.  Mom treated us to a meal, while reminding us there were still \"good people\" in Washington, DC.\n\nScahill does a lot to show that a few US citizens still have some common decency, meaning he is doing way more to protect ordinary American lives than any of the president's hatred-inspiring goons.\n\nIn questioning the legitimacy of murdering a US citizen and his son, Jeremy shows that at least a smattering of writers have a conscience, a taste for logic and ethics.  A lot of people helped with the editing.\n\nI feel safer, as an American, knowing this DVD is getting out, to places like Yemen.  People will better understand that Washington, DC is [a brutal oppressor](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html) domestically, not just overseas.\n\nIndeed, that's been the understanding for a long time, it's just that here the story gets updated a little.\n\nJFK's \"imperial presidency\" is alive and well.  \"Murder, Inc.\" is now global.  DC continues to lose its war for hearts and minds, but then that's not even the goal any longer.\n\nSatisfying a lust for blood seems to be the main theme these days, a rather simple foreign policy, whereas \"defending the Constitution\" seems to be not in the cards.  The war lords in Somalia feel right at home with this post-Constitution (\"bankrupt and extinct\" -- per Medal of Freedom winner) United States of America.\n\nSome JSOC personnel do come forward, sensitive about history and uncomfortable with their Planet of the Apes role.  They're not feeling at ease working for the City of Losers.\n\nWith a stronger safety net, or even without it, some may find their way to less disreputable jobs.  They're being abused by politicians and career bureaucrats.  War is a racket.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}