{
  "id": "1010707576354167396",
  "title": "Disambiguating",
  "published": "2022-03-19T15:53:00.010-07:00",
  "updated": "2022-03-19T16:28:59.358-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/4619138585/in/album-72157717476842606/)\n\nI haven't noticed any slacking off in my contact with Russians through the edu channels I inhabit.  Some TCP/IP supplier was said to have dropped from the scene, but like a rock in a lake.  \n\nThe internet was designed to not have single points of failure.\n\nThat being said, we weren't on the same page in any case, given the Tower of Babel and the confusion of tongues.  How does anyone understand anything in such a polluted environment?  Good thing we have namespaces right?  import this (that's an insider Python joke).\n\nLike ever since I've searched and more recently joined academia.edu, I noticed great market penetration for Haken's, but not for our guy's product line.  No one was intentionally jamming the frequencies.  Both 5G and some airplane altimeters want to use the same space.  That's an analogy.\n\nWikipedia has disambiguated the two Synergetics (Haken's and RBF's) for several years.  We have a link to and from Tetrahedron on the RBF side (one way to keep telling them apart).  So only now are some Russians starting to see double, and realizing the potential for cross-eyed confusion.\n\nNo harm done.  Language is always folding and unfolding, sometimes getting people confused.  Like I said at the outset, it's Biblical.\n\nHey, I just noticed the disambiguation page for Synergetics now has a link to Tensegrity.  Is there something to disambiguate?  And the definition that's given:  \n\n[Tensegrity](https://en.wikipedia.org/wiki/Tensegrity), the use of internal forces to overcome external forces, as in a self-supporting sculpture.\n\n...that seems kinda weird doesn't it?  Who gave it that meaning?  I suppose I could dig into it, but for now I'm just passing through on my way to other places. I reported my finding to FSI.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}