{
  "id": "3959941182958530932",
  "title": "Disaster Relief Teams",
  "published": "2024-12-04T03:43:00.010-08:00",
  "updated": "2024-12-08T17:48:28.714-08:00",
  "content": "A pattern we see often, around the world, is when disaster strikes, say a flood, earthquake or hurricane, people spontaneously self organize to render assistance to one another. \n\nIf they’re being subjected to a siege or serious boycott i.e. the disaster is man made and ongoing, the ability of only locals to regain equilibrium may, of course, be frustrated. Usually though, the outside world is at least sympathetic and will not obstruct recovery efforts, as is the case in East Palestine, Ohio (and environs).\n\nOnce a population has significant logistics capability, it may wish to volunteer its services elsewhere. We see the same phenomenon in the case of military veterans, not surprisingly, given wars are man made self inflicted disasters. \n\nVeterans may join with para-military groups, or the police, in order to share their expertise and subculture. \n\nThe trend is towards not waiting for central governments to take the lead, as in the US at least, it’s understood that government cliques mostly focus on accreting power irrespective of citizen welfare. \n\nWhether this is actually true or not, this has become a widely shared perception vs a niche form of cynicism. Civilians understand it’s their own responsibility to self-mobilize, with or without any help from FEMA.\n\nExtrapolating from this trend, it’s easy to appreciate why city mayor offices coordinate inter-state relief efforts, or at least endorse them. Portland will send its away teams hither and yon, to help out, hoping others reciprocate when the next big earthquake hits, or fire.\n\nSending unarmed civilians directly into war zones is tricky, given military theaters are dominated by destruction engineers and their demolition crews. Disaster relief has to go on in the shadow of continual violence, as in Aleppo.\n\nThose resorting to violence and high tech weapons in pursuit of their goals represent the lower half of a Bell Curve, in terms of ethics if not intelligence. Many religions and religious figures use their pulpits to encourage people to take up outward weapons, whereas other leaders and influencers preach that “jihad” refers to a personal journey, often an uphill battle in the face of temptation. One is tempted to become a part of the problem.\n\nInternational logistics teams hell bent on disaster relief typically deploy truck and bus fleets. Much of the self-help ethos in the face of uncaring central governments is percolating through trucking subcultures. Truckers are the new diplomats, exchanging news and views at international truck stops, and in many cases carrying supplies to those in need.\n\nSometimes governments will have invented adversaries that the folk religions do not recognize. Disaster relief teams from the US, Russia and China might all work side by side to alleviate suffering in this or that part of the world. The upper half of the Bell Curve tends to not sucker for goodie vs baddie ideologies. The lower half isn’t “bad” so much as delinquently juvenile.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}