{
  "id": "8009114230228531171",
  "title": "Discipline and Record Keeping",
  "published": "2015-07-17T13:00:00.000-07:00",
  "updated": "2015-07-31T05:51:25.220-07:00",
  "content": "Although many Friends don't think of it this way, keeping accurate and complete records falls under the Truth Testimony.\n\n\"Are these records to be believed?\"  If the answer is \"no\" then we may conclude:\n\n(A) they're meant as fiction (storytelling) perhaps with embedded teachings\n(B) they're obsolete (out of date) and in that sense misinforming\n(C) they're deliberately misinforming\n(D) the records are riddled with [outright lies](http://worldgame.blogspot.com/2010/01/more-geopolitics.html).\n\nIn moving from A-D, I'm escalating the severity of the untruths.\n\nMany not-truthful records fall into category (B) within NPYM.\n\nWe have creaky, obsolete ways of conducting business.  Collectively, we lack discipline as a business.\n\nSaying a nonprofit or 501(c)(3) \"is not a business\" is probably a grave error, one that kills off serious Quakerism by suggesting that our \"business\" (as in \"Meetings for Business\" -- a core activity) is not really business, and so the idea of applying serious \"business logic\" or \"business rules\" need not apply.\n\nThe lack of discipline in our record-keeping is thereby justified.  \"Everyone knows non-profits are dysfunctional\" -- a belief I've encountered often.\n\nPerhaps it would be constructive to use the term NGO (for non-governmental organization) more assiduously?  Personnel in the global development business know that [not all NGOs](http://worldgame.blogspot.com/2015/06/visa-commercial.html) are slouches,  Some NGOs have their act together, including with respect to record-keeping.\n\nWhat holds us back is the stereotype of a \"non-profit charity\" as a loose ship run by mostly volunteers, a hobby activity.  The outcome:  recreational Quakerism, not all that serious and typically middle class Christian, a religion being something people engage in \"on Sundays\" and on some holidays.\n\nThanks to the connotations of \"non-profit\", our \"business\" takes a back seat, including record-keeping, as Friends indulge in what they consider \"more spiritual\" matters.  Record keeping is not sexy enough.\n\nNPYM Friends fall further and further behind, in terms of relevance, as they allow their \"business culture\" to continue to degrade.  Quakers reached their peak in power and credibility sometime [in the late 1700s](http://controlroom.blogspot.com/2014/10/a-quaker-arc.html), when they actually ran legitimate businesses.\n\nThe very idea of a \"[sectarian business](http://coffeeshopsnet.blogspot.com/)\" is fairly unusual by now, at least as a marketing ploy.  Everyone knows that Quaker ([the commercial brand](http://controlroom.blogspot.com/2009/11/go-humans-go.html)) does not mean Quaker (the religious sect).\n\nWhen the Rajneeshis tried to start their own company town in central Oregon, they opened some storefronts in Portland, like a bakery, but those all were shut down, leaving a bad taste with many Oregonians (a twisted tale).  Churches sometimes have gift shops at least.  Christian supply stores abound like at The Grotto in Portland.\n\nAt some point, with the passage of time, the neglect starts to seem more willful and we move from (B) closer to (D) along the Scale of Untruthfulness.\n\nNot lifting a finger to become more up to date eventually becomes a way of lying, with lying becoming a way of life.  Externalizing \"future shock\" so that others must endure it, but not oneself, is a way of postponing the day of reckoning.  Answering the call of the Zeitgeist to \"shape up\" means keeping up with best practices around curating and record-keeping.  [Graph database](http://mybizmo.blogspot.com/2014/10/graphing-relationships.html) anyone?\n\nI don't believe we need hirelings when it comes to the basics of Quaker record-keeping though.  In today's world, these basics include knowing something about Structured Query Language (SQL) and databases. People in a clerking role should bone up on the relevant technology.  It's not all ledger books and quill pens anymore.  We do not live in Victorian England.\n\nBottom line:  software engineering is not \"outside\" the spiritual sphere, but is rather at the core of our practice and has to do with the Truth Testimony.  [Engineering is a spiritual activity](http://mybizmo.blogspot.com/2015/05/engineering-as-moral-enterprise.html).\n\nI'd like to address issues of lax discipline around \nrecord-keeping in the context of joining said standing Discipline Committee.  The \nrole of \"clerk\" involves attention to records.  Keeping our information \nup to date is a shared responsibility of clerks, not something to \noutsource or lay at the door of some paid person.\n\nAs the Technology Clerk, new position (unpaid of course), I've been agitating\n for ex oficio status on the Discipline Committee.  I want our practices\n to improve [with respect to record-keeping](http://mathforum.org/kb/thread.jspa?forumID=206&messageID=7344243).  Lets see where that goes.  I'm getting the feeling my proposal is not taken seriously yet.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}