{
  "id": "2348585909312445212",
  "title": "Dish Chatter",
  "published": "2007-04-30T08:18:00.000-07:00",
  "updated": "2008-11-15T02:36:48.352-08:00",
  "content": "So here's a question for you DirecTV jocks, somewhat rhetorical as I don't generally accept comments in my journal (too many iPod ads): should I initiate a trouble ticket regarding the circumstances recounted below?So Tara clicks on 311 for America's Funniest Home Videos or whatever and gets 'searching for satellite' but no programming, though some other channels work just fine. Go to the other DirecTV box in another room, go to 311 and voila, no problem at all. And now Tara's got it too, like it just comes on. OK, go back to the other box, and now leave 311: and it's killed on Tara's in the living room, we're back to 'searching for satellite'.Yet the behavior is unpredictable and seemingly not-weather related. Sometimes the main box seems blissfully unslaved from that other one, gets everything with no assistance and/or interference.Whaddya say? I say it's under warranty, and I'm a new adopter locked in for a year, and I should explore my technical environment, so yes, let's initiate a trouble ticket. Also, my caller id went away, after a few days of service. I'm thinking confusion at Qwest, so I'll get a partner to check in to it during business hours.Followup (9:15 AM, May 1):The Qwest tech detected a cross pattern and cut me a fresh F1 to the crossbox near Hawthorne, for which I'm glad, but a deeper problem is caller id and DSL don't play well together. The workaround was to simply connect the handset on my desk to a different jack.The DirecTV tech traced our problem to a bad connector left over from CATV days.I was pleased by the professionalism and prompt responsiveness of both service providers.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgodqQg4UCsvh2oMeTw_cNrjZFbIV__I5E5ykdxM7pE66PVY_u6yEtbJE06P2PC_PjZgpdtvYf0w87JHhjKrJEwZ-DQozoFWPWB44AFnoluT_G9lKtQmCxWQXtx_uMT05V2tr7c/s1600-h/qwesttech.jpg) :: qwest tech ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}