{
  "id": "3623202954381693388",
  "title": "Dissing Quakes",
  "published": "2007-09-26T14:12:00.000-07:00",
  "updated": "2007-12-18T09:05:06.809-08:00",
  "content": "I spent some of my day, between day job activities, mocking Quakers for being such dweebs around technology.  Here we are in a futuristic [Open Source Capital](http://www.csmonitor.com/2005/1128/p03s02-ussc.html), with a new cable car and everything, and we don't even have a [Mapparium](http://www.marybakereddylibrary.org/exhibits/mapparium.jhtml) yet (unless [Google Earth](http://www.bfi.org/our_programs/bfi_community/google_earth) counts).So where's the [Portland Geoscope](http://www.buckminster.info/Index/G/Geoscope.htm) gonna be?  Or should we have more than one?The details: our business Optoma is on loan for legitimate business purposes and I'm snarlingly protective, like [Sarah](http://mybizmo.blogspot.com/2007/09/mt-tabor.html) on steroids, when so-called Friends come along begging, confiding they don't actually take care of their own young (by investing in said equipment), but instead rely on hand-outs and charity.Query:  how can a religion have claws if it outsources the care and feeding of its own young?  Many will say Quakers shouldn't have claws, being all \"[Peaceable Kingdomy](http://images.google.com/images?hl=en&q=%22Peaceable+Kingdom%22&)\" and like that, to which I retort:  don't [lions](http://worldgame.blogspot.com/2006/09/more-about-quakers.html) have claws?On another front, I'm unable to find a power supply for the [Toshiba Satellite A60](http://worldgame.blogspot.com/2005/04/eclipse-chasing.html), my WinXP laptop.  I've been taking Ubuntu to work a lot more.  But if we've decided to go with Visual FoxPro again (my staple for some years now), then it'd behoove me to get that asset back in the game.  I'll order a new power supply if I have to [update:  I had to].Enjoyed gabbing with Wanderers today, Bill and I side by side, with our Ubuntu Dells, except he's booting Win98 off a memory stick and home growing an assembly language piano, which worked flawlessly in the demo.Liz popped up in a chat window, next-gen type that she is, with more cyber skills than even most [boomers](http://worldgame.blogspot.com/2005/03/wanderers-meeting-200531.html).  Sometimes having Wanderers join in cyberspace is the best one might do, and really it's not half bad that way (though I prefer meeting for coffee at least sometimes).Related blog post:  [Quaker Informatics](http://www.2mminutes.com/trailer.html) (May 17, 2007)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}