{
  "id": "3792542438156821761",
  "title": "Does Your School Have a Charter?",
  "published": "2017-07-24T09:58:00.003-07:00",
  "updated": "2017-07-24T10:05:07.412-07:00",
  "content": "[first posted to [Forum 206](http://mybizmo.blogspot.com/2017/01/forum-206.html)] \n\nI just waded through a few Youtubes on the charter versus non-charter school debate.\n\nThere's a sloppiness to it all in that everyone starts by saying charter schools are public schools and then a sentence later it's back to \"public versus charter\".  Silly right?\n\nThe mainstream discourse seems to have settled on \"traditional versus charter schools\" or \"district versus charter schools\".\n\nWhat an amazingly narrow and ill-fitting vocabulary, is my thought.\n\n[https://youtu.be/vhubtPygTcA](https://youtu.be/vhubtPygTcA)\nCharter Schools Are Overrated, IntelligenceSquared Debates\n\nwas interesting, a hosted debate between two teams, an ongoing show that seems to think \"IQ\" is something real and therefore square-able.[1]\n\nWhat many debaters miss, in my view, is the passion some have, in every generation, to create new schools, not just join existing schools.  Any healthy society has its pioneers and reformists.\n\nWe should accept that as a built in feature of human nature, and so the debate should begin with that premise:  that the public sector, however designed, needs to facilitate (not stifle) turnover at the institutional level, meaning public schools, charter or no charter, will continue to come and go.\n\nSpeaking of schools going, I think it's more than obvious we need to physically close a lot of schools that are simply beyond repair [2]. Trying to coast on clearly broken buildings, full of lead or whatever, is just lazy, the opposite of innovation, and proof we have little imagination.\n\nI'm one who thinks a central government (of any nation), if there's one in the picture, should have the where with all to create its own flagship schools.  These could be boarding schools for future diplomats, deliberately open to students from other countries.  We might also see more experiments with same-sex schooling, for those wishing that option (choice).  Let NASA do more than just summer camps, NSA too for that matter.\n\nBut then I'm one who thinks any government worth its salt should run a number of showcase institutions designed to provide work to a nation's citizens, including roadside lodging (motels), an airline, maybe a rental car company.[3]\n\nWhat better way to stay in touch with the people than to run and manage some example enterprises.\n\nSomething other than war machines (and a few camp grounds), which is currently the main endeavor for which the weakest governments (e.g. the US) are allowed a sandbox (the war machine includes government labs such as Sandia and Los Alamos -- not much research on  how to help with refugee camps -- just on how to create them in the first place i.e. by turning cities to rubble, per the 1900s, a century of barbarism).\n\nGovernments are permitted / coerced into serving as clients to a weapons-oriented private sector (Raytheon, Lockheed-Martin...). That's their major role (subsidizing the most sociopathic).  Greece, broke, buys submarines from Siemens. [4]\n\nHow we tax and spend today is income redistribution, like they say, from the defenseless and over-taxed to oligarchs with off-shore investments (Russian or otherwise, what does it matter at that level?).\n\nA truly American run boarding school might even teach some of the heritage I'm most interested in, namely this \"geometry of lumps\" I keep talking about (Karl Menger et al) wherein we experiment with axioms other than those inherited from ancient Greek metaphysics.\n\n[http://coffeeshopsnet.blogspot.com/2009/03/res-extensa.html](http://coffeeshopsnet.blogspot.com/2009/03/res-extensa.html)\n\nThe way things are going, with Uncle Sam broke, and more a hired gun than anyone's idea of an emperor, I don't think it's a given that these dreams will pan out.  We appear to have drifted into oligarchy and plutocracy with democracies fading.  The politicians have the job of telling us something different i.e. they comfort us with their fairy tales.\n\nKirby\n\n[1] (dig way back in the math-teach archives if you can figure out how, takes IQ, and you'll see we discussed the \"g factor\" for like forever that time).\n\n[2]  Beyond repair... or not (in some cases):\n[http://prospect.org/article/fixing-our-infrastructure-how-about-schools](http://prospect.org/article/fixing-our-infrastructure-how-about-schools)\n\n[3]\n\nSpain has a chain of state-run luxury hotels:\n[https://en.wikipedia.org/wiki/Parador](https://en.wikipedia.org/wiki/Parador)\n[https://en.wikipedia.org/wiki/Category:Government-owned_companies_of_the_United_States](https://en.wikipedia.org/wiki/Category:Government-owned_companies_of_the_United_States)\n\n[4]\n\n[http://www.haaretz.com/israel-news/1.801881](http://www.haaretz.com/israel-news/1.801881)\n(similar to the scandal in Greece)\n\n[https://www.nytimes.com/2014/02/08/world/europe/so-many-bribes-a-greek-official-cant-recall-all.html](https://www.nytimes.com/2014/02/08/world/europe/so-many-bribes-a-greek-official-cant-recall-all.html)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}