{
  "id": "4775277563304127027",
  "title": "Doing the Math",
  "published": "2010-02-20T18:28:00.000-08:00",
  "updated": "2010-02-21T03:15:34.672-08:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/4374854038/)The math problem at Peoples' Food Co-op was to figure out which eco-friendly dish washing powder soap had the most bang for the buck.  The bulk offering said 3x concentrated, only a table spoon per load if your unit had but the one soap holder.The two boxed offerings gave weights, but only one gave loads per box.  The other had temporarily removed the word \"natural\" from its literature and wanted readers to know why.My challenge was to use my cell phone as a calculator.  This isn't one of those Droids or anything, not R2D2.  I flubbed getting a decimal point, plus still needed to ask how much of the bulk item gets one those 64 loads.Lindsey, much better at this game, volunteered to obtain this information next time, was just too busy buying to feed her army, at the time of my flailing.  We were at Peoples' in service of another  Vegans not Pigs at Duke's Landing (with chicken an option for carnivores).These have become ritualized no-alcohol events, where we learn how to buy and cook effectively and tastefully, amidst live music provided by local bands.  A more wholesome event would be hard to distill.I brought a whole paper bag of [Flextegrity icosahedra](http://www.flextegrity.com/), cast-offs with paint on 'em, fresh from the Pauling Campus studio.  I feel like one of Santa's elves.  I piled some around an old XO for another photogenic tableau.  Maybe this one 'll end up as a [polyethylene billboard](http://worldgame.blogspot.com/2010/01/pacific-rim-economics.html) in Tokyo somewhere (just kidding)?  G1G1 meets Radical Math (polyhedra are considered somewhat radical in 2010, [check standard textbooks](http://worldgame.blogspot.com/2007/11/world-game-museum.html) to gauge the level of our poverty).One imagines these innovative subcultures, working towards a better tomorrow.  In Portland, we have them.However it's probably a good thing [the Japanese TV crew](http://mybizmo.blogspot.com/2010/02/more-musings-about-television.html) didn't come all the way from Narita for this one.  Troy has to DJ somewhere else tonight.  There's not been much publicity to speak of.  You won't find any mention of these experiments in The Oregonian or Willamette Week.  We'll make do with the amateur film crew (me).[Evelyn](http://www.flickr.com/photos/17157315@N00/4104819987/in/photostream/) just showed up, is joining Lindsey in the kitchen upstairs. Now here's one of the bands. My daughter is off at her debating tournament all day, is welcome to join us (too exhausted: \"extem\" with 30 minutes to prepare on any subject, no Internet, is a rough row to hoe).Now that Pycon is gathered in Atlanta, we're getting some themes coming through on the PSF members list.  If you scrounge around in the blogosphere, you'll likely glean more.I spent another long day with the math teachers, yakking about [my days at McGraw-Hill](http://mybizmo.blogspot.com/2010/02/remembering-new-york.html) (Hugh Kenner important, wrote a column for BYTE).  We should be seeing those recruiting commercials around now, for our new kind of math course.Fighting about what programming language to use is somewhat beside the point, as that's for teachers on the ground to decide.  One goes with the army one's got, as someone once said.Mike D has installed [Xtra Ordinary](http://webpath.net/index.php) on [his XO](http://aspn.activestate.com/ASPN/Mail/Message/edu-sig/3789265), an operating system geared  more for adults.Yes, there's a counter-culture aspect to these operations, in that we're documenting how Portland's underground was [carrying the torch forward](http://coffeeshopsnet.blogspot.com/2010/01/coffee-shop-schools.html).  When it comes to tetrahedral mensuration, world game, [octet truss](http://worldgame.blogspot.com/2006/02/octet-truss.html), [tensegrity](http://mybizmo.blogspot.com/2009/02/celebrating-soho.html), [flextegrity](http://worldgame.blogspot.com/2005/08/flextegrity_18.html), [global grid](http://controlroom.blogspot.com/2008/12/global-grid-info.html) etc., the avant-garde was on SE Belmont, with Laughing Horse and Pauling Campus among the back office collectives.  Lets keep this in mind as other institutions crowd in to cash in.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh9moFK8alORv0wh5M_Ex4xNF-arycAr7HVuIGkR4TOEu8OietRNlZzWewcWeyTzDp9cUfvTWy_Pm-KR5_m5RQMeccNS0KQQ-YQ3GIWmUU6iSZcz5UtmpmjN_IDimnwawmMXE6s/s1600-h/next_dukes.jpg):: next week ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}