{
  "id": "1117755775996001502",
  "title": "Domestic Affairs",
  "published": "2015-02-06T13:13:00.000-08:00",
  "updated": "2015-02-24T18:40:04.549-08:00",
  "content": "Perhaps as a consequence of [the smartphone still having Alzheimer's](http://worldgame.blogspot.com/2014/12/about-smartphones-again.html), overloaded with Aviate, I managed to spend four TriMet e-tickets getting from A to B, which pissed me off, and I thumbed my irritation in the direction of the app makers.  To their credit, they refunded my Visa, and to mine, I'm still using eTickets, being a credit to my religion (one in favor of appropriate tech, including these handy GIS / navigation devices).\n\nSpeaking of Alzheimer's, did you see where Putin might have Asperger's all of a sudden?  That's not catching, like Ebola, so he's had it all along and only his nurses knew.  The martial arts training was all a way of diverting our attention from his stare or whatever open source signals are telling the Pentagon goat staring types what's really happening in Putin's brain (as opposed to his soul, which Bush checked out and briefed the Pentagon about already, presumably).\n\n[CBS is the one with the story](http://www.cbsnews.com/news/does-vladimir-putin-have-aspergers-syndrome/).  I'm yukking it up on Facebook about it, but with empathy for those who suffer from this syndrome, which nowhere in the Constitution is listed as a disqualifying characteristic for a USA president.  I've always seen [Ollie North](http://olivernorth.com/speaking) as autistic, yet he'd have been at least as strong as Romney dontcha think?\n\nBack to my kitchen:  dish washer has run amuk, leaking into the basement.\n\nThirsters last night:  kudos to Mrs. Beebe (PhD) for her presentation on stellar Filipina women who've not only tended our ailing (e.g. in the Holy Land) but have run banks, software companies, done everything men consider worthy.  But was leaving the Philippines a prerequisite for success?  One may always wonder, but one life is the one set of cards, and we don't get to play \"as if\" all that easily as when fantasizing about lives we didn't have.\n\nI was glad to see (in her slides) more of the history in condensed form since my departure from those islands, after many formative years, in the 1970s, to attend a four year university (Princeton).  I was back briefly right before Cory Aquino's rise to power, but not since.  I still buy San Miguel sometimes, just for the mood and the memories (not that I was a huge beer drinker in high school, just we liked to hang out and enjoy one anothers' company -- what a lot of school is about, or should be, if you're lucky).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}