{
  "id": "6486600036956933210",
  "title": "Don't Look Up",
  "published": "2024-06-24T14:48:00.000-07:00",
  "updated": "2024-06-27T07:47:00.828-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjKUjcQs9yLpEBKYkJcMTvaeicsblVYUsQs2l5qZxK6Gggil8dhEfUqFcmsa8X8Z1RGcuyCr0igEL6D0Za77_97HijtyFRp-BqlTnLdlvGmzXdS9fj7hYtk4_H3OnbfnUdPKdkknLZUSVApjpL6_oAOWDp1j3MHulU_mQD7JLkEZ2fdXJZ4-OHK/s1024/epcot_ball_6.png)Spaceship Earth by AI\nSpeaking of ethnicities and culture wars (aren't all wars about cultures, or between them?), one reason Star Wars fans might be taking out their frustration on Papa Disney is escapism just isn't working across the board. We're in the middle of a hot war between superpowers and the message \"don't look up\" is ringing hollow. The billionaires are already moving into their luxury apartment bomb shelters.\n\nMad Max (Furiosa) didn't attract big audiences either. I saw it. A well made film, for what it was, but what it was, was too close for comfort. Showing a post-apocalyptic idiocracy on the big screen is somewhat triggering, not conducive to escapism. \n\nDune 2, on the other hand, was in a convincingly different alt universe, and that's what we need, if seeking anti-realism.\n\nAs of this writing, the Pentagon, circuitry controlled by outsiders, is busy using high powered weapons to strike inside Russia, with no permission or understanding from the American people. \n\nThe calmness in the streets has to do with their not really following the action. It might also have to do with countervailing media, which throw ice water on the whole business, playing up the war game escapism currently underway and offering a more credible, less dystopian, world game instead.\n\nThe stridently arrogant of this world want to plunge us into conflagrations. The result is not surprising: the circuitry is rewiring to lock out the outsiders, if possible, to disconnect them from their arsenals, to which their continued access is now unauthorized. \n\nWhen people believing themselves to be insiders wake up to their actual NPC status, that'll be a good day. In the meantime, we're being victimized by morons.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}