{
  "id": "3726082512064676974",
  "title": "Done Deal",
  "published": "2015-09-02T20:02:00.002-07:00",
  "updated": "2015-09-08T07:52:33.809-07:00",
  "content": "OK, so done deal already, the news media are saying the same.  Given the vote in the Senate is to say nay to this not-a-treaty, the President may gainsay with a veto, with thirty-four needed to sustain that veto.  The Iran Deal goes through, checkmate.\n\nNPR spelled that out in some detail in the last couple days, and by this morning a thirty-fourth supporter had been announced.  That meant Game Over in some dimension, but then politicians know how to keep a ball rolling.\n\nWe may shift our sense of suspense to some newer arena and stop [pretending to care](http://controlroom.blogspot.com/2015/08/pretending-to-care.html).\n\nAlso encouraging:  the words \"air strike\" were used with regard to a Syrian family, one of millions, fleeing a veritable Katrina of air strikes over Syria.  Their home was leveled, no doubt [collateral damage](http://www.theguardian.com/commentisfree/2015/jul/02/the-guardian-view-on-bombing-isis-in-syria-just-say-no).\n\nWho has [so much ordnance](http://controlroom.blogspot.com/2015/09/pedestrian-thinking.html) again?  Was that some Islamic State dropping bombs?  Pretty terrifying, those hits, with collateral damage lowering land values and quality of life for everyone on the receiving end.\n\nWill the computers have each crater by serial number, to help with reparations?  No.  Remember the ordnance drop over Laos.  Napalm and all that.  Check the recent National Geographic issue about those craters.  The perps tend to stay anonymous, or try to, just [following orders](http://controlroom.blogspot.com/2013/08/city-of-morons.html).\n\n[ Note:  the news reports are not saying that product, Napalm, was used in Syria, just that aerial strikes tend to come from those controlling the air.  That would be physical airspace.  Controlling the media is another matter and requires [spin and finesse](http://worldgame.blogspot.com/2004/10/busy-day.html). ]\n\nThe [subways of Budapest](http://www.cbsnews.com/news/syrian-refugees-stuck-in-limbo-at-budapest-train-station/) are the new stadium in an unfolding New Orleans scale disaster, though more spread out.\n\nCongrats to CBS on 53 years of half hour news broadcasting.\n\nHumanitarian aid is not something governments are necessarily any good at.  NGOs will need to step in here shortly.  \"Chinese Peace Corps\" and all that.\n\nDon't expect espresso-sipping cube farmers, corporate peasants, to come to the rescue of the latest \"hurricane\" victims.  Remember the Coalition has been waging a holy war in the region.  Old ethnic tensions flare up when push comes to shove.\n\nMany Asians had a hard time adjusting to North America in the aftermath of the war in Indochina.  My NGO (the one I worked for), Center for Urban Education, had government contracts to work in refugee resettlement in the 1980s, which is when I moved back to Portland from the Atlantic coast (by way of Bangladesh) where I'd gone for higher education at Princeton.\n\n[Refugee resettlement](http://mybizmo.blogspot.com/2015/06/summer-solstice-2015.html) is a source of social work with many ripple effects through small business and banking, as families do their best to recreate some semblance of what they have lost.  The Empire State, for example, has seen a lot of this kind of activity over the years.\n\nHumans are on the move, suffering denial of service attacks where they live.  Nation-states act as prison guards.  The prison-state system is about denying humans their birthright:  access to a whole planet.  Refugees the world over are those falling through the cracks as \"undocumented\", as if it's their fault no one cares enough to create some documents for them.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}