{
  "id": "2525770363107092107",
  "title": "Downloaded (movie review)",
  "published": "2016-11-16T13:33:00.000-08:00",
  "updated": "2016-11-16T14:06:30.945-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/30967779765/in/dateposted-public/)\n\nHistorians will appreciate this quality anthropology.  Two cultures clash:  hackers with Hollywood, with the Feds hauled in to mediate through their Congressional and Court system.  The executive branch was also involved, leading to FBI warnings next to all these copyrights.\n\nAs Bucky Fuller points out, making money means keeping supplies of something scarce. Sometimes the floodgates burst, as happened in the case of Napster.  The paywall broke down.\n\nThe hackers were young and assumed adults in charge would have an optimized response to their disruptive technology.  A positive synergy would be discovered in short order.  On the contrary, the generation aging out was defenseless and had no choice but to go on the offensive, to save its way of life.\n\nFast forward to 2016 and the infinite copiability of digital assets is akin to the power of DNA to reproduce.  Any reproductively active adults are capable or creating new billion dollar humans (applying a government published statistic).  Imagine having to buy your factory-made children and all the hoops they'd want to put you through.\n\nSome musicians were overjoyed to see that, along with pornography, the new telecommunications technology was quickly harnessed to channel them.  People wanted their music, more than anything.  Facebook would come later.  Other musicians understood their incomes were in the hands of an unprepared music industry and joined in the battle to shut Napster down.\n\nI'd just hosted an after-Wanderers party, pumpkin pie served, and had at least one after-party viewer crashing on the couch.  I may have misunderstood that I was seeing a lot of the same people over time, mistaking the older versions of X and Y, for new talking heads.\n\nHowever, that mistake is in keeping with the moral of the tale, which is never mind how fast the technology is changing, humans are able to reprogram themselves at a relatively finite rate.  More than one generation is needed to implement the adaptations.  The pioneers get to hit the proverbial \"brick wall\" or whatever it is that cannot abide change.\n\nThe whole topic of file sharing is too big to handle except in the abstract, in principle, whereas in reality we have special cases, such as hackers versus Hollywood.  The makers of this documentary understand they're exploring some deeper issues with even wider ramifications than an overhaul of the Hollywood music industry.\n\nI go back to Hillsboro Police Department, here in the Silicon Forest (this Hillsboro is a township west of Beaverton).  Chamber of Commerce types were prodding public schools into yoking police into coming into classrooms and scaring the kids about the anti-capitalist practice of \"pirating\" (you could go to jail, and bring disgrace to your family).\n\nThe police were not dummies though and understood a new Free and Open Source culture was inspiring hopeful hackers to share their talents freely, using GNU / GPL and other innovative legal licenses.  Instead of just scaring the kids and criminalizing their natural tendencies, why not show them a better way?  HPD actually started its own Linux Lab as an after school opportunity, myself one of the instructors.\n\n[](https://www.flickr.com/photos/kirbyurner/30922121531/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}