{
  "id": "7749402201809873143",
  "title": "Dream State",
  "published": "2018-05-24T12:02:00.001-07:00",
  "updated": "2018-05-26T16:20:12.133-07:00",
  "content": "\"Dream State\" is a bit of a pun, as I was dreaming (this is a write-up of a dream I was having about an hour ago), plus the theme of the dream was the dream-nature of States.\n\nI was in this institutional building with a large training room, but U-shaped, so I couldn't see all the students. I assumed I was the instructor, as I was on my feet, everyone else sitting in front of a computer.  I'm reminded of when I taught WordPerfect in Salem.\n\nOne of the students started talking about Zionism and Judaism in a loud voice.  He was pretty coherent but weren't we here to learn Python? As the trainer, I felt obligated to politely interrupt and change the topic, but then another voice around the corner picked up on the same theme.\n\nI looked around the U and another guy, tall and thin, was holding forth on the same topic and showed no signs of surrendering the floor.  I did a double take and realized I didn't know any of these students, so apparently I wasn't the instructor.  I must have arrived early.  My class would be later that afternoon.\n\nFor the rest of the dream, I followed the tall guy around the building, to a gift shop (or something), up and down some stairs.  I just wanted to apologize and explain my mistake, why I'd interrupted.  But he paid me no heed, wouldn't listen.  He kept going on about Judaism versus Zionism (he saw them as opposed).\n\nFinally I woke up and realized the sound track for the dream was courtesy of Youtube, still on auto-play and going through videos.  I've been watching this genre of videos, even in a more conscious state, though some might aver we're always dreaming at some level.  No need to wax philosophical at the moment.\n\n\"As French are to France, as Italians are to Italy, so are Jewish people NOT the people of Israel\" is the message.  This is an old debate (if one can call it that -- a clash of viewpoints) going back to the creating of Zionism in the 1900s.\n\nWhat's new is a slob in Portland, half asleep (or fully asleep) can take in these viewpoints as video recordings.  I don't have to just read about them in obscure magazines or whatever.  When I want more, I get more.  That's called becoming informed and given my academic background, I get to pat myself on the back for doing homework.\n\nOK, now it's back to prepping for Python class.  Or maybe I'll blog some more. Actually, what happened is I posted comments on Facebook.\n\nThis whole discussion relates to my summary view that we're in a \"globalist versus nationalist\" chapter. Nationalists such as Bannon have been very clear that globalism is their enemy. As a product of the Aquarian \"think globally act locally\" school of thought, a long time expat (now in Oregon) and alumnus of international schools, my mental DNA is more globalist. I see nation-states as past their pull date, keeping people penned in and pent up (which is the point -- keep 'em governed). Better engineering is desperately needed, however narrow political agendas based on \"my nation against the world\" keep us from wholistic thinking. It's not like I advocate some revolution to overthrow all governments, or to create one world government. Rather I see an evolutionary process at work whereby we at least psychologically free ourselves from the nationalists' political sphere and learn to collaborate with one another more successfully. I want to keep it hopeful of course. \n\nI think world religions, including humanism, as well as science, are inherently more supranational in their perspective and help us dampen the damaging effects of the rampant nationalism that seems the dominant paradigm of our day.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}