{
  "id": "8480397904348440676",
  "title": "Driverless Cars and Automation",
  "published": "2022-06-30T11:24:00.003-07:00",
  "updated": "2022-07-16T20:12:22.656-07:00",
  "content": "The Scott Ritter thesis, that the privatized and gutted post-USA corporate navy is ill prepared to be sunk in the Pacific, neglects outside-the-box, non-military points of view.  That's not really a criticism, as Scott is trained to see issues militarily and was on the channel, with Ray McGovern, to discuss the likelihood of nuclear Armageddon, a hot (i.e. trending) topic on YouTube more generally.\n\nThese high brow prophecies regarding End Times (which wouldn't follow Revelations and so lead many Christians to despair, but not just Christians -- the whole exercise is suicidal and pathological) cannot be other than biased and Scott knows that. His role is to give full vent to his bias and hope he's wrong due to countervailing forces, potentially of a non-military nature.\n\nI'm back in touch with a Lithuanian math guy who might help me tighten up my hypertoons.  The LCDs powered by Raspberry Pis are already on the market and there's little to stop a Coffee Shops Network from emerging more publicly into peoples consciousness, as a design pattern.  \n\nBy \"tighten up\" I mean \"make more useful to scholars trying to pack a lot in\" in the sense of densely packing information, with aids from mnemonics, frameworks, models, whatever holds water.\n\nPicture yourself in Oregon, at a coffee shop, with a laptop and stuff to study.  The hypertoons are on the screens around you, and with ear buds, you might tune them in.  What's available at the bar?  The Oregon legislature is still working on this, with pressure from various sanctioning agencies that have lost too much credibility to be taken seriously.  We bide our time.  \n\nI wouldn't say I've been too activist in trying to assert our right to allocate our video lottery winnings as we see fit (when the state wins, we being Oregonians).  Let the built-in sense of that whole scheme drive it forward, not inordinate bullying from my corner.  \n\nI have no bully pulpit to speak from, no specific legislative agenda.  I'm a blogger with a point of view.  I've talked about a pirate party, with only planks, no candidates.  Kinda ghostly in that sense.\n\nYou might be learning biology and medicine, and/or some form of computer science.  Of course you dial up the specific videos you need for homework and research, or for on the job training, but the shop-provided hypertoons (jukebox model) remind you to relax and take your weight off the foot pedal so to speak.  \n\nSurrender to a higher power and let the \"driverless car\" paradigm take over from time to time.\n\nSpeaking of driverless cars, I am not from the Silicon Valley and never got fully immersed in the venture capital vision being promulgated.  I've always preferred rails and rail systems anyway, ever since dad bought us a great model railway spread for the rec room (Marklin, HO scale).  I gave that up when we moved to Rome and resorted to belts modeling subways in the halls of our EUR apartment.\n\nAnyway, my model of \"surrender mode\" is when and where your car is indeed \"possessed\" and controlled by external intelligence, in theory even another human driver, but in most scenarios we posit automation, an operating system designed to maximize safety and efficiency.  \n\nHowever it's not a matter of every car for itself, with autonomous decision making.  Not every car has to be a genius to join the network of the driverless.\n\nThat protective security layer might well be there (for when the pedestrian dashes out, chasing that dog), but the golf course or theme park or model city is expecting to control all the vehicles according to algorithms, involving routing and waiting.  Cars become people movers.  But only in patches.  In practice many vehicles only operate in one of the two modes, meaning you might need a rental to get around in Philadelphia or whatever (if your car doesn't transition).\n\nIndividual vehicles might go in and out of this mode at allowed switch points, transition zones.  \n\nEnter the zone on autopilot, leave with yourself in command, or vice versa.  If you don't take over, your car is programmed to park safely and await customer assistance.  Or wait in the lot for your car to start moving, steering itself to your final destination, perhaps on someone's private property.\n\nYes, border patrol is listening, but then any weigh station or check point or toll booth could take command once a threshold was crossed.  Those avoiding that threshold might have exemptions.  \n\nI'm not prepared to write all the software in this blog post.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}