{
  "id": "1977687868080646832",
  "title": "Drive By Physics",
  "published": "2008-12-04T20:20:00.001-08:00",
  "updated": "2009-01-05T10:24:32.110-08:00",
  "content": "Yes, that sounds a little scary, given the connotations of \"drive by\", but then physics is involved, even in scary situations.In this case, I'm thinking it's helpful, if you've driven a car, absorbed its nomenclature, to come head on into Newtonian thinking, where the brake is also an accelerator.That's right, both the gas pedal and the brake are accelerators, and so is the steering wheel while we're at it.Now you're starting to get it:  acceleration means messing with the vehicle's inertia (why we wear seat belts).  These \"cockpit controls\" exercise freedoms to speed up, slow down, change direction.  If you're a fish, not a car, you have even more degrees of freedom, more directions to choose from.So is there something wrong with standard usage, ordinary language, wherein \"to accelerate\" is so definitely associated with \"speeding up\" as in \"going faster\"?  No, there's nothing wrong with that usage.  It's fine to have two or more namespaces, wherein the \"spin\" on a word (e.g. its \"acceleration\") is different in each of them (except instead of \"spin\", some will say \"meaning\").What makes diplomacy difficult, as I'm sure Hillary already knows (as any savvy politician knows) is that people don't all mean the same thing when they say \"[George Bush](http://mybizmo.blogspot.com/2006/05/decoding-usa-culture.html)\" or whatever, i.e. you really need context (which convention, which party?).  I make this very point [in my Chicago talk](http://www.youtube.com/watch?v=hbeHdg8mtdc), let's find a time signature: 15:00 - 16:00.Likewise \"[Barack Obama](http://controlroom.blogspot.com/2008/09/another-mad-cover.html)\" or whatever president name -- just using these for examples, good to drag in some civics while we're at it.In the art world, we talk about framing, where competing news crews might seek to outdo one another, in terms of getting the right spin.  And that's not a bad thing, we like competition, consider free speech, like free enterprise, an essential element of democracy.So definitely let's let the Newtonians have their own spin on \"acceleration\", and give them plenty of space to explain their thinking around all these key terms, as that's a valuable namespace, great heritage, and very practical to boot.Euclideans likewise:  give them their right to profess those weird axioms, about their infinitely thin planes or whatever, doesn't mean they own the world, [so don't worry](http://worldgame.blogspot.com/2008/10/claymation-station.html).  It's not like we're running out of disk space.Aside to grammarians:  this guy Thatcher in our Multnomah Meeting argued cogently for a different way of punctuating around quotes, which I tend to favor, i.e. I prefer keeping my commas and periods consistently outside a quoted string, even if I still succumb to bad habits on occasion.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}