{
  "id": "5608948149874482713",
  "title": "Drone Fun",
  "published": "2024-08-15T11:32:00.000-07:00",
  "updated": "2024-08-16T06:06:05.444-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53921614198/)\nI got some valuable drone training in, on my latest visit to the XRL facility, more a prototype in being farm bound, rural, but hardly eXtremely Remote. Mostly flat farmland is a perfect setting for drone training.\n\nGiven GST’s immersion into Active Inference, I was quick to appreciate the “sensory input” versus “action output” model, with a Markov blanket wrapping that me-ball self, controlling the aircraft. I brought that up with the Institute during the most recent Coda session, and sure enough, the “drone model” as already well developed, in the Julia programming language.\n\nHowever Markov comes up in another way where drone action is concerned. Quadcopters easily take the place of “sea turtles” in those “random walk” demonstrations. When only the present position counts, in terms of imparting momentum going forward, then notions of randomness come into play, as what we have is always a probability distribution, perhaps sharp, perhaps diffuse. Markov chains enter the picture, along with some history of Russian greats.\n\nThose sea turtles, you may recall, all start at (0,0,0,0) but then each picks from twelve options, or thirteen if “staying put” is an option. Role the dice. To each option, a permutation of {2, 1, 1, 0}, there corresponds a hop through space to a neighboring zonohedron, with twelve compartments or “voxels” around each. Each hop is through a diamond faced center. We call them K-points, as they’re where the closest packed spheres “kiss”.\n\nSo the goal here is to have the drones hover in such a matrix, with illumination patterns signifying the wandering sea turtles, four of which make a tetrahedron. Drones light up or go dark depending on whether the corresponding zonohedron, conceptual only, would be occupied. Variations on that theme. I’ve cast the neutral buoyancy IVM nets in other action frames. In both cases we might take advantage of unique (a, b, c, d) whole number addressing for matrix positions.\n\nAn ideal gas may be modeled in a static moment as gas molecules in IVM positions, with random offsets, although you’ll likely put science mag editors in an uncomfortable position if you do that; “IVM” (or “isotropic vector matrix”) is verboten terminology within the sphere of capitalist realism. Don’t say “A-” or “B-particle” either, or risk accusations of promulgating “the BEAST” (a specific geometric vocabulary, considered",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}