{
  "id": "117079324089679422",
  "title": "Dry as Bones",
  "published": "2014-06-05T14:24:00.001-07:00",
  "updated": "2014-06-05T17:11:06.886-07:00",
  "content": "Thinking about the Honduras Sisters, how I think of them, through Multnomah Friends for a visit not so long ago.  Interesting conversations about membership.  Hey, how 'bout the new Pope!  My Catholic friends have said some glowing things, some of them.  Boosts morale.\n\nSpeaking of Multnomah Friends, we're due for a new Nominating slate soon.  It's that time of year.  We do [management by rotation](http://controlroom.blogspot.com/2007/12/management-by-rotation.html), meaning we get to exercise our various talents in different roles.  I'm interested in PR (public relations) so it makes sense where I sit.  Front row seat and all that.\n\nThe Curse of the Gothic Symphony was video fare for the non-serious, by which I mean we needed something fun and engaging that would not punish us for dividing our attention.  In my case, I needed to work through Python work, submitted by earnest students of this computer language, named for Monty Python, friends of the Beatles and Peter Sellers.\n\nPython's author is a Dutch guy though, not a Brit, however Python's adoption within the English-speaking world has been widespread.  The 33 keywords (as of this writing) are all English (in, for, is, if, else...) but that's it.  If you wanna have Russian characters, or Chinese, be my guest.\n\nFor my current courses, the ones I teach, at least business English is a requirement, somewhat a reflection of our school's tiny size and my not being anything close to polyglot.\n\nI returned The Curse of the Gothic Symphony just now to Movie Madness, resisting the temptation to get Wagner and Me, in my queue for later then, when I have more bandwidth.  The Curse... could be viewed in a Systems / Project Management class, where you study workflows and methodologies like Agile (what I teach, Python being an \"agile\" dynamic typed language, vs. static).  One might find it on a college's \"required viewing\" syllabus.  Anthropology maybe.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}