{
  "id": "1119795679779537513",
  "title": "Dumb Domiciles",
  "published": "2017-11-07T14:34:00.001-08:00",
  "updated": "2017-11-07T14:52:18.500-08:00",
  "content": "The idea of lightweight high tech gear, much of it inheriting from aerospace, brings to mind the smattering of prototype bases wherein a small crew of science minded practice living on Mars.  Of course there's no way to quite simulate the true misery of that place, and the experience of learning new ropes here on Earth, in terms of lifestyle innovations, might actually provide a modicum of joy to the lucky participants.\n\nCampers come in many breeds, from extreme to weekend station wagon types, lugging equipment to state parks.  Extremophiles tend towards Burning Man and Rainbow Gathering experiences, where they're up against the elements, other logistical challenges.  They're doing research.  Those pioneering new lifestyles are at work as much as at play.  Product placements go here.\n\nHowever, the aerospace sector said \"no\" to [the invitation](http://mybizmo.blogspot.com/2009/01/about-habitats.html), for the most part, seeing easier profits in what's tried and tested:  weaponry contracts.  Peanut gallery opinions regarding early attempts to cross-fertilize civilian lifestyles with higher tech, must have scared off investors.  So are they happy with their portfolios?\n\nWe're left with piles of tools suitable for mass murder (Ka-ching!), chasing columns of refugees on foot, streaming from war crime centers towards mythical better living standards we have not been working to provide.  Even non-refugees are astonished how we've given up the fight for a better life, right when we had so much technology going for us.\n\nAgainst this backdrop of humans unable to perform, even in their own self interest, comes the haunting tale of machines poised to seize the day and catapult themselves into government.  If we all bow down and become properly obsequious in the face of AI's edicts, then maybe those hiding behind the curtain will finally get their ultimate alibi?  \"The computer made me do it\".\n\nHaving bet the store on Endless War, there's a new urgency to finding the new Game Theory that will tell us why the losing strategy has been the correct one all along.  Deus ex machina will come in the form of exoneration:  we had no choice.  \"Forgive me, as I know not what I do.\"  This is not a new development.  As Hannah Arendt pointed out:  evil is banal and just follows orders.  The best excuse is \"everyone was doing it\".\n\nThe counter-movement to the fatalistic one may be within Geekdom, with its more positive \"world domination\" hubris.  Rescuing humans from malign neglect, preventable starvation for example, remains a winners' goal.  Those who code tend to be less cowed by the claims of those hoping to speak for the Singularity when the time comes. \"No, the computer didn't make you do anything, us either\".  Geekdom is cosmopolitan and takes Spaceship Earth itself as our Promised Land (Moon included).\n\nWe could pitch this as an ideological showdown between the Transcendentalists and the Transhumanists.  The latter are more enamored of AI whereas the former tend to be more awed by intelligence that's non-artificial.  You'll find technophiles in both camps, as well as extremophiles.\n\nThe theater for this showdown is the university campus, what it looks like.  Are we expecting gothic arches and ivy?  Or do we expect to experiment with some of the latest engineering solutions to the refugee crisis?  What sort of career am I training for anyway?  Do I plan to help with cleanup, or am I here to make a mess?\n\nThe houses haven't gotten much smarter in in light of where we could be. I'm thinking they're ridiculously stupid.\n\nThe resources people waste, in their pursuit of a good life, is testament to the weakness of our Global U curriculum.\n\nWhat campuses seem interested in experimental prototypes of tomorrow?  What FinTech will they experiment with?  Recruiters won't be looking for just anybody.  I've you've sided with the losers, you may not have what it takes to engage in more holistic forms of scholarship.  Having a lot of money doesn't make you a skilled player.  Imposter Syndrome is sometimes acute for a reason.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}