{
  "id": "4231359405457321318",
  "title": "Early Bird Special",
  "published": "2021-02-11T21:30:00.000-08:00",
  "updated": "2024-04-18T08:10:29.217-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53659605264/in/dateposted/)\nfrom [BEAST slides](https://docs.google.com/presentation/d/13QLfgKo6kyX0j0K0RJ7W0uisB0ZyeBiK-_qbzytipck/edit?usp=sharing) (2024)\n\nI'm being somewhat tongue and cheek in this episode, as the \"early bird\" is finding a \"worm\" we've been following since the early 1920s.  Duncan Sommerville was hot on the trail of all space-filling tetrahedrons.\n\nThe \"early bird\" was also me, as I was up around 5:30 AM to get an early start on what I expected would be today's Youtube, for my channel.  I'm doing these things for free because I'm a teacher and I get paid in the cryptocurrency of Universe.\n\nThe night before, David Koski and I had the Goldberg Chart on the screen (above). He was looking from Minnesota, me from Oregon.  We also had onlookers around the table, a figurative table as this was happening on Facebook, not literally a book of faces either.\n\nBefore he introduces his three new \"infinite classes\" of space-filling tetrahedrons, Goldberg wants to survey what's known so far, about tetrahedral space-fillers.  He does a good job summarizing.\n\nAnother student of this same puzzle, who'd bitten off a lot, especially considering his life expectancy, managed to apply some fairly memorable nomenclature to this same set, but probably without consulting Goldberg's paper, because he left some holes in his system too.\n\nWhat Sommerville had known about already, were what Fuller calls the Mite, Bite, Rite (both Sytes, i.e. made of two Mites).  That's three of the total five Goldberg identifies, other than his newer infinite families, not in the same table.\n\nThe Rite is the source of two more space-fillers, the quarter rite our \"fourth Rite\" and the half Rite. This very last, column five, was apparently not known to Sommerville, just as the fourth and half Rite were overlooked by Buckminster Fuller.\n\n[](https://www.flickr.com/photos/kirbyurner/50927905352/)\n\nWhat's true about Fuller is he's boring a time tunnel of his own, on his own tour, partially overlapping his fellow time-tunnelers.  Whereas Goldberg was able to complete Sommerville's work, and also add to the classification of geodesic spheres, in turn overlapping virology, as Fuller had, he wasn't looking to assign relative tetravolumes. Nor was the Goldberg Mite about [constituent A and B modules](http://rwgrayprojects.com/synergetics/s09/figs/f5012.html), each of tetravolume one twenty-fourth. Those were Bucky's concerns. Coxeter showed a half Mite in his Regular Polytopes, what Koski calls a Smite, introducing it as the \"orthoscheme of a cube\".  Overlapping nomenclatures.  The scenario time-tunnels twist past one another in some multi-dimensional [Hinton Space](https://en.wikipedia.org/wiki/Charles_Howard_Hinton).\nWhen you're planning to follow an author's tunnel, that's when you might at least temporarily adopt her or his nomenclature, at least some of it. You want to be able to follow the thinking, the explorations, and so commit to memory, a set of defined terms.  These may fade away later in some cases, even while leaving some valuable residue.The myth about Fuller though is that he's always piggybacking on someone else, attempting to \"popularize\" and given that makes Fuller a lightweight, there's no need to swim alongside him and take in his shoptalk.  Once that bubble pops, and you see Fuller belongs in the conversation, then it's on with mastering some of the vocab.Initially, neither David nor I knew the half-Rite's shape.  We started speculating.  That's when I whipped out my green felt tip pen, a Sharpie.  The chart gave us numbers to go on and David focused on those.  We each independently arrived at the same place with our dissection, not surprising given the two (complementary) answers.With the A and B modules, we may embark upon some interesting explorations of chirality, or handedness.  We may explore additional dissections, leveraging the one twenty-fourth volume. We may explore additional primitive assemblies, with pairs of Mites (Sytes) and pairs of Sytes (Kites).Under Sytes we have the Bite, Rite and Lite (hexahedron).  Under Kites, we have the Kit, Kat and Kate.  These are the terms Fuller was distilling. If you fine tooth comb through his two volumes, you'll find some inconsistencies. The Bite and Lite switch places. No version control back then.Anyway, not so bad, learning these ropes, especially once you have the cartoons, and/or [vZome](https://mybizmo.blogspot.com/2010/06/working-with-vzome.html).I recorded two drafts of the Youtube but wasn't sufficiently pleased with either.  Then I got sucked into the impeachment hearings, about Trump's alienating everyone, turning this into some foreign country, unrecognizable, bankrupt, defunct.  He had a lot of help.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}