{
  "id": "822929321274697347",
  "title": "Easter Sunday",
  "published": "2017-04-16T14:19:00.001-07:00",
  "updated": "2017-04-17T23:06:00.722-07:00",
  "content": "Some weeks ago, Multnomah Friends considered moving the traditional third Sunday business meeting off of Easter in favor of doing business another day.  Why?  The consensus was to barrel on ahead.  Business on Easter might be especially propitious even?\n\nAs the cookie crumbled, I got an opportunity to chauffeur an MVP out to PDX.  He's off to a world meetup, not in Zurich this time.\n\nThen I met my Shanghai friend at the Bagdad.  He's much more serious about containing NK than I am, a diffuser and disperser of nation-states (in my own thinking).\n\nChinese, Japanese and SKers are closer to the situation than I am.  A lot of political capital gets spent on making Americans care enough to watch the old M.A.S.H. episodes.\n\nCleveland High School was more a business school in the early days, grooming people to have basic office skills, both interpersonal and technical.  Typing at some number of words per minute, error free, was a technical skill.\n\nThen typing became word processing which became desktop publishing. With the invention of the Web came HTML + CSS + JS.  That's the business school triad of today, throwing in SVG, SQL and Regular Expressions (regexes) for a skill set even more rounded.\n\nI'm working along that \"pipeline\" (K-12) much of my week, grappling with older students (adults) some evenings.  Pedagogue by day, andragogue by night.\n\nHTML = hypertext markup language, the paradigm markup language and direct relative of XML. These tags define a document's \"object model\" meaning the DOM, or Document Object Model.\n\nCSS = Cascading Style Sheets, more and more capable, used for styling and describing the look of things, to the point of providing transitions and animations.\n\nSVG = Scalar Vector Graphics.  Similar to Postscript in providing \"zoom-able\" characteristics.\n\nSQL = Structured Query Language, used to store, update and filter-select records from sets of interlocking tables called Relational Database Systems.\n\nJS = Javascript, an emerging computer language, not at all the same language as Java, and customized to work with the DOM and Shadow DOM.  Lookup React and Angular for examples of frameworks in this language.  Also Babel, which allows future features today.\n\nI think of Alvin Toffler's Future Shock.  The typewriter seemed like a big advance in its time.  I remember shopping with mom for an Olivetti in Rome, one of the newer electric kind.  Those machines already felt futuristic to the folks living that dream, however they gave one less control over presentation, with the disadvantage of storing as hardcopy, in devices still known as \"file cabinets\".\n\nThe future is here in terms of instant real time communications with friends and family, in addition to asynchronous.  Fun.\n\nWhy NK would wanna to join [the loser states](http://4dsolutions.net/mycartoons/cartoon3.html) I'm not sure.  Having nuke weapons is a sign of mental illness and moral decadence in today's world.  Why NK'd wanna join the club of nukehead nations is anyone's guess. Time warp?  Throwback?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}