{
  "id": "2205299355285931683",
  "title": "Econotalk",
  "published": "2008-05-12T13:00:00.000-07:00",
  "updated": "2008-05-13T13:09:50.452-07:00",
  "content": "[ from [PHYSOC](http://www.lsoft.com/scripts/wl.exe?SL1=PHYSOC&H=LISTSERV.UARK.EDU), May 2 2008, replying to another poster ]Seems more economics and social policy than physics but we might address this in energy terms, recognizing currencies trade against futures, in whatever commodities, gold, dollars, oil.Relative to other currencies, the dollar has been weakening of late, as speculators rush into a different mix of holdings, not a new phenomenon. To speculate is to imagine a future, dystopian, utopian, and invest accordingly, which is all implicitly about energy channeling i.e. how to use that daily dose of solar, mixed with weather, add agriculture and fuels, in longer term programming -- quite the volatile mix, called \"life\" in biology, or just biomass if you don't care (did others see that story about PETA asking for [in vitro meat](http://www.peta.org/feat_in_vitro_contest.asp)?).So for example Warren Buffet sees reasons why the [Mars and Wrigley](http://worldgame.blogspot.com/2008/04/biz-page.html) operations should meld, but merger is only one thing that happens. There're also spin-offs, and our Silicon Forest is full of 'em (typical event: big company CTO uses savings to spearhead new company, like that woman taking off [from OLPC](http://worldgame.blogspot.com/2008/04/more-on-interface-design.html) with her cool secrets -- Mary Lou Jepsen of Pixel Qi).As we all know as well, oil companies are mostly repositioning, through branding and marketing, as energy companies, have several technologies to play with, but don't want to jump the gun, all shy of the beta versus vhs debacle, or hd vs blueray or whatever -- i.e. who wants to bet on what horse, is the name of the game.I think the hard focus on hydrogen by some leading fossil fuelers was a play for time, to keep more electric at arm's length (too scarily popular per that movie [Who Killed the Electric Car](http://mybizmo.blogspot.com/2007/01/who-killed-electric-car-movie-review.html)).I think a key question facing whatever next president will be why is the dollar weakening, which can't be separated from that sense of direction i.e. investors want companies with a coherent story about where they're going, not just where they've been.Trading in dollars is somewhat commensurate with a USA management class knowing what it's talking about, but then there's no monolithic mega-conspiracy I hope we all know that (many Internet lists don't, and it's tiresome). We're a lot of partially overlapping networks, if you hadn't noticed, some stronger than others, but sometimes small and nimble is what you need to be (echoing myself here...).The office of USA president provides great overview and if there's a brain equal to the job, we'll get some good, positive results. You might read that as a dig at George W. [but it ain't](http://worldgame.blogspot.com/2007/01/random-walking-in-ivm-fm.html), not here to diss anyone this time, just acknowledge that's a tough office (I've got my own, different challenges, more private sector in flavor, though tilted towards NGO work).The gas tax issue is something for the public to bat around in the blogs or whatever, because it's simple and easy to talk about (both pro and con). You need a selection of such \"no brainers\" going, just to keep people focused, when they're not doing NFL, NBA, Cartoon Network or whatever. That sounds snooty-elitist I'm sure, so let's just pretend I'm W.C. Fields ([check YouTube](http://youtube.com/watch?v=HHYc6qgNoXI)?), did go to [Princeton](http://controlroom.blogspot.com/2007/10/more-autobio.html) so am supposed to be a snob (not a frat boy though -- didn't have those, [lived with witches](http://worldgame.blogspot.com/2005/05/princeton-25th-reunion.html) (good ones)).KirbyPS: re our zombie truck system (driverless long haul options, using a lot of existing infrastructure, earlier posts to this list): I finally caught The Simpsons episode wherein Homer and Bart inherit a truck in a steak eating contest (winner dies), only to find truck union conspiracy around autopilot feature many are using (but not talking about). Homer blows the secret but earns kudos for dodgy driving, while meanwhile Marge and Lisa have a stuck doorbell problem.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}