{
  "id": "8752493327744341965",
  "title": "Edge of Tomorrow (movie review)",
  "published": "2014-08-18T07:46:00.001-07:00",
  "updated": "2014-08-18T07:56:02.053-07:00",
  "content": "The plot here leverages the experience of every player of first person shooters:  you get so far into it, and then you die.  Reset, and again.  You play until you make it through, or give up (similar to our pedagogy at OST, in lieu of \"grades\").\n\nGiven there's no alternative \"outside world\" beyond the game (The Matrix is complete, a reality prison), Tom (named \"Cage\" with good reason) has his [Ground Hog Day](http://www.imdb.com/title/tt0107048/) cut out for him.\n\nSeeing Cruise and Murray and their co-stars (Emily Blunt as Rita, and Andie MacDowall also as Rita) as a double feature would be fun, as one gets two different worlds reflective of the kinds of acting each guy does.\n\nMurry is quirky and whimsical whereas Cruise is darkly War of the Worlds and action oriented, highly kinetic.\n\nYet the similarities stand out too:  how to authenticate as a time traveler.  Blunt's Rita has \"been there\" and so has an added advantage vis-a-vis her looper partner.\n\nHaving Cruise go from shy and retreating to full on aggressive, with that same sense of partnership displayed by Peter Quill towards Gamora (Guardians of the Galaxy), was a fun twist.\n\nA needed ingredient is that sense of destiny aka fate that goes with heroism, a strong sense of making a big difference.  Once Cage develops confidence and survivability, along with his sense of destiny, he develops his heroic qualities within the loop, an eternal return. \n\nThe \"mimics\" which Cage and Rita get to fight have plenty of demonic power.  As a first person shooter, this game is definitely challenging.  [Live, Die, Repeat](http://www.imdb.com/title/tt1631867/) is the other name they came up with for it.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}