{
  "id": "1009256062982339164",
  "title": "Egoism Versus Egotism",
  "published": "2023-08-21T09:08:00.006-07:00",
  "updated": "2023-08-23T12:38:13.709-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53128407014/in/dateposted/)\n\nI learned much of what I know about the philosophy called Egoism, from Trevor Blake, somewhat of an authority on the topic. Max Stirner is a central figure. Did Walter Kaufmann write about him much? Wes Cecil lists both Kaufmann and Stirner on his Forgotten Thinkers page.\n\nEgotism tends to refer to pathological exaggerations of the ego's otherwise useful role in anchoring a form of self awareness related to choice making, according to tastes.  An ego develops as a personality or character such that self awareness of a self, a persona, evolves over time (or fails to evolve, as the case may be).\n\nConfusion between egoism and egotism may account for some of the radical therapies which stress abolition of one's ego, or egocide, a kind of self canceling. Bucky Fuller spoke of committing \"egocide\" in the 1920s, only to be accused later, sometimes by jealous competitors, of egomania.  He certainly built a character that signaled to others about untapped potential.  These days we see a lot of egos feeding off \"zero point energy\" (cite Foster Gamble and Nassim Haramein) as a meme, crediting it back to Bucky as an inspiration, his Synergetics in particular.\n\nIntegral within contemporary Christianity is the idea of being reborn. Accepting Jesus Christ as one's personal savior may involve taking a sharp turn in any given character development scenario. One ego needs to die to make room for a next one. We might call it an ego overhaul, and it often becomes a part of one's life story. The turns we take get chronicled, by others if not by ourselves.  I'd say Fuller made a sharp turn in response to strong suicidal tendencies, there in 1927. However he didn't turn to Jesus at that juncture. He fell back on intuitions he felt had been prodding him since his youth, a still small voice he decided to nurture and make room for.\n\nFuller's character's evolution within the Boho Matrix of Greenwich Village is a topic I and other biographers take up elsewhere. Once the ability to transform one's ego (to reinvent oneself) is recognized, it's easier to keep the show on the road, in response to the road. Call it neuroplasticity. Call it a willingness to be shaped, and if necessary broken (a Quaker term), based on prior experience with a auto reprogramming. Fuller's persona continued to morph with the times.\n\nMy own story of punctuated equilibria might point to my time in Gotham as somewhat transformative. I'd moved to Jersey City from Princeton and taken a job as a school teacher. I was also volunteering downtown, at the New York Area Center, pursuant to Kaufmannesque leanings. I wanted to see what philosophy might do as a discipline, and was eying the role of est Trainer as somewhat groundbreaking. \n\nHow could a philosophy lecture hit that hard? A lot depended on the willingness of the training participants to do some serious self overhaul i.e. self transformation was in the air and sharing honestly and authentically in a safe enough space, was encouraged by consensus, not by browbeating or a frenzied sales pitch on the part of the trainer.  Attendees had already paid their money as the curtain opened on Saturday morning, and they were eager to get down to business, with only two weekends to get it all done.\n\nThe Erhard and Fuller scenarios overlapped quite a bit, plus we had est: The Steersman Handbook (Charts of the Coming Decade of Conflict) by L. Clark Stevens, which I didn't find out about until quite a bit later. The sense we were creating or continuing a social movement, call it the Aquarian Conspiracy for shorthand, was fueling that sense of being part of something bigger than one's ego. That sensibility is not inconsistent with Egoism, nor with Taoism, and involves trusting one's own intuition (vs. taking cues or marching orders from others most of the time).\n\nI'd say Quakerism encourages journaling, which includes blogging these days, because keeping a journal has the potential to be a character-building exercise, plus it's a way of inviting push back and feedback from other characters. \n\nWhen a Friend has a sense of a leading, a path to pursue, on behalf of a greater good, it's standard practice to set up a Clearness Committee and then a Support Committee, should the Oversight Committee agree the Meeting itself wants to get behind a certain Friend's ministry. Perhaps a traveling minute is issued and the newly registered minister becomes a circuit rider of some kind.  This may sound like a lot of dated terminology, because it is.\n\nAlong those lines (circuit riding), I'm anticipating more travel (I have my new passport, finally) and want this MacBook Pro to have as much battery life as the technology permits. My plan is to purchase a backup hard drive (HDD), use Time Machine to mirror its content externally, and then visit the Apple Genius Bar for battery maintenance, meaning I expect we'll swap out the old one for a new one.  Office Depot on MLK didn't have the HDD I wanted in stock, so I'm killing time blogging, before heading to the downtown store, which opens later.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}