{
  "id": "3701019350910138409",
  "title": "Emerging Cyberia",
  "published": "2016-10-20T10:05:00.001-07:00",
  "updated": "2016-12-15T19:17:12.713-08:00",
  "content": "On kind invitation from Patrick, I walked over to his household, by way of New Seasons where I stoked up on prepared foods: chicken, brussels sprouts, macaroni and rice.  Patrick picked the beer.\n\nI enjoyed watching the debate, the 3rd twixt the two ruling parties, with an affectionate corgi (brand of dog) jumping all over me.  Spencer joined us, while Katie flittered in and out.  That was the purpose of my visit, to take in this program.\n\nAnother \"[first world concern](https://youtu.be/bwvlbJ0h35A)\" adding actionable items to my \"to do\" list today is the HTC phone from Verizon, which as of two days ago is actually losing charge while plugged into a charger.  Turning it off while charging just barely holds the line.\n\nScouring the Internet leaves the door wide open as to whether it's a software or hardware glitch (I suspect the battery is shot, not the charging port).  In any case, it's soon to be a brick, and I'm still paying for it, so time to pay a visit to my local Verizon storefront.\n\nI suppose the biggest takeaway, for me, was not \"[nasty woman](http://www.vox.com/policy-and-politics/2016/10/20/13341416/nasty-woman-feminist-rallying-cry-hillary-clinton)\" (Trump's remark) but the role of \"Russians\" in the national dialog.  In other times, Georgia (the Black Sea bordering region) and Crimea were maybe more front and center, or Ukraine, but now it's all cyber and [Wikileaks flavored](http://worldgame.blogspot.com/2016/08/the-youtube-channel.html), even while Aleppo is deemed to have \"fallen\" to its own Assad government.\n\nWhereas Gary Johnson (the Libertarian candidate) may not have known Aleppo was a city in [Mesopotamia](http://mybizmo.blogspot.com/2015/06/about-elly-movie-review.html), I'm guessing very few political insiders could name all seventeen USG intelligence agencies that Hillary could cite as sharing her concerns about spies helping the Kremlin. \n\nMore Americans probably know that [Archer worked for ISIS](http://www.avclub.com/article/archer-drops-isis-name-suddenly-finds-itself-bunch-210378) and that the Kremlin rebranded the KGB as something else, just like [the CIA](http://worldgame.blogspot.com/2006/08/drinking-liberally.html) underwent a facelift to become just [one of seventeen services](http://controlroom.blogspot.com/2007/11/good-shepherd.html) — can you name them?\n\nTrump is all about \"dealing with ISIS\" first, a goal he believes he shares with Vlad Putin, but then not the way they're doing it now, by staging a big battle for Mosul, a city to be \"taken back\" by Iraq. Donald ridiculed the Democrats for letting go of Mosul in the first place. \n\nHe takes a position somewhat consistent with Make America Great Again in casting Democrats on the losing side of history. ISIS won't be there given all the advanced notice to move elsewhere.\n\nThat's where the Russians come in, as outplaying the Obama administration.  In a way, that's a constructive role, as it's somewhat like poker or chess, and we see the Dems are incompetent so why not give a smart business man a chance? \n\nI'm not saying I'm personally buying this rhetoric or narrative, only that I believe I'm fairly characterizing the Republican candidate's position.  He likes it when we're fair.\n\nI live in Portland, Oregon which I'd say was most definitely [a Bernie town](http://worldgame.blogspot.com/2016/09/feeling-bern.html) (as in Bernie Sanders). The sense [among Cascadians](https://medium.com/@kirbyurner/notes-from-a-silicon-forester-76d66d2f8742#.7o9x40xtn) is DC is well past its prime in its ability to cough up credible theater.\n\nThe screen writing has gotten even worse than mediocre, and really has more to do with misguided ventures already in the rear view mirror.  Republican president Eisenhower was right to warn us of big business inertia and its need for war as a business expense — could be a \"cold\" one.\n\nSpeaking of cyber-war, I don't think the Russians' role vis-a-vis the US, here in October in 2016, is all that destructive. We're getting more immediate and relevant insight into how the game of politics is played, e.g. the [shoving aside of Bernie](http://controlroom.blogspot.com/2016/10/bed-time-stories.html). \n\nPlus companies and committees (e.g. the DNC) are learning that keeping secrets is a real challenge when they're also hot properties, and this has been true since the village over the hill discovered the secrets of the catapult.\n\nSpies might be sent over to catch up on the latest tech, or defectors encouraged to come over and spill the beans. How do these human behavior patterns work themselves out [in tcp/ip world](http://controlroom.blogspot.com/2006/06/tcpip-for-gnubees.html) and beyond? \n\nSophistication around encryption is definitely a big part of it.\n\nBusinesses engaged in cyber-security for a living are being galvanized by the \"Russian threat\" and that could be good for the bottom line, in a [purely capitalist](http://worldgame.blogspot.com/2016/10/meme-machine.html) sense.  As many security experts have been warning us, the tools of war are becoming ever more invisible. \n\nThe front line is not in Aleppo or Mosul so much, nor in outer space, but in cyber-space or \"[Cyberia](http://controlroom.blogspot.com/2013/09/reading-dynamics.html)\" as some have called it, and as the debate proves.\n\nFollowup:  'twaz indeed the battery, new HTC One device on the way. \n\nCascadia will continue to work with DC on many important issues, especially environmental cleanup.  [https://t.co/EydPahbmHJ](https://t.co/EydPahbmHJ)\n— Kirby Urner (@thekirbster) [October 13, 2016](https://twitter.com/thekirbster/status/786699447073927168)\n\nThe video at the end was entertainingly instructive, thanks. [https://t.co/aFgiltZ4kY](https://t.co/aFgiltZ4kY)\n— Kirby Urner (@thekirbster) [October 20, 2016](https://twitter.com/thekirbster/status/789144648384073728)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}