{
  "id": "3604700004319712149",
  "title": "End of An Era",
  "published": "2014-06-19T19:28:00.003-07:00",
  "updated": "2014-09-09T09:51:25.045-07:00",
  "content": "Probably quite a few Friends Churches don't have a Peace and Social Concerns Committee.  That's a holdover from the Liberal tradition, especially typified in Cascadia, where meetings in [the Beanite lineage](http://www.quaker.org/liberal-history/bean.html) have populated the Willamette Valley, Olympia, Seattle, surrounding areas.\n\nCollege Park Association in California was the common parent, a group disowned by Iowa Yearly Meeting back when a wave of evangelical fervor was gripping the mid-west, driving out the more rational (think Pol Pot -- anti-intellectual).\n\nOur local Multnomah Monthly Meeting, once a Liberal Friends flagship, has raised [a new flag of late](http://quakersusanne.wordpress.com/2008/04/18/quakerism-and-structure/#comment-662).  There's still a rainbow decal on the door, and a sticker in favor of wind power over coal, but beyond that the place is rather non-descript, though it prominently affiliates itself with the Religious Society of Friends.\n\n The Faith & Practice, gathering dust by the library door, will tell the newcomer about Peace and Social Concerns, but you'd have to be listening closely during Social Hour to realize that committee was \"on ice\" or \"imploded\" or whatever is the jargon du jour.  Don't expect the documentation to actually inform you about the real API.\n\nHow naive could you be? (yes, I'm being sarcastic -- as a geek I tout up-to-date documentation as a virtue and I'm [not proud](http://worldgame.blogspot.com/2014/05/connected-comments.html) of our demented documentation, so way out of date).\n\nHah hah, bait and switch!  You thought you were getting a Peace and Social Concerns committee (it's there in the manual), but you weren't, and chances are \"the clique\" felt no obligation to tell you, so in-grown has it become.\n\nWhat does this mean in terms of joining FGC and having ongoing relationships with the alphabet soup of Quaker entities?\n\nProbably the AFSC has taken the most notice, given the local office is supposed to have a seat on the defunct PSC.  How does one take one's chair at the table, when the table and chair have gone missing?  Kind of puts it in one's face, the whole question of \"where do I fit in\"?  Answer:  nowhere at the moment, but likely AFSC will find a place to reconnect, once the restructuring is over.\n\nWhat restructuring?  Come to Business Meeting or stay tuned.  Nominating has become the most powerful committee in the meeting, one could argue the last vital one of the three major \"Monthly Meeting organs\":  Nominating, Peace and Social Concerns, and Oversight.\n\nNominating gets people into their roles; Oversight gives reality checks / feedback, informing Business Meetings (a form of worship) by collecting and sharing information; and Peace and Social Concerns presents the cutting edge of Quakers acting out their testimonies:  egalitarian ethics, a commitment to plain speech (if sometimes technical),  simplicity / elegance in design and presentation, integrity, non-violence (no need of outward weapons) -- all that good stuff.\n\nLike what's the point of a Monthly Meeting if you're not actually a platform for putting Quakerism into practice, isn't that the whole point?\n\nWe lost a lot of our Oversight powers awhile back at Multnomah, when a new committee ([CAC](http://worldgame.blogspot.com/2014/06/when-quakers-go-trans.html)), undocumented, took its place regarding external affairs (vigilance, intelligence, whatever).  Secret alliances were forged with no Oversight input, which committee mostly rolled over and played dead, or was dead for real.  Another story.\n\nAnd PSC is now gone, as I've been mentioning, so that leaves Nominating to try to jump start the new structure.\n\nKind of like Dr. Frankenstein in his lab, applying the voltage to his \"project\".  Lets see if \"the project\" sits up and starts passing the Turing Test.  Then:  will it have Quaker values?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}