{
  "id": "2908649838780987060",
  "title": "EPCOT West",
  "published": "2016-07-25T09:51:00.001-07:00",
  "updated": "2020-07-19T12:44:47.486-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/3457116367/in/album-72157623491114005/)\n\nI used the term \"[EPCOT West](http://worldgame.blogspot.com/2009/01/metropolitan-talk.html)\" in a somewhat tongue-in-cheek manner, some years ago, to refer to Portland's Dignity Village, a collection of ad hoc shelters near the airport, adjacent to a prison.  Experimental Prototype of Tomorrow was the original meaning of EPCOT, if anyone remembers, before lawyers changed it to the more meaningless Epcot, which means nothing at all.\n\nThose of us who've flown around the world some number of times are likely used to flying over vast \"shanty towns\", often referred to as \"informal neighborhoods\" by city planners.  US Americans define themselves in terms of not seeing these in North America, the US being \"the wealthiest nation on Earth\".\n\nActually \"planning\" informal neighborhoods seems oxymoronic to practitioners in the field, as they're by definition \"unplanned\".  The typical urban response is to criminalize \"tent cities\" in terms of what ordinances they violate.  However the [numbers keep growing](http://mybizmo.blogspot.com/2011/06/shanty-town-usa.html) and the jails are full.\n\nHowever, criminalization and warehousing people for profit does attract a form of capitalism.  Warehoused people with no human rights may be used as forced labor.  The institution of slavery is thereby restored, but in not calling it that, those implementing the system get their euphemisms and their cheap goods.\n\nWhen actually feeding and providing a modicum of health care to the warehoused collateral becomes cost prohibitive, [a typical final solution](http://controlroom.blogspot.com/2016/06/what-our-fathers-did-nazi-legacy-movie.html) is to have the work camp become a death camp of sorts.  Crematoria are established.  Those removed from tent cities in urban areas are bused or trucked, or made to walk, to these out-of-sight out-of-mind prison camps in desolate areas.\n\nPlanning for tent cities, providing infrastructure for watching films, learning languages, engaging in work / study programs, is more the Global U approach, where all housing is student / faculty housing, regardless of grade.\n\nThis more humanitarian approach is deemed \"liberal\" in that it relies much less on the mass criminalization of poverty and death camps.  Whether one may afford to be \"liberal\" depends a lot on one's theory of economics.  The more [Malthusian](http://controlroom.blogspot.com/2008/05/wmbs-satire.html) one's outlook, the less liberalism looks affordable.\n\nThe DC think tanks and Beltway consultancies are not especially liberal in outlook.  Their recipe for dealing with collateral is to assume miserable conditions in the tent cities will fuel resentment and a wish to fight back with physical violence.\n\nGiven the Beltway controls all the best weapons, this solution works well.  The public sides with \"law and order\" against \"insurgents\" and, if it shares [the Malthusian view](http://controlroom.blogspot.com/2015/07/deficiencies-in-english-language.html), cheers from the sidelines as the Apache helicopters, remotely controlled drones or whatever, strafe and bomb the shanty town denizens.  We've seen these policies carried out both in Panama and in Gaza.\n\nThe DC consultancies see \"overpopulation\" not \"militarism\" as the biggest issue to deal with.  In fact \"militarism\" and \"overpopulation\" fit hand in glove.\n\nThe Global U curriculum, [relatively liberal](http://worldgame.blogspot.com/2011/11/city-as-campus.html), sees higher living standards as the primary and most effective form of birth control and family planning.\n\nDC sees \"higher living standards\" as unaffordable and prefers to stockpile weapons for its preferred method of \"adult abortion\" (aka \"homicide\") i.e. the willful termination of human scenarios well after birth.\n\nHere in Cascadia, relatively less militarized, the liberals have yet to completely embrace the death camps solution.  A lingering Global U curriculum, less Malthusian in outlook, still struggles to assert itself, gaining the ire of the Beltway, which resents the delays.\n\nThe Occupy Movement, e.g. [OPDX in Portland](http://mybizmo.blogspot.com/2011/10/opdx-pdv.html), was all about setting up intentional tent cities wherein self-governance could be tried.  People spontaneously assumed their roles, choosing arm bands to signify in what capacity they might be consulted.  I worked in Food Services as one of several engaged in Logistics.\n\nThe liberals think if they gain experience mixing high technology (e.g. cellphone apps) with a more minimalist lifestyle — which still includes watching movies — then the Global U might continue to counter DC's militarism and implement its work / study.\n\n[](https://www.flickr.com/photos/kirbyurner/28257445860/in/dateposted-public/)\n\n:: informal neighborhood in Indonesia, by John Taylor ::\n\n.[@REACH_info](https://twitter.com/REACH_info)  mapped the general infrastructure of [@ZaatariCamp](https://twitter.com/ZaatariCamp) w/ the latest data: [https://t.co/qgGkZpB2zB](https://t.co/qgGkZpB2zB) [pic.twitter.com/wQvPmD6QWs](https://t.co/wQvPmD6QWs)\n— UNHCR Innovation (@UNHCRInnovation) [July 27, 2016](https://twitter.com/UNHCRInnovation/status/758322352870531073)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}