{
  "id": "3451647453570987049",
  "title": "Epiphany 2011",
  "published": "2011-01-06T11:52:00.001-08:00",
  "updated": "2012-03-28T10:37:03.362-07:00",
  "content": "The way I was taught, the Kings didn't show up on Xmas day, plus they weren't really Kings, more like Wizards or Magi, as in \"magicians\" (they knew to \"read stars\" and such).  Of course in geological time, we don't reckon that December 25 is much more than a close-to-solstice holiday, like Saturnalia, but the fact of an interval (or memory address offset) makes sense, like the Kings wouldn't intrude right on his birthday (that'd be rude).\n\nI've been reading the 2nd edition of Aung San Suu Kyi, Fearless Voice of Burma.  I enjoy seeing mention of some of the same people I've shared a room with, such as [Bishop Tutu](http://worldgame.blogspot.com/2009/05/time-for-reconciliation.html) and the Dalai Lama, also friends of each other.  Bob autographed one for the elder son whom I hope to meet with someday.  This was another Bhutan family (of subgeniuses?), living in Thimphu around a decade before ours did.\n\nCongratulations to Steve Holden, who isn't thinking about his business (Holden Web), now that he's just meeting his first grandson.  Some of us met at his behest [at Kell's](http://www.flickr.com/photos/17157315@N00/5328567153/) recently, to brainstorm about where the \"open source\" idea might be going.  Portlanders are supposed to have ideas about that sort of thing, at least by reputation.  \n\nOn the way to Kell's from the \"taxi\" I walked along with [a frac gas guy](http://controlroom.blogspot.com/2010/11/gasland-movie-review.html) going back to Arkansas (random chance meeting), where permitting isn't as controlled.  Hard to frac for gas around here.\n\nWe've continued to apply \"spit and polish\" (as they say) to our crystal ball for geometrical concepts, a kind of test pattern for high def and stereo TV.  I've posted some of [the latest blueprints](http://coffeeshopsnet.blogspot.com/2011/01/storyboarding-lcds.html) to the CSN \"wall\" (as people say in FB).\n\nOur household is likewise scholarly (not unlike some of those I've been reading about).  A \"wave of Zen\" seems to have swept the place, although it's still a bit rustic and maybe too dense.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}