{
  "id": "2006719438688337311",
  "title": "Equipment Drop",
  "published": "2009-10-17T00:03:00.000-07:00",
  "updated": "2009-10-17T08:11:15.536-07:00",
  "content": "I'm doing an equipment drop at Circadia, patching in to the wifi for a few. Tomorrow is Burn Out, a festival relating to Burning Man.  Lots of weird buses in the parking lot, a stage crammed with instruments.  Lindsey is volunteering with setup, as well as taking part in the show tomorrow.Lindsey pulled off a superb performance this evening, shades of [Over the Hedge](http://mybizmo.blogspot.com/2006/05/over-hedge-movie-review.html) (we met the president of the homeowner's association).  Another upright piano conquered in any case.Speaking of suburbanite neo-liberals, some of these diversity groups turn out to be little more than the middle class brats seeking to extend both their comfort zone and entitlements.Python's is different I'm hoping.  As I posted earlier, to the diversity list:The first guideline for diversity trainers might be something like: you have no human right to not be offended, as life is offensive and (here's the kicker) there's no one to blame.  It's like when Lord Buddha first left the palace compound, where he'd been spoiled rotten: \"who are all these sick and dying around here, is this some inferior species?\"  From there to enlightenment was a long and strange journey.My talk in Vilnius (Jacob was there) featured snake defecation (snake poop), a way I teach about queues and FIFO in early Pythonic math classes, using eat() and poop() methods.I preface this by saying kids love Grossology (some do) and have these books of Madlibs (fill in the blank stories) that are gross by design. You can code that way too.  Some find this offensive, yet also find they learn Python a lot faster.  No one walked out of my talk, as my slides and presentation were both tasteful, as was my three hour workshop in Chicago which mentioned Hitler's holocaust and included a scantily clad Britney Spears on one slide (first 57 minutes are [on Blip TV](http://worldgame.blogspot.com/2009/03/urner-workshop.html)).All that being said, intelligent managers do tend to provide ways for humans to sort themselves, exercising their own freedoms of choice, into niches where they'll be happy and productive, with co-workers they're OK teaming with.  Or call them schools (as in schools of fish, schools of thought).I'd be pleased if Pycons were models of well attended, well managed events, and from what I've seen so far, I have no reason to expect disappointment.  These are stellar and talented geeks, with every potential to accelerate into multiple Pycons happening with quite high frequency around the world.  But the faster you grow, the more tourists you'll get checking you out and muddying the waters, hence my plans for more exclusive venues, where BOFs are more likely to find one another.BOF stands for Birds of a Feather.Speaking of Python, Scott David-Daniels was at the venue this evening.  He struck up a conversation with Lindsey about arms profiteering and how to escape its grip.  They found some points to agree on, given a shared background in IT.Scott has some papers he's working on, one about a new data structure (currently undergoing testing), and maybe another about his super fast search algorithm.Good Bye Party played the opening gig, will be here tomorrow as well.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}