{
  "id": "6444481809858794998",
  "title": "Equinox Retreat",
  "published": "2009-09-19T16:42:00.000-07:00",
  "updated": "2024-09-17T15:08:13.356-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157622422453330)\n\n:: fall equinox 2009 ::\n\nShomar is here, a favorite Wanderer. Dr. Nick is sauntering through. Dr. Tag is at the beach maybe?\n\nI attended a neighborhood meeting of the Palestinian rights group recently, focused on Palestine's right to exist. There's an initiative at local schools to have students notice whenever Palestine is bleeped over as a \"forbidden state\" (one of a long list of banned and/or esoteric institutions).\n\nWe also discussed the two and no state solutions, the former being a neoliberal preference, the latter having to do with demoting nations more generally, treating them as tourist attractions ala EPCOT i.e. less as a part of Tomorrowland (the [Spaceship Earth projection](http://controlroom.blogspot.com/2009/02/flash-forward.html) cite BuckyBall).\n\nLinus Pauling House is nearby, so some of this thinking spills over (97214 is close knit).\n\nThe PSF has the following Diversity Statement, still in beta, thanks to a bunch of [alpha geeks](http://controlroom.blogspot.com/2007/09/barcamp-alpha.html) hacking:\n\nThe Python community is a global community. The Python Software Foundation and the broader community of which it is a part welcome and encourage participation by all. Our community is based on mutual respect, tolerance and encouragement, and we strive to help each other live up to these ideals. We would like our community to be more diverse, so we extend an especially warm welcome to everyone who will broaden it.\nI was out until 3 AM last night with the Lindsey Walker Show, enjoying the scene at Local Lounge on MLK. We used the company car. I'm still a little retarded regarding set up and tear down, especially w/r to the Bose Tower. Her skills surpass mine w/r to SQL probably, too, though with the Django product [Urban Edibles](http://controlroom.blogspot.com/2009/08/urban-edibles.html), we're one step removed from raw SQL, thanks to the data model. If she comes by the Pauling House, I'll steer her towards Steve's eggplant dish, pretty tasty.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}