{
  "id": "3828997729425657128",
  "title": "Errata",
  "published": "2007-04-27T00:22:00.000-07:00",
  "updated": "2007-04-27T05:43:45.309-07:00",
  "content": "I've been something of a Dennis the Menace character of late, knocking out core services in two important (at least to me) buildings: at my house and at Linus Pauling's house.At my house, I wanted a caller-id enabled telephone on my desk, but replugged it into the second line, daisy chained with the Qwest modem. But there's no DSL on line two, so my LAN went dead. Qwest was on the scene within 48 hours, and did some other troubleshooting as well. My linebacker insurance paid off.At the Pauling House, when hooking [Jennifer](http://controlroom.blogspot.com/2007/04/business-transaction.html) to tcp/ip, I also messed with the phone jack, and apparently replugged something back in incorrectly, just like at my house. Barton notified Glenn, who was able to troubleshoot the problem when reminded of the shenanigans at my place, at the center of which I was the common element.Rest assured I felt suitably sheepish about both errors and thank my lucky stars that Universe had the competence to compensate for them.But I haven't even gotten to my worst error, which was to ineptly secure Naga's aquarium tank, such that she escaped her abode.The odds of finding a small, hiding snake in a big house were against me. Yet I found her. But not before experiencing this little rollercoaster: loss of Internet and Naga the same morning.I've done a lot of postmortems on these errors, have tried to learn a great deal from them. In general I'm on a campaign to reduce entropy in my life, with Dawn, my late wife, a standard bearer and inspiration in this regard. I'm less the poor slob I was when she met me.I did my [first Python for Wanderers class](http://www.4dsolutions.net/cgi-bin/py2html.cgi?script=/ocn/python/wanderers_class0.py) tonight, which I thought went splendidly. The number of total combined computer-related man-hours in that room was impressive, although women still own and control computer science as a discipline, the way I look at it -- again with the Wiccan spin or something close.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}