{
  "id": "7204935469025625201",
  "title": "EthnoMath",
  "published": "2016-03-23T08:29:00.003-07:00",
  "updated": "2016-03-23T15:18:20.854-07:00",
  "content": "John Searle points out that although Wittgenstein has become increasingly influential in the humanities, in anthropology for example, he wrote extensively about the philosophy of mathematics.\n\n\"All math is ethno-math\" is one of my slogans.  Mathematics is anthropological.  The universities keep these departments separate, true, but that's an ethnic thing.\n\nI go back to Wittgenstein's remarks on the foundations of mathematics and fit in some different language games showing how indeed there's room to break the hold of \"squaring\" and \"cubing\" as words for 2nd and 3rd powering respectively.\n\nWe're combating the bewitchment of our intelligence by means of language. We might call that counter-intelligence i.e using language games to extricate ourselves from other language games.  Sometimes we apply \"counter-spin\".\n\nUsing triangles and tetrahedrons to model 2nd and 3rd powering respectively is a break with the past, and was pioneered by R. Buckminster Fuller in his Synergetics, but philosophers have failed to grapple with his ideas much in the ensuing half century.\n\nRBF has not yet been accepted into the canon of thinkers it's OK to write about, as an academic philosopher, although I've seen [evidence in Nature](http://mybizmo.blogspot.com/2015/12/global-data-global-matrix.html) this state of affairs might be changing. \n\nThe high level of neglect of this cultural heritage is an anthropological phenomenon, some of it explicable as backlash against Fuller's own pointed critiques of over-specialization, which left many an over-specialist feeling on the defensive and resentful.\n\nOnce we get to a unit-volume simplex (tetrahedron) we have a \"concentric hierarchy of polyhedrons\" with more whole number volumes than our culture is accustomed to sharing with its young.\n\nHow the concentric hierarchy merges with a sphere packing abstraction opens a lot of doors in the imagination.  One learns about [the octet truss](http://mybizmo.blogspot.com/2016/03/1-2-3-testing.html) and its complementary tetrahedrons and octahedrons of relative volume 1:4, with twice as many of the former as the latter.\n\nThese important concepts integrate more densely and more smoothly than when cubes and right angles so dominate the picture.\n\nE.J. Applewhite, one of Fuller's chief collaborators, once told me he loved the Wittgensteinian bridge I was building to the Bucky stuff.  He was CIA though, not an academic per se.  Again, we're talking anthropology here.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}