{
  "id": "2300152346096289879",
  "title": "Evening TV",
  "published": "2008-02-22T09:23:00.000-08:00",
  "updated": "2008-11-15T02:36:09.812-08:00",
  "content": "Last night I dove into Lost mid-episode, having missed the previous (queued), while trying to eyeball an O'Reilly book on my laptop in Safari about the Linux kernel, trying to get some bang for my buck (I pay a subscription) -- all mildly disorienting.  Kate always gets my attention though, plus all these intense others.  Lost is quite riveting. We hope Sayid is OK.Earlier we were attuned to the news (CBS).  This election season is being plenty interesting. Like there's Kosovo all of a sudden, right on cue it seems, complete with a carefully staged rampage in[ Belgrade](http://controlroom.blogspot.com/2007/01/presidential-races.html), go figure.The chatter on the radio is about how we're back on track for an Academy Awards worth remembering.  Hollywood is in a much better mood these days, what with the writers' strike being over.The job of an operating system is to schedule the use of resources in an intelligent way, so that hardware, a scarce resource, though quite typically ample if well managed, is put to good use.Processes get the illusion of having the computer all to themselves (within a process are threads), but in the multi-tasking paradigm, concurrency is more the fiction than the reality.However, this was about an older version of the kernel on younger architectures, as true multi-processing has become normative in many computing environments, as we might say in modern geek (one of them \"yawner talks\" as we might say in hillbilly (a focus of [Simpsons](http://controlroom.blogspot.com/2007/08/simpsons-movie-review.html)  on Fox 49, an episode wherein Lisa helps the [Spuckler kids](http://en.wikipedia.org/wiki/Cletus_Spuckler) become more urbane)).[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhw-0iXSqpVYCs4zJ_sXcNXeJhyphenhypheng2tmHqX-eCDhH25u9rUtd00oM4g4M37sJCUwzFFEoac0wbrlXeElxY1V_tl_BuRDXKm2n3jZeqZsa6kDKynJvzNEtsbWy8lXua98pfoH0cCH/s1600-h/C-SimpFamily.png)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}