{
  "id": "6050261442698581028",
  "title": "Evolving Minerals",
  "published": "2013-02-16T17:09:00.002-08:00",
  "updated": "2013-02-19T11:01:45.037-08:00",
  "content": "[](http://www.flickr.com/photos/kirbyurner/8477404985/)\n\nDr. Robert Hazen is a huge mineral enthusiast, enjoying a Renaissance of interest in the discipline.  What mineralogists have recently discovered is the panoply or canvas of minerals one finds goes through a progression, or \"evolution\" if you will, with the implied sub-meaning of \"complexification\" (greater variety, more permutations).\n\nEarly rock from the congealing of the solar system, such as that meteorite that recently [blasted out windows](http://youtu.be/e26A4JHtD54) in Russia (a big topic of our conversation), won't have many minerals in it and half of what it does have is only present in relatively nano amounts.\n\nYou need complex chemical reactions to catalyze a bigger vocabulary, processes like vulcanism and of course the appearance of water.  Those things only happen later, on bigger planets (is the current thinking), if at all.\n\nPlanet Earth, at age 4.5 billion or so, may actually be peaking around now, in terms of its mineral variety, as the Sun continues to warm.  The breathable future is measured in millions, not billions of years.  That may be the standard life cycle then, for planets in our class.\n\nHazen was very sure that humans' contribution to CO2 is like nothing the world has ever seen and is orders of magnitude higher than any second greatest cause of net change.  We're pushing fast and hard into unknown territory and he wonders if that's a good idea, though as a scientist he finds it fascinating.\n\nHazen wonders if \"evolution\" might gain more traction as an acceptable topic, in the anti-science USA, if transposed to this scale of minerals.  There didn't used to be clays.  Evidence is pretty strong that, without bacteria, you don't get specific crystals.  Humans are [not the first](http://mybizmo.blogspot.com/2013/02/bacteria-aint-dumb.html) biological form to play a role in planetary alchemy.  That used to be considered a newfangled idea.\n\nHe was also pretty definite about the story of the Moon.  Though he had nothing affirming to say about Velikovsky (someone asked at the dinner) he does of course accept that worlds collide.  Earth was not long congealed before this second mass collided with her at an angle and hit the reset button big time.\n\nVenus may have undergone something similar as evidenced by her \"reverse spin\" (did she reel in a moon?) -- it's hard to know much about Venus.  Earth's spin nudges our Moon away from us, day by day.\n\nAnyway, besides deterministic processes, you have these stochastic random events, and these will make a huge difference in any given scenario.\n\nIn Hazen's mind, it's pretty clear that \"life\" (however defined) is happening in trillions of cases.  His version of Universe is very richly permuted with life forms.  Maybe that's why he seemed so enthusiastic about science.  He also has a mineral named after him.  He was up front about the political nature of nomenclature committees.  Some of us were already used to that from tracking Pluto's demotion from planethood.  As new information comes in, old mental categories need to be fine tuned.\n\n\"Were buckyballs part of the early crystalline makeup of the universe?  Maybe not because buckyballs aren't crystals right?\"  That was my question, plus another about whether anthropogenic mineral is an oxymoron.  Yes, a buckyball is not a mineral but a lattice of them would be.  Early Universe had graphite.  Astral buckyballs have already been seen and indeed their spectral signature is what led Kroto to approach Rice University in the first place (this is me thinking out loud now).\n\nRegarding my other question, right, it's not a mineral if made in the lab, that's just part of the concept.  That being said, humans have created conditions that have allowed new crystals to spontaneously form.  Coal tailings, debris from mines, have been the only known locations for some types of crystal growth pattern.\n\nWe had many young students in the audience and the audience was very encouraging of their coming up with questions, which many did, coming to the microphone.  The balcony was filled with sponsored tickets.  The Mentor Graphics banner was prominent.\n\nI did some outside work with other Wanderers.  The Heathman dinner was spectacular.  I asked about the Hamaker-Weaver thesis (glacial dust, re-mineralizing the Earth).  Some elements of that were part of Hazen's model, as the carbon cycle is one of his research foci.\n\nCarbon subduction is of major interest.  As the Earth cools, it can afford to suck more of its own carbon to lower levels apparently.  He and his wife had just visited [Biosphere 2 in Arizona](http://worldgame.blogspot.com/2009/06/brief-vacation.html) where he had been struck by the scale of some of the experiments, though he thought they might be leaving out some important variables.  Live and learn.  I bought his book, The Story of Earth.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}