{
  "id": "6711185435066712365",
  "title": "Evolving Mythology",
  "published": "2023-05-18T08:48:00.001-07:00",
  "updated": "2023-07-02T12:29:42.826-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi72_wbRcQb86jHMaFQJeBBbZC3k-q2w-ejBfuJP22lYuc1biRfI03X0a0iwOWhguS4OPiEKtAKNx5cyZq1GAMg-vVub0UtZ4i5S1jE232pwlKn3DNbn3_qgtjFtaItBcjkr5j85Rdb78My9r5B_HZsaW55aaIU5YMjro-8c30d7aGQOH43qg/s179/Screen%20Shot%202023-03-29%20at%205.21.47%20PM.png) \n\nI've noticed my specific glue language has taken a turn in that I'm specifically sheltering Synergetics with \"P folk\", not relying on \"M folk\" to do that job.  What am I talking about?\n\nGiven there's only the one P in PATH, you might suppose Psychology and Philosophy were destined to duke it out as to who gets the helm.  However, psych folk are more likely to claim their home on the other side of the C.P. Snow chasm, in STEM, as a Science.\n\nWhat about Politics, won't it vie with Philosophy for the premier P on the marquee?  No, Politics comes under Theater.  Anthropology (not Art) is our bridge discipline.  We study ourselves (all is vanity), as humans (not as members of some superior race or chosen pueblo, that's History, oft written by the proud), and in so doing crisscross back and forth twixt the liberal arts and engineering.\n\nOK, with those clues, you've likely guessed it:  the M-folk comprise the mathematically-minded establishment, networks within networks of various faculties, with silo-style verticality such as in K-16 (the \"grades\" -- YMMV).  \n\nI'm not denying our wedging into that M-silo mid-level, around 8th through 12th grade, and winning some recruits, but that mostly just means abducting them into P for reprogramming (of themselves, by themselves, for themselves) with guidance provided by various syllabi and curriculum artifacts.  Reading programs, in other words.\n\nFor example, a high school maths teacher will tune in CHoP (concentric hierarchy of polyhedrons) and think \"this'd be great for my 10th graders\".  In traversing the directed graphs of connecting concepts, however, said teacher finds herself wading in to lots of narratives involving historical figures, who are not themselves considered mathematicians.  \n\nWe step outside the established pedigreed family tree and pick up more Aquarian Conspiracy types, various illuminati / literati.  Marshall McLuhan for example, and Hugh Kenner.  \n\nThat Hugh Kenner wrote Geodesic Math and How to Use It, becomes a premise for the ensuing narrative I then spin.  Quoting from the M4W archives:\n\nHugh Kenner wrote Geodesic Math and How to Use It, which was not about quadrays per se, but which set a precedent for a James Joyce scholar, fluent in literature (he wrote The Pound Era), wading into the shallow end of the maths swimming pool and beginning the construction of a new namespace, independently of the established M in academia.\n Hugh was something of a polymath.  He also wrote for Byte Magazine (McGraw-Hill) and was one of the first to track \"chatbots\" (again in the news, thirty years later).  I think Dr. Kenner may have inadvertently emboldened the Quadrays people (me one of them) to realize we're entitled to name our four spatial vectors at 109.47 degrees to one another \"basis vectors\", even if we choose to not make them unit length.  The choice is grammatical, and Category Theory, with its liberal ideas about equivalence, helps us provide a justification.\nCorrection:  I should have said \"forty years later\" as the ELIZA-bot stories were from the 1980s.  The World Wide Web came later, around April 1993 -- we just celebrated the web's 30th anniversary last month.  However, thirty years ago, chat bots were already a thing, and had been for over a decade.  They weren't using large language models yet though.  ELIZA was a psychotherapist, Racter an erratic polymath.  They came with built in personalities.  Stay tuned.  Good ideas don't die, they recycle.\n\nSo Philosophy is up to sheltering and nurturing the CHoP stuff while inviting selected M-folk to come tour, packing whatever memes they want to share with us (such as from Category Theory or CT, not to be confused with CRT).  Cross-fertilization occurs, and we keep the most positively synergetic for a next round of upgrades.  Our mythology thereby evolves.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}