{
  "id": "3557424828152303851",
  "title": "Experience Music",
  "published": "2009-07-24T09:43:00.001-07:00",
  "updated": "2009-07-24T12:22:51.570-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/3731728608/):: muddy waters ::I've [continued with](http://worldgame.blogspot.com/2009/07/talent-night.html) operation \"Experience Music\" (named for Paul Allen's [EMP in Seattle](http://controlroom.blogspot.com/2006/10/american-pop-movie-review.html)), this time checking out Muddy Waters with my new friend and professor of gender studies [Dr. Tag](http://www.flickr.com/photos/17157315@N00/3751824838/).I'm such a dweeb about music and if I'm to walk my talk early in this [Music Millennium](http://worldgame.blogspot.com/2006/01/more-music-millenium-notes.html) (a transition figure, kinda like Petrarch), I should at least sound more technically attuned.[Scott](http://www.myspace.com/krishnabluedatsun) explained later how his lineup with lotsa [Neil Young](http://worldgame.blogspot.com/2006/07/movie-sunday.html) had as much to do with the caypo as anything i.e. not usually using one, and not wanting to slide it.[Lindsey](http://www.myspace.com/lindseywalkermusic) was typically free and open about her process, telling us right during her set which ones she was still working on (open mic is a chance to experiment sometimes, do improv).[Heather's](http://www.myspace.com/heatherahunter) petite, strangely shaped guitar was a source of fascination for us.  Dr. Tag isn't shy about conducting interviews, which the talent clearly appreciates.  I hung back and shot stills with my Olympus Stylus, mostly on the \"[available light](http://www.flickr.com/photos/17157315@N00/3751826310/in/photostream/)\" setting, rarely [with flash](http://www.flickr.com/photos/17157315@N00/3751036083/).  Throw some more dollars into this picture, and you could see us as a two person TV crew (one in front of the camera, one behind).The climax of the evening was this group called [theUnreal](http://www.myspace.com/codeoctopus), a small traveling troupe that shouts [hip hop style poetry](http://worldgame.blogspot.com/2005/11/charter-schools.html), can finish one another's lines, moves in and out of chorus mode.  Each has a \"pause, rewind\" verbal command set it can use to remote control the others, with each performer well trained to follow such commands without hesitation or fluster.Cool language game!  I bet [Wittgenstein](http://seanwilson.org/wittgenstein.discussion.html) woulda sat up in his chair for this one, maybe joined in.Although serious musicians have strong self discipline, they suffer from the same self doubts as ordinary mortals, plus are surrounded by talent, so if you have none you tend to stick out like a sore thumb.All of these could hold their own, which is saying quite a bit in Muddy Waters, which has been doing open mic for a long time (I'm just learning).Four of us adjourned to Belmont Inn afterward, a sports bar of sorts, cram packed on a Thursday night, but we did find a good table.  We enjoyed a free ranging discussion of geopolitics, the two Georgias, [Azerbaijan](http://en.wikipedia.org/wiki/Azerbaijan), travel plans, the recent concert in Hyde Park.I've been a good doobie re my \"no beer diet\" (a fast way to slim down in my case), stuck to Bushmills (an Irish whiskey) and some snax.  I wore one of my [signature costumes](http://www.flickr.com/photos/17157315@N00/3751826912/in/photostream/), wanting to blend in to this scene without surrendering my identity as a Silicon Forest professional.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}