{
  "id": "1482078482022717388",
  "title": "Explaining: Control Room",
  "published": "2023-04-26T11:28:00.007-07:00",
  "updated": "2023-04-26T11:40:36.297-07:00",
  "content": "[](http://www.4dsolutions.net/satacad/martianmath/images/celilo1.jpg) \n\nAs old time readers of this blog may know, I often introduce my Control Room vs-a-vs a fleet of vehicles known as bizmos (business mobiles, see BizMo Diaries). \n\nThat would give it (my control room) somewhat of a dispatching, monitoring and data gathering mission.  \n\nThe objective is to keep playing world game effectively, referring to another one of my blogs.  But then from there I've gone on to storyboard a global trucking exchange whereby drivers and other crew get experience bouncing around the planet, from gig to gig.\n\nAlong those lanes, a bizmo might be a logistics vehicle keeping the truck stops along a route appraised of new developments, or be about reconnoitering along a new route.  In the citizen diplomacy model, truck stops play an important role, and my Global University model sees them as extensible campuses, wherein a given driver (no specific stereotype intended) might get some academic time off in the work-study model (drive the roads, while learning the ways of your hosts).\n\nAs like the science fiction writer, I'm able to project into these roles, seeing the angles, without myself holding a trucker's license nor even owing a literal bizmo (I wasn't into owning).  These latter were posited as science fiction or computer model avatars early on, as I was thinking well beyond what was commercially available.  Ditto for the control room.  \n\nI'm not the billionaire evil guy in James Bond movies, who runs all this infrastructure from headquarters, except here in my own threads (e.g. here in my blogs, for example).  I do own a 1997 Nissan sedan, but I cast it in a different role.\n\nThat being said, you could say science fiction is sometimes indistinguishable from investment banking.  An attractive prospect that has the gleam of a near future reality, is sometimes a mirage, yes, but sometimes it's not.  \n\nGiven this genre depends on technology that's already well developed, with new roads in Eurasia a theme (North America already having a cool network, Africa thinking ahead...), it doesn't come across as all Martian or even as sheer Lunacy (on the moon).  Terraforming is an old business around here.\n\nSuch a storyline anchors the model, however I'm well aware that the Dispatcher | Field Operative |  Territory | triumvirate is paramount in many a genre (of computer game or whatever).  As a GST guy (i.e. systems modeler), I'm not trying to deny myself the possibility of thinking about other configuration spaces that feature a similar design.  \n\nThe control rooms will likely themselves be involved in some network, and so on.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}