{
  "id": "4617015631854315255",
  "title": "Exploring STEM",
  "published": "2023-06-24T22:35:00.002-07:00",
  "updated": "2023-07-02T12:28:43.921-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52999550560/in/datetaken/)\n\n:: celebrating the summer solstice ::\n\nThose of us on the PATH side often like tracking STEM-side personnel, meaning we find our people of interest and track them, not nefariously but as people with the usual search engine type tools.  Like last night the Captain and I were reminiscing about cyborg anthropologist Amber Case, as well as Sheldon Renan, a guest speaker with other ties to Wanderers as well.  \n\nThis was at the 2023 Summer Solstice celebration at the Linus Pauling House.  Terry, ISEPP president, was among us.\n\nSo like, wearing my anthropologist hat, I'm hot on the trail of Bourbaki, and yet I'll confess up front my knowledge there is still superficial.  A university gatekeeper would be underwhelmed were I interviewed, but I'm not applying for the Church of the Omniscient at this time.  I was more chasing after whatever Bourbaki became, and some claim that's Category Theory.\n\nOnce on Planet CT, what do you do?  Use your skills.  That's right, discover some key people, authors, authorities and start graphing their relationships.  Are they contemporaries?  Do they engage with one another? \n\nCasual searching today will bring up Tai-Danae Bradley and Eugenia Cheng among others. I came across the former with an already well-formed interest in NLP (natural language processing), and the later thanks to Andrius Kulikauskas, one of our \"for wisdom\" community leaders.\n\nOne of the keywords of STEM culture is \"vector\" which goes with \"vector processing\" along with \"matrix\" and \"tensor\" and whatever else is being appropriated by the Machine Learning (ML) crowd.  That's a big crowd these days, and with its star hooked to AI, only the sky seems the limit where bulls in the stock market are concerned.\n\nThe marrying of a vast corpus, stuff people use English for, with vector (so-called linear) algebra, has enabled a kind of nanotube extraction, meant metaphorically.  I pull threads from the hairball of some googleplexed vector space, coded to continually remind itself of what it's supposed to be all about (\"attention is all you need\").  I'm not the expert.  I'm a PATH guy attending to the various word-meaning trajectories in this neighborhood.\n\nFor example, Category Theory is seriously into \"morphisms\" meaning a generative pre-trained transformer will be finding \"morphisms\" in proximity to \"functors\" and \"categories\" and other such ballpark players.  Their vectors will be weighted accordingly.  The hair around them (same neighborhood) may then be extruded into sensible sentences.  The believable \"predictable goo\" oozes forth.\n\nWe've always allowed dolls, idols, fictional entities, to use the pronoun \"I\".  There's no crackdown on \"dolls talking\" or really any other object.  Through the comic book convention of a talk or thought balloon, pretty much any object is graphically capable of talking and/or thinking.  The strong expectation around AI is we'll have some \"I\" to talk to, \"I to I\".  What would Martin Buber say about ChatGPT I wonder?  Why not ask her (\"hey Siri...\")?  She'll oblige with her fresh-squeezed toothpaste.\n\nAn ulterior motive of mine, for learning some CT, is my wish to cover the obvious bases when it comes to exporting Synergetics to other namespaces.  CT is a \"glue language\" for Stemites in general.  I was thinking if I could use CT for bridging purposes, I might help Synergetics get some more crew.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}