{
  "id": "1219831574613861109",
  "title": "Explaining My Jargon",
  "published": "2021-11-05T10:32:00.007-07:00",
  "updated": "2021-11-05T10:38:38.400-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhrnsxKqcw1xiPvkOhSgD1E9OC4tOIWl8bKSi8XaiLqmFmA6dqOKo0S6_W-zcjmDjle3BJaEXS64PunhHJeE0ogSzCDV0xMm9m_TuFdr-P3I4dKe6ka2kKAXCY-50SPe_o7RebI/s400/jupyterlabs.jpg)JupyterLab Control Panel I'm not just twiddling my thumbs, though in my defense, if I were, isn't that a big part of being a Quaker?  Expectant waiting we call it.  I'm not the instigator, but wait for a way to open, as the jargon goes.  Is there any truth to the rumor that \"Quaker\" in American Sign Language is twiddling thumbs?\nDescribing a role (some still say \"job\") in terms of its personal dashboards is not a bad idea, especially if one is at liberty to stay highly metaphorical with the dashboard talk.  Recall how the UNIX crowd wanted a \"workbench\" or even a \"bicycle shop\" ambience, which went well with the \"many tools, each good at what it does\" esthetics.\n\nWhat are the dashboards associated with high school?  A special desk and chair combination?  A locker?  Do you have an auditorium with a stage?  An athletic field?  An indoor gymnasium?  What I'm describing come from a stereotypical high school, a set of buildings, on a campus.  The home based personal workspace was the homework space.  Until the internet made more inroads.  Until social distancing became more of a thing.\n\nMy shoptalk had long featured the personal workspace (PWS) which could mean anything from a cubicle, to a home office (such as I often had), to the cab of a long hauler truck.  I thought in terms of a cockpit. \n\nThe archetype is often a command center, a mission control, a situation room, a control room.  So here we are, in my Control Room blog.  The PWS is more like a BizMo, complete with captain's log (journal, diary), but on wheels or even just legs.  Control rooms dispatch.  A familiar model.\n\nHow should we extend the interior \"pattern language\" of high school to include our newer Zoom dashboard, with screen sharing?  What \"nerd caves\" do students and faculty inhabit?  Are we talking about multi-hour courses?  Who scripts them?  The process of passing the torch is ongoing.  Older generations shape the newer ones, but sometimes with push back.  Actions beget reactions, and results.\n\nI've been looking at JupyterLab as a high school dashboard, one of many, compatible with the PWS motif. It's what I look at, when reading and writing Notebooks.  My curriculum flows around by means of these documents.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}