{
  "id": "3320860458948227740",
  "title": "Exxon Math",
  "published": "2008-12-27T09:11:00.000-08:00",
  "updated": "2017-03-15T23:02:59.263-07:00",
  "content": "I was on Quaker-P again, sneering about Exxon Math.  Here's your paradigm big oil company, claiming to be doing something for \"culture\" yet I've seen no real uptick in people passing even our [most basic IQ test](http://worldgame.blogspot.com/2005/12/iq-test.html), thanks to their \"initiative\".\n\nInstead, I've seen their moves to intimidate, to pump out imagery relating to math's authority and power over us, very crypto-fascist and ugly, typical Obnoxico ooze.  \"Boost the sludge factor!\" says the man behind the curtain.\n\nExcerpt:\n\nYeah, I'm kinda pissed at Exxon, posing as a helper of poor junior, trying to give a leg up in math and science, while meanwhile it's mostly intimidating cartoons showing unexplained cryptic math expressions, meaning \"we're blindingly smart so you should listen to us when we blather on TV\" whereas a serious sponsor, like Westinghouse in the old days, would have puppet shows by now, a character like Big Bird teaching about the complex plane, fractals...  just empty advertising and hollow commercials, not the kind of company I look for, when looking for quality.\nThe \"Bucky stuff\" isn't going away guys.  Show some courage maybe?  Just a wee little?  No one took the bull by the horns when that was still doable, and now it's too late:  stampede of buffalo, heading straight at ya, in no mood to \"talk\" about anything.\n\nBut hey, it's easier to pick on nations, because their work looks far more hopeless (kind of like kicking nuns when they're down, a favorite pass time in white man suburbia they tell me).  Get an economist in a corner, and see if he lashes out at the hand that feeds him (an investment bank for example) or some guy named Chavez.\n\nI think we know what most will do.\nWhat's a business without trust?  The American people have enough [access to history](http://worldgame.blogspot.com/2005/09/wanderers-200597.html) to at least figure it out half the time, when they're being bamboozled.  This is one of those times.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}