{
  "id": "5128456109945374708",
  "title": "Eyes Wide Shut (movie review)",
  "published": "2009-10-05T11:15:00.000-07:00",
  "updated": "2009-10-06T00:39:14.537-07:00",
  "content": "I've long been curious about this movie, given I'm a Stanley Kubrick fan.  This was my first time seeing it, and I wasn't sure what to expect.  I was pleasantly surprised, as I'd been bracing for some kind of horror movie, not upper crust New York, more like Woody Allen world, lots of doormen and taxi cabs, around people who have everything and then some.Tom and Nicole (the celeb stars in their characters) manage to get into a fight over the price of holy matrimony.  It seems to work for the daddy-I-want-a-pony minded, and indeed daddy is used to spending money, but it's rough on the couple.  Daddy is off at work, looking at naked women all day (he's a doctor) while mommy is highly appreciated by members of the opposite sex (as well as her own) yet does all that semi-boring staying home stuff (nice pad!), while wondering what her husband is really up to out there.  Little does she know.As a result of the fight, Tom at least gets that he's taking too much for granted.  He's now haunted by the [Bridges of Madison County](http://www.imdb.com/title/tt0112579/)[ story](http://www.imdb.com/title/tt0112579/), with someone besides him as Clint Eastwood.  That's disturbing of his equilibrium and he goes off the deep end into film noir country, in this case a kinky patriarchy full of voyeurs, ala Elizabethan Era Globe Theater (the origins of stagecraft in English, inheriting [from Greeks](http://worldgame.blogspot.com/2008/05/squanderers.html) via Romans).  As private cave DVD watchers, we join the rest of the masked (and Tom) for some brief peep show.  No, we don't have limos either, aren't that politically powerful, but at least we have VCRs.What's amusing about this film is that Tom & Nicole ride so high in their social network that the \"dark underworld\" of pulp fiction seems just as out of reach in the sense of economically advantaged.  The two temptress roommates are pretty much like my girlfriends [at Princeton](http://worldgame.blogspot.com/2005/05/princeton-25th-reunion.html), well off enough to afford a slumdog apartment in The Village (we weren't actually that well off by a long shot, lived [in Jersey City](http://worldgame.blogspot.com/2006/10/our-big-new-york-adventure.html) until finding that place in the Big Apple (where my girlfriends moved, me staying behind to teach in a Catholic girls' school, but I digress)).Tom Cruise, being in over his head, out of his element, is what adds levity to this interesting film.  He keeps flashing that doctor badge like it's supposed to justify his playing private detective or undercover cop, like \"hello, I'm Kojak, just let me wake you up in the middle of the night so I can dress up and go to a kinky party in the steens\" (or wherever that was).Obviously I'm coming from some kind of economic jealousy angle, which I think the film consciously encourages.  We have a hard time feeling sorry for these well off people and their exciting lives, identify more with the working class who keep getting to take Tom's coat.  I'm coming from being the limo chauffeur probably, stuck outside with the taxi driver, not even blindfolded because I can't play some fool musical instrument, plus I suck at sleazy dancing like that guy at the party was doing, sucking up to Nicole (whom I'd gladly suck up to if I could figure an angle, but then [glitzy LA aka Hollywood](http://worldgame.blogspot.com/2007/12/hollywood-usa.html) is hardly my stomping grounds;  I'm a fish out of water in that neighborhood (that's more Governator turf)).Speaking of Hollywood, earlier last night I saw [Whoopi Goldberg](http://controlroom.blogspot.com/2007/08/which-hollywood-star-for-president.html) apparently liking Google Android on the LCD flats (at Claudia's sports bar on SE 30th & Hawthorne).  We also saw boomers in a Windows 7 commercial; I advised Annis to try extending the life of the old Toshiba to take advantage of Xmas discounts on new laptops with that Microsoft OS, more suitable for \"normal people\" than GNU/Linux maybe (a geek favorite), and less Cadillacy than MacOSX.Open source (e.g. Python) runs on all of the above so I'm not required to be dogmatically against all proprietary layers above and below my level (talking \"chip-to-cloud stack\"), even though copylefting more assets remains a worthy undertaking and goal.  I'd like freedom to gain and/or hold on to some stack pieces at all levels, making purists happy while continuing to leverage economies of scale.  To this end, [I encourage free products to advertise](http://mail.python.org/pipermail/edu-sig/2009-October/009596.html), given boosting sale price has never been the only motivation for flaunting what you've got.  There's also simply recruiting a user base (cite the Java campaign, or the PR for ostensibly not-for-profit religious brands, Quakers included).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}