{
  "id": "3295510132641096607",
  "title": "Fading World Maps",
  "published": "2024-12-17T06:27:00.000-08:00",
  "updated": "2024-12-24T14:16:22.922-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/3292180674/in/photolist-5uinAK-61VhBL-6EhymY-2ikuGSE-e897Lq)\n\nObviously there’s considerable consternation in the K-12 classrooms wherein it’s no longer possible to agree on a world map, in the political layer at least. \n\nNations are not facts, but stories, i.e. facts plus spin, and some of them “fail” meaning they lose the PR war that protected their ongoing identity as such. Virtual or diaspora nations have an easier time of it, as the bar is not so high, to be recognized as such.\n\nOf course USA classrooms have been notorious for not taking up geography in the first place, such that its grads have no clear conception of the nation-state layer, and this works to the advantage of the Americans in light of border volatility. \n\nTheir ignorance was well placed in some sense, as that layer is flickering, like a candle in the wind, on the brink of going out in the minds of some who still see by its light.\n\nFrom anatomy books, we know about overlays and data layers. With or without the jigsaw puzzle of semi-contiguous states (i.e. contiguous with glaring exceptions) we still have river deltas, transportation networks, fields, mines, pipelines, electrical grids, military bases (never mind the decals for the moment), satellite constellations. That stuff is all there, regardless of the programming running it.\n\nGiven the crunch of telecommunications and networking, the polyglot narratives do have a lot of sorting to accomplish, a lot of computations. Some “glots” seem buggier than others whereas some are simply slow, relatively, given inertia. \n\nHeavy stones with trajectories don’t turn on a dime (accelerate suddenly) without forces being applied, from within or without. That’s one of those English connections: acceleration and coercion. When sudden change is desired, the enforcers come to the fore.\n\nIn my Silicon Forest context, we already use Google Earth and think in terms of overlays and data layers. I’m fine with swapping out a “western” political map in favor of a Eurasian one. I remember John Lang’s inflatable planetarium and all the overlays he had, when it came to organizing the constellations into memorable memes. \n\nAstrology begins with naming and articulating astronomical relationships, which come in ratios and arcs, subsections of circles. It’s not that we’re actively pushing any astrological practices (the commercial markets do that). We just need awareness of the data layer itself.\n\nOur history involves the East (Eurasia) transplanting some of its belief in royalty and entitlements to the Hollywood context, in the form of stardom (the institution). \n\nThe Americas (the West) helped transmute the East (Europe etc.) into a big screen celebrity culture, wherein stars (as in thespians) and political figures (including pundits, news anchors…) came to frequent the same  “level” (or data layer) on television. \n\nThe convergence of politics with theater in PATH, and the fact that military jargon already featured “theaters”, makes the Supermarket Math (commerce) more transparent.\n\nOn the Martian Math front, we continue noting where the Martian meme stays strong, such as within the Urbit community. Hungarians. ET lore more generally. \n\nWe’re promulgating such memes as “flipping the switch” and “closing the lid” in the classrooms, while meanwhile having students become more aware of the Fuller Projection and C60 (a fullerene), along with the Telstar-patterned Adidas soccer ball (widely adopted). \n\nThe fact that Brits got that ball wrong on their road signs is always good for a Monty Python moment.\n\nSpeaking of British culture, that’s where a lot of the focus on nation-states originates, as a tool of empire. Cascadians don’t mind a softer focus, when it comes to decision making centers and the circuit diagrams connecting them, with less emphasis on pomp and circumstance. \n\nThe demise of diplomacy among the PhDs has opened a door to more citizen diplomacy, which used to require more in-person travel but now happens through telecommunications. \n\nTourism still helps though, in terms of shaping the longer term narratives. Recreational tourism supplemented by tours of duty, keeps the ideas circulating. A Silicon Forest teacher such as myself is able to chat with Eastern Hemisphere teachers about S3 without leaving the office.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}