{
  "id": "8672728365590860450",
  "title": "Fahrenheit 11/9 (movie review)",
  "published": "2018-10-01T22:00:00.002-07:00",
  "updated": "2018-10-02T12:41:58.358-07:00",
  "content": "Michael Moore has been following Flint, Michigan through all of his movies.  It's the saga of a city gone bust, amidst rulers who don't have much hope, given the priorities of their higher ups.\n\nThe timeline Moore follows starts with the 2016 US election, then jumps over to Michigan in 2010, when the state governor invokes emergency powers in several cities and replaces their local leadership with his people.\n\nAround Flint, the engineering goes south when a working water supply gets monkeyed with.\n\nTelevision did not turn out to be that medium for public debate we used to hear about, given who paid for it and why.  Will social media be any better?  There's a quick cut to Facebook, suggesting grassroots organizing but the internet and cryptocurrencies are not the order of the day (Alex Jones makes it in, but I was confused about what he was saying in that clip).\n\nMostly the tech giants get left out of this telling, and there's no attempt to dive deep into hackerdom. Leave Putin another bad guy strongman, the way Trump likes his leaders, and move on.  This isn't Oliver Stone driving.\n\nAnyway it's jarring when we remember this lead poisoning is all happening during President Obama's time, the last great hope.\n\nThe Trump presidency is already well established in the movie before we switch to Flint, which is deliberate, as the story is one of \"paving the way\".\n\nThe larger picture is pretty bleak.  Young people need to do their own organizing, and are.  The adults aren't particularly able, when it comes to keeping democracy going.\n\nOne of the wise elders reminds us the US only started to experiment with democracy in the 1970s, with on-paper enfranchisement of non-whites and women, and that experiment may have reached its conclusion, in the wake of 911.\n\nThe flavor of the film is wistful.  Wouldn't a United States be a good idea?\n\nFilmmaker Steve Bannon says on camera he appreciates Michael Moore's craft, though is at odds with his politics.\n\nIt's not Moore's fault that destiny would put him in the eye of the storm, nor Flint's either.  He has already looked at school shootings.  He's trusted to observe the high schoolers in action.\n\nSure he's heavy handed, because he's expressing his worries in strong terms.  He says out loud what a lot of people are thinking.  Lets get those thoughts on the big screen.  Yep, there's Hitler, buoyed by some of the same vibes; his ghost still haunts us.\n\nThe school teachers of West Virginia get a lot of recognition, for trying to hold together the fabric of their society in the midst of an opium crisis and infrastructure bled dry.\n\nThe Bernie Sanders campaign, and its call for social programs, gets a lot of focus as well.\n\nMoore is weaving a lot in.  He's curating many \"Kodak moments\" assuming an audience in the future.\n\nI'm not saying I'm Moore's mouthpiece and would tell all the same stories he does.  We're on rather different trajectories.  That's not a criticism, just an observation bordering on a truism.\n\nHere's another provocative film that is sure to provoke many.  I felt updated on many happenings.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}