{
  "id": "4906543329016497741",
  "title": "Failures in Logic",
  "published": "2013-09-08T19:10:00.000-07:00",
  "updated": "2013-09-09T12:28:03.676-07:00",
  "content": "Assuming someone needs to be punished for A, it does not follow either that B should be the punishment nor that C should be the one doing the punishing.   C is not determined by B, nor B by A.\n\nShould the punishment be military?  Should atrocities and war crimes be committed?  Those are questions about B. \n\nShould [Washington, D.C.](http://controlroom.blogspot.com/2013/08/city-of-morons.html), hardly a moral high ground city, be the city to orchestrate said punishment? Hasn't that city done enough damage for several centuries?  Those are C questions.\n\nPeople agonize on TV about the credibility of the US president.  He rattled his saber so now we have to back him up or what will the Russians think?\n\nAfter [Nixon](http://controlroom.blogspot.com/2009/11/secret-honor-movie-review.html) they still do this. \n\nIt's a father-knows-best about how to impress knee-jerk psychology.  The North Koreans will think we have egg on our faces if we don't fire some cruise missiles into a crisis situation, taking a gamble that this gesture will send the right message and bring healing to the region.\n\nImagine Son of Uncle Sam in a hospital gown, somehow free from his quarters, walking into a hospital room down the hall where the patient is in a state of civil war schizophrenia, stuffing out cigarette butts in his arm, suicidal. \"Let me help you with that\" says Son of Sam... blam, blam, blam (he shoots to maim, not kill, and believes he's a highly skilled staff doctor).\n\nYes, the nut house from hell.  Welcome to Planet Earth folks.  Hollywood could not make this up, and make it seem this real.  Only truly out of control actors could come up with this shit.  And don't ask to see the director.  This is [all improv](http://en.wikipedia.org/wiki/Thrownness) honey, and the director has left the building.\n\nHow about compensation for victims' families?  How about reparations to [the City of Fallujah](http://worldgame.blogspot.com/2004/11/dod-claims-victory-in-fallujah.html) (invaded why again?).\n\nSorry, but there's no gravitas left in those offices.  Insofar as the Oval Office means anything, it's just the scene of an ongoing struggle by the will of a people, to gain control of its own limbs.  Self government was off to a jerky start from the beginning.  Not pretty.  Not that jerky courts were any better.\n\n\"Self control\":  that's tough to exercise as a nation, nations being basket case should-be-hospitalized creatures at most levels, with pomp and circumstance their way of coping (compensating).   \n\nThe US has been mentally unbalanced [since Eisenhower](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html), with a seriously impairing \"military industrial complex\". No one really knows how to cure such things.  Original Sin may play a role, as the angels jeer, at Man the perpetual fuck up.  God made a goof there, that's for sure.  Lucifer said so out loud and paid a high price, but a lot more were thinking it.\n\nMostly, nations project negative qualities on one another as a way of helping their own feel good about themselves.  Amnesia and self-lobotomy come with the territory.  It's not a physical operation, but a metaphysical one. \n\nYou probably do need to watch lots of television though, in specific genres, to stay infected for long. That's what Ernest Mann (below) concluded, one of the first to kill his television.  Speaking of which, now would be the time to really look at Fallujah more deeply, the white phosphorus, the children killed.  We'll find that at sports bars right?\n\nThe president is fond of saying \"against children\" as if chemical weapons were OK against the older children aka adults (like in Friends or in the Mary Tyler Moore Show).\n\nHe's actually moving the goal posts in the wrong direction with such rhetoric, caught trying to make more room for chemical attacks against \"terrorists\" (another step back from civilization, a scary light to these yet man-apes of 2013, their humanity as yet emergent, tenuous). \n\nHe's allowing his speech-writers to blunt whatever message about chemical weapons was supposed to be sent by those deaf-mute collateral damage causing cruise missiles.\n\nI was reading [Ernest Mann's stuff](http://www.amazon.com/I-Was-Robot-ebook/dp/B009N531EK) on the way back from Chicago, using my approved-for-inflight-use Kindle. \n\nI used the seat pocket headset rather than scrounge my own and mostly listened to air traffic control talk on channel nine.  Female voices are creeping up the charts there too, I was happy to hear, both in the control room and in the cockpit.\n\nErnest Mann was this Minneapolis-based maverick, and was one of the first to vector a new ethics of \"freedom\" (living freely) well beyond \"work ethic\" Protestantism.  He believed in the principle of not accepting money for one's work, while yet doing good works.  He found a way to retire early by 1900s standards:  in his forties. \n\nThen he wrote and published about what it was like, a kind of latter day Thoreau, classifiable as a transcendentalist perhaps, or at least someone with a view that history involves many behind-the-scenes players, call 'em the Illuminati or [Great Pirates](http://worldgame.blogspot.com/2005/02/adventures-in-radio-land-part-2.html) or whatever (ETs...).\n\nA monarchist news guy from Yahoo! was saying on NPR or CNN the other day that even if the Congress went against the president's first impulse, and voted down B and C, he could still defy Congress.\n\nA lot of narrativists (journalists) are monarchists, given how they talk about president Obama.  They have no clear sense of the difference between a chief presiding officer and a monarch.  And yet they presume to tell us our story, have serious jobs in the media.\n\n[The US media](http://worldgame.blogspot.com/2013/08/chicago.html) have little notion of a \"UN Security Council\" apparently.  That's where other countries have a say and since when did they really matter?  The idea is Obama is Superman and he should rain down righteous wrath upon the Assyrians just like he does in the Bible as the God of Israel.\n\nThat's your average American mind for ya, eggs scrambled for breakfast, lots of bacon.  \"[Joe Six Pack](http://mybizmo.blogspot.com/2009/10/wanderers-2009107.html)\" they call him.  A guy with [a bulging gut](http://worldgame.blogspot.com/2007/07/slow-food-nation.html), ready to judge you between beers.  War is just HDTV entertainment for this guy.  Why not \"let 'em have it!\"?  They gassed children after all, can't ask for a better excuse. \n\n\"Yeah, we might hit a few hospitals and schools 'n such but collateral damage is a lot less these days than it used to be, what with smart bombs 'n all.\"  We all know him from campgrounds.\n\nWhat did they say about how the world would end?  Not with a bang but a burp?\n\nLets galvanize the world to rid itself of chemical weapons by all means. \n\nNot in a hasty stupid way that might endanger the environment, but in a planned and well-managed theatrical production.\n\nLets all kick back and watch some well made documentaries on these HDTVs of ours, about the history of chemical weapons, dirty bombs, biological weapons.  [Nixon does get some credit](http://mybizmo.blogspot.com/2009/12/freeman-dyson-in-portland.html) for getting bioweapons off the table at least.\n\nTell us about Johnston Atoll and Hermiston please.  Lets talk about DU and a radiotoxic environment. Chemical warfare against people is one thing, but there's chemical warfare against other species, with lots of blowback effects. \n\nWe should transition to civilian topics as we help break the mood.  Lots to discuss, many tradeoffs.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}