{
  "id": "115906950537704792",
  "title": "Fall Retreat",
  "published": "2006-09-23T23:32:00.000-07:00",
  "updated": "2006-11-15T11:44:26.417-08:00",
  "content": "Cheryl Pauling, Linus's granddaughter, came by the Pauling House today.  Don (Terry's Igor) showed her around (I don't think she'd been here before -- I'm pretty sure Linus started getting into chemistry in the basement).We're in the middle of the 2006 Fall Wanderers Retreat.  Terry is holding forth per usual, defending Intelligent Design as he means it (a namespace):  Engineering is a bullheaded god, Science overhyped and namby pamby.  I keep firing my disruptor (not an outward weapon), only because I've heard it all so many times, so please beam me up Scotty ([an engineer](http://images.google.com/images?q=scotty+star+trek&hl=en)).Didn't happen.  [Jon on guitar](http://mybizmo.blogspot.com/2006/03/st-patricks-day-wanderers-retreat.html) is a real pleasure.  Don has a good singing voice to go along.  OK, so good thing Scotty didn't hear me.This morning, before all these people showed up (we're packed), I was rehearsing wordlessly pointing to butcher paper (like a flight attendant) while Tom Lehrer sang [New Math](http://www.stlyrics.com/songs/t/tomlehrer3903/newmath185502.html) on my iPod, amplified through my Altec Lansing inMotion portable speakers.[Tom sings](http://faculty.ivc.edu/rzucker/Math%20Songs.htm) through 342 - 173 (a subtraction problem) twice , in bases 10 and 8.  His 1960s audience is cracking up, but he knows it their way too.  As an MIT math prof, he's lived through more than a few changes in fashion.Then I joined Dawn and Tara for an adventure: Portland's first [Pirate Festival](http://mybizmo.blogspot.com/2006/09/yar.html), a big success by the look and feel of it (lots of harmless gunpowder games, good music & food).I'm using Don's Safari on an iSomething to post this, meaning I'm missing my customary wysiwyg text editing controls.  I'll add some links, other formatting, when I'm back at my workstation.From my workstation:  I did get to play the Lehrer tune (plus Allan Sherman's [You Went the Wrong Way, Old King Louie](http://www.themadmusicarchive.com/song_details.aspx?SongID=75) for an encore).  I explained after the Lehrer piece that our emergent [Gnu Math training](http://mathforum.org/kb/message.jspa?messageID=5057949&tstart=0) is likewise evolutionary, though with different [emphases](http://www.answers.com/emphases&r=67).Regretfully, we didn't manage to bring Sarah-the-dog down to the Lucky Lab for Dogtoberfest.  There's only so much one can get done in one day.[](http://photos1.blogger.com/blogger/1134/545/1600/beherenow.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}