{
  "id": "3540016113339895889",
  "title": "Fantastic Four (movie review)",
  "published": "2015-08-20T11:25:00.001-07:00",
  "updated": "2015-08-30T11:56:12.624-07:00",
  "content": "I will advance the rather plain thesis that this portal to another dimension the kids are experimenting with is code for the drug experience, i.e. in reading this Marvel text, a youngster is enabled to mediate on the problems and issues around psychotropic use and abuse.  What else could the portal be and why would it hold such interest to everyday teenagers if it didn't relate to everyday possibilities?\n\nThe questions are several:  is there anything over there in that other dimension that I might bring back that could be useful to my world?; might I bring back something damaging?; might I not come back at all?  On top of mere substance, the metals involved, one might be transformed or transmuted oneself, psychologically, and of course this possibility is where the film spends most of its time.\n\nHere I'd make the [connection to Mad Max](http://worldgame.blogspot.com/2015/05/mad-max-fury-road-movie-review.html) and the psychological landscape it provides, a denuded Earth laid waste, presumably by humans' doing.  The other world in Fantastic Four is not presumed to be Earth, nor its features attributable to humans.  Rather it's a crucible in which one has near death or rebirth experiences as a result of which one's persona is affected, perhaps with new and different powers manifested.\n\nThe comics, or manga tradition, has long embraced the archetypal story line of humans undergoing some stressful test only to emerge with at least quasi superpowers, [Batman](http://mybizmo.blogspot.com/2012/08/the-dark-knight-rises-movie-review.html) a prime example, but with so many other examples.  Just as likely, a villain is born of such a test, or a worthy ally.  The cast of characters, and therefore plot possibilities, multiplies as a function of unpredictability that stress and risk occasion.  Growing up is stressful and doesn't stop with the attainment of adulthood.\n\nBack to the details:  we need role models and examples of what to do and how to be, in the face of this portal.  One guy is just too into it and is more jealous and proud in ordinary meat space ([meetup space](http://worldgame.blogspot.com/2015/08/meat-therapy.html)) as well.  These character flaws turn out to matter and this older character has the most trouble keeping his superpowers under control.  We find a similar arc in Buffy, wherein the bewitching Willow goes over the line and comes back more a demon.  Something along those lines.\n\nWe should remember that \"[monster](http://worldgame.blogspot.com/2013/08/monster-university-movie-review.html)\" \"mentor\" and \"Minotaur\" have important overlapping connotations, connecting likewise to \"masks\".  In a Biblical setting, the vision-seeker comes back from the desert singing a more prophetic tune.  We need not interpolate any drug taking rituals, and in a different interpretation of Fantastic Four we might take The Portal to be simply the experience of reading (maybe the Torah, maybe something else), learning to read being, at one time, more revolutionary than taking any little red pill (both [phylogenically](http://www.thefreedictionary.com/phylogenically) and [ontogenically](http://www.thefreedictionary.com/ontogenically) speaking).\n\nIn light of the above interpretation, though, the one I've adopted, what are the lessons learned?\n\nMaybe the main one is some changes are permanent, last a life time or longer, one could say \"leave scars\" if wanting to scare more.  There's no going back and undoing.  Again, true in many dimensions besides this one, so a useful teaching.\n\nJust growing older means saying good bye to a succession of former selves and close neighbors.\n\nThe film has to work pretty hard to spread responsibility for the whole portal thing in the first place, if our heroes are to end up with moral high ground status.\n\nOne could say the whole experiment was an unmitigated disaster, does nothing but damage, a new hellmouth having been opened (thanks a lot guys) and now its just more good money after bad, trying to repair the damage (but also more family wage jobs, which I suppose is a silver lining).\n\nThe military plays the role of grounding this ultimate irresponsibility just as it does in the real world i.e. the BP disaster in the Gulf, or the seepage at Hanford, has everything to do with the military's being ravenous for what oil rigs and uranium mines come up with.  Destroying the planet to save it, is the name of the game.\n\nMy movie review here is likely colored with my summer reading in late August, an autobiography by Dennis McKenna regarding his life and adventures with his older brother Terance.  Their primary area of exploration was psychotropics and the dissemination of \"Magic School Bus\" knowledge (not to be confused with Ken Kesey's, a more literal bus).  Or knowledge of some \"Screaming Abyss\" as the case may be (an allusion to the book's title).\n\nI got to listen to Dennis live at one of [the Esozones](http://mybizmo.blogspot.com/2008/10/attending-esozone.html) I attended, some years back.  I've yet to sample much of Terry's stuff but expect I'll be getting around to it in [my wanderings](http://worldgame.blogspot.com/2011/05/philosophy-talk.html). \n\n[](https://www.flickr.com/photos/kirbyurner/20676449752/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}