{
  "id": "4724977313494562852",
  "title": "Fast Forward",
  "published": "2012-08-01T00:54:00.001-07:00",
  "updated": "2012-08-01T01:01:49.945-07:00",
  "content": "\"Accelerating acceleration\" seems to be the name of the game, shades of Alvin Toffler.  One's own life is its own succession of \"future shocks\".\n\nI'm working with Saturday Academy again, to bring some of the latest technology into classrooms for young teens.  Mostly people don't provide that as a service.  I'm talking about Python 2.7 with Visual Python.  The computer lab is at a local university.\n\nTonight Tara and I hopped a bus to see for ourselves what this vigil around City Hall is all about.  A corner of the park where Occupy was based last October serves as a compact little picnic area.  Many of those present are homeless.  Cities do not always tolerate gatherings of this kind.\n\n[](http://www.flickr.com/photos/kirbyurner/7689616000/)\n\nThis particular initiative has been going on for awhile.  I've been reading up on the twists and turns in Willamette Week and Mercury.  Negotiating the status of R2D2 (Right To Dream Too), a long-running occupation of a privately owned property -- with owner permission -- has been a part of it.\n\nMonday night I hauled food to Colonel Summers from St. David of Wales, and then headed over to Barley Mill to catch up on reading.  Then I returned to the park to chat with some of the people I know there, such as the Jennings, Melody and others.\n\nThere's too much going on to capture all the details, either for myself or these blogs.  I'm sure it's no different for others.  Lots just flows through the nets.\n\nTara and I took the 14 back towards the neighborhood though she alighted early to catch some comedy at Helium across from Lucky Lab.\n\nI went on to Pauling House where Bob McGown was holding forth, but decided I needed to work instead so wandered over to Powell's Books on Hawthorne and jacked in.\n\nHours later, I'm still working, though I've shifted the venue.\n\nI did find some time to post to the Wittgenstein list, [thinking about thoughts](http://dir.groups.yahoo.com/group/WittrsEX/message/4865) some more.\n\n[](http://www.flickr.com/photos/kirbyurner/7689614478/)\n\n:: franz hall ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}