{
  "id": "1291764654765940652",
  "title": "Fed Up (movie review)",
  "published": "2018-10-12T18:00:00.003-07:00",
  "updated": "2018-10-12T18:48:53.751-07:00",
  "content": "This movie is in alignment with SuperSize Me and [Got the Facts on Milk?](https://mybizmo.blogspot.com/2014/03/got-facts-on-milk-movie-review.html).\n\nThe vital organs of the USG (Department of Agriculture, FDA, Congress...) are as assaulted and degraded as the vital organs of any hooked-on-nachos-and-fries school child.\n\nA weak and pudgy USA was a pushover when it mattered,  yet it still pretends to be a player, \"winning wars\" for its donor controllers.\n\nThe Smedley Butler era Business Plot against FDR was long ago successful, at least since Reagan's term.  Thinking some porky establishment in Washington DC is going to save us this late in the game seems pretty dated, not to mention unrealistic. \n\nWhat world capital has that kind of power?  Against Coca-Cola?  Again Nestles?  You've gotta be kidding me, right?\n\nOne idea I've clung to over the years:  why don't we have private sector companies that specialize in edgy advertising, employing counter-intelligence the way we need,  and the production of which propaganda the USG is apparently incapable?\n\nI'll keep buying your coffee, and subscribing to your on-line games, if you promise to keep hitting out hard against junk food culture.  Deal?  Why can't it work?\n\nThe status quo is we somehow expect private sector media news companies to exercise their juice through channels.  But which such media have such juice anymore?   Who takes up the cause of youngsters against Diabetes Inc?  Pediatricians? \n\nObnoxico rules the roost and it's hard to see who has enough muscle to challenge the pervasive ideology of a soulless corporate personhood.  Not the World Health Organization it turns out.\n\nUncle Sam?  Is he still on life support?  Seems to me he flat-lined some decades ago.\n\nI'm getting a strong Morlocks versus Eloi vibe.  A predatory intelligence, some Bell Curve's upper half, is quite willing to exploit its trusting victims, by means of cartoons.\n\n\"Eat lots of sugar and become a basket case\" say the immortal cartoon characters, not physical beings themselves. We have the makings of a horror film here.\n\nDid you know that FDA nutrition guidelines mandate no upper limit on calories from sugar? \n\nThat North Americans are among the most malnourished anywhere is raw ammo for those hoping to suggest some alternative wiring, experiments with other approaches. \n\nCould we experiment more with [how we do food](https://medium.com/@kirbyurner/in-favor-of-place-based-education-21a3ea178177) in schools?  What about [those cooking shows](https://mybizmo.blogspot.com/2015/10/learning-to-cook.html), saved to the school server?\n\nVarious talking heads tell us that a foreign power and declared enemy of the USA, hellbent on its destruction, would be hard pressed to do as much harm as the junk food and junk science industries.\n\nThe logical conclusion is that some alien ideology is indeed entrenched.\n\nFed Up offers some hope, but as long as the answer involves looking towards DC for leadership, I question whether that hope is misplaced.\n\nExpecting USG politicians to regulate from on high, to protect citizens and guests against predators, is expecting too much.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}