{
  "id": "6193363538752139683",
  "title": "FEMA Loves You",
  "published": "2017-03-29T15:48:00.000-07:00",
  "updated": "2017-04-02T23:00:38.449-07:00",
  "content": "From my angle, this was a [short-lived media campaign](http://worldgame.blogspot.com/2017/03/nuts-and-bolts.html) on Facebook with a thought-provoking premise: that both the heroin epidemic sweeping the nation, and the purge of voter rolls, ala Florida but bigger, might constitute national emergencies to which a response was in order.\n\nWe saw what actually happened when New Orleans went under: a lot of disbelief in DC that anything was expected of them right away, as these were mostly poor folks with homes underwater, literally, and therefore of little net worth. \n\nFEMA had some trailers built in a hurry, with formaldehyde issues, and moved on to Rita, a little better organized (learn by doing). Food Not Bombs was on the scene as well, managing logistics from [a van](http://mybizmo.blogspot.com/2017/04/digital-scanning.html) (I wasn't there, Melody went later).\n\nThe idea that Uncle Sam (US) might develop public programs for drug abusers is just distopian science fiction from the point of view of those hoping to lower the population. We have schools of thought, tracing back through Eugenics (the movement), to Galton and so on, always looking for excuses to dispose of people, accelerating their downfall. \n\nThese schools have a lot of hands on a lot of controls and should not be dismissed as fringe cults or sociopaths-in-treatment.\n\nAdmittedly, the Euro concept of Sanatorium has gone through many iterations. We also have strong grooves around sending people to camps to either punish them or have them brainwashed (rehabilitated) most likely both, so \"FEMA camp\" is already a nightmarish meme in distopian scenarios.  That's two strikes against the whole idea:\n\n(1) government should let more people die faster and\n\n(2) we're afraid of government because of how we've been treated in the past.\n\nIn other words, we don't have a lot of precedent for a secular institution successfully bettering the lives of people in need.  That's not something we know a lot about.  We know a lot more about enslavement and control, getting people to do stuff, so-called work.  Healing people of their drug addiction is not really a part of our repertoire.\n\nAnyway, back to earth, I was glad to see CBS News taking up the subject and zippering together the debate about insured healthcare, the many plans, and the hitherto missing detail about whether any provision for rehabilitation and drug treatment might be in the works, for the nation's most desperate.\n\nThat was last week sometime.  Mostly I've given up on the media as incapable of connecting the dots.\n\nAs for the voter purge, I find it [beyond believable](http://worldgame.blogspot.com/2017/02/the-best-democracy-money-can-buy-movie.html) that such jiggering occurred, given Florida. Also, given tightening control over the media and less diversity in coverage, I could see why something just barely making the radar in Bush vs. Gore would fail to register all together in Trump vs. Clinton.\n\nThe [Amy Goodman cartoon](http://controlroom.blogspot.com/2017/03/back-on-grid.html) makes a lot of sense:  those in control of the narrative are not about to surrender it to outsiders who steer the conversation in different directions.\n\n\"A discussion of voter suppression right when we're having outbreaks of ethnic violence, heightened awareness of the legacy of a sorry past, just feels like it might get unmanageable so let's keep that on the shelf for now.\" Not sure to whom I should attribute that quote. \n\nAnyway, FEMA is not about to take over the voting process and put it through extreme vetting, with help from the NSA. \n\nIf we want it to be super-secure, we all need to be more educated about encryption.  That means appreciating Edgar Allen Poe more, in my book. \n\nHis detective novels helped us all learn about \"bread crumbs\" though we'd had \"treasure maps\" before.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}