{
  "id": "114124637219198700",
  "title": "FEMA Villages?",
  "published": "2006-03-01T12:33:00.000-08:00",
  "updated": "2006-11-15T11:44:16.369-08:00",
  "content": "I caught some Congress dude pointing to an aerial photo of manufactured homes (huge numbers of them) some 450 miles from ground zero (New Orleans etc.), on C-SPAN (flip flip flip).He was making a lot of good points e.g. why is FEMA just sitting on these homes, while in the meantime stopping payment on hotel rooms?OK cool, so Congress is waking up.  I'm all for it.The reason of course (for sitting on these homes) is there's this pervasive assumption among bureaucrats that people are undeserving of the valuable services they might provide.You find this in India a lot:  the greatest satisfaction is in denying others what they most sorely could use.  It's a back-handed way of meting out justice (however sick and twisted that \"justice\" may be).  At last, a way to punish, a way to be in control of others, to have some power.Or on a stereotypical English estate:  the biggest snob is the butler.  If you buy there's this totem pole or ranking system, and you're three rungs up the ladder, then no way are people on rungs one and two going to get above you, come hell or high water.  They're just scum of the earth after all.In a democracy, we're less enamoured of any totem poles in the social stratification sense.  Old timers get respect by default, because their \"been there done that\" quotient is likely higher.  We acknowledge experience.But in the lifestyle department, we take a more theatrical approach:  people live on different stages, act out in different soaps.  They're not atop one another.  More like Universal Studios:  the sound stages are laterally dispersed.Does this make any sense at all?  I think so.In the social stratification sense, I consider myself as high as I need to be.  I've got a middle income lifestyle and that's sufficient.  I like being average in that dimension.  [Ram Dass](http://en.wikipedia.org/wiki/Ram_Dass) was a teacher in this regard:  \"keep to the eight fold bath of the upper middle way\" he said (like, I wouldn't mind having a jacuzzi -- might have to up the amps to my fuse boxes though).And I use my disposable income to man a battle station.  That's a luxury, privilege, freedom, and right that I have:  to engage in battle, to make alliances, to practice the art of war ala Sun Tzu and Machiavelli.  Bucky was my teacher, but not my only one.Our democracy affords me this opportunity.  Thank you Uncle Sam.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}