{
  "id": "6391241552518074123",
  "title": "Fifteen Years",
  "published": "2018-03-25T23:57:00.001-07:00",
  "updated": "2018-03-26T14:55:09.132-07:00",
  "content": "Margo Guryan/\"16 Words\"\n\nSome channels are remembering this is a fifteenth anniversary, to the month, from when a massive PR campaign drove Americans to take out their frustrations against an enemy they'd been presented with.\n\nThe challenge was to shape the fury unleashed by 911, and turn it into something positive.  Fury and frustration.\n\nTwo of the documentaries I watched followed much the same story line, revisiting the build-up, from yellow cake from Niger to aluminum tubes from all over.  Elements within the British, German and Italian spy services, along with Iraqi expats, colluded with a DC cabal on pushing the war agenda forward.\n\nI'd been [following these stories](https://goo.gl/9CMBvb) at the time, as someone who'd always dreamed of such as Internet newsgroups and search engines.  I was like a duck to water, an early geek, weighing in as someone with a dog in the fight.\n\nBiological weapons labs, the story sources... indeed, the two documentaries were so close on these facts that they probably came from agreeing authors.\n\n[One](https://youtu.be/3fNkeOZlM4U) contained former ambassador Joe Wilson as a talking head, whereas [the other](https://youtu.be/B5FaMbnINwc) featured Valerie Plame.  In both films, the reflective intelligence professionals are chagrined by how insistent the war hawks had become, about sticking with discredited stories.  But hadn't they promised a dramatic response, in retaliation for 911?\n\nBefore those two documentaries, I was looking at long documentaries about developments in Iraq, produced by [Al Jazeera](https://youtu.be/sxhilUOdFZI) and [Real Stories](https://youtu.be/VRgpeFY5FhA).  One of these also featured interviews.  Then we had another [episode of CrossTalk](https://youtu.be/b29PWWbJ8yE) on RT.  I notice Twitter is consistent in labeling VOA as at least in part funded by a government, not unlike these other networks.\n\nWhat's been difficult to regain since 911 is much sense of a consensus reality.  Peter Sloterdijk writes eloquently (I read translations, also flowing) about our shared bubble going away, giving way to a more foam-like environment.\n\nPeople shoulder more of the overhead of having whatever beliefs, not necessarily mirrored by geographic neighbors.  The internet has contributed to making such \"foams\" sustainable (in some cases), as \"virtual nations\" in their own right.\n\nDon't expect any one institution or belief system to dominate the vista.  Expect many.  We learned of this more fragmented multi-channel reality from television, and enjoy the power a remote gives us, to select among offerings.\n\nWe have lots of [reflection and reviewing](http://mybizmo.blogspot.com/2018/03/studying-wars.html) to do.  I'm not telling anyone to turn away and forget the past.  On the contrary, lets let ourselves dive into a deeper examination of what's been happening, under a microscope, with help from a macroscope.\n\nLets get off the treadmill long enough to think back and take stock.  Why wait until you retire to ask what it all means, right?\n\nThat's what Fifteen Years is all about, reflecting, though I notice many channels can't afford the time. \"Reflect about what?\" They wouldn't know where to begin.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}