{
  "id": "2075707354043109449",
  "title": "Filling In",
  "published": "2017-02-23T23:16:00.001-08:00",
  "updated": "2017-02-23T23:49:49.902-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/32927881742/in/dateposted-public/)\n\nSpeaking of \"hollow schools\" (below), Bridgeport Elementary is not one.  The hollow schools of which I wrote are sometimes useful as gymnasium equipment, I don't deny it.  Some even foster community.\n\nAnyway, one of my team needed a sub and I'm on call to some level, we're not yet sure to what level. Usually I try to keep the day clear when I'm on in the evening, as I was tonight, closed circuit, with my adult peers.\n\nHowever, I'm wanting to be a team player and what better way to get into shape than visit an elementary school in Tualitin and lead an after school hour in MIT Scratch, for Coding with Kids?\n\nWhat tested my resolution to stay chill, beyond reports of impending ice rain, was the sudden power outage, a kind of flickering, and then a whole 90% gone, but the snake's aquarium heater still heating.  What?\n\nI dashed to the fuse box, forgetting the phone flashlight, but seeing clearly enough nothing seemed enough out of place to explain the phenomenon.  Then it dawned on me:  the three trucks outside my door working on the electrical pole across the street.\n\n[](https://www.flickr.com/photos/kirbyurner/32927874322/)\n\nThat's right: today of all days was the one a new taller pole was slated to replace the older one.  Portland General Electric (PG&E) had a team of linesmen, plus traffic control people, on the job, fortunately making quick work of their part of it.\n\nSome infrastructure is lower on the pole, probably Comcast and/or CenturyLink, with cable and/or fiber. That stuff stayed on the older pole, which they also sawed off, to maybe half of its former height. \n\nFortunately for my peace of mind, the power had come back on before I backed out of the driveway. Also fortunately, the expected icy rain was not the occasion for a jam-up on I-5.  I got back from Tualitin in time for some last minute prep for class.\n\nMy students said kind things in the chat window, which I didn't save at the end of the day.  Patrick joined us again, for more of a speaking role than last time.  He gave a presentation on his snake trap, the one he's offering to folks in the Florida Everglades, for testing.\n\nLike any inventor, Patrick needs feedback loops that amplify more than dampen, if his invention is to get off the ground.  As Quakers put it, we learn to follow God's will \"experimentally\" i.e. by means of trial and error.  Mistakes teach us a lot.\n\nI've long been thinking \"two teachers per classroom\" changes the ratio, plus didn't philosophers of old often present subject material in the form of a dialog?  Sportscasters have hit upon conversational banter as a way to impart fluency.  Patrick and I have been eager to give co-teaching a whirl. \n\nI've found it useful to cross-fertilize across my adult and kid gigs to some degree.  I'll pare down an adult Python module, then enhance it in Codesters for the kids. \n\nThen I'll run that same Codesters application for my adult audience, an exhibit in their world, regarding how kids these days learn to code (MIT Scratch, phasing in Codesters on the way to a cloud-based host, is one approach).\n\nI had Steve Holden on my Python show a few weeks ago.  He brought along some hardware devices from the UK, to control using MicroPython on a chip.  Passing the screen around adroitly is an athletic ability in itself.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}