{
  "id": "3225470695407691759",
  "title": "Finding Vivian Maier (movie review)",
  "published": "2014-08-14T13:58:00.002-07:00",
  "updated": "2014-08-15T12:50:27.851-07:00",
  "content": "One might imagine I felt drawn to Vivian as I share her obsession with \"street photography\" as they call it, though I more call it \"National Geographic photography\" when thinking about it to myself.\n\nThe controversy about her accent seems easily resolved:  you could call it \"affected\" as she went to France only later to discover her ancestral roots.  Adopting those roots and owning them was wise on many levels, including in the practical sense that upper middle class people still sucker to this day for that \"European nanny\" jazz (though these days the Philippines is the new Europe).  It pays to have a French accent when you're in the nanny business, and she had to learn hers late in life.\n\nShe had that kind of spy-like fly-on-the-wall existence that life behind a camera somewhat foments.  You get that distance, that [\"observer\" mentality](http://worldgame.blogspot.com/2005/01/inside-iraq-untold-stories-movie.html) (to quote the est Training).  One is recording for posterity, spying as if for ETs, but really for the future, and it was just hugely fortuitous that John Maloof would acquire her property at auction to start, and do the requisite archeology.  He reminds people how fun it is to discover others, and that's just as viable a creative outlet as making a big show of oneself.  Reminds me of Trevor.\n\nIndeed, he's being somewhat Vivianesque in playing the self effacing documentary maker.  People treat him with the respect of someone who's done some homework.  Vivian too, did a lot of homework, and came across as respect-worthy.  Her employers would have sensed that in wanting her to have parenting responsibilities vis-a-vis their own children.\n\nYes, developing film was messy, chemical, and a pain.  If you're a deeply private individual, as Vivian was, then piling up your negatives in good condition and putting them all in a time capsule, with some strategic letters, is not a bad strategy.   High risk, but at least doable.\n\nRemember Bucky Fuller and his \"chronofile\":  to self document in that way added a dimension to his experiment \"Guinea Pig B\".\n\nVivian achieved her own kind of nirvana in morphing herself into one of the greatest street photographers in the age before we could just upload into the cloud.  Now I think she so resonates with people like me, the common garden variety camera buff, because we share the same fascination with street photography, and the technology to make it relatively painless.\n\nOf course it helps that the pictures she took were really excellent.\n\nAs Linus Pauling said (paraphrase):  the secret to taking some really good pictures is to take a lot of them (as he said of \"ideas\").\n\nThis is a well-made documentary about an intriguing subject:  Mary Poppins meets Bridges of Madison County (OK, that's a stretch -- she doesn't meet anyone, but she does remind of Clint Eastwood).\n\nSomeone told me ahead of time she was \"plain\" and/or \"homely\" and if maybe that was why she had such a lonely life, the poor dear.  On the contrary, Vivian was photogenic and displayed a level of toughness that goes with the territory, if \"street photography\" is your game.\n\nAs for her supposed mental illness (yes, lots of paranoia, imagine today with Cyberia) and draconian child rearing techniques, lets remember this was spoiled upper middle class America and she was hired as a French nanny.\n\nThe role of the nanny was to be \"bad cop\" sometimes, giving parents a more \"good cop\" role, sparing them the need to use the rod (nanny was rod queen).\n\nSo sure, the little darlings had some PTSD under Mary Poppins, but who wouldn't under such a Scary Mary?  I'm sure Vivian could be intimidating when she needed to be but she didn't water board, lets be clear.  Hers was the wing of the OSS (or whatever spy service) that didn't torture, but maybe did stay out in the cold quite a bit.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}