{
  "id": "7885782165709646283",
  "title": "Fire Starters",
  "published": "2018-06-08T12:40:00.004-07:00",
  "updated": "2018-06-08T19:23:15.061-07:00",
  "content": "A theme in these blogs lately, has been global IC work (IC = integrated circuits) aimed at keeping violence contained, even as weapons makers stoke the fires.  Keeping old resentments alive is Satan's chief occupation, we all know that.\n\nHowever, the futurists of the 1900s did a pretty good job sketching out a world Beyond War, like on Star Trek.  Humanity still faces existential threats, like the Borg, but seems far less hell bent on self destruction.  All the shiny new technology has cheered the humans, past the point where they wanna \"press the button\".  They'd rather live to see the 24th Century and onward.\n\nHowever, a lot of humans, some with means, are not persuaded that the End Times should be further postponed.  They've put a lot of eggs in their End Times baskets, and are now wanting to see all those efforts pay off.  Before it's too late.\n\nI'm thinking it's getting to be too late, but the fire starters are still at it, getting more brazen and visible in proportion to their sense of panic.  Of course it's oxymoronic to be panicking because the world is not ending, but that's a corner the End Timers paint themselves into.\n\nWhat feels like a loss of power to many a political leader, is actually the gradual abandonment of various circuits that have carried significant voltage until now.  Attempts to galvanize large populations with a war fighting spirit is what's proving increasingly unlikely to pan out.\n\nI'm guessing the \"world domination\" meme used by Geekdom is worth inserting at this point.  The \"new world order\" (NWO) was expected to be political and to have something to do with banking. For certain Christians, we would also be meeting some [Antichrist pseudo-hero](http://mybizmo.blogspot.com/2008/09/wanderers-2008930.html), a false leader of sorts.\n\nHowever, with the emergence of cloud services, crypto-currencies, and social media, we're facing a NWO of a different flavor, sponsored by FANG and Microsoft, Chinese giants, Russian research firms.  They code and promulgate coding.  Is this the Borg?  There's lots of engineering.  The culture is global, because the internet is global, and because world problems are world problems.  \"Thinking globally\" is not a \"nice thing to do\" (or is it evil?), it's just what makes sense.\n\nThe way I'd put it is:  [desovereignization](http://grunch.net/archives/64) is already far advanced, something I believed in the 1990s, but it's not resulting in any great showdown or political climax, more just a lot of vacuous hyperbole.  The atmospherics are not one of End Times.  The sense is more business as usual and Tower of Babelish.  We're not all on the same page (so what else is new?).  We're acting out in different theaters, following different scripts.  We're OK with that.  Multiple namespaces co-exist.\n\nThose who focused more on \"context\" than \"content\" had the right idea I think.  We're still struggling with deep misery, hellish conditions, but our impulse is not to give up and blow it all up.\n\nUshering in some nuclear apocalypse, perpetrated by the Nuke Nations against the others, is not that easy when the IC is quick to learn of any secret plans.  How were you planning to trick us again?  We learn from your mistakes.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}