{
  "id": "2367751397636927767",
  "title": "Fire and Ice: Korean War (movie review)",
  "published": "2011-11-25T13:17:00.001-08:00",
  "updated": "2016-12-09T18:02:39.528-08:00",
  "content": "This two-DVD set was among the five documentaries we checked out from Movie Madness, for a small fee, due Saturday.  We've already watched them all.\n\nI'd been sparring [with Cherlin](http://controlroom.blogspot.com/2011/01/2011-day-one.html), [an OLPC guy](http://worldgame.blogspot.com/2008/12/exoterica.html), about North Korea in [some thread](http://groups.google.com/group/mathfuture/msg/47bf6b83d762bcf9) and decided to back fill with some History Channel.  Getting the North Korean point of view might take [a Clint Eastwood](http://worldgame.blogspot.com/2006/10/flags-of-our-fathers-movie-review.html) (Korean version), but in any case I learned a lot about the American historians' point of view, colored as it was by the dizzying power of being a superpower, at least in its own head.\n\nI'm tempted to say that Douglas MacArthur and Joe McCarthy were two of the worst things to ever happen to America, but then I temper [my armchair viewpoint](http://controlroom.blogspot.com/2011/11/adult-discussion.html) with the observation that both were products of their times and it's always within the power of the many to rein in the one, or should be, so blame the weak groupthink maybe?\n\nClearly those Main St. USAers weren't following too closely, as most are not today.  \n\nWho has the time?  \n\nLet Madison Avenue handle it (let advertisers pay for news, yeah good idea...).\n\nThe narrator relives the realization USAers kept having that they were not in charge of world events (such an alluring idea though).  Blaming the OSS for \"losing China\" was as dumb as thinking Russia (\"the invisible hand of Moscow\") was pulling all the strings in China.  \n\nThese simple mental models based on a smattering of loosely connected proper nouns just don't serve as reliable guides (don't constitute real thinking).  People give in to ideas not because they're correct, but because they're easy to grasp, compact, even cute (the song of the sirens). \n\nWould that intuition have a stronger hand eh?\n\nBy the end of the film (made around 1999), MacArthur has been reduced to a thespian.  His final speech before Congress is squirmy / uncomfortable in its self-indulgent cliches, many of which he coined (so not cliches then, I realize).\n\nJoe McCarthy was a terror, a bully, and Americans proved hardly able to corral this mad cow, because so infected themselves with their own \"anti-communism\".  Was there any science in that rhetoric at all?  Welcome to Planet of the Apes (1950s onward).\n\nSorry, I'm judging with hindsight and that always looks bad.  \n\nGood thing the American people started tuning out after awhile, rather than continuing to treat the Korean War as a spectator sport put on by generals in theater, like some kind of NFL.  \n\nThat's just tasteless ugliness.  \n\nWatching humans blast their own infrastructure apart out of vengeful catharsis is just to watch the death throes of a pathetic species, another life form gone astray. One hopes to tune in later and find something worth watching.\n\nWell made.  Good footage.  Tightly scripted.  What a nightmare.\n\nSpeaking of [Clint Eastwood](http://worldgame.blogspot.com/2011/11/j-edgar-movie-review.html), another documentary I got was [a.k.a. Cassius Clay](https://youtu.be/fyFWWZs-tXY), a biography of Mohammed Ali that is rather deftly made given it's in the thick of things (in the midst of wars).  It's a film that comes out boxing, dancing.  Ali was smart to have this made at the peak of his career.  Smart guy all around, a real dancer.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}