{
  "id": "6704564557407299706",
  "title": "Five Letter Land",
  "published": "2022-03-08T09:19:00.004-08:00",
  "updated": "2022-03-08T09:29:39.709-08:00",
  "content": "I was in Horse Brass again yesterday, loving Guinness.  That was after ascending Mt. Tabor, by means of the west side steps.  Then we (Dr. D. and I) descended to Belmont.  Deke was in the loop, and joined us later, from his beat.  Derek (Deke the Geek) is a generic community helper, delivering food 24/7, a discipline reminiscent of earlier gigs in less Mad Max conditions.\n\nI was celebrating a successful restoration of drivability to my car earlier.  I'd made it out to Bethany Village and back.\n\nThe little private Silicon Forest school where I field test and further develop my online curriculum, consistently with whatever they hand me, has been a source of gigs for some time.  During the height of covid I only worked over Zoom, but these days I show up in person, masked and vaxxed for my own protection.\n\nOur focus has been Number and Group Theory of the type that's relevant when developing coding skills, which these students very much are, and pretty quickly.  I like to showcase several technologies:  JupyterLab, Github, Replit.  Python features as one of many languages, not necessarily the be all end all. I'm somewhat partial to Clojure and could use some classes.  I'm 80% in student mode, 20% in teacher mode, a healthy ratio given there's always so much more that one doesn't know, than one knows.\n\nFor example, when the popularity of Wordle (which I still haven't played at the official website) took off, I found that famous five-letter word list at Stanford Graphbase.  Except at first I didn't know the size of this tiger I had grabbed by the tail.  Computer Science itself branches out from this file and some others, given the curriculum (that metaphoric set of circuit boards) we have today.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}