{
  "id": "905968166843360445",
  "title": "Flash Forward",
  "published": "2009-02-19T01:06:00.000-08:00",
  "updated": "2009-02-19T17:55:25.240-08:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/3292186750/)I was gratified to see [a Fuller Projection](http://coffeeshopsnet.blogspot.com/2009/02/in-news.html) getting front and center treatment at Cleveland High School this evening, although we were there not as students, but as supportive parents, looking forward to [the new speech and debate team](http://mybizmo.blogspot.com/2009/02/be-there.html), ramping up under the care of the Madison coach.The Fuller Projection forms a good backdrop for telling stories from the Cold War Era, like [about those radomes](http://coffeeshopsnet.blogspot.com/2009/02/pointful-gossip.html), basically radar covers, with 3rd generation models in use even today.  As Oregonians, it helps to see why that Lufthansa to Frankfurt takes such a northerly path, [over Great Slave Lake](http://controlroom.blogspot.com/2008/06/xrl-meeting-space.html) by way of Calgary.Dr. Chuck Bolton, emeritus in Sociology at PSU, brought me a recent Futurist article by one Marvin J. Cetron (Timeline for the Future... March-April, 2009).    I scanned it over lunch and agreed it seemed pretty fanciful, not unusual in this genre.  Science fiction is what you get whenever you write about some time beyond the present.Transforming possibilities into realities is a kind of alchemy, with lots of psychological elements.  [The Jungians](http://controlroom.blogspot.com/2008/07/on-individualism-transcendentalism.html) talk about sublimation a lot, even this late in the game.  Strong concepts have a life of their own it seems.  This doesn't mean psychology is all you'll need.  On the contrary, you'll want to study chemistry, biology... art, ethics.On the Wanderers list, I've been telling the story of FOSS (free and open source software), somewhat [drawing from Revolution OS](http://mybizmo.blogspot.com/2007/04/class-notes-session-two.html), a documentary. Grad students were tired of losing access to their favorite toyz, once ejected with a degree, and so used the Internet to collaborate on all the tools one would need to build an operating system (this was GNU-not-Unix), and then they built that operating system (which was Linux-also-GNU).By keeping the generic power tools in the commons, everyone enjoys higher living standards right out of the gate.  Those who put work into it, benefit from the work of that many more others.  Those that don't put any work into it, still benefit as well, presumably add value in other ways besides committing to the kernel (something I've never done).FreeBSD, OS X... Windows.  There's lots more lore.I also talk on the Wanderers list about about how we could be doing a lot more fun and informative storytelling if we'd deign to introduce SQL, a language for \"keeping tabs\":You can't explain the world to children without talking about SQL. Not really.  If this were a village, and you were the village elder, and you didn't have anything to say about core memes of the culture, left that to other elders, then we'd want to find those other elders. I have this \"take me to your leaders\" attitude, being fresh off the UFO (Princeton). I was yakking with Larry and Dave about OLPC:On edu-sig (Python Nation), I tout MDPA i.e. multiple desktops per adult, thinking more of those NASA type mission control places (\"control room\" in the language of places).  Park your laptops at the door when ye enter the workplace (or return them to the checkout clerk?).[The XOs](http://worldgame.blogspot.com/2008/11/posting-from-my-xo.html) are really for children, not adults so much, or even teens.  That doesn't mean they're not cool.In Hillsboro, we liked having the Internet through a gateway with two subnets, so we could play IP routing games.  We had a wifi option but student stations were on traditional ethernet, with an air gap between the lab and the rest of West Precinct.I've been getting some good peer review from New Mexico on my nascent \"geek versus nerd\" distinction, an exercise in systematic ideology.I'm mapping \"geek versus nerd\" to Terry' \"engineering versus science\" meme, which encourages practice, exercising of freedoms.Brian wisely counsels against hubris.I've got lots of mnemonics going.  Mostly I'm working to recruit activists for our \"circus\" (an allusion to our geek heritage).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}