{
  "id": "2931731613166100790",
  "title": "Flatlandia",
  "published": "2025-01-04T07:19:00.000-08:00",
  "updated": "2025-01-04T08:00:23.432-08:00",
  "content": "ET: Wow that sounds ambitious and like the architecture of some computer game, with levels, as we progress up the dimension ladder.\n\nYour beginning seems influenced (in the poetic sense, cite Harold Bloom) by Edwin Abbott’s Flatland, a classic piece of satire, not a math book at all, but relied upon heavily by popularizers of what became Hilbert Space retrospectively i.e. the n-dimensional playground sandbox of ML and AI.\n\nYou follow the textbook grooves pretty closely through point, line, square, and cube but then veer off in going from cube to sphere, as in conventional university maths there’s no change in dimension when a cube morphs like that into a bowling ball i.e. the introduction of curvature doesn’t add a new dimension. \n\nThe door to higher dimensions in Hilbert Space is through adding more and more orthogonals, with the caveat being: you get to confess visualization becomes difficult beyond the first three. But some high priests and gifted amateur mystics are able to witness said Hypercross, the Holy Tesseract. \n\nYes, the math goes kinda culty in this ‘hood, in terms of jargon, but in terms of analogy and metaphor it works well, as “Euclidean distance” keeps being meaningful no matter how many dimensions are involved, as does the notion of address adjacency. \n\nN-dimensional sphere packing comes with an elegant algebra. \n\nThose at home in Hilbert Space tend to do well economically. The metaphysical heritage of the British Empire. Except it’s French and German just as deeply. XYZ coordinates are quasi-universal, as is the scholastic consensus that “space is 3D”. Few ever fight City Hall on that one (Bucky an outlier for sure, and perhaps the best known of such mavericks).\n\nFlatland concerns itself mainly with a sphere talking down to a circle as I recall. The circle gets a headache trying to imagine the space the sphere is in, whereas we readers consider the sphere’s space our home stomping ground — we have the opposite problem: imagining ourselves in an entirely flat world. Is this possible? I’ll admit it’s a challenge as the tendency is to “look down” on some squares-ville meaning we’re still in god’s eye mode and haven’t yet lost the 3rd dimension. Try again?\n\nThis little comic book has to be one of the most influential tracts ever published, right up there with the theses of Martin Luther.\n\nI’m intrigued by your neutrality talk and in the background I’m thinking of “neutrality studies” a branch of “peace studies” which some colleges and universities have had a major in, although I don’t believe the genre “peace college” has anything to counter the well-established “war college” trope. My storyboard “schools for diplomats” might qualify someday.\n\nI’m saying I spontaneously connect your (|+.0.-|) neutrality talk to geopolitics, which I’m somewhat geared into. When it comes to word2vec and inter-word hyper-distance, “neutrality” definitely haunts the world stage, in the sense of “appears frequently”.\n\nI’ll be somewhat in the bleachers (innocent bystander, observer, spectator) vs-a-vs your starting over from scratch dimension ladder project, as I’m already pre-committed to hammering out my own (inherited, extending a lineage). \n\nI’m also interested in what you mean by “pre point” as we have our “prefrequency” notion in the 4D talk I espouse (4D being like a brand, a logo, me having registered 4Dsolutions.net as a domain name awhile ago). \n\nI’ll check in on your progress and see if I can make use of some of your PR. From my angle, all systems require spin and PR to have a half life. PR is akin to propaganda, that which propagates. In the old Catholic bureaucracy, which spoke Latin, there was nothing especially disreputable about the term. It only lost its neutrality, even positivity, when it became associated with the dastardly nefarious activities of that other guy, the baddie. I find English (the language) especially colored by “goodie vs baddie” ideas, which extend to colorizing the mathematics e.g. negative secondary to positive, left secondary to right. They’re imbalanced.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}