{
  "id": "8309540044558851822",
  "title": "FNB:  2010.1.13",
  "published": "2011-01-14T12:22:00.000-08:00",
  "updated": "2011-06-12T13:21:58.209-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhS_UOK9PgkSpUrGnJMfafi7pcUqxNjpxDEukEtRBDjri2HOxIsfKzyMAZMEtoHGl4fkGgT5UChmPjAkx3vaDH1XZrNPmcOKRCogjvwB0A_Xl3w0jBIxTpFTsaDsz6Kq0nJIMK7/s1600/Food_Not_Bombs_logo.png)Food Not Bombs has been in a sharing relationship with the Religious Society of Friends here in Portland since about September of 2010.  The relationship goes back a little further than that if you count our participation as a Quaker household (per directories) minus any use of the commons on Stark in a non-rental community-serving set of arrangements.  Basement storage of bulk supplies is permitted.  Deep frying is not (fortunately FNB tends to go with light steaming, as we did yesterday).  Friends pay for heat, electricity and water use for a three hour period each week.  FNB also borrows salt and pepper on occasion though with plans to replenish (I could get some [next time I visit Costco](http://worldgame.blogspot.com/2010/12/close-to-solstice.html)).I used to be dogmatic about some official FNB trailer not getting separated from Simon's cookware, but that was mostly invented bureaucracy on my part.  The stalwarts are ingenious at coming up with trailers, including making their own.  Simon, a stalwart, with history as a software developer, is pulling a new rig fashioned from a ladder.  Aaron's trailer, like Noah's in Davis, is able to haul an ass of compost, maybe several (an \"ass\" is a unit of measure in our household).Yesterday (Jan 13), I wasn't sure I'd be getting assistance (I'd done the job solo [the previous week](http://worldgame.blogspot.com/2011/01/office-note.html)).  Lindsey volunteered to assist, though she considers herself mostly a hauler (despite her vegan cooking skills).  Upon arrival, however, I was greeted by two veteran cooks already in the kitchen.  Sarabell used to work in a Quaker elementary school in Philadelphia.  Noah seemed to know his way around a kitchen.  We showed up with the produce Lindsey had hauled earlier that day.  Thanks to the surfeit of cooking talent, Lindsey allowed herself to [sing her show tunes](http://www.flickr.com/photos/17157315@N00/sets/72157622738577837/) using the social hall piano, though always mindful that her TV-14+ lyrics might be offensive to some Quakers working in the building.  She has a more PG-rated lineup when playing in houses of worship, such as during that [benefit for Sisters of the Road](http://worldgame.blogspot.com/2010/06/meetinghouse-benefit.html).[At the park](http://controlroom.blogspot.com/2010/12/from-day-to-day.html), it felt a bit like a Zen convention, as [Satya and friends](http://wweek.com/editorial/3707/14911/#PresentsOfMind) were on their way to some esoteric sitting and presentation regarding some newly translated works.  I thought about going, but then Brent very kindly offered to share wood he'd salvaged from a free pile in Washington (a clear cut).  Their native practice in that state, probably in Oregon as well, is to douse all this burnable fuel, including fresh hemlock, in diesel, and set it ablaze.  Air pollution from such waste had already driven Brent from his habitat at another time (the fire smolders for days).  He fights back by salvaging what he can and redistributing it to suburbanites who maybe don't appreciate the value of real firewood, or the level of waste their own lifestyles encourage.Brent came to the house with his maul and ax and split some [seriously big segments](http://www.flickr.com/photos/17157315@N00/5355182945/in/photostream/) right there on the patio, by the light of a partial moon (plus some electric light, which Quakers are not against using).  I now have that essential ingredient I'd been missing:  lots of kindling, as well as more burnable woods than what we'd inherited when buying the house:  a garage full of something rock hard, which Brent also took a crack at, successfully in many cases.While all this chopping was going on, Lindsey reappeared with the trailer and responded to Brent's request for broken inner tubes he might use around his ax handle (as a veteran of Bike Farm, she stocks such supplies).  Then she was off to her coven and I to my office, where my night job begins late.  I went through a few billable hours of course material before shoving the dog over and crashing.  Other household members are away. Nick, who sometimes stays in the room where I crashed, is still [undergoing lots of tests](http://mybizmo.blogspot.com/2011/01/next-frame.html).  I plan to go visit him using the green elevators.Noah didn't join us at the park as he wanted to be a part of this town meeting, called by the mayor, asking citizens whether Portland should rejoin a certain \"counter-terrorism task force\". The reason Portland is thinking about rejoining is because of mentally ill people and their nightmares, many of which have an impact on collective living standards.  People have been staging protests and vigils against terror.  It's hard to find anyone who's pro-terror in [this neck of the woods](http://www.myparentsopencarry.com/).  Many of 'em just wanna use \"shock and awe\" to eliminate terrorism, using torture if necessary. Of course the Quakers are in the minority on this issue, in wanting torture banned in all its forms (including [slow death by starvation](http://mybizmo.blogspot.com/2007/11/starvation-torture.html)).  The collaboration with Food Not Bombs is a part of our Ending Hunger campaign, the way I look at it.Speaking of which, the head of Food Not Bombs was interviewed on the radio in a program broadcast by KBOO this morning.  I missed hearing it but apparently FNB is disturbing to neighbors in some zip codes and they end up calling the police.  Here in Portland, neighbors often show up to share food and catch up on the buzz.  We discuss all kinds of [esoteric topics](http://mybizmo.blogspot.com/2009/06/favela-rising-movie-review.html), as we hail from many walks of life.  Many of us are wanderers, and enjoy comparing notes.  For example, Fallon, who made [the little Youtube](http://controlroom.blogspot.com/2010/11/made-for-tv.html) about our operation, is these days [biking around Mexico](http://pdxoaxaca.blogspot.com/), doing her damnedest to pick up on more Spanish (or Mexican -- English:American :: Spanish:Mexican, sort of, when it comes to vernaculars).[](http://www.flickr.com/photos/17157315@N00/5079267309/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}