{
  "id": "5527267878470418714",
  "title": "Forging Ahead",
  "published": "2010-01-25T22:30:00.000-08:00",
  "updated": "2010-01-26T00:11:44.440-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjDfJbje-aJ1tbf_XGCF2KTmQnPyULzekrv3CdADNWRJr4J_pn3lbvefIbgssshfC6WTSPOySRVq2RbJqKW5v5r_QZ2D7B2gSwTWNzEnbH7R1PnTZkUtKyKOYbH61sWCwtKdtWH/s1600-h/61axis.jpg):: 61-axes by vorthmann & hart ::[The Wikipedia project](http://worldgame.blogspot.com/2010/01/updating-wikipedia.html) has been going OK (SNEC helping).  I did some editing from Laughing Horse Books last night, after accompanying the collective on a recon mission under some bridges: the camp near Mercy Corps had been swept recently -- means the police had cracked down. [Dignity Village](http://worldgame.blogspot.com/2009/01/metropolitan-talk.html) and most shelters are full (need some [new ones](http://sketchup.google.com/3dwarehouse/details?mid=a4295f6b93a3e11488961f28097fe890)?).  Met up with a church team [from Tanasbourne](http://en.wikipedia.org/wiki/Tanasbourne,_Oregon), compared notes.More editing today from Urban Grind.  Then back to the Flextegrity workstation, keeping on keeping on.Koski and I have both been focusing on great circle networks.  He's got zonohedra and zero volume hexahedra to think about, some Pascal's Triangle rule.I've been revisiting Fuller's trying to superimpose his A module's plane net onto his 120 LCD triangles, a result of spinning the icosahedron around its 31 axes. David writes:\"Fuller states two possible icosahedra from the VE so 2*31 axis =  62.  The whole enantiomorphic thing. Then adds the 25 great  circles getting 87, but it is noted that the 3 and 4 axis of the VE are  redundant, the three is part of the 15 axis and the 4 is part of the 10  axis in the five fold. Since he had doubled the 31 great  circles he reduces the 87 by 14 to get 73; (3+4)*2 =14.\"He's referring to this well-known figure (in geometer circles):  [Fig. 1132.01B](http://www.rwgrayprojects.com/synergetics/s11/figs/f3201b.html). [More threading going on edu-sig](http://mail.python.org/pipermail/edu-sig/2010-January/date.html), debating ghost policies regarding whether math teacher trainings through community colleges should be \"objects first\" or not.  In Japan maybe?  Intel says it's releasing funds, but money for STEM is like black ops sometimes.  Where did it all go?Like how many young women are getting some digital math in their schools, thanks to any kind of stimulus, public or private?  Give us a breakdown by zip code area, thanks in advance.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}