{
  "id": "486959124441738518",
  "title": "Free Range Humans",
  "published": "2025-02-03T13:59:00.000-08:00",
  "updated": "2025-02-03T14:19:05.167-08:00",
  "content": "[](https://64.media.tumblr.com/e8d4d6ebc741f0491ae2c21825c3961d/6dd195335cda4e3c-9a/s1280x1920/f7d0bb6e1d5108215387c09311aa97064fdf684f.jpg)\nWhat I object to is outsiders deciding the fate of the Palestinians collectively, in terms of where they should go or shouldn't go en masse, as a managed population. \n\nThis stance that they'd stay in Gaza no matter what and fight to the last Palestinian, is mostly speaking for someone else. Sure, many feel that way, but many would love to see the world.\n\nIf Palestinians had real citizenship, they'd go where they want, irrespective of projected role-playing responsibilities. They could settle anywhere, including in Tel Aviv, or elsewhere in Lebanon, in Jordan, in Cuba, in Portland, as private citizens, welcomed by the locals through managed resettlement programs.\n\nPortland has done managed resettlement before, turning itself into Little Asia (no longer Little Beirut), or Little Lhasa as I call it, alliteratively. The merging works when you have NGOs who know how to diffuse tensions. Portland had AFSC for example, brokering relationships twixt Asian and Latino minorities, starting at the high school level (the LAAP program -- with me in a consulting role).\n\nEven if Gaza were a paradise, free of foreign rule, some would want to leave temporarily, if only to return a generation or two later. USAers have such rights. The hallmark of an Israeli is the freedom to come and go. Is it too much to ask that Palestinians should have such rights as well? \"Yes, way too much\" some will respond, with me not among them.\n\nTo me, that's what membership in a global nation-state system, centered around the United Nations, was all about providing: a set of privileges consistent with world tourism and cross-enrollment, which is tantamount to a safer world. Students and faculty both could hop from campus to campus, perhaps within the same university system, as globally distributed. A USA kid gets to study abroad. A kid from Kazakhstan gets to study here.\n\nIf you're undocumented, that means you've been left out of the human rights game and even the United Nations may not have a solution, as you have no citizenship as yet, and so no country claims you and fights for your rights. \n\nWere Palestine to have legitimized advocates on the world stage, then we would hear more voices demanding their right of free passage, on a par with what citizens of other nations are getting.\n\nOf course the ugly truth is freedom of travel has been severely curtailed by the statists, and being welcomed into the company of nations is no guarantee of citizens' right to join the jet set, or even the ocean-going ship set. \"Being documented\" does not equate to having generous travel rights.\n\nWould-be tourists of the world unite!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}