{
  "id": "6044058806199736590",
  "title": "Friday the 13th",
  "published": "2018-07-14T01:41:00.002-07:00",
  "updated": "2018-07-14T17:26:52.984-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/15624212726/in/photolist-UNpxir-UqCsa8-pNEb73-bWZhni-bPvict-bPvi5p-b89Pev-aBUhaj-9Jw4Wb-9Jw4Eb-9oKJ3p-7iN1QW-76jj94-6V6uqW-6US1xd-6TzsJT-6bigru)\n\nI've been working a lot lately, which is good, because I needed money to repair my car.  Some will think I'm crazy to sink way more money into a car than I'll be able to recoup in selling it, but I'm not looking to sell, I'm looking to drive.\n\nPresumably I'll get some more years from this 1997 sedan.  I'm not in the mood to switch horses right now.  I use the car for my business so some percentage of this repair should count as a business expense.  Chassis stuff, not engine stuff.\n\nSo today, Friday the 13th, was the big revelation that the FBI has some serious spying powers vis-a-vis Russians after all, perhaps thanks to 3rd party contractors, but what does it matter.  Either that, or we're continuing to read a lot of interesting science fiction (the stuff of spy novels).\n\nEither way, people are much more aware of how the Internet is still a Wild West.  Some degree of paranoia is warranted.  Geeks know that.\n\nThe indictment seeks property damages, not extradition.  I'm not sure what amounts would be acceptable, or whom to pay, and whether bitcoin would be accepted, however these are minor details that will come out in the wash.  Perhaps GRU employees are covered by insurance?\n\nThe story goes back to [the Guccifer 2.0](https://worldgame.blogspot.com/2018/05/reality-check.html) and APT28 threads (Fancybear etc.), and provides a lot more details. The indictment talks about a server in Arizona for example (\"AMS\"), a way station between keylogging and screen capturing malware, and those seeking to provide Americans with a much deeper look into their own political underbelly.\n\nShowing \"sausage being made\" to the lay public is definitely an undermining tactic which left people older but wiser about their dysfunctional so-called democracy (reputable academics have suggested more of an oligarchy by now, more like the Roman Empire). \n\nNo one is alleging that the leaked and/or hacked communications were forged, only that they were never meant for the American public.  The DNC's secrets sparked a lot of outrage.  The special counsel is not saying whether the election went the other way because of that.  How could they know?  Maybe voters were just sick of family dynasties?\n\nAn earlier special counsel indictment goes back to the \"troll factory\" story, which alleges it was illegal for Facebook to allow Russians to use its platform for political purposes.\n\nOnly Americans are allowed to play politics with Facebook and Twitter, and perhaps the British, owing to a special relationship.  True, [Cambridge Analytica](https://mybizmo.blogspot.com/2017/02/keeping-tabs.html) had to face the consequences of its own hype regarding its alleged election-swaying powers, however no indictments were forthcoming.  \n\nMark Zuckerberg had to promise the politicians in DC that social media would stop rocking their boat. However promises extracted under duress may not be all that binding.  Software engineers, Russian or otherwise, cannot stop social media from affecting political careers.\n\nHow exactly the Russian troll factory affected the national election remains unclear, as the published memes don't seem to stand out as especially mood-altering.  If there's a secret to election-swaying with psychometrics, its apparently subtle.\n\nWhat I remember from November 2016 was a lot of Pizzagate hysteria, which I blogged about [here](https://controlroom.blogspot.com/2016/12/a-tale-of-two-tunnels.html).  Many bloggers and tweeters were up in arms about the Clinton Foundation.  Was that the Russians again?\n\nPresident Obama kicked a bunch of Russians out of their villa (dacha), after Homeland Security and the DNI fingered RT as a foreign agent (much like the BBC in that capacity, on PBS every night).  This was after his party lost in the electoral college.\n\nHowever the Russian troll farm was not accused of working the Pizzagate vein in particular.  The example posts I saw had more to do with whether war veterans were being sufficiently cared for.\n\nThe GU (aka GRU) is accused of spear phishing and then sharing DNC chairman John Podesta's emails, perhaps with Wikileaks, perhaps with others.  Certainly those emails got out, by hook or by crook.  Whether the Russians played a role (as alleged) or not, the content was upsetting to many.\n\nEarlier versions of this election story suggested that Guccifer 2.0 was not actually responsible for these leaks (although he tried to take credit) but the current story makes the case that the DNC was:\n\n(A) certainly vulnerable to cyber-attack (that's clear, from the leaks themselves) and\n\n(B) that Guccifer 2.0 was actually a fictitious persona designed to deflect attention from specific Russian military personnel, the ones who planted the keylogging malware.\n\nThe actual indictment tends to bleep over how omniscience was finally achieved vs-a-vs the Russian operation regarding the inner workings of its spy machine.  [Skeptics](http://g-2.space/) point out that the 3rd parties are partisan.\n\n[The Office of Information Awareness](https://www.theatlantic.com/technology/archive/2015/12/darpa-logos-information-awareness-office/421635/), as envisioned by Admiral Poindexter, or some semblance thereof, may have been involved.  Stay tuned.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}