{
  "id": "620226955301822100",
  "title": "Friends of Jung",
  "published": "2008-01-18T23:11:00.000-08:00",
  "updated": "2008-11-15T02:36:13.032-08:00",
  "content": "I joined a throng of strangers, plus a Wanderer friend, to find out what J. Pittman McGehee had to say on the subject of love.I'd always been curious about Oregon Friends of Jung, having grown up a [Freudian](http://worldgame.blogspot.com/2006/05/some-autobio.html) of sorts, a focus in 8th grade (his Interpretation of Dreams in the school library), then Chaim Potok's The Chosen was fun, [Woody Allen movies](http://worldgame.blogspot.com/2006/12/superman-returns-movie-review.html), later shifting gears though.Anyway, I thought this guy did significant work, wielding those three Greek roots eros, philia and agape, mixed with more modern taxonomy ala [DSM-IV](http://en.wikipedia.org/wiki/Diagnostic_and_Statistical_Manual_of_Mental_Disorders) and with more than a dash of mainline Protestant or Christian or whatever that was (big cross behind him, in a Methodist church -- no way to escape it and besides he embraces his religious credentials).His value system grated against mine somewhat, but hey, it's not like he's my father or anything.Although he had a structure to his talk, you could tell he was exploring, learning, discovering more about himself.  Bottom line:  compassion for self (among others) is critically important.I'd gladly attend some of these other lectures I see scheduled, though not at the expense of missing my own workouts (it's one thing to watch other people work out -- I don't allow myself to just play a spectator role).And [speaking of workouts...](http://mybizmo.blogspot.com/2008/01/koski-on-t-modules.html)[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhcl0Of5km_Ve15RsmB2MZZDRWnYAxGSYu1PwhxmUxc-4BL5teFJKJa9Hiah6qSUeeza2YPl2lnFnRieve5v0JB1cbvm99WB1PzE9CGLJNO1yyib7zh_EovKTPU-u9kDco2XMt9/s1600-h/jung_parking.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}