{
  "id": "3869200936130257725",
  "title": "Friendship Societies",
  "published": "2023-05-06T11:37:00.001-07:00",
  "updated": "2023-05-06T11:37:30.598-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52802674461/in/photolist-2kmBeEs-2kmBf2p-2orZvuZ-2oscz7M-2ovoTo4-S4BvRJ-2gMf4kS-2hnVDqQ-2j8LQFN-2jgh9k5-2joi6Z9-2joZ3ko-2jxtX8z-2k5UhVv-2mktXar-2mBL19y-2ncjRH2-2nFwbsD-2oksTco-2oo2Hkt)\n\nAs a career programmer consultant and custom applications developer, I had numerous mostly non-profit clients in the greater Portland area.  The Northwest Regional China Council for example.  Portland may not be as integrated into the Pacific Rim economy as Seattle, given its relatively diminutive port facilities, but it's certainly another chip on the global motherboard.\n\nNetworking among subcultures does not require world travel as much as in the past.  Sometimes it feels more necessary to hop a jet and meet with counterparts in person.  However, when one lives in a big enough city, said counterparts just as often have good reasons to come here.  In the meantime, we have our electronics and shared stashes and repositories.\n\nProbably one of the best ways to diffuse tensions, which tend to work in favor of warmonger businesses, is to keep friendships and communications alive across supposed ideological boundaries.  Although stereotypically a source of tensions and outward war, these days a religion, such as Quakers, provides ready-made circuitry for community building exercises and other confidence building measures.\n\nThe exercise of free speech has become less of a luxury than a necessity in an age when retro Planet of the Apes tendencies wish to destroy recent gains and return us to a pre-civilization that's easier to control and/or understand.  We're able to reassure our friends that we're not ourselves participants in these campaigns to stoke the flames of animosity.  On the contrary, our network of friendship societies is about creating new workarounds.  Portland is a welcome catalyst, in providing a staging ground.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}