{
  "id": "1150334933911384361",
  "title": "Friendly Technologies",
  "published": "2008-08-18T10:30:00.000-07:00",
  "updated": "2008-08-18T10:35:31.146-07:00",
  "content": "[Quakers](http://mybizmo.blogspot.com/2008/07/together-friends.html) have been mulling over some of these new networking tools and asking themselves how these might open new opportunities for our spiritual practice.The Unitarians have been thinking about this too, my thanks to a Friend for passing along [this link](http://www.allsoulsnyc.org/publications/sermons/ggsermons/a-steadiness-of-days.pdf):A STEADINESS OF DAYSA sermon preached by Galen Guengerich[All Souls Unitarian Church](http://www.allsoulsnyc.org/whoweare/history/historymain.htm)New York City June 1, 2008Excerpt:The distinction between traditional blogs and Twitter — between answering the question “What are you thinking?” as opposed to “What are you doing?”—has a theological dimension as well. In traditional terms, religion has usually been understood as a set of beliefs or a body of doctrine, which believers are called upon to accept as true. These beliefs are typically described in an inspired scripture and compiled into an authoritative creed. The liberal tradition in theology, initiated by Frederich Schleiermacher in the late 18th century and clarified by William James in his lectures on religion at the dawn of the 20th century, insists that religion is not mainly a set of beliefs. Rather, religion is first and foremost a way of life.If this is true, and I believe it is, then the ultimate religious question is not “What are you thinking?” but rather “What are you doing?” If you want to know what we think is important, look at how we spend our time. If you want to know what we value, look at how we spend our money. If you want to know what we believe, look at how we live.I recognize some of Galen's themes in [Karen Armstrong's](http://www.grunch.net/synergetics/aphiloview2.html) writing, when she talks about the importance of practice over simply believing stuff.  I would add though, that blogs don't have to be about one's opinions, may also be a chronicle of one's doings or whatever.  But he's right that bloggers tend to be opinionated, use their blogs to register these opinions (in my case, that means lots of [movie reviews](http://controlroom.blogspot.com/search?q=%22%28movie+review%29%22) for example).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}