{
  "id": "7030867854486938783",
  "title": "From the UN to VNs",
  "published": "2024-10-16T05:07:00.000-07:00",
  "updated": "2024-10-22T21:36:40.382-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/54070154382/in/dateposted/)\n\nI’m not the first to remark that the hallmark of USA nationalism, at the peak of American confidence (we can say hubris), post WW2, was its internationalism. American Express. Pan Am. TWA. The United Nations even. Liberalism embraced the UN but then the UN was in New York and seemed plenty American. What had been American schools overseas (with that “A-word” in their name) became International schools (A became I). The American School of Manila (ASM) became the International School of Manila. That’s one that I attended (Class of 1976). We just held a reunion in Dallas, which I missed (I’ve been to one), but enjoyed vicariously through Facebook.\n\nFast forward and the whole nation-state system lacks much confidence, as when borders become too fluid, they simply snap, and then people don’t know if their citizenship means anything and they start to look for new roosts, perhaps within the bowels of an avuncular mega-corporation if such can be found. Become a salaryman first and a citizen a distant second; that’s one strategy I’ve seen. Survival being the goal of course. Many turn into refugees.\n\nIn the Quaker sphere, we often speak of the refugees we’re always getting from other religions. Some megachurch will implode or explode, due to scandal or other loss of reputation, and families start looking for more ideological security. Unprogrammed Quakers pride themselves on how sparse a brainwashing one needs for Inner Light training. The ideological baggage is fairly lightweight and involves doing, more than believing. Join committees and run a business, the Meeting itself, with your peers, role modeling Good Order. See? Easy peasy. Take your inner light training out into the world.\n\nHowever Quaker meetings are not all encompassing when it comes to one’s lifestyle. They don’t provide livelihoods directly, meaning committee positions are unpaid, up through and including the Clerk (like head pastor). All these roles rotate, if it’s your typical functional Meeting, with Nominating Committee recruiting a next cast, for Business Meeting to approve. \n\nSo Friends still need jobs, a source of income. We didn’t have UBI yet in 2024, although the old folks had their SSI (social security income) in many cases, in addition to whatever pension. Which is where citizenship comes in again. We’re back to nation-statehood, and ROI (return on investment).\n\nWhat was eroding the UN were: fluid borders and the shaking loose of families from any security network called a nation. We’d lost nations before, such as Prussia. Plus they had often drastically changed in size (look at Lithuania). \n\nBut that kind of churning was a result of warring, and the whole point of the UN was to impose a freeze. Let’s give our states true self determination, post-colonial self respect, and focus on development instead of warring. That was the vision. \n\nBut in 2024 we’re back to churning. The head of Israel is saying Israel’s neighbors are not real nations. Ukraine was unable to sustain its former unity. Yugoslavia had ominously disappeared in a rain of NATO bombing.\n\nTo paraphrase the opening of Grunch of Giants, the author wrote: “I could see from a young age that the nation-state system, as crafted, was not designed for a world that works, as the ethnicities would continue with their culture-clashing and refugees would be everywhere, as humans scrambled to survive aboard their little spaceship. So what I resolved to do, starting around 1927, is tell the world I was working for all humanity, messianic as that might have sounded, but I was thinking more through architecture than religious revival. Having put myself on the spot in that way, I would no doubt grow as a person.” \n\nFuller avoided cult leader status by joining the ranks of great writers, where one has fans more than followers. Here is where many will part company as they’ve checked out the writings in question and found 'em far from great. Here’s an engineer speaking in stilted terms, having never bothered to learn his mother tongue sufficiently, is often the reaction. \n\nSynergetics is the kind of book an impatient reader slams shut, maybe because they’re not categorizing it correctly. Think of works by Joyce, Pound, David Foster Wallace… their writings were “experimental” in nature, a word Quakers also use. The difference is that Synergetics is consciously about focusing on generalized principles, meaning it’s designed to have pragmatic consequences.\n\nIn response to a nation-state system likely headed for a train wreck, Fuller got to work in the early 1920s on a new mindset or framework, involving conceptual art informed by solid geometry. The UN building in New York could gaze upon a Geoscope in the East River, an illuminated global displaying global data. The whole of Manhattan might be domed over, saving on heating and cooling bills if you do the math, as it’s all about surface area to volume ratios. A city of skyscrapers is built like an old fashioned water heated radiator. \n\nWould the Geoscope ever happen? No. Is New York domed over? No. So was Bucky a failure? No. This was conceptual art, working on the mind of the beholder. Instead of the Geoscope, we got Google Earth. And we do all live in domes: they’re called skulls.\n\nWith the crumbling of American self-confidence, typified by the shock and revulsion over the raging battlefields, killing fields, and slaughter zones, that sense of being rendered a powerless bystander, its version of globalism, its internationalism, crumbled as well. \n\nThe UN had been a big part of that. The bright futurism it represented, a kind of globalism, was draining away, and with it went yesteryear’s brands of cosmopolitanism.\n\nThe standard narrative of the time was a new “right wing” nationalism was springing up in an effort to save a crumbling system from complete collapse. This could only be accomplished by control over borders. The old timey boomer liberals, raised in the Age of Hubris, were vilified as holdover “leftists” which meant “globalist” in some distasteful way. Resentment of the younger, towards the older, was based on that sense of inheriting only failed, loser ideologies.\n\nAs a boomer myself, I saw Bucky as Boho, i.e. Bohemian, from a prior crop of Greenwich Village hipsters that he got to hang out with, Noguchi in particular (they were best friends). He had his cohort of eggheads and patrons, his Cold Warrior friends, both in and outside the Pentagon. \n\nMy generation came later, growing up through a time when Manifest Destiny was being challenged. The legacy of the colonial period, when Europe believed it owned the world (Doctrine of Discovery), had become burdensome on the United States. The conquest of the Philippines led to the General Lansdale era, of guerrilla warfare and counterinsurgency, mixed with narcotics trade as we called it. Capitalism’s Invisible Army.\n\nHaving experienced American internationalism in its heyday as a youth, I could see the writing on the wall as well. As early as 8th grade, I was reading about the Club of Rome in dad’s Futurist, and thinking about thinking globally while acting locally. I took it for granted that “thinking globally” was a thing. Didn’t Wendell Berry say it wasn’t a thing? He was more in the Schumacher Small is Beautiful school. Bucky wasn’t so committed to a particular scale. Big could be beautiful too.\n\nThe transitionary phase has been characterized by those Big Brother mega-corporations and the safety net those have provided their CEOs at least. Some might be worker owned. They have budgets the size of nations. They have a secular orientation that keeps them from competing for religious faithful. Keep to the religion you have, no one will insist you “convert” to anything. Skip ahead to a new religion if you wanna though, or resurrect an old one. Page forward. Page back.\n\nThe upshot is today you find families in “virtual nations” (VNs) who think it’s OK for junior to be reading Grunch of Giants and picking up some of that Synergetics. The Bucky Boho stuff, reinterpreted through the boomers, and passing on to Gen X, Millennials and so on, comes with a world map and a habit of doing data science, in a format branded as World Game, which has continued to evolve. Whether Uncle Sam rejoins the living is a different question. In my iconography, that’s happening, via USA OS, a whole literature. \n\nBut it remains to be seen how we want to address those border questions. Citizenship is not a function of what country one happens to live in, in so many cases. Expats help us focus on creating the new rules in new games.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}