{
  "id": "5385114743349704042",
  "title": "From Fred Meyer",
  "published": "2009-10-25T16:13:00.000-07:00",
  "updated": "2009-10-28T16:45:36.434-07:00",
  "content": "I'm in the downstairs dining area sitting with Leslie H. who is busy grading papers for the health studies class she's teaching.  We're catching up a little.Last night I joined a large group of well wishers at Mississippi Pizza to say bon voyage to Nirel, about to launch on one of the big adventures of her life, which she's planning to [blog about](http://www.nirel.mobi/India/).  She'd shaved her head in preparation, called it [a \"mohawk\"](http://www.flickr.com/photos/17157315@N00/4045532502/).There I met a science teacher from the new high school in Hillsboro, which has a state of the art facility [for home economics](http://mybizmo.blogspot.com/2008/11/town-meeting.html).  I shared my concept of producing [cooking shows](http://controlroom.blogspot.com/2009/06/cooking-show.html) ala Julia Child, multi-ethnic, imparting a mix of culinary and TV-making skills.  You could even see it as chemistry.I then headed home for my Ubuntu laptop, the Starling-1, so I could maybe get some work done from Muddy Waters, while Lindsey brute forced through her set, despite a rather nasty cold.  Greg and I got to talking about geometry, paper folding, pin ball machines and computer programming among other things, also Kodak's reputation for being rather [slow to adapt](http://controlroom.blogspot.com/2008/07/epcot-makeover.html).  Future shock is [sometimes shocking](http://controlroom.blogspot.com/2006/01/power-of-nightmares-movie-review.html), even for futurists.  Get ready for a next generation of \"3D\" movies (director Cameron of Titanic, Aliens 2 fame has one in the wings; science fiction).Speaking of futurists, Dr. Bolton (emeritus) filled me in on some of the latest thoughts in The Futurist over Thai food the other day.  We'd missed the surprise party in their honor, mom just back from lobbying Congress in Washington DC.  Chuck and Mary are old family friends, were aware of [my dad](http://worldgame.blogspot.com/2009/01/about-chicago.html) at the University of Chicago before I was born there.  The Boltons used to own [that rustic getaway home](http://worldgame.blogspot.com/2005/04/morning-mail.html) overlooking Hood River from the Washington side of Columbia Gorge, where Dawn and I went on our brief honeymoon in September of 1993.I posted one of my \"[once again, from the top](http://mail.python.org/pipermail/edu-sig/2009-October/009616.html)\" kinds of posts to edu-sig, explaining what I think I'm up to regarding education reform.  You'd think The Futurist would have explained the [concentric hierarchy of polyhedra](http://mybizmo.blogspot.com/2006/02/valentines-day-2006.html) by now.  I recall Applewhite writing an article in that mag many moons ago, [pre Chemical Intelligencer](http://www.4dsolutions.net/synergetica/eja1.html).  Next time I'm in a well endowed library, I should try digging that up.I've been digging out my basement, having gutted the garage, coming across some old papers, including the [rejection letter](http://www.flickr.com/photos/17157315@N00/4033639605/sizes/l/) from the Guggenheim Foundation (Ed had encouraged me to apply).  I'm reminded of an episode of Family Guy when I see that ([fifth paragraph from the end](http://mybizmo.blogspot.com/2009/05/recap.html)).  I may be smart, but I also sometimes come off as [kinda kooky](http://www.flickr.com/photos/17157315@N00/4047493858/), or quirky as Ed put it.  Or just call me a freak of nature, helping to [keep Portland weird](http://worldgame.blogspot.com/2008/06/staying-weird-in-portland.html).I'll end with a quote from Wittgenstein (many thanks to Sean, for digging these up):From Culture and Value, 1931: “The solution of philosophical problems can be compared with a gift in a fairy tale: in the magic castle it appears enchanted and if you look at it outside in the daylight it is nothing but an ordinary bit of iron (or something of the sort).” CV 1931, 11.... and with this Youtube about [a new extreme sport](http://www.bestofyoutube.com/story.php?title=cross-country-snowboarding) (with thanks to Dave Koski).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}