{
  "id": "5839054130615848244",
  "title": "Game Theory",
  "published": "2022-07-26T22:34:00.001-07:00",
  "updated": "2022-07-26T22:47:13.622-07:00",
  "content": "Those into sports know what it means to root for a team.  Sometimes, if coming to a sport from the outside, there's a default sense of neutrality.  Why root for a team so soon?  Why not watch the game for awhile and learn the ropes.  Pick a team later.\n\nSports tend to be neat and clean in terms of pitting two teams or two individuals against one another.  The action is easier to follow that way, not to mention the rules.  Once the sport goes to three or four bodies, the complexity gets pretty intense, which doesn't mean there's no point thinking about them?  On the contrary, more thought is needed.\n\nReal life often offers this multi-polar prospect:  many teams or gangs or companies or crews, all vying for position, and in some cases seeking to advantage one another, as teams will join meta teams. The vista may contain a lot of roiling and boiling, a lot of dynamism.\n\nWhat sometimes gets difficult in these multi-player games is figuring out what teams are really fighting what other teams, versus putting on a show.  Team A perhaps makes a big show of fighting Team B, in order to deceive Team C, whereas in actual fact, A and B are on a meta team together, and their seeming opposition is more about outing their adversaries in the C group.\n\nLike if Bob is actually in cahoots with Alice, yet they portray themselves as opposite poles, then if Eve goes to Bob to betray Alice, Bob might tell Alice.  Eve is caught in the middle with nowhere to go, but may not realize it.  She may believe she can play one side against the other.\n\nThe matter of secret understandings and hidden alliances is often a source of paranoia.  The computations get too intricate and a player may blow a fuse.  Conspiracy theories break out at this point, widely shared or closely guarded.  If the theory is testable, then it may not be crazy.\n\nThese same dynamics play out on soap operas, in families.  \n\nSometimes a public stance of neutrality, broadcast to all players, is a best way to stay sane, with backdoor attempts to undermine neutrality thereby countered.  Public declarations of transparency open a space for whistle blowers and ongoing revelations.  Exposing truth is more a process more than an end state.\n\nAm I planning to map all this theory to any specific situation on the ground?  Not at this point.  I'm just looking for patterns.  In my minds eye, I'm flitting between situations, some geopolitical, all psychological.\n\nActs of kindness, without strings attached, no quid pro quo, sometimes come across as confidence building measures.  \n\nTeam A wants to reassure Team C that their stance is not adversarial.  That's all find and good and yet who speaks for the team?  Does it have the one captain?  Does it speak with one voice?\n\nObviously, the big unknown in these equations is the level of trust.  What has an agent (acting party) come to conclude regarding the predictability and consistency, of either an adversary or friend?  \n\nWhether to consider another team adversarial or friendly may come down to decisions based on history, track record.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}