{
  "id": "1380705803694506228",
  "title": "Gay Pride 2019",
  "published": "2019-06-16T15:46:00.001-07:00",
  "updated": "2020-04-27T23:44:49.908-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEizJJC5w5wuWxFLRb6ReSHRAFA_7Jmj9LC1yhkoiQF3DqyGFsmT5i7G1do7FtBpgWYKjuhi0NzaCHBgjMebu51eDFUCRpXsalPATEs1lIEZpPC4tMDLpjEi9TKrytJWEuBf_NvD/s1600/48075536461_6b0c32c7f4_z.jpg)\n\nThe exercise was needed and Patrick & Quinn (the beautiful dog) were my perfect walking buddies, down to the waterfront, west side, over the Hawthorne bridge and back.  At 11:30 AM, the parade was already coming in.  We stood on SW Pine with the crowds, west side.  Leela joined us, arriving on the 14.\n\nI wasn't in a frame of mind to party hearty myself, as, like many of my peers, I'm wondering if I need to be leaving the District's jurisdiction.  That's my name for DC (\"the District\"), shades of Hunger Games. I made out [the $12.70 check](https://controlroom.blogspot.com/2017/03/psychotherapy.html) owed to the IRS.  My loose end for 2018.\n\nWould the Oregon Curriculum Network work better in some refugee camp?  The local economy's autoimmune system might need all this Bucky stuff to come from elsewhere. [Github](https://github.com/4dsolutions/) is in the cloud anyway, ditto [Youtube](https://www.youtube.com/user/kirbyurner/videos).\n\nSo might this be a good time to leave the country?  Carol is thinking she might move back to California.  I used to talk Costa Rica, when expressing my disappointment to Applewhite (we'd talk on the phone sometimes, between in person visits -- he only came to Oregon [that one time](http://grunch.net/archives/171), that I know about).\n\nThis subculture was enjoying itself, having a good time, celebrating.  There's lots of wealth on display, both individual and corporate. This is the face of the current establishment. Very theme park, very carnival, very mainstream.\n\nParents with kids in strollers were everywhere.  The heteros are like just another letter in LGBTHQ...  -- and might white be a color too?  Full spectrum attained!\n\nNot so fast.  If I zoom out to the surrounding culture, I find others running somewhat counter to this one, which I'm in principle fine with (the devil is in the details).  A lone preacher with a Fear God flag shared some ministry, but his was token protest, quickly countered.  \"Love\" is a fighting word.\n\nFor my part, I don't think unicorns and rainbows in some code language need to dominate around the world.  No one code language needs to rule them all, not Python, not even Pharo.\n\nWith that much power and influence already, lets remember to make space for true diversity.  Even where it's perfectly OK to be gay (whatever that means exactly), you might wish to speak in different codes, extending to different dress codes.  The permutations are endless.\n\nThe days of victimhood are over (oh I know, it never feels that way, for any of us really).  The peculiar way queerness (fades to weirdness) expresses itself in Portland does not need to be any kind of global template for Tehran or Kiev.  But then memes spread (two way streets).\n\nI may be [a globalist in some sense](https://controlroom.blogspot.com/2019/02/what-is-globalism.html), but I'm not for steamrolling indigenous cultures.  As pretty much always, it's the missionaries I least the trust (the ones with an agenda to propagate some faith and practice), as distinct from citizen diplomats (with an agenda to reach agreements and get along).\n\nFor one thing, Portland (\"Stump Town\") at the end of the Oregon trail, was settled by pioneers escaping tyranny.  The club scene, cross-dressing, drag queens and so on, is so much a creature of history.  The Pacific Northwest has its own local stories.  Vaudeville.  Burlesque.\n\nI didn't see a single sign against any war with Iran (anti Keystone pipeline, check, solidarity with native Americans, check).  That would have seemed out of place.  These happy summertime party animals don't watch much war theater.\n\nThey're not home watching the burning tankers on CNN, with all the customary telling us what really happened.  Not when we have Netflix.\n\nWhat part of zero credibility do they not understand anyway?\n\nLeela had that positive spin on things.  This is a vibrant, healthy culture and if you randomly query (heh) any of them (us), they (we) would have nary a word in support of a vanity war to showcase weapons.\n\nIt'd be madness to start a war with the population in this mood.\n\nBut that's the thing:  madness doesn't seem to be \"a thing\" (a barrier) when it comes to what's on DC TV these days (what it sometimes means to be mad: you don't know it).\n\nMy parents liked being out of the country because, yes, it's a militaristic place.  Wears on one's soul.  I feel an urge to detox.  Get to some breathable air.  Life in the Lower48 can be suffocating.\n\nI don't have any simplistic view that we need to demonize any specific ethnicity.\n\nThere's something sick about this culture, true, but I don't pose as the answer man as to exactly what or why.\n\nA symptom is Pompeo at the podium, already all-knowing as to whom to blame for the tanker attacks.  The attack on Syria, in retaliation for the White Helmet hoax, the attack on Libya, the attack on Iraq... with a track record like that?\n\nHowever \"diversity\" is sometimes a slippery concept.  Are we saying no one has a right to be offended by our ways?  I'd say that's precisely not a right.\n\nDefying cultures that seem to want to take you over is a natural response.  Taliban defend their turf, I get it.  No abortions in Alabama.  Mormons might have three wives.  Eradication need not be the name of the game.\n\nGun toters on horseback need their Wild West enclaves.  Don't we have enough geography to keep the different lifestyles going?  How has that worked out up until now?  Lots of bloodshed, but some successes.\n\nMaking travel and tourism easier, and not militarized (as in \"tours of duty\"), makes it more likely people will sort themselves into compatible groupings.  Catalyze the Global U curriculum by making work/study travel more commonplace?  Go by bus, train and ship too.  It's not always about airplanes.  Truckers for Peace.\n\nThe only reason I voted for Obama was to support his plan to cement a peace with Persia.  I've been working on that myself.  He kept his word so I even voted for Hillary, as a favor, despite Libya, because that's what he wanted us all to do.  But what have politicians to do with anything anyway?  They're the scapegoats the screenwriters put out there.  We all love a good Punch & Judy, right?\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiJZYtXTygip70RjWl3Kr6nM-lTIQZ85fr-l_9JVFOkkM9OxaYnvennr1ooxNb_yYF3EGRw6LhJBFKY4wyZLAWtNMrDAygEXnjfggyGXHV26hUVvfdyxFJ6TDJtKWHf0cSAAjAp/s1600/48075537696_52238862a5_z.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}