{
  "id": "2292418180556260055",
  "title": "Gazans to Guantanamo?",
  "published": "2023-10-16T08:06:00.005-07:00",
  "updated": "2023-10-18T08:37:54.256-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/5497827059/)\n\nI understand the calls for Guantanamo to serve as New Gaza for now, with the cruise ship flotilla bringing thousands of Palestinians to their new temporary home. I don't know if Cuba has contacted the State Department about this proposal. \n\nGive WDC a chance to do the right thing maybe. I suppose it's the Pentagon, not State, that should get to say \"absolutely not\" without even thinking, based on its reflex conditioning. \"No means no\" doesn't mean Cuba shouldn't get its land back. What's critical is to document the reactions for posterity.\n\nThe military is gearing up for rule by AI some suggest (the \"singularity\" is coming!).\n\nGuantanamo is a huge base of operations, not just a torture camp, and Cuba has been dreaming of ways to repurpose it to serve the world more auspiciously. Cuba has chafed under its reputation as a world torture capital, thanks to the Spanish American war era forced annexation and absorption by the IBC (Imperial Borgian Complex (\"resistance is futile\")).\n\nMaking Guantanamo and maybe Okinawa into permanent refugee camps (with lots of turnover) would not be that different from their current role as military socialist IBC R&R destinations, just a tad more serious minded and concerned with the big picture.\n\nThe idea of a New Gaza is it gets you back on your feet, but not as a helpless militant with a narrow specialization. The kinds of training offered in an Asylum City amount to usable skills, applicable anywhere. This is not another School of the Americas and we're not stoking future violence with nasty ideologies glorifying same.\n\nThe Gazans and Cubans are expected to get along, as fellow long term victims of BDS on a world scale. Both ethnicities have used a lot of ingenuity to cope with their oppression by AI over the decades.\n\n[](https://www.flickr.com/photos/kirbyurner/52318042611/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}