{
  "id": "1611147199130839099",
  "title": "Geeking Out",
  "published": "2016-08-24T15:33:00.004-07:00",
  "updated": "2016-08-27T20:40:58.773-07:00",
  "content": "Down in the basement, [in the VML](http://worldgame.blogspot.com/2016/08/vml-verboten-math-lab.html), I've got the Raspberry Pi cranking on installing a free GLUT. That's a library Adrian Rossiter depends on for [his antiprism](http://www.antiprism.com/), or at least the antiviewer component thereof.  He thinks it might work.  I promised to update him on [my progress](http://worldgame.blogspot.com/2016/08/pov-ray-on-pi.html).\n\nSo far the installation is going well, thanks to [these clues](https://www.raspberrypi.org/forums/viewtopic.php?f=33&t=72654) for installing freeglut3-dev, after which ./config, with no other switches, reported \"good to go\" on antiviewer.\n\n[](https://www.flickr.com/photos/kirbyurner/29132591521/in/dateposted-public/)\n\nCarol (WILPF) is out with Barbara (WILFP), at Denny's, \"the America I believe in\" as Carol put it, going out the door.  She doesn't believe in this \"other America\" they're outing by snailmail.\n\nShe's getting around more slowly, I think still quite strong.  She needs another checkup tomorrow.\n\nI met with Friend Leslie last night to sort out health care issues, and then Nat, an expert on autism.  I suggested he check [this Youtube by EBN](https://youtu.be/GRj7-Ymrh5E) for all the characteristic movements it invokes, through the magic of video editing.\n\nI held court at The Bagdad, these two appointments back to back.  Leslie connects to FCNL, the Quakers' lobby.\n\nAlthough I've found ways to install gcc 6.1 or one of those, the gcc version on standard Jessie (the Raspian distro) should be OK, says Adrian.  I'll go downstairs and resume operations in a sec.\n\nCarol and Barbara work with WILPF (Womens International League for Peace and Freedom), over a century old by now.  Mom went to their [Centennial in The Hague](http://controlroom.blogspot.com/2015/09/wilpf-festivities.html).  They're mailing around the poster shown below.\n\nFunny how what used to be treasonously cynical criticisms of [the Pentagon](http://mybizmo.blogspot.com/2006/08/mathcasting-about-phi.html) have now become marketing memes.  \"Animosity towards Russia is good for business\".  Yeah right.  \"Yes it's [a jobs program](http://controlroom.blogspot.com/2015/10/diplomatic-gaffs.html).\"  \"Yes it's 1984, did you have any better ideas?\"\n\nI see a lot more promise in [the space program](http://mybizmo.blogspot.com/2016/07/meanwhile-in-outer-space.html), where we continue in the tradition of Apollo-Soyuz.\n\nI'm surprised the DoD still finds many scientists willing to sacrifice their reputations for what's empirically speaking a dumb campaign.\n\nAround the Beltway you'll find anything for a price I suppose.  Maybe that's why more think tanks have moved west (e.g. Stanford)?\n\nLeave the legalized / sanitized media to practice their pseudo-science and witch doctor rattling (no offense to real witch doctors).\n\nYesterday I paid a visit to the Veteran's Administration hospital and got the above pictures.  My friend served in Vietnam, but he's not disabled but for the dental problems.  He's therefore only eligible for tooth extractions at above market rates.\n\nIf Americans don't want as many refugees to seek refuge here, there's always being more up front about how we're poor. Uncle Sam is broke and it shows.  Why come here of all places?  I think many refugees know that, and are staying put or walking elsewhere.\n\nThis morning I worked with NPYM's cloud provider to get to the bottom of an email glitch that's been driving our Secretary wild.  We may have gotten to the bottom of it finally, a faulty Mx record on their end.  Time will tell.  I was on the phone for some time, bouncing around in tech support world.\n\nWorld news:  attack on the American University in Kabul, where one of our Thirsters is on the faculty; big earthquake in Burma; another in Italy; teenage girl in a cross walk hit by driver with suspended license doing like 50 mph on Hawthorne Blvd. \n\n[](https://www.flickr.com/photos/kirbyurner/29083420622/in/dateposted-public/)\n\n[](https://www.flickr.com/photos/kirbyurner/29145538992/in/dateposted-public/)\n\n[](https://www.flickr.com/photos/kirbyurner/28615075033/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}