{
  "id": "3632066056387831566",
  "title": "Geek Speak",
  "published": "2020-10-17T23:20:00.005-07:00",
  "updated": "2020-10-18T10:43:03.653-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/50500145592/in/dateposted-public/)\n\n:: world domination ::\n\nGeeks were collectively smart enough to start down the World Domination road some decades back, and have since lapped the track a few times, owning a next virtual reality time and time again.  Each time around, we make a great leap forward, to sound Chinese about it.\n\nYou know other geeks like you, working for other bosses, using a lot of the same tools, are spreading a global culture, combining many languages and ethnicities.  You've developed a shared namespace, a vocabulary, a set of concepts.  You've been working on Codes of Conduct.\n\nHowever, like most everyone else, the geeks tend to not distill themselves as a class, as their conditioning is they're nerds, and therefore working to fit in, to gain in popularity, to become more socially accepted.  \n\nAs nerds, they may even want revenge, for their outcast status.  But as geeks?  What's the difference?\n\nIn my lexicon, a geek is a fully matured nerd, meaning early introvert tendencies have largely been transformed into social and media skills, and increasingly, diplomatic skills.  \n\nRelative idealists sometimes have an easier time communicating, as they're not in need of more secretive agendas. Once you're playing poker, you have to factor in more game theory, including calling a bluff.\n\nBusiness transactions happen faster against the background of shared values.  You're on the same time, as Humans in Universe.\n\nWe've talked about some of the buffer zones, in Germany, in Korea, where a kind of reunification in cyberspace creates new opportunities for identification. Hackers live on the edges, connecting and reconciling. They're regarded with suspicion, because of the invisible worlds they frequent.\n\nIf the code is all open source, freely fixable and upgradable, then one has the basis for an economy, in terms of accessible tools and marketable skills.  The hackers found a way to survive, if not always thrive. They inhabit an underground, complete with comics.\n\nWe call it a \"gig economy\" and are working on a safety net layer, as actors aren't always working on a project.  We remember Education Automation by RBF, about freeing us, as scholars, to study.  Andrew Yang and MLK pop up in our conversations.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}