{
  "id": "4223843641994961136",
  "title": "Gender Pride Day",
  "published": "2015-06-14T12:45:00.002-07:00",
  "updated": "2015-06-15T07:43:43.073-07:00",
  "content": ":: gay pride 2014 (rerun) ::\n\nI'll call it that, given today is Gay Pride Parade in Portland, and Prairie Home Companion, on the radio now, has been appropriately Seattle / Northwest based.  Is this a rerun then?  [As of yesterday, sure](http://prairiehome.org/shows/june-13-2015/).  Dang but Garrison is good.\n\nHe just advised a guy to go for same-sex marriage next time, funny marriage counselor skit.  All morning were poignant \"dad\" stories on NPR, well made.  I found myself admiring radio as a medium again.\n\nThat's right, unlike last year when I photographed Gay Pride on a somewhat rainy day, capturing Congressman Blumenauer and some others, this year I'm kicked back in an easy chair (\"... of computer science\") with my dog and the radio.  Having a case of Achilles tendinitis (self diagnosed) is a contributing factor to my relative inactivity. \n\nCarol wanted to walk home from Stark Street Quakers (SSQs).  I drove her there at 9:40, bright sunny day, great for a parade.\n\n\"Gay\" does not even begin to cover the full pantheon of \"Queer\" or as some say \"Pan\", the parent class, most inclusive, from which the subtypes derive.  Remember that genders turn off and on and that the asexual dimensions are often the most textured and nuanced.\n\n\"Turned on\" states, even friendly-flirtatious, often feed the exaggerated caricatures more easily, so those working against stereotypes will often do so in a more business class persona, at least around Portland, which has an eclectic Central Business District (CBD) and everything.\n\nBend gender at work, where it matters, not at the bar, where no one cares (in a liberal town like Portland, it takes a lot more work to get stares, so your mileage may vary).  That would be my advice to gender activists.  However, work includes business lunches and being out in public, so I'm not drawing a hard line.\n\nWhile kicked back, I'm conversing with other math-teachers, or debating in some cases, on [the issue of multiculturalism](http://mathforum.org/kb/message.jspa?messageID=9796749) (is that an issue?) and \"[technology in the classroom](http://mathforum.org/kb/message.jspa?messageID=9796748)\", both perennial themes.\n\nLast night I was catching up on work-related studies around Cython, the basis of Sage, and I-Python Notebook in synergy therewith.  Cython is a hybrid Python + C that \"compiles\" to C code that in turn compiles using a C compiler.  Sage is developed in this language.\n\nIn this mode of work-study, I have Safari open on the Samsung tablet (Galaxy 3) and an I-Python Notebook on the laptop.  Same chair (\"... of computer science\").  I'll read for awhile, then tap tap on the computer, read some more and like that.\n\nNor do I have a working camera this year, as of yesterday.\n\nThe Fujifilm XQ-1, black, which I adore, suddenly no longer powered on, after a bright morning of fun shooting.  Taking pictures is such a big habit of mine that I was almost right away on the phone to Camera World, where I bought it under a year ago.  An hour later, I was downtown at the store, having it shipped for repairs under warranty.\n\nGood timing for [seeing Ex Machina](http://mybizmo.blogspot.com/2015/06/ex-machina-movie-review.html), before driving home.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}