{
  "id": "6064776682394017859",
  "title": "Geometric IQ",
  "published": "2022-02-14T09:48:00.011-08:00",
  "updated": "2022-02-15T00:11:23.481-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/a/AVvXsEgg1fekCueUAkABUxyWvQGXd8EVQe-g-RsdxpvxmWjscM0s1BryEotODntu9ObEpUdWdx6qHpFrM2P1jK_14NOqnB7VlQdziJiPBtD0Jk4mIDA5DLn42LYWwItQi0E6duzY6GBa7Ba5SYT1790G_CDgjoRK8ivNxAoG5TCN7OfNRdhDB_PyQQ=s400) \n\nWhen I was growing up, I picked up on the \"multi-dimensional meme\" \nand on how \"thinking in higher dimensions\" was a hallmark of geometric \nIQ or something along those lines.  \n\nI'd say that's still the \ncase, and when people first encounter Bucky's 4D lingo and connect with \nhis being a recognized genius, past president of Mensa and so on, they \njust assume he's thinking \"multi-dimensionally\" too, like one of those \nsuper smart people, or at least intuitively gifted people.  And in a way, he\n is.  But in what way?\n\nSince studying computer science more, and developing an \nappreciation for \"namespaces\", I'm better able to compartmentalize the \nterrain of human discourse into \"language games\", thereby fragmenting \nmost monolithic meanings -- and lets throw \"God\" into the mix, most \nassuredly i.e. there's no monolithic meaning attaching to monotheism \neither.\n\nNowadays, I no longer spontaneously think of space as\n 3-D (especially with the hyphen (smile)). I have to work at it. I'm \nable to psych myself back into it through machine learning (ML), which \nis closely related to Coxeter-type polytope geometry, not least because \nthey both thrived at the University of Toronto.  Canadians have a higher geometric IQ than their neighbors to the south perhaps. \n\nThrough ML, I get back \nto the n-D meme and conventional Extended Euclideanism (EE), with \"3-D\" \na visualizable subspace, a kind of Minecraft or Lego World for doing XYZ \"three directional\" physics. \n\nWe learn space has these independent \ndirections called the X, Y and Z. We learn to spontaneously \nsay \"cubed\" when confronted with a 3rd powering.  Anything flat, like a pancake or screen, is \"2-D\" whereas the horizon betwixt the ocean and sky is \"1-D\".\n\n\"Schooled \npeople\" (me one of them) all think in this way.  However, since Synergetics\n (Fuller's, not Haken's), I'm not so sure we sound quite as smart as we \nused to.  Osmosis has taken its toll.  The Euclideans have no monopoly on philosophical underpinnings anymore, presuming they ever did.\n\nIn EE and ML, whether you had \nother family on board with you, were female or male, had a nice cabin or\n were in a certain age range, all become dimensions locating you along \nvarious axes, giving you a multi-dimensional \"address\" with a Euclidean \ndistance to other addresses.  \n\nWe'll compute some weighting factors using\n \"neural networks\"and pretty soon, in knowing your multi-dimensional Euclidean neighborhood, \nwe'll also have a very educated guess as to whether you survived or \ndrowned when the Titanic went down. Such is EE + ML.  \n\nIf we're \nCambridge Analytica, we'll use our prowess with ML to scare you into believing we know \"where you live\" in the sense of knowing how you'll \nvote in the next election.  Or we know what to do to tilt you more in a specific direction (dimension), through tailored messages, targeted ads. We'll sell politicians on this idea we have these superpowers, leaving it to others to counter our grandiose claims.\n\nThe Minority Report (a dystopian movie) seems already here, or at \nleast some people would like you to believe they know the future. Any \nwannabe priest caste has conventionally claimed clairvoyance, based on whatever passes for \"tea leaves\" in a given generation.\n\nIn\n Synergetics, we part company with those saying they can visualize but a \nsingle dimension, such as width but no breadth or height, or height \nwithout width and breadth.  Whatever we're visualizing, it's already in a container defined by the observer's apparent subjective distance from the observed.  There's your space.\n\nWe find it quaint that 3Ders include, as one of their chief documents promoting \"hypercross mysticism\", a work not of mathematics, but of political satire.  I'm speaking of Flatland of course, by Edwin Abbott, quite important to this namespace, as a kind of cultish tract.\n\nWhen you start fresh with with a Kantian a priori \nsense of space, it's a box, a container, ab initio. Then comes a creation story about successive dimensions (starting from zero) explaining why said paradigm box is \n\"3-D\".  We go to school for the privilege of learning this creation myth, as a part of our early indoctrination.\n\nFuller disrupts that genesis story and supplies another one, likewise firmly based in \ntopology:  space is one inseparable concept, indivisible into independent dimensions, one of containment, and the\n most primitive (in the sense of simple) container is naturally the tetrahedron (spheres stay complex and may be reshaped accordingly),\n a tetrahedron that says \"four\" way more loudly than \"three\".  \n\nBeyond timeless 4D space, we get to Time, which we may call a dimension too (as Einstein does), but then, while we're in time, lets not \nforget to break it down further, into weight, density, molecular makeup, color, temperature... the \"dimensions of chemistry \"\nwe could call them, and indeed the word \"dimension\" does carry that kind\n of water in many a namespace, including in ML.  \n\nFor Fuller, there's 4D space + Energy,\nwhere Energy = Frequency i.e. a specific \"program\" full of physics \nhappening.  \"Event space\" we could call it.  Shape alone is angles.   Frequency steps up the mere eternal into the actually existent, the space of \"special cases\" in time/size.  \n\nSuch was the state of Fuller's philosophical lingo, by the 1970s. \"Angle + frequency\" had become his shorthand for all physical information \nabout stuff in general.\n\nGoing back and forth between namespaces sometimes does \ninvolve training the senses, inducing new perspectives.  Gestalt \npsychology shares this notion of \"aspect shifts\" with philosophy. \n\nGetting into Fuller's way of thinking does require a kind of \nre-education, and getting there may involve what we might call \n\"brainwashing\" if we're resolved to put a negative spin on it.  \n\nOr \nconsider \"brainwashing\" something healthy, apply a positive spin. \n\nIf you haven't washed your \nbrain in decades, maybe it's high time?  Smile.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}