{
  "id": "4457049118659729399",
  "title": "Geometery + Geography",
  "published": "2010-03-27T18:04:00.000-07:00",
  "updated": "2010-03-28T00:00:34.036-07:00",
  "content": "Here's how I'm thinking:  the emergence of high definition screens (HDTVs, LCDs etc.) will drive a resurgence of [spatial geometry](http://groups.yahoo.com/group/synergeo/message/58095).  One could say it already has, given [the NFL](http://worldgame.blogspot.com/2010/02/more-from-97214.html) is simply [polyhedra on steroids](http://mybizmo.blogspot.com/2009/05/show-me-polyhedra.html) (each player like a Sim, in the sense of [an object](http://worldgame.blogspot.com/2009/02/regarding-objectifying.html) with attributes and methods).With this Renaissance in the foreground, we'll have the option (so far not much availed of), to streamline and simplify the teaching of said spatial geometry.  This will occur in tandem with a more explicit embrace of high technology ([HDTVs](http://mybizmo.blogspot.com/2006/03/math-wars-continued.html), LCDs etc.), in place of the current Calculator Limbo, the dominant paradigm in many a school.Those schools embracing the [NCLB Polynomial](http://mybizmo.blogspot.com/2006/08/mathcasting-about-phi.html) and [NCLB Polyhedron](http://mybizmo.blogspot.com/2009/12/synergeo-57035.html) (both literary devices, students of American Literature take note) will have more of a world class flavor and will prove more attractive to an international cast.Diplomacy will get a boost from these developments, as the USA recovers from [its withered years](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html), as a mere puppet of Eisenhower's aptly named \"military industrial complex\" (a psychological complex characterized by some infantile belief in \"superpowers\").As science fiction, this forecast makes some sense.I'm not talking about a done deal of course, as the slumdog millionaires fight change at every turn, grasping at whatever straws.Nostalgia for the 1900s and its Flatlander belief systems is still running high in some segments.  Some believe in the end of history.  Others believe in no tomorrow.The Geometry-Geography nexus is where to focus.  Geography at the medio-level is one's local ecosystem, neighborhood, bioregion.Going in, it's your body and the chemistries it depends on, [the quantum mechanics it obeys](http://mybizmo.blogspot.com/2005/11/physics-emergent-isepp-lecture.html).Going out, it's the solar system, a fusion furnace with client planets, outward and onward to the stars, the galaxy, other galaxies.Geography is all that has energetic significance.Geometry, on the other hand, may be size-and-time independent, what we in the Synergetics namespace call \"prefrequency\" or energy-free.Here is our familiar Platonic Realm, where our philosophical faculties like to anchor themselves, as observers of the eternal verities.[U = MP](http://worldgame.blogspot.com/2006/08/4d.html) in other words, i.e. to communicate this curriculum, one needs both vocabularies, the geometric and the geographic.Geography is about the playing field shared by [we world game players](http://www.4dsolutions.net/synergetica/veil.gif).Geometry is about the generalized principles that connect all the special case dots.These broad brush stroke heuristics may come across as [too esoteric](http://www.4dsolutions.net/images/ohman12192004.jpg) to  have pragmatic consequences.What's true though is that geography and geometry have always developed hand in hand, so lets remember that \"radical\" and \"root\" have much the same conservative and/or anchoring meaning.When it comes to providing civilizations with secure origins, serving up a mix of geometry and geography has generally been the most successful approach.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}