{
  "id": "115195240712194762",
  "title": "Ghost Trains",
  "published": "2006-07-03T11:24:00.000-07:00",
  "updated": "2007-10-16T18:37:14.592-07:00",
  "content": "One of the ways USAers like to advertise their dysfunctionality on the world stage is by making their passenger trains run late.  Of course serious business commuters couldn't afford that, so the Northeast Corridor tries to keep up some semblance of a schedule.But when the distances get long, and the ridership less skyscrapey (less penguin-suited), Amtrak takes a back seat, has no right of way on privately owned tracks.  Some get elected to Congress purely on their promise to keep the passenger trains 2nd class, always begging just to stay on the tracks, let alone on time.Canadians find this frustrating at times.  The northbound Amtrak, from Portland to the border, was disgorging passengers without proper ticketing the other day, the computer system having died again.  Clerks were hand-writing postits or something, expecting Canadian authorities to just swallow the costs of not dealing with a trully functional railway system.Plus that Amtrak train is just skeletal anyway.  One conductor has to run the whole show, including serving snacks behind the counter, with a line out the door and down to the next car.  There's just no budget for staff anymore, even though talented young people would like nothing better than to punch tickets and tell stories, on some dream train through the North American outback.The Coast Starlight is still good.  Wine and cheese, parlor car.  A tourist magnet.  Always late though.I don't blame Amtrak.  It's more a national schizophrenia at work.  Letting civilians have a decent rail system would be like \"socialism\" whereas the old agreement with Congress is to let wealthy industrialists set the living standards where they need 'em, low enough to keep workers scrambling, even for the most miserable jobs (use \"citizenship\" as leverage, by turning the legal against the illegal).\"A really healthy civilian vista would mean a disasterous drain on the Pentagon, in terms of manpower,\" or so the dying computer model seemed to imply, \"so use Katrina as leverage, to drive more wage slaves into bondage.\"In actual fact, the Pentagon would have no problem filling vacancies in a bona fide, lean and mean, \"Be All You Can Be\" army -- if the mission were something other than naked aggression on behalf of a few privileged private industrialists.It's the dying computer model we don't need.  Arlington's Pentagon still anchors a global matrix (as one of twelve, per hexapent shop talk).  I think its original architects were probably forward thinking enough to have ensured our USA's survival, even if the erstwhile piggy-backing LAWCAP went down with all hands.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}