{
  "id": "8697844106699635661",
  "title": "Git Mo Stupid",
  "published": "2010-06-18T23:14:00.000-07:00",
  "updated": "2010-06-18T23:32:48.926-07:00",
  "content": "\"Too stupid to close Gitmo\" was the verdict, [last time we checked the score](http://worldgame.blogspot.com/2010/02/lame-analysis.html).It's mighty hard to put any faith in those \"counter-terrorist\" twits after seeing their bogus blog posts in defense of that operation, an embarrassment for [what little remains of] \"intelligence\" in those circles.No career path to an elite inner circle by that route apparently.  Just cruft on the c.v., might as well say \"unemployable\".I'm not blaming the White House though, even back to Bush, who wanted it closed too.   Few people know that, as they can't believe presidents get lied to (especially presidents).This defying of presidents is what \"the woodwork\" is good at (the so-called spineless bureaucracy -- [aka \"banana republic\"](http://controlroom.blogspot.com/2008/01/other-news-blips.html) -- which hides behind anonymity, posing as patriotic).USAers don't seem to understand how [their credit rating](http://controlroom.blogspot.com/2009/03/stress-tests.html) so much depended on what they might offer the future.  Overlooking the debt was easier when the policies made some sense.[Endless \"war on terror\"](http://controlroom.blogspot.com/2006/01/power-of-nightmares-movie-review.html) is wearing thin, especially when there's so much positive futurism waiting in the wings, on hold while the world sits through this tortuous little stage number.At least we're making some headway [on the voting machines](http://controlroom.blogspot.com/2008/09/paved-over-past.html) and attendant infrastructure.  If they're not NSA approved, then we know they're unworthy.  Or did I get that backwards?  Good to see The Washington Post is on top of it, vigilant as ever.Any truth in the rumor that the Pentagon wants to commandeer Gitmo as a HQS to monitor[ the oil bleed](http://controlroom.blogspot.com/2010/05/oil-spill.html)?  Certain BP executives might need to be watched, asked a few questions.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}