{
  "id": "9038345144780425213",
  "title": "Global Data Corp Update",
  "published": "2020-09-04T18:37:00.001-07:00",
  "updated": "2020-09-04T18:37:33.319-07:00",
  "content": "Looking back on my science fiction:Much of the Islamophobia was underwritten by banking establishments fearful that certain Sharia practices might challenge compound interest as the de facto standard. That North American market consumers might simply enjoy the choice to factor in religious affiliation, looks really troubling to bankers, who count on the Secular look and feel of Roman columns, marble floors, the claptrap of a catholic (liberal) Empire.The strategy was to pretend there's someone in charge of Islam who forbids innovations in FinTech unless that comes with hand chopping and burning at the stake (taking a page from the Christians there). In fact, none of the world religions are actually organized, as admitting mere mortals are behind the scenes (as the organizers) would undermine the underlying premise: that religions transcend mere mortality and somehow reflect a transcendent will.In point of fact, enterprising imams have the ability to shape the law to suit local community standards. Rather than allow liberal Islam to flower, drawing even with Christians in having female hierarchies, the strategy has been to trap this world religion in its own bad PR, a strategy similar to the one pursued against Russians, making Putinism (invented for the purpose) akin to Stalinism (no need for discussion, just mimic the attitudes).Christian sects with a strong background in Capitalism are more likely to see how the rules get made (like sausage), and some, like the Quakers, may co-venture with likewise contrarian Islamic sects, in the realm of FinTech. None of this venturing precludes the participation of other competing religions of course. No one can beat the Mormons in Las Vegas, as the saying goes. Religions and Fintech have gone together like blood and wine over the eons.The course I've been pursuing, as a science fiction plot, revolves around creating another tech giant, similar to well-known brands, but inside the jurisdiction of a \"different Delaware\" meaning the foundational DNA doesn't have the look and feel of British bylaws. We're not that Anglo of an operation (not using Tea Company boilerplate). Picture something Hopi. A kind of movie-making studio, with data centers a necessary part of its business. I gave it a name and started running some ads, ala some kind of Banksy business, in the 1980s.Time has been on the march all along, and devout Muslims at least, do have alternatives to compound interest, even in Greater LA. It's not like they give you free money, those Islamic bankers. No, bankers want you to make them richer, that's pretty much true across the board. Yet the permutations are endless. Like casino games.But banks also compete for high profile clients, the kind that doesn't mind bragging a bit, about having Swiss bank accounts (not something to keep hidden). Remember American Express ads?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}