{
  "id": "6893578488871933719",
  "title": "Gnostic Musings",
  "published": "2014-02-09T19:47:00.001-08:00",
  "updated": "2024-02-13T07:30:21.349-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/12646665135)\n\nGlenn tromped through [the winter wonderland](http://worldgame.blogspot.com/2014/02/winter-wonderland-weather.html) to Blue House today, though with warmer freezing rain, walking became more treacherous.  He and I would later appreciate the dribble of cinders on 38th.  We weren't the only pedestrians taking to the middle of the street.  Besides, trees were dropping big loads, maybe icicles.  Who wants to be hit by one of those?\n\nWe discussed the Gnostic literature, where we overlap some, Glenn being a voracious reader on many topics and me hosting a borrowed collection that's brimming with titles.  I've been sampling, enjoying some memories.  Pico della Mirandola and Cosimo di Medici -- these were figures I'd encountered before.  I hadn't realized Dame Frances Yates, as some call her, had left us that long ago ([1981](https://www.facebook.com/pages/Frances-Yates/135234879844337)).  I'd read some Pico ([in translation](http://vserver1.cscs.lsa.umich.edu/~crshalizi/Mirandola/)) at Princeton.\n\nCosimo played a role similar to Jung's later, in getting an early bird look at some ancient documents.  Cosimo's score purported to be the writings of Hermes Trismagistus, though a later critic would denigrate their authenticity as such.  Jung helped curate some of the more recent archeological finds, newly uncovered mostly-Coptic sources.  The hay day of Gnosticism is anchored between two and three hundred years after Jesus.  Mining sources for alternatives to established theologies has been a pass time of the rich and famous (who else could afford the risk or gather the information?).\n\nGoing forward, we get to Blake and Swedenborg, and Jung whom I've mentioned.  But also the Transcendentalists, including of the New England variety.  Bucky Fuller's Tetrascroll contains the classic Gnostic inversion of the Genesis story, meaning exaltation of the snake (Naga) as an avatar of Sophia (gnosis), Eve the emissary of [a higher Self](http://mybizmo.blogspot.com/2006/01/wanderering-in-pdx.html).  Women tended to have full powers relative to men in Gnostic institutions and this, Glenn and I agreed, is maybe what most roiled the emerging Patriarchy, the self appointed Christian Orthodoxy, i.e. those \"highly motivated men\" hell bent on putting a stop to the Gnostic heresies.\n\nI've been thinking of how Dee's or Bruno's Monad resonates at the far end of the 20th century with Fuller's Dymaxion or VE.  We're talking about an ordinary cuboctahedron, six square faces and eight triangular ones, which in Fuller's Synergetics became the Vector Equilibrium of volume 20.  He'd call it the VE (the strut pattern was a focus, not looking at a \"solid\").  That kind of [metaphysical symbolism](http://coffeeshopsnet.blogspot.com/2014/01/happy-2014-for-your-coffeeshop-lcd.html) marks Synergetics as a work in the humanities, its tetrahedron a bridge to STEM.  But the literary critics have not been too keen to swallow that magnum opus as a work on their side of the fence.  Getting it listed as Philosophy at Earlham College was an uphill battle and then some.\n\nThat raises the question of to what extent Quakers might be latter day Gnostics and such.  These matters may be debated as if an empirical truth could be discovered, but of course \"it's complicated\" is the real answer.  The mystical Quakerism [of Rufus Jones](http://worldgame.blogspot.com/2014/01/rufus-jones-luminious-life-movie-review.html) is a close neighbor of New England Transcendentalism, some might saw a pure form of it.  By some transitive law implicating [Walt Whitman](http://controlroom.blogspot.com/2008/07/on-individualism-transcendentalism.html) and Emerson to some extent, we get a continuation of the Gnostic tradition.  But again, that's just storytelling and myth, not set in stone dogma.\n\n[](https://www.flickr.com/photos/kirbyurner/3483595185)\n\n:: tetrascroll, limited edition full size ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}