{
  "id": "8882403735304558887",
  "title": "Go By Train",
  "published": "2021-07-13T12:58:00.003-07:00",
  "updated": "2021-07-18T21:36:38.789-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/51257243015/in/dateposted-public/)\nBill Lightfoot at Papa Haydn in NW Portland, June 2021\n\nMy intrepid Uncle Bill Lightfoot, last of my grandma Esther's sister's kids, made it to Union Station (PDX) from King Street Station (SEA) this morning.  \n\nHe left Seattle around 7:30 AM and was here by a little after 11:00 AM.  My expectation is he'd return, as usual (this has been his routine), on the Coast Starlight at 4:00 PM.\n\nBill likes these day trips.  He usually only has a couple hours in town.  We typically squeeze in a visit to a brewpub, Ringlers maybe.  This was all before covid.  Since the pandemic, he's been down one time, in late June.\n\nAnyway, contrary to my expectations, the Coast Starlight has been canceled perhaps until September 1st. Fires in the Mt. Shasta region (Dry Canyon Bridge) have damaged the tracks.  \n\nApparently there's no way to break the route in two and have a bus intertie.  That's likely because rail travel is somewhat redundant to air travel in the region, and the passenger rail system doesn't get to treat itself as especially critical.  It's more of a luxury, a form of entertainment.  \n\nFreight rail, on the other hand, still sees itself as essential and has some way to reroute.\n\nBill favors Papa Haydn, the dessert place, when we can fit it in.  We did that last time, visiting their northwest location.  This time, we would in theory have time to get to the Milwaukie / Sellwood location, however both establishments are closed Mondays and Tuesdays.  Today is a Tuesday.\n\nYesterday we had another gathering in my backyard.  Derek (\"Deke\") supplied much of the food from the back of his roving pickup truck, a logistical link in the city's feeding program, decentralized and cybernetic.\n\nA lot of people still believe the world is run by \"bosses\".  I agree we have many breeds of crime boss, managing their criminal networks (religions, cults, banks, corporations, gangs, schools, governments).  \n\nHowever nature presents us with a more optimized type of efficiency, pre-human, pre-money, pre-conscious.  Some philosophers acknowledge these deeper layers of the economy.  Others are apparently oblivious.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}