{
  "id": "535832732736340393",
  "title": "Godzilla (movie review)",
  "published": "2014-05-17T09:38:00.003-07:00",
  "updated": "2014-05-18T08:32:33.741-07:00",
  "content": "I enjoyed this more than I expected, coming in as a skeptic.  Given my birthday was starting around showtime, the Happy Birthday Daddy theme resonated some, and I could appreciate the nuclear family vibe (pun intended).  Allusions to Aliens (egg sacs) and Lost (Monarch) seemed present.  The human familial matrix was mirrored by the creatures, with that intelligent eye reminiscent of whale movies.  We recognize a fellow sentient being in Godzilla and company.\n\nThis is a great film for control rooms, so let me underline that meme again in this Control Room blog.  You have them in nuclear stations, on aircraft carriers, wherever command and control is exercised, as well as monitoring (it's a feedback loop).\n\nThe film has a young audience in mind and wants to show them bravery, loyalty, discipline and other positives.  What a great lesson in infrastructure.  The importance of electricity is never more obvious than when it suddenly goes away and planes fall from the sky.  EMP is a real danger in our age and in 2012 the planet narrowly missed a solar flare that could have had similar consequences.  Nature is not conducting itself with human life and civilization its front burner priority, though as humans we should take responsibility for developing more backup systems and better shielding.\n\nI'd flown from Reno the same day and had been meditating on the vast wealth humans have created for themselves, in terms of cities, roads, agriculture.  Godzilla likewise reminds us that we live in a fairly advanced global civilization.  The science fiction did not have to push very far, once the creatures themselves were admitted.  The opening credits waste no time in that they help contribute to the back story.  My conversion from skeptic to fan had a lot to do with enjoying the back story.\n\nMy thanks to the vast army of professionals who worked on this thing, a visual feast / extravaganza.  We're also celebrating the state of the art in special effects (VFX) in this movie.  Audiences come with high expectations and, speaking for myself, I was not disappointed.  Judging from audience response, I was not alone in feeling appreciative.  The Bagdad's new sound and digital projection system got a great workout.\n\nPrior to show time I tucked into Patti Smith's new autobio at Fresh Pot across the street, a walk through from Powell's (Asylum District) so one may snag and read, and sometimes buy.  I didn't get which Robert she meant until I finally read the dust jacket, given I was in my usual non-linear mode.  Lots of interesting twists.  I missed her co-appearance with Ralph Nader at [my 25th Reunion](http://worldgame.blogspot.com/2005/05/princeton-25th-reunion.html), but certainly raved about it anyway.  Yeah, I thought Horses was good, we all did.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}