{
  "id": "680441673779666748",
  "title": "Good Shepherd (movie review)",
  "published": "2007-11-29T17:20:00.000-08:00",
  "updated": "2008-11-15T02:36:19.419-08:00",
  "content": "This very stylish piece plays it straight with our man Agent Buttercup, a shy guy, both ostensibly and for real, who turns his back on every one of his angels in exchange for some vaguely lewd Castle of Whispers (plus a haunting piano).I was reminded of both [eXistenZ](http://www.imdb.com/title/tt0120907/) and [A Beautiful Mind](http://www.imdb.com/title/tt0268978/) (imagine oscillating between the two in some random sequence).Other spins in this literature make it so much less of a guy thing.  I contribute to this genre in part because of inbreeding: my [Princeton's 2D](http://worldgame.blogspot.com/2005/05/princeton-25th-reunion.html) (Class of 1980) was more [coven-like](http://mathforum.org/kb/thread.jspa?threadID=1660718&tstart=0) than anything bonesmen (more of a Yale thing). But hey, this movie isn't about me, so I should just save it for my blogs, right?[De Niro](http://controlroom.blogspot.com/2005/08/shark-tale-movie-review.html) both directs the film and plays Wild Bill Donovan, titular founder of the OSS, which later transmogrified post Truman, as we all know, to become the beloved Cold Warrior agency, since then eclipsed by this weird constellation of like sixteen little agencies around some [D'ni](http://worldgame.blogspot.com/2004/12/national-intelligence-director.html) in Uru (or whatever (I don't pretend to follow too closely)):[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhtx4wcT_8Pf_uFyy1WEU9PEsL6fr24iJy9582HaTLL96Es9gjNMR-RJFSevTbaCJl-BA7lEoNhXIXLPYsKFNbXnQuwewvB4gIUWPf_E9aX1w3oJAxajbvG89fULHdwH_-uaQ0J/s1600-h/intel.jpg)The Americans don't make out very well in this film.  Agent Buttercup & Co. basically botch every operation they get close to, like the Russians are simply better at it and so?  All water under the bridge by now; cold warriors having their fun in the sun.I kept thinking of the Matt Damon character as a Sim, like you don't want too many of these guys in your reality (idiocrats, \"pompous and faggy\" ([allusion](http://worldgame.blogspot.com/2007/04/idiocracy-movie-review.html))).  Damon gets points for doing him so effectively (another \"quiet American\" you just want to scream at, tell him to get off the phone and get a life (like, you're married to [Angelina](http://worldgame.blogspot.com/2006/12/homeward-bound.html) for crying out loud)).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}