{
  "id": "2578361550540917330",
  "title": "Greetings from Philly",
  "published": "2011-03-05T11:46:00.000-08:00",
  "updated": "2011-03-10T11:22:34.205-08:00",
  "content": "[[a post to Synergeo](http://groups.yahoo.com/group/synergeo/message/65072), hyperlinks added ]We're talking about Math for Mystics (book) [on mathfuture](http://groups.google.com/group/mathfuture/browse_thread/thread/d676d8864689fabb). No one has mentioned Bucky, which is fortunate, as he did not consider himself a mystic ([see Synergetics Dictionary](http://www.rwgrayprojects.com/SynergeticsDictionary/SDCards.php?cn=11172&tp=1)). On the other hand, he was [a transcendentalist](http://worldgame.blogspot.com/2008/06/literary-investigation.html), at least in my book. This doesn't constitute a belief in the \"supernatural\" however. Sure, [he considered telepathy a reality](http://www.rwgrayprojects.com/SynergeticsDictionary/SDCards.php?cn=17887&tp=1), based on experience, but thought it would therefore become a topic for science. You find \"non mystic\" physics writers expressing similar thoughts, about the reality of a zeitgeist, noosphere, or shared mind (morphogenetic fields etc.). These topics should be filed as \"speculative\" to be sure, but it's not necessary to get all occultish about them. Fuller was not another Aleister Crowley.I'm currently attending [a meeting of the AFSC corporation](http://mybizmo.blogspot.com/2011/03/corporation-meeting.html), a Quaker action arm, somewhat Machiavellian in that it's all about forming alliances and networks with non-Quakers. That's what one has to do if in a small and esoteric sect (more a privilege than a burden).I haven't met up with any SNEC people yet, but have some plans to do that [tomorrow](http://worldgame.blogspot.com/2011/03/adventures-in-philadelphia.html). Then the next day I fly back to Portland.Also on mathfuture, I'm [continuing to share my ideas](http://groups.google.com/group/mathfuture/msg/f3bc4d6bdffd4866) for the emerging digital mathematics track, a multi-year conversation. In my case, I was influenced by [the rise of object-oriented executable math notations](http://4dsolutions.net/ocn/trends2000.html) (so-called \"computer languages\"). The idea of giving more concrete expression to \"math objects\" (such as rational numbers, vectors, polyhedra...) and defining their powers operationally, in terms of scripted algorithms, seemed like a \"no brainer\" to me. Subsequently, I encountered the resistance of the functional programming crowd, some of which are strongly opposed to \"imperative\" and/or \"stateful\" grammars.A core \"math object\" (where the concept really takes off) is of course the \"polyhedron\". People ask where polyhedrons occur in the real world, but if you're thinking generally, then [the answer is \"everywhere\"](http://mybizmo.blogspot.com/2009/05/show-me-polyhedra.html). Any kind of container at all, from beer can, to planet, to human body, is a polyhedron in some sense. You have an inside and outside, spinnability, translatability, scalability... a rich set of ideas explored in detail in Synergetics.Once we agree that polyhedrons make sense as paradigm \"math objects\", the question remains as to whether [Fuller's treatment](http://mybizmo.blogspot.com/2006/02/valentines-day-2006.html) is relevant and important. My position is clear: of course [it's relevant](http://controlroom.blogspot.com/2009/06/avogadros-number.html) and, in fact, not mentioning this treatment in any way has gone a long way to draining the more traditional curricula of their credibility and viability. In failing to incorporate even the gist of [the \"concentric hierarchy\"](http://mybizmo.blogspot.com/2010/06/outlining.html), we've discovered math teaching subcultures to be mired in straitjacketing reflex-conditioning. This belies many claims of operating \"logically\" and/or \"intelligently\" (rationally). I see corruption and a lack of integrity. That's an opinion, clearly, and the countering view seems to be that Fuller's treatment lacks integrity for one reason or another. For the most part, the guardians of the status quo feel no obligation to be explicit in their defense of said status quo, as they don't see polyhedra as making a come back [under any guise](http://coffeeshopsnet.blogspot.com/2011/01/storyboarding-lcds.html), let alone as avatars of some [\"world game\" nonsense](http://worldgame.blogspot.com/2010/02/more-grid-talk.html).Those who do tend to verbalize their defense, including many who may be \"pro polyhedron\", tend to recite the mantra the \"Fuller was a mystic\" (taking me back to my opening paragraph). Somehow, teaching about the 1/24, 1/8, 1, 2.5 3, 4, 5, 6, 18.51 20 volume progression is associated with Tarot, astrology etc.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}