{
  "id": "7057848530090887456",
  "title": "Grizzly Man (movie review)",
  "published": "2016-07-28T23:18:00.002-07:00",
  "updated": "2016-07-30T22:25:22.484-07:00",
  "content": "I borrowed this DVD from Glenn several days ago.  As it wasn't a rental, it went to the back of the queue.  I'd not realized [Werner Herzog](http://controlroom.blogspot.com/2007/01/aguirre-wrath-of-god-movie-review.html) was the director, a pleasant surprise.  He's a masterful filmmaker, and narrator (storyteller).\n\nThe film doesn't beat around the bush about what happened to Timothy and his friend Anne, more mysterious, as to why she stayed.  She wasn't as suicidal around bears as Timothy, who tempted fate for a living.\n\nThe angle Herzog picks up on is not Timothy's controversial lifestyle (waltzing with bears), but his talents and technique as a filmmaker.  Herzog treats him respectfully as a peer.\n\nIn showing the many takes of the same scene, one might mock or denigrate a brave soul.  As a fellow director and filmmaker, Werner leads a lay audience to water, and some really beautiful music (the DVD comes with a full length feature on scoring the audio track, thumbs up).\n\nGiven almost eight billion people, and bears a true rarity, in relative terms, having at least one man daffy and lonely enough to go trans in this way, is a statistical possibility (as we see).\n\nThe locals, who've been keeping track for thousands of years, understand that taboos are for a reason.  Tempting a fate is a great way to someday meet said fate.  Treadwell is saying \"bring it on\" to this Bear World.\n\nHis life turns into a grim tale and sends a warning to children, but without a retraction of the loving attitude.  We're free to love foxes and guard their habitat.  Whether that means chasing them or sleeping with them is another matter.\n\nDomestication has worked with some species.  Humans have found some understanding with other wild creatures.  These relationships are not static.  We could do more to cultivate our relationships with fellow travelers.  Religions have their work cut out, not just the sciences.\n\nWerner is contrasting a hippie clown aspect with a more serious cowboy, in sampling the many talking heads from Timothy's scenario.  Treadwell was part of an ecosystem in the human world just as surely, with children a big part of it.\n\nIn watching Herzog's sampling of Treadwell's unedited hundred or more hours, I was grateful for the deep dive into a loner's life, and struck by the young age of the intended audience.  Timothy was creating raw material for documentaries he'd share with children.\n\nIn meeting his fate so fatefully, he upped the rating, from G to something closer to R.  Herzog wisely keeps us from having to relive the full ordeal, but does manage to communicate horror.  The grizzly story turns grisly.  And children still love the foxes and bears -- except the mean ones.\n\nMom & dad and my sis went to a private farm north of Lesotho where the caretaker developer allowed lion cubs to roam freely, including among the guests.  He'd cage them or move them out when old enough to do serious damage.\n\nMom doesn't know how that scenario turned out.  Carol, Julie and Jack only briefly overlapped it.  A lion cub jumped up on their table, in their presence, knocking it over, and ate their tuna fish sandwiches.  That's what tourists were paying for I guess.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}