{
  "id": "7947728331595232173",
  "title": "GST for Truckers",
  "published": "2018-07-29T08:38:00.000-07:00",
  "updated": "2018-08-19T10:59:59.948-07:00",
  "content": "How many long haul truckers listen to podcasts?  I imagine myself chugging along I-whatever listening to satellite radio, but maybe also to some Russian classics, maybe Dostoyevsky, Tolstoy. Having some literary criticism, philosophy, biography, history, mixed in, would [count towards my PhD](http://mybizmo.blogspot.com/2014/12/a-phd-in-truckology.html).  Driverless trucks don't support learning in this way.  My fleet is dual purpose, in providing truckers with personal workspaces (PWSs).\n\nWhat is GST again?  That depends whom you ask.  Out there in the wild, these three letters match a lot of strings.  However, I'm following my Quaker heritage to some degree and connecting with Kenneth Boulding, the economist, and the general systems theory he wrote about.  My spin:  lets compete with economics as a discipline, since economics itself suggests that monopolies give rise to lots of inefficiencies.  Why give economics as a discourse any monopoly say over any aspect of planetary affairs?\n\nOf course my detractors point out that inside economics we have Georgists, Marxists, the Chicago School and so on.  If you're driving right now, maybe punch up a podcast on Henry George after awhile?  OK, we're talking semantics at this point.  If you want to inject GST into the economic sphere as another competing economics, that's fine.  As long as you stay competitive.\n\nWhat happened next in my story, is Buckminster Fuller came along with his Spaceship Earth meme, and his practice of thinking globally while acting locally.  His idea of \"systems\" was very structural and geometric, as demonstrated by his elaborations on the octet-truss, a fascination for Alexander Graham Bell as well.  He got his truss to curve and make the triangular panels of a geodesic dome.\n\nAt the heart of Fuller's thinking was a shape we all probably recognize when we see it, but might not have its name handy: the tetrahedron.  Fuller went so far as to imagine a civilization which had shifted its weight from the cube to the tetrahedron to such an extent that it often measured units of volume using tetrahedral shapes (four faces, six points, six edges).  He wrote two whole volumes (Synergetics and Synergetics 2) exploring this alternative Universe.\n\nThe \"Sesame Street\" of Synergetics, meaning the core neighborhood wherein we might revisit a lot of partially overlapping topics (much as Children's Television Workshop explored the letters and numbers necessary for cultural literacy) is known as the Concentric Hierarchy, a nesting of well-known polyhedrons.  As a former high school teacher, and computer language teacher to this day, I've devoted a lot of resources towards communicating about this Concentric Hierarchy.  The topic lends itself to sculpture and modeling.  When sharing about it with kids, I'll sometimes use C6XTY, Sam Lanahan's flextegrity construction kit.  I have other kits as well, which I truck out during workshops.\n\nWhat got me interested in trucking?  Not so long ago, I used a computer language called Visual FoxPro to make my way in the world.  I programmed for hospitals, nonprofits, various clients.  However, that work dried up, partly because FoxPro was shelved by Microsoft and taken off the market.  Meanwhile, thanks to my interest in geometry and Synergetics, I'd been building up my Python skills.  What happened next is I met a transportation engineer whose whole business was about using Visual FoxPro to support scheduling and routing in Trucker World.  He had a thriving business.  He was also interested in using more Python in complement with his Visual FoxPro.  He started contracting with me on the side for some apprentice level coding, and giving me insights into the trucking industry from an applications developer viewpoint.\n\nAnother aspect of my childhood and young adulthood, was growing up in areas where Peace Corps volunteers might serve, the Philippines especially.  The whole idea of going to distant lands not as a tourist, but as a worker seeking to develop one's skills, was attractive to me.  I recall my friend Hugh Thomford going to Fiji to help establish growing pearls as an industry.  That might not have been with the Peace Corps, but the idea was similar.  Our family was engaged in a similar business.  My dad was a planner, urban and regional, who worked with various sovereignties on their long term development plans.  These sovereignties included Libya, the Philippines, Bangladesh, Egypt, Bhutan, Lesotho.\n\nWhat if truckers had a way to swap routes.  As a driver, I could apprentice in someone else's rig until I got the hang of it.  We might have more team driving.  You get to know the other person in your cab.  You're a diplomat, bringing your ideas and viewpoints into the situation.  You're learning about another culture, and another system of roads.  Such work wouldn't be for everyone.  However, I could see where it might be attractive to some.  What better test of GST as a discipline than to apply it to something concrete like this?\n\nThat gives you some background on the various Medium writings, podcasts and whatever, that you may stumble across as a trucker, whether in the Trucker Exchange or not.  We also call it Truckers for Peace sometimes.\n\nAs I mentioned above, I'm extending a Quaker lineage in my writings about GST and the Quakers are always looking to remove the causes of war before things get out of hand.  Having truckers become more empowered and adept at diplomacy and job sharing is a way of building our shared planetary immune system against meme viruses that lead to outward wars.\n\nWe still suffer from inward wars, psychological battles, so in terms of being a warrior and a hero, that's still a calling.  We could use your skills and services.  We just hope you'll not have to fall back on using obsolete outward weapons that have nothing to do with improving your psychological health. Many still make a career out of outward weapons but would prefer to do something more creative.  My advice:  [study GST](http://www.grunch.net/synergetics/gst2.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}