{
  "id": "4266773523278482975",
  "title": "GST Meetup",
  "published": "2018-02-25T12:57:00.003-08:00",
  "updated": "2018-02-25T13:15:35.290-08:00",
  "content": "I've been having breakfasts with Terry Bristol, president of ISEPP, regarding his Engineering Philosophy meme, by which he means a brand of pragmatism customized to give engineers (social and otherwise) a context wherein a notion of moral responsibility is not at all an oxymoron.  Engineers are moral agents.\n\nWhat Terry is up against is fatalism, though it's called other things: an ideology of zero culpability (impunity) because the outcome is foreordained.  Some brands of Protestantism embrace fatalism, which becomes an excuse, basically, for sitting on one's hands and doing nothing, in the face of suffering, because the outcome is predetermined.\n\nDeterminism and fatalism go together, I think that much is clear, but then we think of \"fatalism\" more as a superstition, whereas, until recently at least, the determinist, like the materialist, was considered the most no-nonsense type of thinker in the room.  Indeterminism was considered too romantic and/or Pollyanna.\n\nA kind of popularism kicks in here, wherein fatalism combines forces with Malthusianism and thermodynamics to where, since entropy always increases (2nd law), the world is ipso facto going to hell, and the best we might wish for is (A) a Second Coming and an end to life as we know it and/or (B) a better hell for us than for them, where \"them\" is the competition ([the Eastern Orthodox](http://mybizmo.blogspot.com/2018/02/political-radar.html)?).\n\nThose who see hell as the final outcome regardless, are not averse to accelerating in that direction, which is where WMDs etc. come into the picture.  Humans will spontaneously use massively destructive weapons against themselves given they're eager to accelerate towards one preferred hell over another.  Bombing is seen as a form of steering.\n\nResistance to fatalism comes in many forms, but comes most effectively from engineers (social and otherwise) in a position to offer alternative chemical and/or nuclear reactions that locally lower entropy for humans aboard Spaceship Earth.  Lowering local entropy is not against thermodynamics as local open systems are free to import heat from their surroundings.\n\nGibbs and Helmholtz both give us notions of \"free energy\" meaning energy available to spontaneous chemical reactions.  Spontaneously decreasing entropy happens, for example, when we charge a battery with solar panels and/or windmills.  The increasing entropy is happening in the sun (the energy source), which is running downhill towards its future fate.  We still have room for a deterministic future for the local star, and for Earth (heat death).\n\nSince the Sun is not very massive by stellar standards, \nit will never get hot enough in the center to produce nuclei much heavier than \ncarbon and oxygen. These elements will collect in the center of the star, which \nwill then shed most of its red giant envelope -- creating a planetary nebula -- and \nemerge as a hot white dwarf star.  [ [WhiteDwarf.org](http://whitedwarf.org/education/sunwd/index.html) ]\nThe difference between syntropists and entropists has to do with their different understandings of what science allows.  The fatalists see themselves blamelessly steering towards a preferred hell in a zero sum game, whereas the syntropists are more interested in backing away from hell and focusing on win-win solutions (Terry is in this camp).  Both have their own brands of mathematics, used to recruit new followers.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}