{
  "id": "3441758549186679273",
  "title": "GST Meets Neuroscience",
  "published": "2024-08-08T09:12:00.000-07:00",
  "updated": "2024-09-01T12:44:38.106-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiU1Ce7fv3Y9iZm4OLpzoiOKOCJ0nNDyBrfzMasBZyGNz_51kGIzAbNe6Nivx2tn8E-_4TGZEj4zcFbtdLYl5LwbP2fJAqoX57pUlhi8GWvUs4ltQX6bfn6vAyYVjvHQWwo4oOn3fYv78MSF8TTCkBN8QZXOk7Th5Xdqli09SCvOAlUvRRyUoYz/s1536/contained_container.png):: enclosed enclosure ::\nWhatever happened to GST after it featured in my science fiction as the planning discipline behind our Global Data Corporation, amalgamated outside \"whiteman law\"? In that form, it stayed on the periphery, affiliating itself with Synergetics, and thereby drawing us closer to Discordians and Subgenii, usually avoided by university faculties and prosperians, as too wild and risky for purely academic treatments.\n\nSynergetics, in the meantime, got picked up by the Markov Blanket tribe, the Active Inference folks with their Bayesian brains. Markov membranes feature here in two contexts:\n\n(a) nothing makes it to the future from the past but through the present (where change is made)(b) the Markov blanket divides an inside from an outside in an agent-based model of any self + other\n\nYes (a) may be regarded as a truism, and (b) is likewise part of a framework, a setup, and one consistent with the Omnidirectional Halo pattern of No More Secondhand God. \n\nThe Markov blanket, in this (b) case, encloses the neural network we like to probe, seek clues from, a black box in many respects, but also protective, like a skull casing, keeping our delicate modeling systems from damage by the rough and tumble outside. \n\nSensory organs mediate between these two worlds (outer and inner), bringing in news. From that inner black box, full of unknown unknowns, then spring the agent's actions, responses to what's incoming, robotic and reflex-based, or perhaps thoughtful and considered, or maybe initiated from out of the blue. \n\nOur own models may find another's actions rather impossible to predict, or even our own may elude explanation sometimes. We rationalize, after the fact. \n\nOur models may adapt and improve, or get hot swapped (radically updated), over time.\n\nIn the older (a) sense, GST long included \"edit/recombine\" as shorthand for \"value adding\", a correlate of the old economics concept of \"doing work\". \n\nIncoming are all the \"factors\" that make up one's circumstances including a \"free energy\" allotment, so-called \"disposable (or discretionary) income\" i.e. what's left to a worker to work with in an uncompelled, not automatic manner.\n\nWe typically symbolize the incoming as a pie chart, with slices as mundane as air and water, in a temperature controlled space. Do we have bandwidth? What inventory? \n\nOutgoing is our performance, including all manner of communications: vocalizations, facial expressions, gestures of all kinds. Perhaps one paints, writes poetry, programs, plays roles in theater, all of the above. Perhaps one is a craftsman and makes beaded necklaces.\n\nNeuroscience and computer science have knit themselves together rather inextricably, which stands to reason, given the cell-silicon interface is highly populated with busy devices, with more in the pipeline.\n\nWith machine and deep learning, we now have what we call \"neural networks\" on both sides of that same interface, with many analogies bridging the two flavors: chemical wetware versus software on hardware. \n\nElectrochemistry has bonded what at one time were separate disciplines.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}