{
  "id": "5233498365205682855",
  "title": "Guns or Butter",
  "published": "2015-12-15T10:39:00.001-08:00",
  "updated": "2015-12-26T08:48:51.821-08:00",
  "content": "This rather hawkish Frontline documentary seems inconsistent, in building support for more US troops on the ground, while never addressing the issue of US weapons falling into the hands of armed gangs.  How did \"troops on the ground\" really solve things in round one?\n\nThat the only response to a dark ages Catholic-vs-Protestant (Sunni-vs-Shia or the reverse) style war -- with modern weapons -- is \"should we bomb or send troops?\" is critiqued more directly in the Russia Today interview of a retired Marine, Jason Stapleton, below.  These two (Frontline and RT) come up back to back in my Youtube viewing queue.\n\nThe private sector floods the area with arms, in exchange for black market oil, without consulting either NATO or DC (or the Kremlin or...).  The Arms Bazaar is open to all comers, as a player in its own right.  It's not like guns are hard to find.\n\nPouring high-powered weapons into a war zone is not a clear recipe for restoring peace.  Just about anyone suggesting a \"solution\" seems to think it's a matter of which trigger-happy faction to support with more weaponry.  Certainly the weapons makers have it made.\n\nEvacuating civilians is also a political maneuver.  Propaganda and ideology is not all about who has the most guns (or oil).  Win the allegiance of civilians by helping them escape a war zone why not?  Do more to shore up living standards in the refugee camps at least.  Take a high profile lead in lighting a way forward that's not just more darkness.  Be a beacon for hope, not a source of \"shock and awe\" for a change?\n\nThe suddenly low world price for oil makes sense, in light of the fact of the collective hunger for weapons.  The Arms Bazaar is feeding off this hunger, driving the price of oil down, given \"black market\" circuits (scare quotes because we're talking about a lawless state of war) are pumping like crazy, trading butter (crude, aka Peak Oil) for guns.\n\nThe private sector does not actually need US tax dollars to make its fortune, except on the very biggest ticket items (atomic weapons procurement funds many a fancy restaurant visit, good for the wine barons at least, until the grapes [start ticking](http://www.findingdulcinea.com/news/science/2010/mar/How-Do-You-Spot-Vintage-Wine--It-Has-Fewer-Radioactive-Particles.html)).\n\nThe US does not need to pump any more small or even medium sized arms into the region, for there to be plenty of such weapons (it's not like they're used up after two or three rounds -- expect at least a decade of trusty service on some makes and models).\n\nAlready, a large percentage of what's circulating is \"US Army surplus\" (captured from Mosul or wherever), valued in the hundreds of millions of petro-dollars.\n\nKeeping the campaign aerial (the NATO-Russia solution) is a way to avoid direct weapons transfers, but ultimately dropping bombs is about continuing to destroy infrastructure that leaves nothing left by way of employment other than picking up a gun and joining the mayhem.\n\nIf the only job open is suicide bomber, but with several months of free room and board (called \"training\"), that might mean a longer life for some jihadists?  With nothing more to lose, why not go out in a blaze of glory right?  Goodbye cruel world with a vengeance, right?\n\nLiving standards plummet the minute those craters start happening in your city, thanks to bombs, whether delivered by car or by jet (or by cruise missile or by....).  Destruction is quick.  The consequences take longer to manifest, the healing even longer.\n\nInvading Iraq in the first place is what helped end Iraq.  These nations were tenuous to begin with and couldn't take that much stress without shattering.\n\nThe purpose of the nation-state system was to find a way to live in peace.  That didn't work out did it?  We'll continue with the theater of it all, not having any better ideas apparently, but with less faith and belief in some of those recent ideologies, best left behind in the 1900s or whatever.  Good riddance.  On to something [more sustainable](http://mybizmo.blogspot.com/2015/12/global-data-global-matrix.html), we pray.\n\nEconomics and GST both agree:  it's about guns versus butter (killingry versus weaponry) and also about non-linear spiraling, positively or negatively trending.  Without hope and longing for a brighter tomorrow (utopia), there's still room for fear and the hunger for outward weapons (oblivion).\n\nRather than cratering freeways, the basis of civilian trucking could be improved and extended from Kabul to Istanbul, a paying gig, perhaps [for academic credit](http://controlroom.blogspot.com/2010/12/from-day-to-day.html).  I know that sounds far fetched, but not for any lack of trucks or fuel oil, and the freeways were being used. \n\nTaking that same oil money to rebuild hospitals and factories would be an option.  Other sectors besides the Arms Bazaar have goods and services of value.\n\nWhat do people shop for, especially if their self-proclaimed business is to \"glorify God\"?  Some shop for and deploy tanks.  Others procure [Boeing 737s](http://mybizmo.blogspot.com/2015/11/road-trip.html).  Either way, it's a business (a bazaar).  The least responsible buyers are expecting the end of the world, but who can blame them?\n\nSpeaking of oil, I need to turn down the heat.  I was testing the furnace this morning.  It works.  No need to waste.  I'm mostly just using space heaters these days.  A rain forest ecology gets lots of rain, but isn't usually down to freezing except in the mountains, where skiing remains a popular sport.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}