{
  "id": "6428718352074916925",
  "title": "Happy Birthday to Me",
  "published": "2022-05-17T14:37:00.007-07:00",
  "updated": "2022-05-17T14:51:57.570-07:00",
  "content": "Storm (see post below) says she's not really leaving Portland, just that apartment on Hawthorne we all knew about. \n\nI exaggerate. Dr. D. knew where it was, as a true fan, who goes to her shows and tracks her career. He even hopped in his car to see if he could catch her last act, the final moving out scene, which she'd been streaming live on Facebook.  However, she was pretty much done before he got there.\n\nI wandered around on Division with a friend, who took me out for Thai Food.  \"Every time I try to cheer myself up\" I told him, \"I run into something even more bleak\".  Surfing Youtube, the Shanghai lock down added yet more weight to these shoulders.  \n\nI know Chinese feel the stress, and not just because of omicron.  The District seems hell bent on ramping up tensions.  Some talking heads babble about \"weakening Russia in order to take on China\".  So much crazy talk, from the perspective of an elder in my school (meaning me).  \n\nAn ideology is like a fatty lipid sphere, studded with talking points.  That's how they spread, by injecting those talking points.\n\nThank you Tara, a calling to offer your birthday wishes.  I answered Dick Tracy style from the Thai restaurant, talking on my Apple Watch.  There's no FaceTime on it yet.\n\nToday is a work day.  I'm in the gig economy and have a gig.  Yesterday I had two gigs.\n\nI told Maurice I'm in no mood to go on stage and take a bow anywhere, because that \"Bucky was a failure\" airbrush might just as well paint me.  The world seems interested in investing in the dreams of its most bellicose.  Realism is associated with jingoism.  \n\nNo, I don't think the Russians were eager for war.  Given my own Youtube channel features the old RT logo here and there, I'm easy to brand as not a NATO lover.  That means I'm likely fated to languish in obscurity when it comes to my own brand of positive futurism, given the climate.  \n\nOn the other hand, the Trucker Exchange Program is something we could work on for Chinese and African drivers.  It was never my intention to involve DC all that directly i.e. I wasn't especially trying to go \"dot gov\" with these plans.  \n\nTurning truckers into citizen diplomats would just be seen as more competition.  Probably a lot of State Department types already resent how some of those Youtubers have been doing their job for them.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}