{
  "id": "822518250235576583",
  "title": "Harboring Activists",
  "published": "2018-05-20T12:32:00.001-07:00",
  "updated": "2018-05-31T12:10:32.208-07:00",
  "content": "I retrieved my 89 year old mother from PDX last night.  She flew in from LAX on Alaska Airlines, her favorite as she tells everyone.\n\nCarol is a long time activist.  She attended the centennial celebrations for Womens International League for Peace and Freedom (WILPF) and talks about the signing of [the Kellog-Briand Pact](http://controlroom.blogspot.com/2016/06/golden-rule-part-2.html) is if it were yesterday.\n\nEleanor Roosevelt and Jane Addams are her biggest heroes, though I remember when Gandhi and St. Francis were the top two she'd talk about.\n\nWe all get to build a pantheon, an altar if you will.  Robert Thurman has Walter Cronkite in his, as I recall from a dharma talk he recorded in Bhutan. \n\nI wondered aloud on Facebook if anyone with serious peace activist credentials wants to camp out down the hall from her.  But such sponsored positions are hard to come by and I haven't succeeded in joining the ranks of non-profits.\n\nBlue House hosts a tiny business, mine, and I paid self-employment tax in 2017.  I have no employees and live on the edge.  Melody helped score some food from charitable sources.  She lives in an abandoned vehicle (in a beautiful forest).\n\nI stayed up late composing my cover letter to Oregon State, documenting my eligibility for OHP, a health plan for the bottom bracket.  My taxable income on my Oregon return was under $10K.\n\nOur Urner family has a long history of tax avoidance.  One way is by staying poor.  Another way is by not living inside any of the fifty states.  We're pacifist Quakers and dislike paying the war machine to do its dirty business.\n\nYesterday one of my most loyal detractors on Youtube decided to attack the Bucky stuff I'm known for touting.  That's Bucky Fuller, at one time a respected and recognized maverick architect and philosopher, definitely in my pantheon of Bodhisattvas.\n\nI'm glad we had it out, to the tune of about 150 posts in some buried thread.  David Koski joined in, adding some colorful metaphors.\n\nThat all happened on Facebook, which I've continued using through all the hoopla about how it's to blame for helping the UK meddle in US elections.   So many cabals.\n\nAs someone with a global perspective, I think it's a given that social media will become a tool for political campaigns, many of which roil beneath the surface.  The whole world has a stake in what happens everywhere.\n\nCreating hermetically sealed bubbles, impermeable to outside influences sounds anti-biological, though immune systems are not.\n\nSpeaking of cabals, you may read about mine in an old encyclopedia of conspiracies, so-called, by Robert Anton Wilson.  Look up Grunch in Everything is Under Control.\n\nIt points to my old website, long ago discontinued as Teleport was sold.  I have the newer Grunch.net domain name these days, set to renew in June.\n\nMarshal McLuhan to Bucky:  \"I have read your books and am ready to join your conspiracy.\"  Fuller argued that \"to conspire\" meant \"to breath together\" and didn't put a negative spin on the word, as many are reflexively wont to do.  Same here.  I always say:  \"if you haven't joined at least two conspiracies, you haven't lived\".  Something to that effect.\n\nYes, I put my period outside the quote marks sometimes, where most grammarians say I shouldn't.  An old Quaker named Thatcher wrote a manifesto on that topic, which I've misplaced, but I agreed with his reasoning.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}