{
  "id": "8468562893607447764",
  "title": "Hard Times",
  "published": "2008-11-18T05:07:00.000-08:00",
  "updated": "2008-11-18T07:17:27.173-08:00",
  "content": "Speaking of toxic landlords ([see previous post](http://controlroom.blogspot.com/2008/11/neighborhood-associations.html)), some infamous in our zip code ([97214](http://worldgame.blogspot.com/2008/08/block-party.html)), many are perversely raising rents at this time, as their response to scary economic news is to squeeze tenants even harder.What Congress apparently never understood, given those jobs pay pretty well, is that [the lending industry](http://worldgame.blogspot.com/2008/10/anyway.html) was never a kind one (nor gentle either), and now that it's weak, missing a war it'd banked on, it really wants to destroy a lot more lives, to keep a few rich on Wall Street.  Adding muscle to that species, in the form of a \"bail out\" is hardly good medical science, just more quack politicians with no clue, wasting a lot of time and energy dealing in sugar pill placebos.Fortunately, we don't really need Congress, nor the state legislatures, when it comes to altering the mix in mathematics and science.  Stanford is buzzing with [new curriculum writers](http://www.bfi.org/our_programs/who_is_buckminster_fuller/fuller_today), galvanized by some of the stronger teachers there, has already given us [LEP High](http://www.lephigh.org/), in the form of [Koreducators](http://www.koreducators.org/).  There's really no comparison between a stuck in the mud traditional curriculum, and one informed by 20th century breakthroughs, even some in the 21st, though we're only seven years into it.As a private sector (commercial) small businessman (like Joe the Plumber, but a geek), my focus is advertising.  If more people understood the world [from an engineering viewpoint](http://www.grunch.net/synergetics/motherboard.html), there might be less vulnerability to real estate bubbles, [or even dot com bubbles](http://controlroom.blogspot.com/2007/11/technation.html), with technology twisted to bizarre ends by money-lending practices designed for the dark ages.  We understand energy economics a lot better now.Our enemy is more a failure of the human imagination, which we have the means to counter (e.g. through advertising, as I was mentioning), not anything God-given about Spaceship Earth, e.g. some [\"fatal lack of resources\"](http://controlroom.blogspot.com/2008/05/wmbs-satire.html).[](http://www.flickr.com/photos/17157315@N00/3040347902/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}