{
  "id": "418989248777750781",
  "title": "Healing Meditation",
  "published": "2019-04-17T19:07:00.000-07:00",
  "updated": "2019-04-20T12:15:40.873-07:00",
  "content": "I took my eye off the ball today, when Carol went to purchase a ballpoint pen.  Rather than shuffle along behind her, I decided to hit the Cork & Tap on the first floor, for a single pint.  We reunited and headed over to Powell's, on foot, but there she didn't seem to have her wallet.  Uh oh.  She must have lost it when my back was turned (figuratively).\n\nThe punch line is she did have her wallet but just didn't reach for it enough.  The walker has a pouch that hangs in front.  I'd been home and to several cashier stations, making inquiries.  The day had turned bleak, as I realized we'd need to cancel her bank card or whatever.  A pleasant outing had turned gray.  These turns don't usually get to me but...\n\nThere's a big ugly world out their churning too, and so I did indulge in some despair.  But fortunately I didn't bottle it up, and found ways to release the pressure.  I still consider myself sloppy though, as I could have easily found the wallet had I really looked.  Second guessing in the rear view mirror.\n\nYeah, I'm worried about all the craziness, from Julian Assange, to Flint (new movie coming), to Venezuela, to the Refugee Science we may need to invent.  What have our universities been planning all this time?  They don't actually plan, they teach planners.  The planners go to work for city, county and state governments.  Does Oregon State have any thoughts about refugees?  I know there's a tight legal meaning wrapped around that word, that wouldn't cover homeless on the streets of Portland.  But then there's also English.\n\nWe're acting like the humanitarian crisis we need to solve is somewhere far away.  I'm seeing a need to up the level of conversation, meaning sharing more intelligent data.  I realize it's up to me to look for sources.  I can't expect everything to just fall in my lap.  But then I don't have a real job description when it comes to Refugee Science, other than I've been working on GST as a counter to the more oblivious forms of Economics.\n\nThe Quakers seem to be coming around to my \"military socialism\" characterization, which I admit works pretty well for some families.  Some of those housing units on Okinawa look pretty spiffy, and those aren't even the high ranking officer accommodations.  I'm just finding so little willingness to bend away from rigid adherence to yesteryear's ways of talking.  People get stuck in a rut.  Me too.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}