{
  "id": "5895758416560351826",
  "title": "High Desert Circuits",
  "published": "2024-05-26T18:55:00.000-07:00",
  "updated": "2024-06-24T15:53:20.543-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53749072454/in/dateposted/)\n\nSo I'm back in KPOV country, in what we call high desert Oregon. People take music seriously in proportion to what else is going on, it seems to me. In any case, here and in the midwest I've discovered some of the most seriously music-oriented subcultures. Shout out to WEFT in Champaign-Urbana.\n\nI'm hopeful I'll get to meet with The Other again for a spell, the host of the Saturday noon Psychedelic Rebellion, one of my favorite shows. I tune in just about any radio station via Radio Garden, an app on my iPad. I'm listening to KPOV right now in fact.\n\nLast night, our party made it to Furiosa, the latest mega-movie epic extravaganza in the Mad Max post apocalyptic idiocracy series. We caught it at The Bagdad. All I'll say here is the transition to a more Smith Rock style environment the next day felt prefigured, although we're still in a Land of Abundance here.\n\nThis computer book I picked up for free from a Lil Library (curbside) in the hood (foreword by Ward Cunningham), reminds us that Party is a great moniker, akin to Entity in allowing for many subclasses, such as families, any table of clientele at a restaurant. I'm thinking of the famous little tips database. Smokers? Really? We're biased to think in terms of \"political parties\", not so much \"party lines\" (as in telephony, a forgotten meaning, not as in \"toeing the party line\"). These \"biases\" get reflected in word2vec type data sculptures (slowly moving, heavy mobiles in the wind, tubular bells).\n\nI've been into helping Judy catch up on the various Art World advances occurring on a broad front collectively referred to as EayEai in the literature i.e. \"AI\". I've just added \"EayEai\" to my dictionary as I can see reasons to clutter my namespace with such a monstrosity. Right up there with \"egg-zist\". She's a musician, more into country folk than goa trance. We share a love of Swingle Swingers doing Bach numbers. We were both nerdy as kids I guess.\n\nPart of my demo involved prompting \"Giant King Kong gorilla climbs smith rock in Oregon with mountains in the background and surprised hikers in the foreground\" and getting the above. No post production editing.\n\nYes, we stopped at Eagle Crossing, although I didn't take Sydney inside. That's a family favorite, a great place to get fry bread.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}