{
  "id": "8232368100060171218",
  "title": "Hobbit Economics",
  "published": "2014-12-20T15:15:00.000-08:00",
  "updated": "2014-12-21T09:22:04.288-08:00",
  "content": "\"everything is awesome!\" (so much gold!)\n\nSo King Thorin has a serious headache with all that gold, inherited from the [nasty dragon](http://worldgame.blogspot.com/2013/09/leveraging-python.html).  If he just lets it out the door then pretty soon it won't be that scarce.  We saw how the villagers treated it, but how long would that last?  It would have to be meted out, and you would need to be an Einstein, or [Milton Friedman](http://mathforum.org/kb/message.jspa?messageID=9666526), to figure out the velocity of money issues.  How fast would be the military build-up?  Would inflation lead to food riots, with wheel barrows of gold barely buying a zucchini?\n\nWhat are orc children like?  Did we see a hatchery in a back episode?  Do Mr. & Mrs. Orc ever party, and do they form nuclear families at all?  They don't appear to have much use for money in other words, or the finer things in life.  That's probably why Smaug's Mountain has to be \"strategic\" in some battle ground, as a bunch of gold is not attractive enough.\n\nIndeed, what can gold buy you?  The Elves have what they need so remain aloof.  No HDTV, no iPhones... there's precious little money can buy back then, and one gets tired of mere jewelry and gold bricks used for street pavement.  So what?  What's so \"wealthy\" about streets paved with gold when you get right down to it?  Slippery, impractical.  Back to Thorin's nightmare.\n\nOne can almost read Gandalf's lips there at the end when he says Bilbo is a terrible liar.  We all know he's got the ring and Gandalf understands the Shire is the best place for it as the saga continues, with Mordor on its military build-up, post face-off with the [elvyn chyk](http://controlroom.blogspot.com/2009/06/unconference.html) (tail tuck time).  We know that in the audience as well, that Gandalf is just biding his time, plus the book readers among us even better understand how the ring is increasing Bilbo's willingness to lie, never mind how bald facedly i.e. badly.\n\nThe first of the three Hobbit films got me claustrophobic and I'm reminded by last night's Solstice banter that the book is that way too.  Now that I've seen [the Snowden documentary](http://controlroom.blogspot.com/2014/11/citizenfour-movie-review.html), I can't help but make the pun \"snowed in\" and draw the parallel of getting stuck in some hotel room in Hong Kong for N hours.  Lets just start on some adventure already!  People should let up on Assange.  In general, lets be a lot less Mordor-like, less Orc-like, if we really think [the Hobbits](http://worldgame.blogspot.com/2004/12/intourist-pdx.html) won or deserved to.\n\n[](http://photos1.blogger.com/blogger2/3273/1616/400/mffront.1.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}