{
  "id": "3010765253238420292",
  "title": "Hollywood East",
  "published": "2024-01-27T18:30:00.000-08:00",
  "updated": "2024-02-01T08:03:24.006-08:00",
  "content": "I was saying to Thirsters, on a Zoom call the other night, that I think America is a great country, but that this greatness is not somehow championed nor best advertised by the city-state of WDC, aka The District, home of the Beltway Mafia. We have many great cities, not to mention rural areas. The wilderness is what’s greatest of all.\n\nFor semantic convenience and thought-organizing purposes, I have come up with a trivium / quadrivium type thing, cross STEAM and PATH, Scrabble-style, on the letter A (for Anthropology). T = Theater (which is a lot about psychology, cite the Oedipus Complex, or the Military-Industrial one); whereas H = History, what one might call “theater writ large” (not just a simulation). \n\nWe often use fiction (especially science fiction) to forecast and simulate what’s eventually non-fiction (what will eventually be, versus what might have been). \n\nWe rehearse in the imagination (the simulator), before popping the question (whatever question, let’s assume consequential), or taking the stage, podium or battlefield. We plan and cogitate, before launching some campaign.\n\nThe transition from Theater to History is fairly seamless in that thespians have real lives, as do playwrights, directors, storytellers of every feather. Theater production is anchored in the real world. \n\nWe also have celebrities, movie stars, who step off the stage or out of the big screen to become political leaders, such as Arnold Schwarzenegger and Volodymyr Zelenskyy. \n\nI explain all of this as background for why I think “Hollywood East” is a good synonym for The District. People flock to DC for the same reason they flock to LA: they want speaking parts, and/or parts as extras, in some lifestyle drama that also pays the bills. They want to be paid actors. Don’t we all?\n\nA reason for thinking of DC as another Hollywood is that both cities specialize in fueling our imaginations. Indeed these cities work together, and tend to speak the same language of public relations behind the scenes.\n\nSo am I forgetting the role of New York? What about Las Vegas?\n\nI’m not trying to forget anything, so much as remind people we have a choice of where we buy our melodramas. WDC wants to sell both Sinophobia and Russophobia simultaneously. Are we in the market for that kind of drivel?  Maybe we’d like to sample other phobias for a change, not to mention “philias” (affiliations).\n\nSome cities might want to opt out of DC’s unhealthy programming. That’s their freedom: to free their own minds from glitchy, cultish brainwashing pushed by competing think tanks.\n\nWe hear a lot of talk about community standards. Perhaps we regard WDC’s output as too much in the “disgusting” category. Maybe Hollywood hasn’t been that great either, in recent memory, with stellar exceptions.\n\nSo am I just engaging in more boosterism, pushing Portland (the weird one, in Oregon) as a countering / competing source of memes and dreams? I would not say “just” but that’s an element of my agenda for sure. \n\nI’d like to keep America great by rebalancing the relationships among its cultural capitals. That’s a global calculus as well. Or call it World Game, in some dimension.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}