{
  "id": "8689060061370471133",
  "title": "Hollow Schools",
  "published": "2017-02-19T10:48:00.001-08:00",
  "updated": "2017-02-19T11:26:46.244-08:00",
  "content": "The emerging trend in the high tech economy is to provide unemployed or \nunderemployed workers, college students, curious teens and others, with \nmany \"hollow school\" options, meaning the exercises are canned, and no \nteachers are present.\n\nWork through an automated textbook (web-based), and you'll pop out the other end of the pipeline with the needed skills.\n\nThat's a theory, quite unproved.  It'll work for some people, as most \nfad diets do, and those are the people you want giving glowing \ntestimonials. \"I did the WorkForce Training [tm] and now I'm making one \nhundred K!\"\n\nIs academia the source of this dream? I'd say more it's from publishing.\n We need students / customers to \"work through\" our material. The \nteachers are no longer in real time, just look it up on Stack Overflow if\n there's a problem, or maybe we set up bandwidth for students to help \neach other, perhaps awarding them extra credit somehow for so-doing.\n\nThe messy business of keeping a faculty alive is what's left to the \nuniversity in this picture.  The publishers siphon off students and \nfurnish some credential based on \"working through\" their offerings.  \nStates find it easier to work with publishers, which are businesses, \nthan with universities, which are not as eager to get behind \nself-gutting platforms.\n\nWhere a more intelligent government + university system might step in, \nis with experiments to reverse the model, and pay students, instead of \nmaking students pay. If learning JavaScript + HTML + CSS is so vital to \nthe economy, then lets bleed out a stipend, an allowance, could be to\ncyber-currency wallets on the cellphone (university provided?).\n\nPay teachers and students both, as they'll be exchanging roles all this \ntime anyway. I may learn React and/or Angular from you (both \nJavaScript), but then I'm a Python teacher and will teach you Flask.  \nBesides, it's work to study.  Work-study is what we do for recreation, \ncradle to grave.\n\n\"Where does the money come from?\" you ask.  That's a question for \ngeneral systems theory, the answer being \"from the sun\" (current = \ncurrency at the root of it all). Some economists may have competing \nanswers but GST is more of a science than Econ is.\n\nIf you want to limit how these work-study program credits might be used,\n that's what FinTech is all about.  Pay students to learn JavaScript in \ncurrency exchangeable for groceries but not booze. If you're studying \nbiology, earned credits might be towards a catalog of microscopes and \nrelated equipment.\n\nAt the O'Reilly School of Technology (OST), our PR was contra-MOOC in \nthe sense that we didn't think a 1:10000 teacher-student ratio was all \nthat workable.\n\nNot that there's anything wrong with watching Youtubes. One may learn \nplenty from passive viewing, as well as from reading. But when does \nanother human evaluate the quality of your own work? Are you tested only\n by machines?  What's the workflow?  Is the school you're in hollow?\n\nDo you think by watching doctor shows you become a doctor?  Do we get \ncomputer programmers from robograders? What's the fail rate? What's the \ntheory?\n\nAt OST we were more wanting to duplicate the Renaissance 1-on-1 \napprentice model, where, in joining the JavaScript guild, one gets \npaired with a guru, a guide, someone who will work with you directly and\n think about your code with you. A co-programmer of sorts.\n\nThe whole thrust of Extreme Programming + Agile was \"those who work \nalone don't develop as team players.\"  Which is not to say working alone\n is unimportant. There's no either/or here.\n\nThe irony in this picture is hollowed out schools are scrambling to deal\n with the unemployment problem created by letting go of all the teachers by hollowing out all the schools.\n\nWe think faceless bureaucracies are now in position to roll over the \napprentice model.  Finally, we don't need to worry about teachers i.e. \ninnovators and researchers, people who study for a living. \n\nWe can freeze our pot of gold curriculum into that end of the rainbow \nskills training we believe is out there, and all our unemployed will get\n their $90K full stack developer jobs. Solution provided!\n\nYeah right. Count me a skeptic.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}