{
  "id": "819009653289373181",
  "title": "Home Appliance Story",
  "published": "2007-11-18T05:31:00.000-08:00",
  "updated": "2009-09-21T12:09:55.759-07:00",
  "content": "Les & Elise tackled my dishwasher problem with gusto.  The thing had become anemic, only the bottom rack usable, and the heating element was looking pretty fried.The Yellow Pages guy had failed to find the real problem, had charged me $70 anyway, whereas Les quickly got to the heart of the matter:  the chopper blade had come off the circular pump intake mesh, leaving it to clog with grime, which explained the low water pressure.  The plastic mounting post was irreparable.Elise, a mechanic in her own right (she fixes old Volvos etc.), managed to track down and secure this obscure assembly, along with a new heating element, just minutes before Saturday closing time at a nearby supply depot.The heating element came with a replacement circuit board controller and a warning to only install both, suggesting to Les there'd been some shortcomings in the previous programming i.e. I probably wasn't the first to experience a heating element melt down.My only role in all this was to dash to the hardware store for a Torx screwdriver kit, and to hold the flashlight.During final reassembly, Les and I took a time out to express our patriotic fervor regarding our privileged position as civilians in a society with its act together enough to make such repair stories possible.I attributed our success as a culture in part to our willingness to [rant](http://groups.google.com/group/soc.religion.quaker/msg/9b1ac2571f6b035e) against ourselves, often in the context of hard core trainings, illustrating with a five second [Full Metal Jacket](http://www.youtube.com/watch?v=aUc62jD-G0o) impersonation crossed with some football coach.Les agreed, then told the story of this top manager he knew, who lived across from a high school and finally got tired hearing coaches screaming at their male trainees about their being \"women\" in the sense of incompetent sissies.  She went over there and really gave 'em a piece of her mind, again making a positive difference to our culture.Later, while Ruth and Tara played upstairs, the three of us watched a show about the Galapagos on the [National Geographic](http://channel.nationalgeographic.com/) channel, which is where Les & Elise got married.  The dishwasher is working great now.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjAha1mHLxOsALvD5WPjLDjKKQbi-xLbwfrjDPLpNhqz-Xpqr8GsiKxogq8aNXI68feuvNewAWA-MIcuY3dRnfRjOglEiPdw4sfyfKeViP9HNGTTe9mkeodFz6kboJJV4UVZfiO/s1600-h/dishwasher_parts.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}