{
  "id": "2258983642167791386",
  "title": "Home Sweet Home",
  "published": "2018-05-27T01:16:00.005-07:00",
  "updated": "2022-03-30T11:20:40.288-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/27510523387/in/dateposted-public/)\n\nWe learn from Geoffrey West of Santa Fe Institute and others, that universities have greater staying power than businesses, thanks to a more robust institutional structure.  That may not be the best way to look at it though.  There's nothing necessarily shameful or unfortunate about a business having a short half-life.\n\nFor bookkeeping purposes, one might form a company for the express purpose of making a Netflix movie or Youtube channel production.  Once the body of work is complete and published, the company disbands, not with a sense of failure, but with a sense of completion.  Those who worked in this company remain proud to have it on their resumes.\n\nA university has more of a commitment to reinvent itself, in order to meet wave after wave of incoming generation, each already benefitting from the experiences of the previous one.  A business need not adapt in precisely this manner.\n\nThe more apt analogy might be the nation-state, some of which have longer histories than others, some of which have changed character and boundaries rather drastically.  Think of Austria.  Think of Pakistan.  Companies also beget child companies, or spin-offs.\n\nIn other words, although we maybe have some cause to feel pride when human institutions last a long time, lets not stigmatize the short-lived ones just because they're short lived.  Even religions might be gems of sheer genius yet only last a generation or two.  That they're so fleeting is not a mark of failure, necessarily.  Sure, it may be, depending on the stated goals of the founders.  In the case of [2 Dickinson Street](https://worldgame.blogspot.com/2005/05/princeton-25th-reunion.html), we have to recognize it's an old Victorian made of wood.\n\nThe institution of \"nation-state\" may not be \"for the ages\" either, and that wouldn't be a Great Tragedy necessarily.  \"One planet, one people\" does not necessarily mean some tyrannical One World Government pyramiding (bottle-necking) to a few people.  We don't need some singular cabal to boss us around.  I learned that at Princeton.\n\nComplex systems have self-organizing potential.  Regional bodies and overlapping steering and oversight committees (to use some Quaker jargon) may be sufficient to keep the public in a willing mood, sufficiently participatory to keep a public sector alive and well.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}