{
  "id": "1604908302048365786",
  "title": "Homework Requirements",
  "published": "2018-04-21T11:40:00.000-07:00",
  "updated": "2018-04-21T12:03:03.900-07:00",
  "content": "I've been getting some push back regarding my contention that everyone in the intelligence community knows about Applewhite's retirement project to boost positive futurism, by teaming up with one of the best known, and most quirky, of futurists, Bucky Fuller.  His geodesic dome appeared in Kabul, Afghanistan and Khrushchev quickly recognized its utility going forward.\n\nThe domes also featured along the DEW line, which is how Fuller and the University of Toronto first connected, through their mathematics department.  That collaboration continued.\n\nThe CIA features throughout Fuller's later writings especially, at least attracting the eyeballs of the Russian services.  Whether DC political hacks, with pretensions to membership in the intelligence community, have actually done their homework is another question.\n\nThe shift in the center of gravity away from DC might have something to do with their missing the boat?  That trend started under Reagan-Casey.\n\nBasically, if you don't know your American history well enough to understand about Fuller's contribution, you don't have enough perspective to serve in the CIA at any level.  That's how I'd translate my thesis into plain English.\n\nA lot of diplomats and cultural attaches display Fuller tomes on their shelves, signalling to foreign counterparts that they're not dolts.  New England Transcendentalism is alive and well in diplomatic circles. \n\nThe symbols and signs used to exchange intelligence (SIGINT) make it fairly easy to identify the real deal versus wannabe IC types.  I've already indicated to RT what Americans such as myself are looking for, in terms of a pattern language or code.  You can dig that up in Medium if you like.\n\nI feel these litmus tests are necessary given neocons have invaded DC and plunged it into disrepute.\n\nThe Russians have been friendly enough.  The intelligence community is of course global and gets along with itself better than in the old days, despite lies from corporate media.\n\nCorporate persons (as in \"corporate personhood\") are not known for their smarts.  If \"making money\" is your only goal, then you stop making sense eventually, witness CNN.\n\nI'm busy recruiting for the IC of tomorrow.  The Applewhites [visited me in Oregon](http://grunch.net/archives/171) that time, helping to pass the torch to my generation.  Now a next generation is rising through the ranks.\n\nAnyone reading my blogs and journals knows what that looks like.  Helping weed out the fraudulent wannabes is getting easier, as the reading public gradually wises up.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}