{
  "id": "5779304240904466906",
  "title": "Hotel World",
  "published": "2013-08-22T20:54:00.001-07:00",
  "updated": "2014-04-06T10:41:52.504-07:00",
  "content": "Portland, Oregon Hilton, 23rd Floor\n\nI'm a small timer in Hotel World, so I felt quite privileged to get an invite to tonight's soiree at the Hilton in downtown Portland.\n\nThe architects have redone the 23rd (top) floor not as some private penthouse but as a configurable set of rooms which, all opened up, form quite a commodious space.\n\n\"Wide open\" was the floor plan this evening, with the air walls removed.\n\nThe occasion was to showcase the remodeled space to conference organizers and, as [a guy on the edge](http://mybizmo.blogspot.com/2011/09/my-character.html) of that business, looking over Steve's shoulder, I sometimes peek in.\n\nAlso on display:  some of our best local caterers.  Most wore Hilton uniforms but I noticed some others as well, like at the main cheese station.\n\nThese would be caterers the Hilton could put you in touch with.\n\nAlso exhibited:  this style of event, with interesting food stops or stations scattered around the margins, all small dishes, nibble food one could say, but with forks or spoons, and quite substantial.\n\nKobe beef, sushi sized, sizzled on lava.  Top quality shrimp cocktails.  Cheese plates.  Grilled and stuffed mushrooms.  The final cooking step is sometimes done right there at the station.  One sees it's quite fresh.\n\nPeople helped themselves but given the tiny plates, which one put down -- and they'd disappear, thanks to a deft staff -- the flow seemed natural and encouraged mingling.  We had places to sit, but not too many.\n\nTo be alone with your thoughts, I recommend the floor to ceiling windows and a pillar table.  Someone interesting will join you, almost certainly.  It happened to me.\n\nPeople who wanted to meet, or simply should, easily could.  The bandwidth stayed high.  That's what I like about the space and/or event.\n\n[Steve](http://worldgame.blogspot.com/2013/08/visiting-open-bastion.html) had actually staged an event here earlier, one of a select few, but not in this giant room.\n\nDown the hall, to the south, you'll find a smaller room suitable for a more intimate breakfast or dinner, with place settings and seating for all.  There's still space to stand and mingle in the serving area, where diners go to fill their plates.\n\nNewcomers come directly to this space from the elevators.  We were given floor plans as we took our badges, to help plan our events.\n\nSteve's [OSCON Survivors Breakfast](http://controlroom.blogspot.com/2013/07/oscon-orm.html) was in this sit down format. I was privileged to be there also.\n\nBack to this evening:  I hobnobbed with a Hilton sales guy, Anton, fresh from Chicago.  We talked about pop-up galleries and how these would be ideal in this space.  Artists could debut maybe one or two nights only, say over a weekend, with a few of these food stations going.\n\nYes, it would be an investment.  Sometimes for charity.\n\nOr one might imagine a traveling museum that only fleetingly appeared and was not easy to just stumble upon or into.  Who knows, maybe it will come through Portland. \n\nThe established galleries (or museums) might resent the competition but I'm saying any of them could play too, in some corner of the market.\n\nTop of the world event spaces are perhaps plentiful at the global level and hotels [aren't the only ones](http://worldgame.blogspot.com/2011/02/open-secrets.html) with those.  The alchemy of creating events, and matching them to the right venue, is not the easiest to master.\n\nThe real challenge, or one of them, is in how do you select and screen your guests.  If they need to claim a name tag at the door, this could be at the top of the elevators, where there's more space to aggregate.\n\nThey had outside security at the bottom though too however.   A swipe card or ticketed event might set up in the ground floor lobby.  More like [The Nines](http://mybizmo.blogspot.com/2010/11/goscon-2010.html) with service counters at street level.\n\nIn any case, this was not some wide open public event, but had badges pre-printed.  Weddings are often run this way.  The guest list is meticulous.\n\nI told Steve my story, and Patrick, of going to Junior English School in Rome and having a friend who got to live with his family right inside a Hilton hotel.  His dad was the hotel's manager.\n\nI got to stay over at the Bondis sometimes and order room service for dinner.\n\nTo me at that time, this seemed beyond cool, to enjoy a living standard so much higher than any Caesar's, now that we had electricity and TV and Lego and such.\n\nStill no personal computers yet, no smartphones... no i-Stuff.\n\nYet we were definitely lovin' it back then in the roaring 1960s, hoping we'd live to see 2000.  Those holding atom bombs might not let us.\n\nI'm not talking a whole 50 years ago quite.  Not that far back.\n\nToday is August 22, 2013 and people are remembering the March on Washington and MLK's I Have a Dream speech, and then [the horrifying Kennedy shootings](http://controlroom.blogspot.com/2013/05/murder-mystery.html) and assassination of [MLK](http://mybizmo.blogspot.com/2006/01/mlk-day.html).\n\nThe world got a lot more bleak in a hurry for little people like me.  That was 1963.\n\nBy 1969 we were looking back on Woodstock.  I was about done [being a cub scout](http://mybizmo.blogspot.com/2006/07/eighth-grade.html), in Rome.  Hayden Dunn, Mahlon Morse, Kijoon Yu, Reggie Hyde, Joe Montabello... my mom was our den leader, then Hayden's dad was, for Weblos.\n\nNow I'm the older guy with gray hair, still bouncing around in the same matrix, yet it's also different.  The movie The Matrix was still in the future back then (duh).\n\nI'd seen 2001 Space Odyssey with my dad at a theater just off [the Via Veneto](http://travel.nationalgeographic.com/travel/city-guides/rome-walking-tour-2/), closer to Villa Borghesi than Piazza Barberini, not far from the American Embassy (where neither mom nor dad worked -- but friends of ours did, sure).  [La Fiametta](http://unamericanaaroma.com/2007/11/12/going-to-the-movies-in-italy/).\n\nNot having read the books, I was a tad confused by the ending of that film.  I wasn't the only one. What was that obelisk anyway?  Like the beginning was confusing also.  But cool anyway.\n\nI also went to English language movies at [the Pasquino](http://www.tripadvisor.com/ShowTopic-g187791-i22-k2234391-English_language_cinema-Rome_Lazio.html) in Trastevere (Yellow Submarine) and at the Archimedes (007 movies) closer to my home in Parioli.\n\nBut I wander...",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}