{
  "id": "463307990318250046",
  "title": "Hypernormalization (movie review)",
  "published": "2019-04-08T14:27:00.001-07:00",
  "updated": "2019-04-08T14:52:20.755-07:00",
  "content": "I'm on an unplanned Adam Curtis kick, a marathon, starting with The Century of the Self, and moving on to Hypernormalization, but remembering The Power of Nightmares from [earlier blog posts](http://controlroom.blogspot.com/2006/01/power-of-nightmares-movie-review.html).\n\nWatching a lot of the same style in one go is to become aware of the thematic backdrops, impressive skyscraper vistas, which scream two messages:  planned and unplanned.  The narrator holds to a dialectic between chaos, and politics losing all ability to shape events, versus some renewed sense of hope in a new managerial philosophy, which then inevitably falls by the wayside.  The crashing of waves on a beach comes to mind.\n\nThe style is one of reverie, with the narrator sometimes leaving us to interpret for ourselves the blizzard of images, or maybe just a few.  The music and other soundtrack, as distinct from the narrator track, is also impressive.\n\nThese movies tell stories, I think effectively, and so take their place as potentially reality-shaping.\n\nAs I mention in my earlier blog posts [of today](https://worldgame.blogspot.com/2019/04/documentary-city.html) and [yesterday](http://mybizmo.blogspot.com/2019/04/on-first-day.html), although I was caught up in Occupy Portland,  I don't have a strong sense of how it connected to any events in the Middle East.  I'm not saying there weren't connections, only that I wasn't doing anything to influence events there, nor aware of people around me doing so.\n\nWhere Hypernomalization is into connecting dots, I'm sometimes not making the same connections.  However I do like connections-making narratives, so if we focus on different dots, that's not a criticism on my part.  I learn from some stuff I've been missing.  Like I'd forgotten, if I ever knew, Qaddafi got to stay in a tent on a Trump property that time.  Both were into getting publicity.\n\nThe angle on Nine Eleven (911) is to focus on the sense of foreboding and literal foreshadowing leading up to those events in 2001.  Syria is a core focus.  The arc is vengeance for Kissinger's betrayal, in terms of never planning a real future for national boundaries.  I'm not saying the movie blames Syria-Iran, having argued effectively that reality is plastic.\n\nWhen we get around to the Russians, it's as if they've invented \"reality shaping\" all over again. We've had the Vienna Circle, through the Freuds (including Anna) telling us to tame the id through conformity, or, through the human potential movements (e.g. est) channel it to overturn and reinvent a stultifying earlier reality.\n\nEither way (whether for controlling or unleashing), politics is projected for (and by?) a collective unconscious, an irrational side.  I'm venturing into Self episodes, having seen those last night.  But then we're supposed to believe the Russians suddenly came to similar conclusions only after the USSR had faded?  Or does every generation discover these same truths?\n\nIn the sight of God, no nations may exist, except in the minds of little humans, post Babel (I'm getting Biblical).  But that's where it (existence) most matters (in peoples' beliefs).  One doesn't dismiss something as not existing by saying that thing is widely believed in.  That's not a recognized logic or rhetorical device.\n\nThe youth of cyber-America don't have any real solutions once technology gets them to show up in large numbers.  They stand around going duh.  Lets be practical though:  OPDX in downtown Portland was not sustainable.  We had an experiment in self management.\n\nThe people threw a big party, coming in from Beaverton and all around, a kind of victory celebration, very nonviolent, after which the leadership was happy to call it a day.  Now of course \"[the leadership](https://mybizmo.blogspot.com/2011/10/halloween-2011-1-of-3.html)\" is oxymoronic in anarchic situations, and I'd be one of the first to admit that. \n\nAt the end of the day, I'm prone to marvel at the same tenuous picture of a creature with free will, somehow left adrift to figure a way forward in ways crows and cattle don't have to worry about.  We've been given this gift of a big intellect, and we're still not sure what it's for, after all this time.\n\nClearly, our big intellect suggests we're here on Planet Earth to tackle some big problems, and before we start sounding hopeless lets at least take note of some abilities, some track record.  Yes, we've done a lot to disappoint Freud and lead people of conscience and insight to despair for the human animal.  I've already admitted to a streak of misanthropy.\n\nThese films keep circling around that same conundrum, of in what sense is humanity free and is there a constructive, intelligent way to exercise this freedom, insofar as it exists?  The question seems apropos, but points to an unsettled science, or to philosophy in other words.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}