{
  "id": "8511227003090612337",
  "title": "I, Robot",
  "published": "2017-01-22T21:30:00.000-08:00",
  "updated": "2024-03-19T18:06:07.889-07:00",
  "content": "I reconnected with Russian mysticism, as some call it, thanks to a pile of books for sale at Multnomah Meeting. I've since traced prior ownership, of these four volumes, from a set of six, by Maurice Nicoll, to  Friend Marson (\"the Marsonite\" I sometimes call him, a Peace Corps vet).\n\nI'm referring to Psychological Commentaries by the Scottish Jungian, also a disciple of one \"Dr. O\" i.e. P. D. Ouspensky. Where did Dr. O enter our story before? In [Linda Dalrymple Henderson's book](https://mitpress.mit.edu/books/fourth-dimension-and-non-euclidean-geometry-modern-art), about non-Euclidean geometry and modern art. Ouspensky was branding around 4D, an icon which the young Bucky Fuller took on as well. Einstein was flying this banner. The 20th Century was looking propitious.\n\nAs I've been clear about in other blog posts, we have multiple meanings of '4D' in play here, but let me avoid that whole thread and get back to the Russian mystics.\n\nNicoll suggests we get back to developing our essence in later life, after maturing through the earlier stages. We have a fully formed personality by then. We've worked out with the reality principle. Put another way, our egos are fully developed and now we're ready to go the next step as it were, to reach for wisdom.  How is that done?\n\nThe Russians want us to confront our robotic nature, our mechanical side. That's not always easy for US Americans because \"robotic behavior\" is usually demonized as somehow totalitarian (which it may be). Using \"robotic\" without a negative spin, with reference to human behavior, is akin to making \"porn\" somewhat meaningless, as when we talk of \"train porn\" (admiring trains, thinking of a Barcamp talk by [the late Igal](https://controlroom.blogspot.com/2011/10/at-wherecamppdx.html), PDX geek, worked with Patrick a little).\n\nLet me take a well run (smoothly clerked) Quaker business meeting as my model.  The people in attendance all have considerable experience, personalities fully formed.  Kids would usually be off elsewhere, in a program of some kind. Business meeting is all adult stuff, pretty much, awfully dry for little kids especially. Nursing mothers are certainly welcome.\n\nIn saying the meeting went like clockwork, I'm not making a negative characterization. However if I say that Friends were robotic in their practice, that sounds insulting, like I'm saying \"unimaginative\" or \"dull\" (without the spark of life etc.). That's the cultural divide I'm facing, in translating these Psychological Commentaries into the language of my locale. \"Robotic\" is a term of admiration.\n\nThe resolution of my puzzle is perhaps through the example of Muhammad Ali, a man of schooled reflexes who could hold his own both inside and outside of the ring.  He professed the discipline of Islam in later life, however he came to that religion already self-disciplined.  In Afro-American subcultures, \"machine dancing\" is a recognized art form, influenced and enhanced by some of Michael Jackson's maneuvers.\n\nThrough \"machine dancing\" we move to the martial arts and all those routines people go through when working for that next colored belt, the next level.\n\nTrue, Dr O. and Maurice want us to see, in our robotic nature, those features we may at first project on others, when we fail to \"remember ourselves\" as they say in their jargon.  I'm not suggesting that Friends all convert to such thinking.  However I do think it worthwhile to remember our deeper culture and apply that in our daily lives. Teachers like Maurice did not do all that writing out of sheer boredom. They were working towards a less violent world, less indulgent in negative states, from which great misery arises.\n\nFor those not familiar with Ouspensky, one of his famous maxims is \"man cannot do\" which is on the face of it meaningless. I'd say the program is meant to apply what Nicoll calls \"the shock of consciousness\" which is an experience of extreme determinism and epiphenomenalism wherein all humanity appears to be on autopilot. Walt Whitman's The Sleepers is a soliloquy of great compassion, by someone with a body electric, another robot in other words.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}