{
  "id": "1744807828373815053",
  "title": "Identity Management",
  "published": "2008-06-06T10:07:00.000-07:00",
  "updated": "2008-11-15T02:36:00.262-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiAzNn1hlmPcoykwHCy54iDUUtHx88BKqGgTH6VnMR8Nci1srtQlUgpOW-ZOWJR7TGJTIm8sibxjchukQm0QaAkKHfeBlcM4SdCbsbsG5uhTM4eyXS9Id41Xk04lTaFBSEw8aaq/s1600-h/kirby_guy.jpg)Relief workers see a stream of people in need, of water, of medical attention. But community services depend on a notion of persistent identity, matching individuals with programs, and tracking progress through those programs.Ongoing medical care depends on accurate charting, whereas academics work with transcripts and portfolios.  Individuals are not just snapshots in time.To this end, field workers have ways to assist in the establishment of medical records, using Google's CCR-based approach for example, but a strong community doesn't leave identity management only to outsiders.Record keeping is a vital internal process, whether by word or by mouth, with the extended family a typical repository of vital information on family members.  The workplace is another institution for keeping tabs.  Some subcultures code personal histories into their uniforms, along with rank and/or serial number.A strong education system gives students a sense of responsibility for their own identities, what to reveal, what to conceal, which aspects to cultivate, which to retire, all based on reality checking, feedback from one's environment, but of course also based on one's heartfelt desires, intuitions, callings and/or leadings as we Quakers sometimes say.Speaking of Quakers, we often use journaling and/or web logging to assist with our identity management tasks, going back a few centuries.  This practice is in no way limited to just Friends of course, is intrinsic to bookkeeping, to public service.Autobiography is closely related to journaling, becomes a multimedia enterprise in some cases.  Biographies, authorized or not, typically use such logs and/or journals, other self chronicling work, as raw material.  Historians and cultural anthropologists study collections of biographies, and so on, helping future societies benefit from sometimes hard won experience.We all develop habits of mind. Providing students with strong individual identity management skills is part of the work of building democratic societies, wherein semi-autonomous individuals really know what it means to mind their own business, and do so responsibly.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}