{
  "id": "114296057696367614",
  "title": "Identity 2.0",
  "published": "2006-03-21T09:01:00.000-08:00",
  "updated": "2006-11-15T11:44:16.967-08:00",
  "content": "My topic this morning relates to a talk I heard at OSCON 2005, from the main stage, by [Dick Hardt](http://www.identity20.com/media/OSCON2005/).  His brief:  we need identity servers that authenticate to the various services behind the scenes, so we don't have to always re-enter the same stuff.  Identity management would become the identity owner's responsibility.  Having it all gathered in one place would actually make its theft much harder, as you couldn't get by with only fragmentary data, e.g. just an SSN or credit card number.  Banks would \"go to the source\" and any hack of an Identity Server would be national news, not just run of the mill fraud, a cost of doing business.Speaking of identity, I've been trying on \"[Silicon Forest exec](http://mathforum.org/kb/message.jspa?messageID=4581466)\" for size.  I think that pretty well sums it up.  I wrote to Allegra yesterday that I didn't want to be on BFI's Shelter Committee just now, not because I'm anti-shelter (duh) but because I'm trying to clarify my role in the World Game theater.  I'm like this computer geek with aspirations to invest more in multimedia (4D Studios), out of my desire to craft some [dynamite curriculum](http://mathforum.org/kb/thread.jspa?messageID=4581750) for future [Silicon Foresters](http://mathforum.org/kb/thread.jspa?threadID=1351435) (no, not exclusively).In order to pass along this culture, a thriving one, we need to leap frog various bastions of [Ludditism](http://en.wikipedia.org/wiki/Luddite), including, I'm sad to say, [within the education sector itself](http://mathforum.org/kb/message.jspa?messageID=4582153).  Too many teachers feel trapped in dead end jobs, and take it out on their wards.In particular, I'd like to see a stronger curriculum served through [the Pentagon Channel](http://mybizmo.blogspot.com/2005/02/pentagon-channel.html), as I think military investments will make a huge positive difference, if there's real intelligence behind them.  The paramilitary gray zone between hot and cold war, is also the zone of disaster relief and emergency management.  We're looking to economize through dual-use technologies.  The same [Fly's Eye Dome](http://worldgame.blogspot.com/2006/01/location-scouting.html) skeleton could contain a variety of hardware and software.A military that knows how to perform civilian duties provides a stronger career path for would-be recruits, as they won't be irrelevant deadweight in peacetime.  And for [conscientious objector types](http://en.wikipedia.org/wiki/Conscientious_objector), a purely civilian trajectory might be plotted, such that if war breaks out, they'll be tasked with the sometimes extreme services our nation has historically required of its peace-loving leaders.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}