{
  "id": "9209730161705441435",
  "title": "Illiberal Liberals",
  "published": "2009-12-07T08:00:00.000-08:00",
  "updated": "2019-03-29T12:01:53.734-07:00",
  "content": "[author's note:  Google decommissioned the knol infrastructure ([see Wikipedia](https://en.wikipedia.org/wiki/Knol))]\n\nThe oxymoronic character of my title is a consequence of reading through Liberalism - a knol by Paul.\n\nA \"knol\" is Google's invention for \"a unit of knowledge\" -- not quite the same as a \"meme\" because potentially more complex.\n\nPaul's portrayal of the VVD, FDP and PVV parties, the first and last being Dutch, the middle German, suggests Liberalism is anti-diversity, anti-utopian and  anti-Islamic.\n\nRegarding the policies of the PVV party he writes:\n\nImmigration from non-western countries would be banned, as would double nationality. Any foreigner convicted of a crime would be deported. If naturalised, they would be stripped of their Dutch nationality, and then deported. If ethnic-minority children repeatedly commit crimes, then their parents would be stripped of their Dutch nationality and deported. Moroccan 'street terrorists' would be deported on a second conviction regardless of nationality. Speaking any language except Dutch in a government building would be prohibited.\nThe semantic tension in the title may stem from seeing business class entrepreneurs as innovative, and yet not socio-politically, not at the level of institution building.\n\nThis class of innovator considers the \"free market process\" the only legitimate driver of social change.  In this model, the entrepreneur responds \"freely\" to market forces, but is not charged with designing new institutions outside of that market (a job no one should have, too much like central planning, a cardinal sin).\n\nBy this analysis, the attack by some elements on the notion of \"corporate personhood\" is considered anti-liberal.  Returning to an \"artificial persons\" model, potentially software-defined, subservient to real (authentic) humans, undermines the dominant ethnic fiction.\n\nPaul points out how the American usage of \"liberal\" in contrast with \"conservative\" is somewhat counter-intuitive to a European.\n\nIn most of the world, the term 'liberalism' refers to the general ideology described here, and to that type of political movement. That is how it is generally used in political science. In common US usage, however, it is an antonym of 'conservative', or a synonym for 'left'. This is confusing, especially seen from Europe, where liberalism is generally classified with 'the right'. From the perspective of history and political science, however, the United States is clearly a liberal society, and its two main political parties are liberal in terms of ideology. In fact the United States is the primary agent of the global expansion of liberal democracy, since 1918.\nIn the US context, neocons and libertarians are not that far different, are basically subtypes of liberal by Paul's analysis.\n\nMy inclination is to invoke the notion of \"namespaces\" (akin to \"language games\" in Wittgenstein's philo) in order to distinguish among contexts.\n\nMy brand of liberalism, stemming from the liberal arts tradition ([Vienna an influence](http://groups.yahoo.com/group/WittrsAMR/message/828)) and a [Quaker](http://worldgame.blogspot.com/2004/11/quaker-politics_110167340290091180.html) concept of \"Liberal Friend\" is primarily a counter to mono-culture, is a commitment to diversity in a live and let live context (a root meaning of \"catholic\").\n\nThe consequent [commitment to secularism](http://mybizmo.blogspot.com/2006/11/about-secularism.html) is not anti-religion so much as protective of multiple religions (many as yet uninvented) by assuring them shared access to public infrastructure and the levers of power.  A religion may well be non-theistic.\n\nBy my lights, Paul's liberals are actually illiberal or anti-liberal.\n\nThat being said, many secularist liberal arts majors do end up as Paul describes, both [nationalistic](http://knol.google.com/k/paul/nationalism/m3hpd3552jcv/3#) and triumphantly expansionist in their outlook.  In the US, this is largely a consequence of their being indoctrinated into a [military-industrial mindset](http://controlroom.blogspot.com/2009/08/some-analysis.html) with its hallmark \"last / only superpower\" meme.\n\n[](http://www.flickr.com/photos/17157315@N00/3292186750/)\n\n:: new, improved: nation free! ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}