{
  "id": "3405682178249789608",
  "title": "Industrial Scale",
  "published": "2008-12-26T11:50:00.000-08:00",
  "updated": "2013-07-28T00:32:54.651-07:00",
  "content": "We have this inherited mental picture that \"industrial scale\" means really big, [as in heavy equipment](http://www.flickr.com/photos/17157315@N00/3039510029/in/photostream/), large factories, and it still does mean that (supertankers, pipelines), but lets recognize we went in the other direction too, organizing a workflow in the very small.  [The two go together](http://worldgame.blogspot.com/2006/02/bruce-adams-presents.html):  it takes a big place in Aloha (near Hillsboro) to put all that Intel inside.\n\n[We would like better health care](http://worldgame.blogspot.com/2007/09/futurism-revisited.html), no reason you, as a student in our Global U, should have to forgo access to some corrective technologies (e.g. eyeglasses), no matter what your status in life.  We're a theater-minded culture, don't need to be stingy with basic props of that nature.  Sally Field gets her [Boniva](http://www.youtube.com/watch?v=KryR45XM7vs), even if she's [just a poor nun](http://www.youtube.com/watch?v=2Hua7m6wQuw).\n\n[We don't consider it an extravagance](http://worldgame.blogspot.com/2008/10/eye-exam.html) to provide dental and optical of a basic corrective / remedial nature, but the engineering challenge is still considerable and we don't want faculty burnout.  We want the health care professions to remain highly attractive, and yes, there's a lot to know and practice and not everyone will have the stamina for it.  That's true in many walks of life.  But why make jobs artificially difficult, e.g. by withholding [essentially free information technology](http://worldgame.blogspot.com/2007/09/open-source-within-health-care.html)?\n\nYou want relaxed, happy doctors, not over-worked speed demons, much as some doctors enjoy a fast pace.  We're talking about average, ambient working conditions, where supply meets demand (a price point).\n\nTalented actors and screenwriters managed to turn Korean War MASH units into yuk-it-up zones.  [Why aim for that though](http://www.youtube.com/watch?v=uHg8-3wr2KU)?  I'd rather have my doctors [on cruise ships](http://mybizmo.blogspot.com/2006/08/wanderers-200688.html), nurses likewise (and no I'm not stereotyping about gender, know both of both).\n\nPersonalizing your experience is likewise something we're more able to do, not less, because of [advances in MVC designs](http://controlroom.blogspot.com/2007/09/more-curriculum-writing-re-mvc.html) and implementations.  You're able to record more of your preferences, portfolio, pamphlets, not because you're a sudden celeb and everyone's rushing to [supermarket checkout lanes](http://www.flickr.com/photos/17157315@N00/3140672050/in/photostream/) for the latest gossip, but because software is paying close attention to all of those druthers of yours and, [unlike a paid servant](http://worldgame.blogspot.com/2005/01/mornings-meditation-energy-slaves.html), never tires of poking you with fun suggestions.\n\nIs this what you meant?  Look like a fun opportunity?  Remember:  you asked for it, you got it ([and OK, our AI isn't perfect -- but whose is](http://controlroom.blogspot.com/2008/08/back-to-basics.html)?).\n\nSo what if it looks like mission control, with [thousands of patients streaming](http://worldgame.blogspot.com/2008/06/wall-e-movie-review.html) to and from scheduled procedures, like a factory, beds on wheels?  Yes it's a machine, yes it's heavy industry.  It's also micro-surgery and caring about your body, which is likewise a bevy of scheduled processes, like a factory.\n\n[Your insides](http://mybizmo.blogspot.com/2008/03/crossing-paths.html), like your outsides, [are working 24/7 on your behalf](http://worldgame.blogspot.com/2008/05/adult-education.html), just it feels unfamiliar (alien) sometimes, like it's not \"the real you\".  We project demons (a real \"them\") instead.  [No one here but us chickens](http://worldgame.blogspot.com/2004/11/pentagon-public-or-private.html), trying to get things a little more organized (a lot more in some contexts).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}