{
  "id": "871371050008057390",
  "title": "Inequality for All (movie review)",
  "published": "2014-02-16T18:10:00.000-08:00",
  "updated": "2014-03-01T15:06:06.415-08:00",
  "content": "I discovered at the meeting house today that my Samsung Galaxy 3 had no battery charge.  This is my primary surface for reading [OSCON proposals](http://worldgame.blogspot.com/2014/02/the-lego-movie-movie-review.html).  I plugged it in and left it charging, to watch this documentary from [Movie Madness](http://flic.kr/p/6MtBsb), an employee pick, and a relatively new release, taking in phenomena up through 2011 and the Obama administration.\n\nBecause Reich is a former Secretary of Labor, in the Clinton administration, having served in other political capacities in DC starting with Robert Kennedy and Gerald Ford, the narrative is DC-centric and uses a mostly nationalist perspective.\n\nHe joked about being an aide to Lincoln when lecturing to Berkeley students, most of whom were not yet born in the Carter years (his students fill a vast lecture hall and spanned more than a single generation -- and that's not counting the DVD and \"e-tube\" audience). Most of his self-directed humor is not about his age so much as his \nheight (he's quite short), a result of a rare genetic condition.\n\nOne of the rich guys interviewed, a talking head, made a point I've been thinking about as well: no matter where you stand on the investments and income scale, a human body is like [a 200-300W bulb](https://groups.yahoo.com/neo/groups/SYNERGEO/conversations/topics/71604), burning those calories, building those proteins, replacing those cells, and nothing more than that.  So what is \"wealth\" at the end of the day?  We're all roughly equal in getting some nature-provided equipment, with which to do stuff and sleep.\n\nI'd say the movie makes an unintentional pun on \"karma\" and \"car\", because Reich's Mini Cooper is a focus, an icon, while the rich guy gets to show us his Audi, the best you can get.  So body + car might be a wealth summation.  But I think the lobbyist interview says it best:  you're paying for access i.e. wealth is access.  If you have \"good karma\" then that means you're lucky enough to have the level of access you need.\n\nBut that somewhat just postpones the tautology.  Why is access so valuable?  It's a means to what end?  More wealth == more experiences to treasure (as memories, once over)?  Wealth is a well-sustained expectation of being able to maintain high living standards tomorrow and the next day?  A kind of near term sense of security?  Access to medicines.  Access to education, information, training, skill building exercises.\n\nMuch wealth takes the form of public infrastructure, facilities shared by \"strangers\" and not just some \"in group\" or congregation / club.  Government that cares about \"joe public\" and \"the middle class\" is of a different type than government of, by and for the rich.\n\nWhen Fuller signaled the demise of the USA of the Constitution and Declaration of Independence in the early 1980s (Grunch of Giants, St. Martin's Press), he's heralding the corporate-persons-controlled Citizens United USA of today, [a different \"Lego Land\"](http://worldgame.blogspot.com/2014/02/the-lego-movie-movie-review.html) than before, which many rich people find more awesome (although Reich reminds us that even the rich do better with a strong middle class than with a weak one -- the virtuous cycle turns vicious at some point tipping point). \n\nWe could go on and on with this investigation, into what people mean by \"wealth\".\n\nAnyway, the rich guy basically agrees the system lacks smarts, since where his money gets invested stays a black box to him in large percentage, meaning \"control\" is hardly the right word for what you're gaining.\n\nIt's not like he's automatically \"in charge\" in proportion to his making thousands of times more than the average joe.  Having many times more money does not mean calling proportionally more of the shots.  I'm sure the same might be said of Jack or Jill CEO:  net take home pay is not a measure of commensurate insight into inner workings.\n\nThe metaphor of a sailing ship is still apt:  it's your ability to adapt to the shifting weather that sustains you, not some heroic ability to \"control\".  That ability to adapt depends on more than just you, but on your crew (personnel) and your gear (tools).\n\nSpeaking of ships, Reich and Clinton were both Rhodes Scholars and met on the ship the selected scholars would traditionally take across the Atlantic.  That's when they first started to become friends.\n\nDuring the Joys and Concerns portion of business meeting (at the very end) I expressed my relief that Jen had found another home in which to have her baby, given Carol's ongoing need for that room.  The Buddha Room is still in need of refurbishing (having been reconstructed for $12K), but as a nursery / bedroom?  I expressed my expectation the home birth will go well.\n\nThe timing had been ironic in that Peter (another Princeton alum) was telling Wanderers about his time in Vietnam in the far north, aiming to assist leveraging cell phone access to gain better health care for ethnic minority moms, and finding in this particular case that cell phone access was already high and so was birth-in-facility (versus home) an indicator of a developed health care infrastructure in his criteria.\n\nThat's what had surprised him.  What surprised me was getting an email that very evening, from someone 8.8 months pregnant, requesting a guest room.  It was just that her original plans had not panned out and finding another place was a long slog.  She's stayed here before, a stalwart of our FNB / [post-Occupy (OPDX)](http://controlroom.blogspot.com/2012/11/occupy-unmasked-movie-review.html) community.  She's a joyful, kind woman and should be a great mom.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}