{
  "id": "5130663217622255997",
  "title": "Inside Out (movie review)",
  "published": "2015-06-22T20:45:00.003-07:00",
  "updated": "2015-06-23T09:15:01.991-07:00",
  "content": "Yes, I too admired this film for its cleverness and compassion.\n\nAs she gets older though, and even while young, I think those five archetypes don't quite cover it.  Maybe we would find some mutant sixth and seventh crew members in different people?\n\nWe take only a small sample, with N only > 10 towards the end, if it ever gets that high (cross species, nice touch).  I'm talking about how we look in on different control rooms.  Always the same five?\n\nThis Disney / Pixar movie is the paradigm \"control room\" movie, taking the meme right to its psychological roots, as a source of core memories feeding complexes (\"military industrial\" or whatever). \n\nShades of Woody Allen right?\n\nLong term memories get visited later, by an estranged headquarters pair, seeking to get back to the helm.  Not giving too much away.\n\nShe's a ship in choppy waters, our girl, and through an extended and elaborate set of interlocking metaphors, we get an excursion through a detailed mind map.\n\nEither that (more crew) or each of these five might need to stretch a bit more, to take in new territory?  The subconscious covers a lot of ground... I'm maybe just unclear about the plumbing.  \n\nI admit the prospect of a sequel somewhat scares me.  What if the series catches up and passes me?  It gets scarier doesn't it?  San Francisco is just the beginning.  Maybe [The Zero Theorem](http://controlroom.blogspot.com/2014/10/the-zero-theorem-movie-review.html) fits here?\n\nOK, I'm angsting a bit, have some concerns of my own.  Maybe I'm a tad envious of little girls and the problems they get to have?  Sniff.  You've gotta admit she has it pretty good, just having so much joy for starters.  Her parents have benefited, a stress point right there.\n\nHey, I'm looking forward to Minions.\n\nTwas fun to see this on a big screen with a friend in an audience.  I had my book on [cryptography and Poe](http://worldgame.blogspot.com/2015/06/recent-news-and-readings.html) along, taking the bus, got a ride back in a new Mercedes.\n\nWe get more from a spontaneously shared event in a dark movie hall, than watching on a flat screen home alone.\n\nNot that I don't welcome the more kicked-back option; I do that too.  I'm glad I have the option to choose.  Did I mention seeing Jurassic World with Alexia?\n\nThis is one I'd gladly add to my collection.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}