{
  "id": "7471630827027549439",
  "title": "Intellectual \"Property\"",
  "published": "2014-05-14T11:48:00.001-07:00",
  "updated": "2016-10-14T17:04:36.525-07:00",
  "content": "I enjoyed the story on quinoa in the recent Harper's, among other stories.  Bolivians are understandably reluctant to contribute to a corrupt system that allows patenting of things they may already know, such as how to create male-sterile varieties.  The author doesn't mention Open Source and the revolution in the software industry that has already occurred.  Pfizer has been [talking Open Source](http://controlroom.blogspot.com/2012/02/munching-on-medical-data.html).  The biologists need to learn from the engineers.\n\nSpeaking of Open Source, I'm in the beautiful Lake Tahoe area, on the California side of the lake, at all all-hands meeting of the O'Reilly School of Technology.  O'Reilly Media, parent company, is a champion of Open Source in the world, as the organizer of the annual Open Source Convention, OSCON.  I'm one of the OSCON proposals readers / rankers though not a program or track chair.  We're in a meeting about the overhaul of our codebase, currently in progress.  Angular.js and Node.js are among the technologies we're moving towards.\n\nSean is urging that we remain friendly towards our competition.  For example CodeSchool does a free course on using Chrome dev-tools.  Referring our students to that should not be a problem.  We're looking out for what's best for our students.  We're not under the illusion that we have some monopoly or corner on the market.  This is about taking on the Open Source mentality, says Sean, seeing ourselves as part of a larger ecosystem and emphasizing collaboration over mindless competition.\n\nDan is hoping to improve the student experience with the creation of cloud-based gateways closer to students with fatter pipes on the back end.  We use a lot of terminal servers and a chief complaint of our students is the slowness of this connection.  We have some workarounds that work sometimes, but in this world everything becomes available through the web site.  We shall see.\n\nOur courseware is open, but not our homework assignments as we want students to get the benefits of working through these projects themselves, not find cut and paste solutions on-line.  Having some secrets is not inconsistent with the Open Source ethic, though it may be in conflict with the Free Software ethic.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}