{
  "id": "5596533153105558572",
  "title": "InterFaith Meetup",
  "published": "2013-09-22T21:41:00.002-07:00",
  "updated": "2020-10-22T15:47:33.916-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157635788796054)\n\nHey, great reconnecting with Harold Long at [this New Thought church](http://www.newthoughtcsl.org/). He hung out with me 'n [Ed Applewhite](http://mybizmo.blogspot.com/2005/02/ayatollah-of-tetrahedron.html) that time.  Ed was always gaga for architecture and Long was / is Frank Lloyd Wright trained (as in personally) and an expert in religious architecture in particular.  He and Ed had lots to talk about, though I don't mean to peg Ed as \"religious\" in that statement.  Ed loved being a skeptic about such things.\n\nHarold is Maureen's ex, for those who follow [my Russian novel](http://worldgame.blogspot.com/2005/02/methodist-morning.html) (these blogs are full of comings and goings of the interesting people in my life).  Applewhite was a close friend and associate of Bucky Fuller's, another architect you may have heard of, [along with TC Howard](http://controlroom.blogspot.com/2011/10/toward-history-of-domes.html) (Seattle Expo Bubblator, [Metallurgist Dome](http://www.flickr.com/photos/17157315@N00/6834704198/in/set-72157629206299498/), many others).  Fuller and Sadao, their shop, was near to [Noguchi's place](http://controlroom.blogspot.com/2006/10/musical-event-noguchi-museum.html) in Long Island City, just across from Manhattan.  Apologies for the deluge of trivia.\n\nAnyway, Lynne Taylor, a Wanderer, had organized an ambitious program, like a mini Parliament of World Religions but much shorter, just a half day.  Packed with content.  I have reams of thoughts.  I spent lots of time in the gift shop.\n[](http://controlroom.blogspot.com/2013/10/carol-addresses-thirsters.html)\n[Carol](http://controlroom.blogspot.com/2013/10/carol-addresses-thirsters.html), my mother, was representing Quakers.  She did a good job, making an abstruse historical allusion to Peter Waldo, one of the early heretics.  I could hear people thinking \"Who's Waldo?\".  The slide above and behind us (every religion had one) was of the Columbia Gorge I'm pretty sure, but mom wondered if it was Pendle Hill.  She talked about her deafness and loss of short term memory. She won the audience completely, good job mom.  I was in the pews snapping pictures.\n\nThen we adjourned to a downstairs panel discussion, after more snacks.  The event was gracefully tiered such that people could leave, but diehards could go for more, even ask hard questions.  As the chauffeur, I was of course on the hook for the whole thing, though did manage to spend a good thirty minutes arguing vociferously with another director type (think Wanderers) in the privacy of a large empty lot. \n\nThen it was back to fun and games.  We got to chant, sing, pray.  Many religions, Sikh, Navajo, Roman Catholic, Atheist, Scientologist, Essene, Baha'i, Jewish, Islam, Pagan, Hindu, and Quaker all up to bat. All comported themselves well.  The Scientology lady was into demurely celebrating her brand's being in the august company of world religions, already, and she shared a tasteful video (see below).\n\nThe Islamic woman was forceful during the panel discussion afterwards.  She was just back from Pakistan.  She's a business person, her own boss, and draws a line between Islam and the cultures in which it has so far been adopted.  She is very optimistic about [North American brands of Islam ](http://controlroom.blogspot.com/2007/08/liberal-islam.html)because women start out with close to a full deck here, in contrast to other places.  Islam has a head start. Rarely has it been practiced in so pure a form.  She's on the highest committees in her congregation (sorry for mangling the terms).  There's nothing in pure Islam that dictates a Taliban interpretation of Islam, wherein women have few responsibilities.\n\nThe Atheist, who reminded me [of Duane Ray](http://worldgame.blogspot.com/2011/01/wanderers-20100119.html), referred to himself as a secularist.  As I was explaining to the director on the cell phone, [to me](http://mybizmo.blogspot.com/2006/11/about-secularism.html) \"secularist\" means \"believes in an equal opportunity to go to jail, no particular religious caste excepted\" (dividing \"church\" from \"state\" one might call it).  I think of the late Reverend Moon (Unification Church) doing time for tax evasion.  She may have had a different meaning.  The Atheist quoted Carl Sagan from the pulpit, and cited Richard Dawkins as another hero, which I found almost too stereotypical, as if [South Park Studios](http://worldgame.blogspot.com/2004/12/team-america-world-police-movie-review_04.html) had had a hand in this script (I admire [Carl](http://controlroom.blogspot.com/2009/06/taking-inventory.html) by the way).\n\nDavid Tver was sitting next to me and asked for a definition of an Atheist.  \"Are Buddhists atheists?\" I asked myself.  My advice to Atheists is this:  it's dangerous to define yourself by what you're anti. My dad was an atheist one could say, but \"Quaker\" was a more positive identity, as it came complete with role model pacifists (like Bayard Rustin) and a kind of \"democracy in a box\" (our way of doing business).  What do Atheists so far have, in terms of community?  Walden Two?  Just a question.  No need to get defensive. \n\nActually the Humanists have a community, and a thriving one around Portland, so I think that's an answer right there.  The goal, in any practice, is to prevent arrested development, be that \"psychological\" or whatever.  Some atheists accept a \"psyche\" or \"ego\" (normal me) but not a \"soul\" (paranormal me, a non-existent ghost) -- nomenclature matters.  An atheist might still embrace some form of depth psychology (e.g. Tantric Buddhism) to fight / counter / rebalance the various projected abnormal psychologies (some of them mob psychologies, collective).  Aberrations stalk us all and you don't need to believe in ghosts to feel haunted by memories, as in PTSD.\n\nI'm the one at a disadvantage, I should just admit, in that I'm somewhat misanthropic and so outnumbered.  As a little kid, I tended to favor non-humans over humans in some dialectic, like I more empathized with dogs and horses, or whatever. \n\nIn religion, such \"animism\" (I call it Quaker animism) maps to an esoteric form of gnosticism wherein you identify with the sneering angels, who think humanity was a mistake and are jealous of God's love for them.  You probably haven't heard of us if a mainstream Christian, but the angel fanatics are familiar with the literature, of angels as the humans' competitors (\"so how do you explain Guardian Angels?\"... obviously there was some kind of war, and the so-called \"good angels\" sided with Yahweh, obviously).\n\nAnyway, I wasn't doing the talking and got us home safely.  I uploaded a bunch of pictures (from the event, see above) then went over to Glenn's.  His brand of Neolithic Math re-galvanizes my vision of \"fat farms\" in the high desert, places to come to to shed metaphysical fat as well as adipose predisposing you to diabetes.  That doesn't have to mean vegan but for some it should.  You oughta try it religiously at some point in your life at least.  Experiment, don't get stuck in a rut and become a lifestyle bigot.  Your religion, Atheist or otherwise, is not your license to be a jerk.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}