{
  "id": "7592428566347746659",
  "title": "Interstellar (movie review)",
  "published": "2015-03-28T10:09:00.005-07:00",
  "updated": "2015-05-10T13:25:02.900-07:00",
  "content": "I caught this at Laurelhurst, packed house, smaller screen, bright and sharp picture though, I don't require Real3D to stay happy (except outside when driving I find it convenient).\n\nI'd been skeptical about this film given the hype and my low opinion of public opinion a lot of the time, call me a snob or elitist.  However I've come to respect the film for what it tackles:  the way in which love seems to transcend even death, or call it gravity.\n\nThe memes are straight from the dust bowl cornfields of America mixed with NASA space program ethos, a volatile combination with many stark contrasts.  Planet Earth is on the wane and there's a sense of needing to bootstrap somehow.  Why are humans always on the brink?  Or maybe that's what prehistory was about:  not being right up against it with End of the World just around the corner.\n\nScience fiction is expected to have worm holes and higher dimensions.  That tradition was established at the end of the 1800s, when novelesque plots were developed to take advantage of 4D, the new kid on the block.  The tesseract or hypercube, made its brilliant debut, with no upper limit on dimension number.  Worm holes could be everywhere.  Our confinement to the solar system, a frustration for plot developers, was solved.\n\nAs I've harped on in these blogs, the tesseract is not a time machine except in scifi.  That these would be jumbled together on the chalkboard is part of the tradition, but formal math does not permit it.  The polytope mathematics of the nD crowd, led by Coxeter, is not the 4D mathematics of Einstein, nor the 4D philosophy of Fuller, to which this film comes very close (no obvious tetrahedrons though).\n\nIn classic humanities liberal arts, the dead speak to us in our libraries, through our books, across time, across space.  Yes, it's kinda spooky, and poltergeists (at least tales of) lurk in those pages.  Young girls are especially drawn to certain passages, specific phenomena.  Their dads use science to discourage this tendency but then end up on the other side of it, wanting to speak after deadline.  The hero's frustration is palpable.  He has machine Marines for cold comfort.\n\nThe relativity touch was really well acted I thought, complete with aging at different rates.  Maybe I'll see this movie again, in Real3D even.  A car pulled out in front of me on Stark on the way home and I was glad to have the right break-hitting reflexes and enough traction even in wet weather.  The film is long, starting with previews at 8:45 and not letting out until close to midnight.  Not complaining; it kept me in my seat.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}