{
  "id": "2651547502528019719",
  "title": "Invective",
  "published": "2024-09-07T16:37:00.000-07:00",
  "updated": "2024-09-11T21:22:52.492-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjUI1AsfEn5j0ZLJYxfJlwNOc7th2xpLxu0LJ0PoG4Bnv1pUFaT1WvAqU8LqsSzPRPRS2lqb1p84LxTALNnx-KVk0qrICeboLly78tB6e1Honk3BIYBNXXC2CfXohLx3HTo8xlrFvmV-4qA101_l9rNITtfTm-HhBhRnxeb8z6fOlXitRt91oC4/s1024/july4_uncle_sam.png)\nPartly why my Pirate Party wants the USG to take more responsibility for schooling its own future officials, is leaving it to prep schools has been a bad idea by many measures. \n\nYou get too many of these Elon Musk types who seem to assume their high status in life is God-given and well deserved, and that's why it's their burden to take the rest of us over some cliff or other. \n\nVictoria Nuland comes to mind, or Condoleezza Rice, or Madeleine Albright. I don't look up to these peeps as intellectually suited to their roles. But they managed to pull strings and get plumb positions, too bad for world history, looking back. Not to only pick on women: Jake Sullivan, Antony Blinken... total disasters, from a USG point of view.\n\nI think if the USG had boarding school opportunities starting for kids of a young age, not dependent on personal means or family finances, that we might groom (not a bad word) a cadre (not a bad word either) a cohort of future diplomats who were actually good at their jobs for a change, because of their well-conceived educations.\n\nOne obvious symptom of our weak privatized system is that big publishing can't turn on a dime, or even take off from a runway a mile long. The inertia is just too much to overcome. \n\nSo whereas we should have been talking about America's greatest futurist subversive, Bucky Fuller, in the same pantheon as Martin Luther King, the only TV we got was either maudlin mourning or poking fun. Cry or laugh, neither serious.\n\nNPR did a really terrible job with the Bucky narrative, botching the story completely. Given the high \"spoiled brat\" index of the people working there, that's not surprising. \n\nThey didn't get any \"Bucky math\" in prep school and so assume there's no there there. That's the arrogance that comes with thinking your teachers really knew their stuff. Question authority more?\n\nAnyway, I'm glad at least a few schools are showing promise this fall season (you know who you are) and we have some talent in the pipeline. \n\nIn the meantime, we'll put up with Imposter Syndrome and pretend the USG exists, even though it doesn't for the time being. Uncle Sam is quite dead. In his place: the corporate version: shallow, vapid, devoid of real brains. A zombie. \n\nPatriots underground work on a next version of USA OS.\n\nI just saw Beetlejuice Beetlejuice at the Bagdad last night (crowded!), which might explain why I'm seeing Ghost House tropes in real life. The focus of that movie is phoniness versus what's really real. The difference may get pretty thin. \n\nWhen you've lost integrity as a being, a lot of automaticity kicks in and you find your life filling up with involuntary unfree responses. You start lip synching the party line and marching to the groupthink drummer.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}