{
  "id": "9184038276590340203",
  "title": "Iran Forum",
  "published": "2018-07-02T12:30:00.001-07:00",
  "updated": "2020-08-24T08:58:00.241-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157670657671388)\n\nPortlanders met in Elliot Chapel at the same time [as OS Bridge](http://controlroom.blogspot.com/2011/06/open-source-law.html) was going on, in the came Elliot Center complex, part of the Unitarian Universalist campus downtown.  We had a panel of speakers and celebrated the lives of commitment of the Huntworks to bettering Cascadia's relationships with Persians.  Here's what I posted to Facebook:\n\nPortlanders gather in a church with Peace Corps vets to strategize \nregarding Citizen Diplomacy twixt Cascadians and Iranians. The \nHuntworks, a local couple now deceased, spent a career building \nconnections. Their memory is being honored at this event. Shiraz and \nPortland have ties. The relationships are strengthening as political \nleadership is increasingly seen as subservient to tiny psychopath \nminorities with wars in mind.\n\nOS Bridge (a geek fest) is happening in the same building.\n Geeks and Peace Corps vets have some commonalities. We know how to \ncollaborate outside of political channels. Engineering is about longer \nterm plans than those concocted by next-term-seeking vote getters who \nmust pander to peoples' basest fears and most negative emotions.\n\nTruckers for Peace has no brochures here. That's like Peace Corps for \ntruckers who wanna get into the Citizen Diplomacy game. Chinese Peace \nCorps might provide more details regarding opportunities in the Iranian \ncontext. OBOR is about infrastructure improvements, including in human \nrelationships (necessary for collaboration).\n\nSwamp City (WDC) is these days quite hostile to the idea of improved relations between itself and just about anyone who doesn't want its weapons.\n\nSwamp City's Banana Republic, a holdover relic, is pretty good at alienating Cascadians these days.\n\nThose of us more interested in people skills have to learned to count on continued clod-like opposition from the Swamp.\n\nFortunately, the clod-like are pretty awkward.  The more adept find ways to counter the warlord mentality.  Should Portland and Shiraz become sister cities?  We'd need something from our Mayor's Office to make that official, and from Shiraz naturally.\n\nOS Bridge, some might recall, was organized in the wake of OSCON's leaving Portland for San Jose. OSCON later returned, then went to Austin.  This year:  back in PDX.  OS = Open Source (or Operating System in some lexicons).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}