{
  "id": "7509639053176631835",
  "title": "Iranian Festival",
  "published": "2009-08-01T21:31:00.001-07:00",
  "updated": "2020-09-19T12:28:55.478-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157621793762675)\n\n:: iranian festival, portland, oregon ::\n\nTwas my privilege this afternoon to throng with Greater Portland's Iranian community, got some baklava and iced tea at the Intel booth, listened to music, wandered around taking pictures. I didn't know anyone there, plus was involved in trip planning by cell, [talking high desert](http://mybizmo.blogspot.com/2007/03/high-desert.html). That didn't keep me from taking it all in though.\n\nYes, Iranian politics is complicated and I know better than to just jam my finger into working machinery going \"what's this?\" or, even worse, \"do that!\". Probably Portland mirrors a lot of [the attitudes](http://controlroom.blogspot.com/2008/11/standup-comedy-at-newmark-theater.html), so I could assemble a more accurate picture over time, but that would require knowing more of these people and I didn't see a single person I recognized the entire time, which surprised me a little.\n\nSpeaking of who gets to talk about what, I got into this game of [one-upmanship](http://en.wikipedia.org/wiki/One-upmanship) with this guy on Synergeo with relatives in the service. We were putting our cards on the table as to which of us had more street cred:\n\nHe: I wore a US uniform fighting forest fires, been in firefights. Nuff said.\n\nMe: I used to dress up as KGB in the USSR, but no one knew that's what I was doing, as I disguised myself as [an American tourist](http://controlroom.blogspot.com/2007/08/simpsons-movie-review.html) traveling with family. Fun pulling the wool over their eyes in this way.\nOK, so that's just crazy talk (not that I was lying exactly, having been [through Moscow that time](http://worldgame.blogspot.com/2004/12/intourist-pdx.html)), but such is the uncontrolled banter on that list, lots of yakking about wild animals and sea life as well. Wanderers and [students of Synergetics](http://www.rwgrayprojects.com/synergetics/plates/plates.html) have a lot in common I sometimes suppose.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}