{
  "id": "9221038896488888394",
  "title": "Iron Man 2 (movie review)",
  "published": "2013-06-23T23:04:00.002-07:00",
  "updated": "2013-06-23T23:35:06.963-07:00",
  "content": "I'd been favorably impressed by The Avengers [in Indianapolis](http://worldgame.blogspot.com/2012/06/our-week-in-indy.html) a year ago, and knew then I had a hole to fill, the Iron Man movie preceding it.  A year later, I finally saw it.\n\nOf course I'm glad I did, in part because it's redolent with Bucky stuff.  [Tony Stark](http://controlroom.blogspot.com/2008/06/iron-man-movie-review.html) is like a Heinlein character, strongly individualistic (and narcissistic).\n\nConnecting back to World Expo aesthetics, via the dad, a Disney-like character, takes us straight to Bucky domes and Spaceship Earth.  But what may escape more viewers is the epiphany Tony has when connects the dots:  a geodesic sphere materializes, somehow encoded in the positions of the pavilions.\n\nI remember when they talked about Bf is like the discovery of an element.  Anyway that's what Tony is discovering in this scene:  a new form of unobtanium, a next fountain of youth.\n\nVibes of Superman in his Fortress of Solitude.\n\nThe superhero lore alludes to itself.  There's a Cold War theme, with the Russians contributing both the evil villain, and the attractive spy, Natasha Romanova, played by Scarlet Johannson, a character who gets stronger (psychologically) in The Avengers and in Captain America: The Winter Soldier, still in production.\n\nThese characters are coming from old comic books you understanding.  I checked out Iron Man 2 from the Comic Book section of Movie Madness.\n\n[David Koski](http://www.flickr.com/photos/50584699@N03/) phoned during the shoot out in the geodesic dome, or just before, which was appropriate.  I paused the DVD so we could talk for a couple hours.\n\nThis wasn't the first time there'd been a dome in the picture.  He'd called me from that TC Howard dome at Pycon 2012, [right around](http://controlroom.blogspot.com/2012/03/occupy-silicon-valley.html) when I was asking the ESRI guy to say more on the Fuller Projection.\n\nThey flirt with the Bucky stuff, these movie makers. It percolated into the movie Argo as well:  the science fiction theme park that he and Ray Bradbury were supposedly into, which Argo is somehow about (the movie, not the cover story about which [the movie Argo](http://worldgame.blogspot.com/2013/03/argo-movie-review.html) was made).\n\nNo one says \"geodesic dome\" when they talk in The Making of Stark Expo (special feature) about integrating the climactic fight scene from its components.  That's Easter Egg stuff you get more of if you dig, i.e. if you do your homework.  Allusions to Cornwall and domes as arboretums (St. Louis).\n\nThey're working to capture a Zeitgeist here.  Comics are into that, tapping into that common vocabulary of shared mythology, that Matrix.\n\nDavid has his up hill struggle finding peers to share with.  Most mathematicians consider \"three dimensional volume\" to be handled, not an especially interesting area.\n\nYou have the Archimedeans on the Poly list and Guy Inchbald, but the excitement Dave's subculture evinces, for a volume six rhombic dodecahedron, brands him an outcast and an eccentric.  Not mainstream.  The culturally literate don't use that dot much, when dot-connecting.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}