{
  "id": "769596999863209578",
  "title": "Islam in Oregon",
  "published": "2019-08-28T10:34:00.001-07:00",
  "updated": "2019-08-28T22:42:53.335-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/48636798508/in/dateposted-public/)\n\nBy the end of the Oregon Trail, many had shown their true colors, out of necessity, which need not mean anything bad.\n\nBy WW2, the idea of women in the workplace, including in factories, was widely accepted, but not without assistance from a propaganda barrage, explaining why such gender bending was necessary.\n\nHowever Oregon's colonial pioneers had in many cases already discovered the extent to which women could manage farms, run factories, govern towns.\n\nOne may counter that I exaggerate about the power of women in the early days of Oregon Territory -- the days of calling it that (before statehood) -- and one is correct for so doing.  I'm anticipating, with the benefit of hindsight.\n\nRolling forward, to 2019, yesterday I was in the company of a farm-owning, science-lab-running, manager woman, one of the Wanderers.\n\nThe seeds had been planted in the culture somewhat earlier.  I was feeling proud of our ability to adapt to grow.\n\nI could branch out here, into anthropology around indigenous cultures, exploring stereotypes.  Gender bending is not a new theme.  The way in which genders relate to one another is indeed part of the tension-compression morphology that goes on, with respect to the many stresses and strains that challenge homeostasis at every turn.\n\nHowever what's on my mind is the future of the manager woman, the farm owner and tractor driver, in the namespace we call Islam.\n\nMany women come to Oregon to start a business and gain for themselves a level of autonomy taken for granted by business owning men.  Some of these women may speak Arabic, others do not.  Some may come from local families wherein Islam has been a practice.  Others have newly adopted [the Muslim faith](http://coffeeshopsnet.blogspot.com/2019/08/geometric-esoterica.html).  Skin color varies.\n\n[I've commented](http://controlroom.blogspot.com/2007/08/liberal-islam.html) on [these themes](https://controlroom.blogspot.com/2013/09/interfaith-meetup.html) before.  I suppose what triggered me this time (in a good way) was riding around with a farm-owning science lab manager, listening to her talk about her plans to get a motorcycle.\n\nShe was driving a powerful new kind of Volkswagen, hardly a Dead Header micro-bus.  She has no fear of machines or hardware.  She makes big plans for the future.  Praise Allah.\n\n[](https://www.flickr.com/photos/kirbyurner/48637291447/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}