{
  "id": "1167814469148840653",
  "title": "Isle of the Dogs (movie review)",
  "published": "2018-06-21T11:12:00.002-07:00",
  "updated": "2018-06-21T11:12:27.018-07:00",
  "content": "I got to see this with Alexia, my late wife's first daughter, nowadays living with her dad and in the process of a career change.  She rarely gets any days off.  I haven't seen her since our trip to visit her younger sister in December of last year.\n\nIsle of the Dogs is a puppet-based animation.  I've watched at least one movie critic's Youtube and agree with his observation:  the timing and rhythm are notable and interesting.  When I found out the director was the same guy who did Budapest Hotel, I thought that made perfect sense.\n\nIsle of the Dogs is billed as a comedy.  I'd call it dark comedy.  The movie critic said the Megacity of the future was dystopian, but it didn't seem all that terrible to me.  People were enjoying life and we saw some semblance of democracy, though it was mostly for show.  I didn't see any homeless or tent cities.\n\nA dynasty of dog-haters was in control and used the office to push an agenda that would obliterate all dogs, first by exiling them to like a concentration camp, followed by plans for genocide.\n\nThe Science Party is against genocide and has already found a cure for what ails these dogs in the first place.  The dynasty suppresses this knowledge and continues feeding pubic terror of dogs.  One sees the cats have a subtle role in this program, though it's not spelled out.  The cats never say a word.\n\nWhat's interesting is how languages are dealt with.  The dogs, such as Harvey Keitel, speak their English perfectly complete with accents and dialects, while the humans speak Japanese, without subtitles.  The little boy who goes to rescues Spots, his guardian, is unintelligible to the dogs.  However he and Spots are connected by short range Blue Tooth and do understand each other.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}