{
  "id": "110706768159896281",
  "title": "Joint Ventures?",
  "published": "2005-02-02T22:54:00.000-08:00",
  "updated": "2014-12-27T18:03:52.660-08:00",
  "content": "I got a call from Richard Amerman out of the blue the other day. He and I are Plone afficionados -- like, we both attended that sprint with [Alan Runyaga](http://plone.org/Members/runyaga) and [Andy McKay](http://www.zopezen.org/) in Victoria that time. He wants to do some global data displays using Plone, in collaboration with a biodiesel guy I haven't met yet. They might need my help in some way. Sounds like fun.\n\nOn another front, I met a former webmaster with Sesame Street (Consoletti introduced us). He reminded me that [Grover](http://www.sesameworkshop.org/sesamestreet/coloringpages/view.php?contentId=3023&) (a kid favorite) and [Yoda](http://en.wikipedia.org/wiki/Yoda) (the Jedi Knight), are the same guy, Frank Oz (just like [Big Bird](http://www.amazon.com/exec/obidos/tg/detail/-/B00016XO6U) and [Oscar the Grouch](http://www.iridis.com/Oscar_the_Grouch) are both performed by Carroll Spinney). This webmaster has also worked as a counselor with navam kids.\n\nI still remember those posters that came out after 911, with Osama Bin Laden in the foreground, and in the background: [Evil Burt](http://dc-mrg.english.ucsb.edu/conference/2002/documents/mark_poster.html). I took a screen shot of that in my brief case when I flew off to the east coast in October of 2001, to visit (among others) [Kenneth Snelson](http://www.kennethsnelson.net/) in Manhatten and Stuart Quimby[ ](https://www.blogger.com/null)in upstate New York; a [spark of humor](http://www.insidebayarea.com/argus/news/ci_2548142) in a very dark time.\n\nThat's the time Ken gave me Barrel Tower, a fantastic gift that sits proudly in my office. I had to get it back through airline security at EWR (too big for the metal detector, and besides, it's all metal, so what's to detect?).\n\n[](http://www.insidebayarea.com/argus/news/ci_2548142)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}