{
  "id": "490315486844943224",
  "title": "Journaling My Day",
  "published": "2020-12-02T18:04:00.006-08:00",
  "updated": "2020-12-14T09:15:37.655-08:00",
  "content": "Today started with my job at Portland Energy Strategies, Patrick's think tank. We'd agreed on 10 AM for a VS Code workout, experiment with collaboration features, but I overslept.\n\nThe experiment for me included finding out if staying with OSX 10.10 is fatal, as far as Live Share is concerned.  It is.  Thanks to C6XTY, I had an alternative desktop available and from there forward, everything went swimmingly.\n\nNext I was on the porch with a retired librarian, who lent me, or gifted me with, these novels about one Reverend Bebbe (Lion Country is what I'm reading). These are fictional characters, and I've done most of my life fairly cold turkey when it comes to fiction, with lots of caveats.  These days, I'm ready to feed again on fiction, if only to limber up the imagination, which can always use more libering.\n\nFor those mystified by the VS Code talk, that's a running program that many of today's coders are using to write stuff in the many computer languages.  The motif is rectangles within rectangles on a screen, with lots of typing, but also a shared whiteboard if you install the right extensions.  Both Patrick and I did.\n\nPatrick, for those just joining us, designed a new kind of snake trap, with pythons especially in mind, because of the situation in the Florida Everglades.  Pythons have thrived there.  The trap doesn't keep the snake necessarily, but it does have that capability, as once you've gone to all the trouble to identify the species (AI goes here), you want to reserve that option in front of the patent office at least.\n\nAnyway, after Patrick and Rosalie, I got to visit with Glenn, who is deeply immersed in Korzybski at the moment.  He has done some more homework and I can now see a path from my Youtube channel, through Korzybski, back to Alan Watts.  But an even more intriguing link suggested itself around \"timelock\".  Korzybski as a specific meaning for that work.  Of course I'm thinking of 4D Timelock by Bucky Fuller.\n\nNow I'm back at the Oregon house, one of the campus dots on the world map.  Another dot would be some 47th floor in Singapore someplace.  We have our virtual nationhood, after all.  I've been discussing that on Facebook, in the sense of how curriculums overlap or are distinct.  The \"concentric hierarchy\" is my focus, and that implies \"tetravolumes\" without needing to say so.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}