{
  "id": "2794170993749519951",
  "title": "Journey of the Universe (movie review)",
  "published": "2012-01-30T20:51:00.000-08:00",
  "updated": "2012-02-04T13:58:12.467-08:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/6813229497/)\n\nOnce again, I wasn't sure what I was getting into.  We wandered up to the 16th floor of the wrong building, finding a beautiful lobby, then entered 888 to make our way to what turned out to be a meeting of the State Bar (as in lawyers' guild).  There's [a subgroup or committee](http://osbsustainablefuture.org/) looking to improve the future -- \"the only bar section in the country with a specific goal\" or something like that.\n\nAt first I thought this was clever marketing, [this Torporation](http://www.tonkon.com/) (Torp) instead of a Corporation (Corp).  The best way to avoid that [\"corporate personhood\" stigma](http://worldgame.blogspot.com/2011/10/in-nutshell.html) is to start up as a torporation instead, with torporate executives and so forth.  \"More benign than corporate persons, because they sleep a lot\" was [Glenn's joke](http://en.wikipedia.org/wiki/Torpor). Anyway, it made a good skit in the theater of my mind.\n\nWhich brings us at long last to the movie.  [This had been on public TV](http://www.journeyoftheuniverse.org/) I'm told (OPB), yet we were somewhat exclusive in getting to see it -- not clear on the details.  Brian Swimme is the new James Burke and does a fine job in the microcosm / namespace of Samos (an island), where we've decided Pythogoras literally lived.\n\nThe narrative takes a bold move in that cave of his, suggesting we look at the imagination as like another eye (an imaginary eye), a wholly different way of seeing.  Two other kinds of eye, including the water ball eye (what we also have) were discussed beforehand.\n\nAnyway, as with most of my movie reviews, I somewhat assume the reader has seen the movie already -- backwards from most reviews, which read more like previews, but certainly a way to go:  it's like we at least have this recording in common, so now lets share our takes / angles.  Like a book club.\n\nThat was what this meeting was like: a focus group.\n\nThe organizers were honestly interested in getting some feedback, lawyers first.  The group knew we had some scientists intermixed, including the identifiable physicist / cosmologist on the back bench, a credentialed authority (University of Chicago).  So when it came time to relay impressions, it was stipulated we let the lawyers speak first, as this was, after all, a meeting of their guild.\n\nOne of those present suggest we raise our hands if we were lawyers, but the moderator immediately countered that this need not be revealed.  Interesting culture, this.\n\nDon talked about the movie Farewell (a spy movie) on the way back in his new motor vehicle, Glenn stuffed in a much roomier back.  We'd had a good time.\n\nOther Wanderers, such as Bob McGown and David Tver were there too (they both spoke).\n\nI spoke as well, after the bar against non-lawyers was lifted.  I was slightly self conscious when raising my hand, in geek costume (in my Python sweater-vest, army surplus jacket on the rack), especially of the leather cuffka, Nirel brand, about my wrist -- but I doubted it mattered too much (lots of people had styles).\n\nMy gray locks put me more in the \"rounded elf\" category and soon I had the entire room chuckling about how a lot of our dark side was missing.  \"If I'd been briefing a room full of ETs about what to expect upon encountering humans...\" I suggested.  But the film was upbeat, wanted us to feast on the images, not shield our eyes.\n\nShades of Koyannisqatsi and Winged Migration both.\n\nSome of the lawyers present got more talkative with time.  The physicist in the back was also diplomatic I thought, in requesting a moment to think.  When the lawyers had been asked, they'd fallen into a profound silence reminiscent of a Quaker meeting, reluctant to have too easy opinions.\n\nGradually the ice thawed and opened the space for some real sharing.  Lynne Taylor was there and spoke up before I did.  She'd seen an earlier draft of this film at the Parliament of World Religions.  She was eager for more of this genre.\n\nThere probably was some implicit tension in the film, as it used Samos as an integration point wherein to criss-cross psycho-spiritual and physio-scientific concerns.\n\nWas this taking on too much of the role of the priest?  Know-it-alls can be a problem.\n\nI saw lots of hat-tipping to maternity and the child like nature of humankind, though the narrator was clearly an XY.\n\nSeveral lawyers remarked on the interesting thesis that what set humans apart in an important way was their prolonged childhood and extended dependence on mothering, which translates into malleability / adaptability.\n\nI will add my two additional cents:  that the show closely adheres to cultural templates, as far as \"television scoring\" goes (following known examples), is to its credit.\n\nSome of the latest state of the art images are shown in this frame, a visual feast is delivered.  Having a frame stay familiar and friendly gives more room to the weird and strange.\n\nBetter to read the somewhat \"cliche\" or \"formulaic\" obeisance to convention as honest homage to admired prototypes / ancestors, in the language of film making and television.  Why fix it if it ain't broke?\n\nWe're telling the greatest story ever told, that of the universe itself, and to take an \"if you can't beat 'em join 'em\" humble pie attitude is not a stupid move.\n\nI thought of Universe too:  \"that which humans have expressed regarding the universe\" (a kind of \"shared poem\" in RBF's lexicon).\n\nThat it all reduces to Pythagoras and number sets up a good vibe for simple storytelling (this is about passing the torch so memorability is key).  \n\nThe final fade out on Europe is apropos.  There's a deliberate Medittereanean flavor to all of this, an invitation to other regions to give it their own spin.  Be bold, be regional, be place based.\n\nWe know that's an important ingredient in \"gamefication\" as well (to localize, in the form of some specific geography or vista, a world).\n\nThe film points to the future with some notes of hope, but doesn't really try to go there.  I'd say it's more a summary of where they'd gotten by the end of the 1900s.  It's an end-of-millennium piece.\n\nSome of the next iterations will seem less cliche in some ways, as we're more disruptive of set mindsets (relic belief systems), or as nature is (not saying it's all about humans and their experience).\n\nDown the road, maybe we'll see more about the transition from 90-degree \nto 60-degree-based thinking, more in harmony with nature, perhaps in the\n guise of East-meets-West.\n\nOn the way to the venue, we passed a by \"fear panel\", a public space LCD radiating fear into the room.  Something about an extensive network of tunnels in the Persian vista.  So?  Are tunnels illegal all of a sudden?  Sheesh.\n\nHow that commuter-TV based lifestyle serves people is beyond me.  The amount of fear pumping through those veins, those urban capillaries, can't be good for a body.\n\nSo this is why we all wanted to get wired?  So we could be afraid, so very afraid, in The Matrix?\n\nDon't be a coward, kill your TV -- which might just be the \"head channel\" you're watching.  Choose your channels wisely (use that \"third eye\").",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}