{
  "id": "8753546235791090374",
  "title": "Judgement Day",
  "published": "2018-05-17T13:05:00.005-07:00",
  "updated": "2018-05-17T16:56:03.832-07:00",
  "content": "Judging from the non-starter screenwriting, some cabal wanted us to link a domestic case of poisoning to a war theater gas attack, and use this as some kind of excuse to start a major gamble, which this cabal was thinking might help get them ahead.  Desperate outsiders, these cabalists.\n\nThe police are getting better at working in concert, as are the militaries.  They know politicians have the dubious job of inciting violence, and that the people supposedly enthralled by political soap operas are chomping at the bit for social cues.  But that's not working, and insofar as \"mainstream media\" plays along, it becomes ever more phony-sounding.\n\nWe're wise to the fact that tiny minorities are trying to start something.  If not in Mesopotamia, then in Korea.  If not in Korea then somewhere else.  Jobs depend on keeping a war time economy in high gear.  Other jobs depend on having that war economy business make room for a next generation of weapons inspectors and cleanup gurus.\n\nThe intelligence community, such as there is one (pretty tenuous), is engaged in counter-intelligence against war-hungry cabalists.  They'd have you believe otherwise, as a way cabalists (members of a cabal) impress others with their power is to pretend overwhelming forces are on their side, including God if that's at all credible.\n\nWe don't need horrible violence to sustain a good life for the tiny few.  I know many still believe that's the case and get anxious when the horrible violence abates even a little.  If any religions feel like playing a role, it might be to disown the nukes.\n\nIf you're at all God fearing, [don't coddle your ego](http://controlroom.blogspot.com/2018/05/quaker-affairs.html) with fantasies of owning and controlling weapons of mass destruction.  Grow beyond needing that junkyard.  Heal from being an outward weapons junkie.\n\nNot that we want Armageddon to start at the hands of unbelievers either.  Our belief is God wills us not to make a mockery of Judgement Day, by staging it ourselves.  Or call it teleological pressure, some Fury of Being.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}