{
  "id": "111336080972735385",
  "title": "Judging Science",
  "published": "2005-04-12T20:35:00.000-07:00",
  "updated": "2006-11-15T11:44:08.852-08:00",
  "content": "Today fellow wanderer David Feinstein, a talented, Caltech-educated mathematician, presented his innovations designed to help judges of science fairs. The Intel International Science and Engineering Fair ([ISEF](http://www.intel.com/education/isef/)) is the particular one he's been focusing on.  The stage is set to give his new data visualizations and associated [decision support tools](http://analyticanimations.com/) a try.Thousands of science projects, neatly packaged and summarized, appear under one roof, with their authors in tow, and judges have the difficult job of interviewing all the contestants, and then ranking these projects, on a per-discipline basis, in order to hand out prizes and awards of various description.The job is made even more difficult by the fact that no judge sees all the projects in his or her domain, and maybe only one or two other judges has registered a score for any given project.Judges will skew their scores based on: what other projects they've seen in the fair; their background; their tendency to give generally high or generally low scores (on a scale of 0-100).David doesn't try to influence judges. His tools merely summarize and organize their scores more intelligibly, for the benefit of later caucusing. Caucusing is the process which ensues after judges have registered their initial scores, and now need to sort out the top projects.Today's demonstration involved jellies and jams instead of science projects. Each of 10 judges was assigned the task of scoring six randomly assigned jams and jellies, out of about a dozen samples. The scores were entered into a spreadsheet (the template was already prepared) and emailed from the Pauling House to an associate, who used the data to drive David's web-based visualizations and decision support tool.Fred Menger, Eve's brother, and chemistry professor at Emory University, was part of our number this morning. Last night, we heard him speak at Reed College about evolution (room 301, Chemistry building). He thinks the usual criticisms of Neo-Darwinism aren't all that problematic, but what does seem strange is that this huge, energetically expensive brain would show up, with potentials way in advance of anything we might have needed at the time. What in the environment would select in favor of so many unrealized capabilities? I think the brain has probably paid its own way, in terms of conferring advantages relevant to the era.He went on to suggest the brain supports epigenetic evolutionary processes with Lamarkian properties i.e. some acquired advantages get passed on. I wasn't sure why he thought the mechanisms needed to involve genetics at all directly, i.e. couldn't the processes be extracorporeal, e.g. linguistic? For example, cyberspace is making us more responsive without altering the human genome in any direct way.On another front, I've been working on a [new resource](http://www.4dsolutions.net/ocn/geoquiz.html) for the Oregon Curriculum Network, designed to provide insight into how some of the basic infrastructure in cyberspace operates.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}