{
  "id": "5738436737370406829",
  "title": "Juggling Hats",
  "published": "2012-05-25T16:00:00.000-07:00",
  "updated": "2012-06-19T12:29:45.740-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/7271348774/)\n\nI'm somewhat wearing [my AFSC hat](http://controlroom.blogspot.com/2011/12/base-tours.html) these days, having been drawn back to my foci from Asia-Pacific Issues News days, when I was editor. \n\nI drove Carol to the meeting this morning, but didn't attend.  She's continuing to meet with one of our program committee in this coffee shop, where I'm doing my day job.  I can't help but listen in a bit. \n\n[I'll be joining this same committee](http://worldgame.blogspot.com/2012/05/afsc-program-committee-meeting.html) for its first formal meeting, now that we've recruited our new Regional Director.  She'll be based in SF instead of Seattle, the way Susan was.\n\n[The neocon ideology](http://worldgame.blogspot.com/2006/03/temple-to-athena.html) goes on the rocks of hypocrisy quite often, most especially when \"the spread of democracy\" is proffered as a goal, but then what happens is non-democratically managed permanent cities are dropped in and stuffed with Americans living in slavery (stop-loss) or deliberately escaping from freedom (per Fromm).  No, it's not officially a POW camp (usually), but it's hardly a democracy, hardly one of [Disney's](http://coffeeshopsnet.blogspot.com/2009/07/pets-as-gifts.html) experimental [prototypes of tomorrow](http://controlroom.blogspot.com/2008/07/epcot-makeover.html).\n\nCase in point:  [the island of Okinawa](http://www.facebook.com/closethebase) is riddled with non-democracies, which gives Japanese the impression that USAers are nothing but a bunch of Roman soldiers who don't realize the war is over (lots of jokes at the Romans' expense).  Or they think they're a part of the Fourth Reich or some foolish business ([stand up comics](http://worldgame.blogspot.com/2010/09/arabs-gone-wild.html) are having a field day).\n\nThe curriculum is weak and kids graduate with little sense of history.  They get sent off to Occupy (one of the bases), and end up thinking, like [Gen. Smedley Butler](http://worldgame.blogspot.com/2011/10/esozone-talk.html), that \"war is a racket\" and/or some kind of [Business Plot](http://mathforum.org/kb/message.jspa?messageID=7832027).  But is it even that well thought out?\n\nSo the best place to focus on improving the curriculum, if the Feds plan to walk their talk, is right there on the bases, where Feds have the most control.  Show us how your curriculum is paving the way for a bright future, for the Okinawans included.  Don't just kick the can down the road, like Gen. Colin Powell did, by making militarism the solution for yet another decade.\n\nGetting kids in base schools to report back should not be a problem.  I'm sure some enjoy the lifestyle and wouldn't want it to end.  But I'm not saying so-called \"[Girl Scout Math](http://tech.groups.yahoo.com/group/synergeo/message/70136)\" (an operation) [and the like](http://mybizmo.blogspot.com/2010/12/wanderers-20101229.html) has to mean giving up access to airstrips.  Small planes would come and go. \n\nThe new base wouldn't be needed, but that was a lavish and unnecessary expense anyway, on the chopping block like [Manas](http://www.flickr.com/photos/17157315@N00/7274911630/in/photostream) (easier to chop given it doesn't belong to the Russians and Kyrgystanis the way Manas does).\n\n[](http://www.flickr.com/photos/17157315@N00/5498420758/)\n:: old recruiting poster (click for larger view) ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}