{
  "id": "631860487932019491",
  "title": "Keep Portland Queer",
  "published": "2024-07-22T08:36:00.000-07:00",
  "updated": "2024-07-22T22:38:33.353-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi8K_v6BmjdWXS088Whyphenhyphenx1cCB5I5y4jcVl0Cn3busyrLybcXTFdOCh_nmNnHBO6b3DbHyNZC22hvnM3R9YNKSeJYgKVts-Wm5M2YRscwaVhSEODH1k-dijSuI0Xf4R6HC630urswWi9w0aP-z4CFgzSl6VAP1C-0ddicMA-fEiogqVqi13GMC38/s1024/1024px-Keep_Portland_Weird_(17658598119)%20copy.jpg)\nAs some of my correspondents are aware, I've finally stumbled across Mark Fisher, the philosopher and commentator on contemporary culture. He extends my study of punk music, which in my curriculum links to the School of Tomorrow and of course solarpunk as an antidote or counter to cyberpunk.\n\nMark does a lot to dissect the meaning of \"weird\" versus \"eerie\" in his book on these two concepts. \n\nThe weird involves a presence, not necessarily horrific or terrifying, but off kilter, eliciting a sense of not belonging or, if it belongs, then our priors (Bayesian speak) must be what's off. We may live in a different world than we expected.\n\nThe eerie is more about a rekeying of intentionality, shifting the emphasis from human agents with free will, to tricks and flips of fate. Again, the eerie might be employed or evoked by a writer of horror genre fiction, but the eerie need not be scary so much as haunting, as if by dim memories or a sense of deja vu.\n\nMark dives into various authors (Lovecraft...) and filmmakers (David Lynch... Hitchcock), as well as musicians (Brian Eno...) to make his points and tease apart these meanings. I'm enjoying such investigations as they jibe with my own philosophical background as a Wittgensteinian. When we want to know the meanings of words, running to a dictionary is the lazy option.\n\nNaturally, the unconscious is not far below the surface in Mark's analysis, and Freud figures prominently, in part as an authority to overcome, as Freud's use of \"uncanny\" has tended to obscure the nuances Mark is attempting to capture.\n\nAs I wrote to a friend in the background:\nIs \"queer\" insulting though?  Deja vu we might've had this conversation?I'm watching old lectures by one Mark Fisher, philosopher, author of Real Capitalism and other books, including one on the [eerie and the weird](https://www.amazon.com/Weird-Eerie-Mark-Fisher-ebook/dp/B01DHWAMCI/) (just purchased).  That's adjacent to the old meaning of \"queer\" as in \"odd\" or \"different\", but oftentimes in a positive sense as in \"novel\" or \"out of the box\" (\"the box\" being stuffy and stultifying).Speaking for myself, I like being called an \"odd duck\" and stuff like that, \"a martian\" one of my favorites.Again, summarizing some of my thinking, to another friend I wrote:Podcast taking up Mark Fisher's book on the eerie and the weird:[https://youtu.be/4gSpNIct1-0](https://youtu.be/4gSpNIct1-0)They explicitly address obtuse / dense academic language and how Mark steers clear of it for the most part.My focus has been Martian Math as embedded within or serving as a portal to science fiction as a genre, which sometimes borders on the eerie / weird as well as on horror (adjacent / overlapping genres).The sense of humans embedded in an inhuman (nonhuman) intelligence comes through in episodes featuring uncanny synchronicity for example.  \"Human writers could not have written this\" is the sense.  Or it'll be a combination:  an outlandish human project goes wrong, or not as planned, thanks to the surreal aspects of life itself.  That can be a good thing, if the human project was misguided or nefarious in the first place.  The sense of divine intervention, angelic or demonic, is a counter to human hubris. Humans may have had a hand in world affairs, but are ultimately not in control. The Ouija Board comes to mind, and that sense everyone has that they're not the ones moving the planchette.  The (collective) unconscious versus the ego persona.There's a whole segment towards the end of the podcast about how it sounds weird or strange to remind people that the country they imagine they live in is all make believe e.g. the line between the USA and Mexico or the USA and Canada, is all imaginary-fictional. To remind people that their \"world\" is a fantasy based in social conventions, is to elicit an alien viewpoint, which I've called ETPV (ET point of view) in other writings.In the background:  Bucky's Grunch of Giants, about untethered capitalism versus cosmic evolution.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}