{
  "id": "894685102749280719",
  "title": "Kirby Kibitzing",
  "published": "2025-01-23T21:08:00.000-08:00",
  "updated": "2025-01-24T05:48:57.333-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjbHq1u3DEZFI60lkD3HCDsvhO4jywf1MVhclQNu2FPxBo8jQAjGPSN5-vC1rCpK4r-I4hp2Go-KqQ5-J-AzJTn9xbiMY0sEu_rKpp17Iq8b-xPyph7d0FvkxbnMU3OP-vP7FlAUVE2U27NLkNPCpryotbW46HzUYKfgv_3mLqpmunVqaL6SPEf/s4000/20240123_164200.heic)\nI checked the etymology of “kibitz”: something to do with watching others playing card games while running his, her or their mouth, opining on the state of play, and likely giving unsolicited advice.\n\nAlong those lines, I found it a refreshing change in the conversation to have DT sound ethnocentric (what else?) regarding who won WW2. Many USAers are now getting an education on the Russian view. \n\nFormer allies try to one up each other on who was the star and who the co-star. Mission accomplished: both were on the same side (some of the new people wouldn’t remember). The statement seemed customized to create a productive backlash. People enjoy lecturing DT.\n\nThen comes a supposed pause in propping up the Neocon-Nuland regime in Kyiv, but with conflicting messages, as few believe there’s been any real change in permissions. The sense of a looming audit is not enough to brake the juggernaut. \n\nGlobal gangs raid and loot the old world arsenals pretty much unchecked, provided they grease the right palms and are well connected in Gatekeeper City. \n\nThe Contras in Nicaragua were likewise weapons traffickers, with cocaine a common currency. What to do with an excess of junk weapons was a problem solved, once “fighting to the last Ukrainian” became a thing. As long as weapons are shipping, some people are happy campers.\n\nHowever there’s a public perception of increased reluctance to fuel the psychotic mayhem in Eastern Europe, on the part of those ostensibly running the so-called government. The public tries its best to follow from a distance.\n\nAt the same time, the tone towards Russia was “this is bad for you too” (more “same page” rhetoric) with the threat that if this conflict isn’t stopped, the Prez will fall back on imposing even more onerous financial penalties, a far cry from threatening to send twice the number of javelins and bayonets, let alone threatening big arrow offensives by military socialist forces (the military base economy).\n\n“Figure this out or I’m really gonna put my foot down, you don’t wanna see me having a hissy fit do ya? I can assure you it’ll be ugly.” If that’s what passes for tough talk, then we’re maybe making some headway.\n\nAs readers know, I’m a big fan of citizen diplomacy, with a lot of emphasis on truckers as among those who interact the most with counterparts from other backgrounds. How do we get more PhDs in that job? Lots of data science. I could say the same for global airline crews etc. \n\nIt’s the tone of those anonymous semi-private person to person conversations that I like to track.  These latest few moves by the new White House team, with respect to the NATO war, seem relatively benign in a Chuckles the Clown kind of way. \n\nThe comedy index has ticked up, if only a little.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}