{
  "id": "4695804128482464000",
  "title": "Kubo and the Two Strings (movie review)",
  "published": "2016-09-08T09:33:00.002-07:00",
  "updated": "2016-09-08T10:06:29.569-07:00",
  "content": "Laika is an Oregon brand, so this film was made in Oregon.  The look is quite different from the previewed animations, Glenn and I agreed.  We had The Bagdad almost to ourselves (two other people), as it's \"back to school\" and the summer matinee audience has dissipated.\n\nGiven the 100% Asian motif, one might consider this a \"Japanese\" story (which it is), however the stuff of Euro fairy tales fits in fine, from the Sword in the Stone to Pinocchio, both childhood favorites to ponder over, in my case, in several versions.  I liked to read and movies were harder to come by in those days.\n\nThe magical powers of Origami, the paper squares, allude to frames of film and the dreams we bring to life using our powers of animation, film magic.  The appreciative crowd is the audience, and it's great to see this movie with one's grandmother.  The extended family matrix, the ancestral tree, is strongly present throughout this \"soap opera\" involving a jealous grandfather and a disapproved marriage, Kubo the illegitimate offspring (the way grandad sees it).\n\nThe protagonist, Kubo, goes from outward storyteller to inward hero, helped by the archetypes to encounter the others he must face.  Even the ghost of grandfather helps him along, to confront his own jealousies.  The forced march to adulthood requires facing death in many forms.\n\nThat all sounds rather serious and double-plus un-fun perhaps, but then animations rendered to text, like fairly tales, will tend to sound grim.  The artistry and care taken make up for my dismal retelling, many details left out.  These stories serve a healing function by cushioning hard lessons in cartoons. Or call it cryptography -- whatever myth-making is.\n\nWhen the villagers put lamps in the river, in celebration of the ancestors, I was reminded of our first ceremonies at Oaks Park, along the Willamette, setting afloat such paper lanterns, commemorating souls lost to war, to atom bombs, to all manner of outward violence.  My mom had been to Japan in the aftermath of WW2 and was eager for me and my sister to have a less crazy and dangerous world.  She's been at it ever since.\n\nDeath comes soon enough anyway, why not let nature take its own slower course?  Humans seem to always go for the gas peddle in some rush to get to some [Mad Max end times](http://worldgame.blogspot.com/2015/05/mad-max-fury-road-movie-review.html).  Relax and enjoy the roses?  Why go for [Planet of the Apes](http://controlroom.blogspot.com/2014/07/dawn-of-planet-of-apes-movie-review.html) every time the trigger-happy go off half cocked.  Do they need their own island?  I pondered Lord of the Flies a lot too.\n\nGlenn and I had walked around Laurelhurst earlier, discussing his Global Matrix in the context of forward-thinking PR. The world's gamer community, with the leisure to model civilization using Civilization, seems eager for a whole planet tiled with hexagons. \n\nWhere should [the twelve pentagons](http://worldgame.blogspot.com/2016/08/hp4e-continued.html) go?  Of course at the poles in some layers but that's the thing, we have any number of overlays (layers), and not all are about the same things.  ESRI's ArcGIS works the same way, as does Photoshop.\n\nI suggested a game of Pentagon Go, with one of the twelve pentagons snug around the US one, with geocaching games around the consequent other eleven, some of which might be in the high seas (I haven't figured it out yet).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}