{
  "id": "3396627062394401882",
  "title": "Last of OSCON",
  "published": "2012-07-23T21:12:00.004-07:00",
  "updated": "2012-07-24T20:37:00.864-07:00",
  "content": "[I've been puzzling](http://mathforum.org/kb/thread.jspa?threadID=2391310) in the rear view mirror, ever since, like reading my new Go language programming book at American Dream Pizza today.\n\n[One of the best talks](http://www.oscon.com/oscon2012/public/schedule/detail/23186) was this enthusiastic woman, Kirsten Jones, with a clear mission:  to make our use of the web APIs less frustrating.  And she did that very simply, by showing us the best software for snooping on web traffic and getting those request and response objects clearly mapped, complete with headers, parameters, whatever came or went. \n\nThat genre of software proves its value over and over in her experience and she gave a really clear exposition about that, to an appreciative room.\n\nIn reverie, I was [taken back to West Precinct](http://worldgame.blogspot.com/2009/06/at-work-again.html), Jerritt Collord presiding, starting our class in Open Source for Saturday Academy, courtesy of Hillsboro Police Department, geared for youngsters in their region.  He had them thinking about packet sniffers immediately. \n\nEven though [Officer George Heuston](http://mybizmo.blogspot.com/2005/03/wanderers-meeting-2005315.html), former FBI and white knight in good standing, was present and monitoring, he allowed Jerritt to proceed.   This was public information.  Geeks, and geeks in training, have a need to know -- especially if it's the web traffic through your own machine, not even talking about sniffing wifi.\n\nThe final keynote was amazing as well, all about fear and longing, motivation, \"mind hacking\".  A skillful speaker that guy, head and shoulders above so many.  I was enthralled, even though I felt I knew the ideas already.\n\nSlides are an art form and I don't think [that biomimicry guy](http://mybizmo.blogspot.com/2012/06/another-omsi-pub.html) made the right call, in opting out of sharing pictures in that Bagdad setting.  The standup comics get away with not doing that, but is that what we were there for then? \n\nThe military has adopted the lightning talk standard, [per anthropological reports](http://controlroom.blogspot.com/2011/04/roller-coaster-at-reed.html).  I can see why.  With slides, and five minutes, you can say a lot.  But then blog posts let you read at your own pace and have [more hypertext](http://mathforum.org/kb/message.jspa?messageID=7852816) -- it's more pull than push. \n\nNeed to know?  Keep clicking.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}