{
  "id": "430330943404727949",
  "title": "Laughing Planet",
  "published": "2008-10-25T20:16:00.000-07:00",
  "updated": "2012-11-16T00:46:15.373-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh9kcovLNK8hUtmF3OLie3X6Yhsl-YwlFGVB34RPPyhqRjzC87rAj3kSlEFoqjSsgGncpmPq_VBJj0RmpdwMyweKLJIHgKyk70CgG5c97AEmJ1FSZuRy7rB2LOHz3ZkI5LpMdef/s1600-h/yes_partner.png)@ Laughing Planet\n\nIn offering to spike your caffeinated beverage with some Jack Daniels, we're not muscling in on liquor bar turf so directly, as the ambiance involves staying, or at least looking, pretty sharp, in business clothes, basically conducting small board meetings, [using the LCD](http://mybizmo.blogspot.com/2008/10/ppug-20081014.html) for either PowerPoints (generic) or real time hookups with partners in this / other time zones.\n\nSports bars involve sharing one screen to a whole room, whereas a coffee bar distributes content through multiple screens, each potentially hosting different programming, like those old juke boxes, one per booth.\n\nHowever, for a host of reasons, Portland might not be the best city for prototyping, even if [some of the thinking](http://controlroom.blogspot.com/2008/10/coffee-shop-philo.html) is coming from Pauling House Campus and environs (Richmond / Sunnyside).\n\nWe could develop streaming content locally, asynchronously served (or synchronously even), per our [ToonTown economy](http://mybizmo.blogspot.com/2008/01/curriculum-notes.html), yet clue \"first viewers\" closer to Hollywood.  That's an equation involving state statutes, political climate, other factors.\n\n\"Good thing we have 50 states\" is [what I'm thinking](http://mybizmo.blogspot.com/2008/09/nation-of-writers.html).\n\nOf course the franchise idea occurred to both [Nirel](http://www.nirel.mobi/) & myself (we think alike in some ways), and also the possibility of occupying different tiers, in terms of family friendly, versus no minors allowed.\n\nThe idea of an NC-17 McDonalds may be counter-intuitive (to call up a known franchise i.e. chain), but one might imagine gradations in service nonetheless, as in Orlando.\n\nIn a parallel meeting with Patrick, we resolved to trademark some stuff around our HAARP beer concept, a play on [the Irish brand](http://en.wikipedia.org/wiki/Harp_Lager), \"affordable mind control:  inexpensive, not cheap\".  We might have one of those [HAARP cams](http://www.haarp.alaska.edu/) play a part in commercials.\n\nYes, we're into spoofing those many urban legends, have [some DIA grays](http://darkestsecrets.org/dia_conspiracy.html) on the consulting team, just to keep it real.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}