{
  "id": "5390928041936196730",
  "title": "Launch Sequence",
  "published": "2013-04-20T16:59:00.000-07:00",
  "updated": "2013-04-22T13:01:51.973-07:00",
  "content": "...162, 92, 42, 12, 1.  That's a lowering frequency in to a nuclear sphere of 1, where the grammer of [Synergetics](http://en.wikipedia.org/wiki/Synergetics_%28Fuller%29) may locate a point of inside-outing and a corresponding 1, 12, 42, 92, 162 expansion.  Bow tie Universe and all that.\n\nThe progression hooks to Coxeter in the recent biography, The King of Infinite Space.  This was a mathematical discovery Coxeter approved of, found merit in, and your mathematics might be only high school grade, and yet still you might [prove it](http://mybizmo.blogspot.com/2007/01/gnu-math-memo.html).\n\n[As I posted to Math Forum](http://mathforum.org/kb/thread.jspa?threadID=2448513), in my posited Lucky Devils Academy (LDA), you have a slow, leisurely, relaxed approach to sequence and series generation.  You may introduce recursion in various ways.\n\nEven fractals are color coded sequences, where those that converge are the black [Mandelbrot points](http://mybizmo.blogspot.com/2006/09/focal-points.html) (example fractal), while those that diverge are colored according to their rate of divergence.  [At Saturday Academy](http://worldgame.blogspot.com/2012/08/adventures-in-teaching-and-driving.html) we took advantage of the University of Portland's excellent projector system and watched some Mandelbulb movies (another brand of fractal).\n\nSooner or later we get to Python, where we explore and implement math objects, including sequence and successive sum generators.  You're using Python for something it's good at.  My recent examples to Math Forum included Bernoulli Numbers and Gregory Coefficients (I'm not claiming to be the first to express those algorithms as generators plus I'd done Bernoulli Numbers before, though less elegantly).\n\n[](http://www.4dsolutions.net/ocn/graphics/cubanim.gif)1, 12, 42, 92, 162...\n\nOf course I have an ulterior motive in sharing generators in that 1, 12, 42, 92, 162... describes [a growing octet truss](http://worldgame.blogspot.com/2006/02/octet-truss.html), a piece of scaffolding. The bars between the hubs describe tetrahedrons and octahedrons.\n\nWith a new model of 3rd powering, demonstrated with a tetrahedron, we get [relative volumes](http://www.grunch.net/synergetics/volumes.html) of one and four.  Other whole number and incommensurable volumes click into place forming what Bucky will call [the \"concentric hierarchy\"](http://worldgame.blogspot.com/2005/12/incomprehensible.html).\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjYfhj3q68biGdYBf5Z0vfLdLuXULRDoG4Kqa4uxaJTTcgGmx1K-Zg2VxclMOhbwQIX0KkUgR2Ej7c70hs2GTfpAQKDn0VfxkmueMGXO0Uu0_rWuBlIDTSi1N1hVq4R-lAcyJ6O/s1600/smhierarchyanim.gif)\n\nAs a grand central of connected concepts, it's hard to beat the density of relationships within this graphical / lexical matrix of shapes and sequences.   The Lucky Devils come away from this reading / viewing program more savvy about Python, the micro-architecture of the virus, and the geometric facts that will help with their STEM studies.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}