{
  "id": "5633664604295681027",
  "title": "Libby, Montana (movie review)",
  "published": "2014-10-22T13:08:00.003-07:00",
  "updated": "2016-07-22T10:12:30.387-07:00",
  "content": "This almost-two-hour documentary does a marvelous job showing the story from Libby's angle, where the workers gradually put two and two together and realize this deadly asbestos they've been hearing about is actually the stuff they've been mining but branding as vermiculite or something else cute.  The stuff is everywhere because for awhile no one thought lung science could possibly matter in the rock business.  Kind of like H-bombs can't be bad for ya.  Or smoking.  Live and learn.\n\nAnyway, what's missing are the board room meetings at [W.R. Grace](https://www.mesotheliomalawyercenter.org/asbestos/manufacturers/w-r-grace-co/) where the limited liability nature of the corporation kicks in.  That's what keeps little old ladies from losing their life's savings because some venture goes bad and all the sailors lose their lives at sea.  You may not get that box of chocolates, $100 wasted, but if you do, each bonbon will be individually worth $100, the proceeds all yours to keep or divvy among friends per your temperament.\n\nThat was the promise to English nobility:  risk ten sheep, reap a fortune, or at worst, lose the ten sheep.  No one comes banging on your door for twenty sheep.  There's a cap on your liability equal to the amount ventured.  That's what Inc. means.\n\nW. R. Grace needed to reallocate resources to selectively bankrupt the Libby subsidiary, then block EPA from locking up lucrative contracts, in case a clean up ever was approved.  Meanwhile people were dying but there's no real cure for asbestosis anyway so that was already a write-off.\n\nThese were more good soldiers of capitalism, risking their lives for their labor in their capitalist sea, and reaping the rewards:  early death from complications associated with one's job.  Grace management died on the line as well, this wasn't just union men.  Whole families got it.  Asbestos is no joke.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}