{
  "id": "5933916584153665782",
  "title": "Limitless (movie review)",
  "published": "2024-12-19T11:29:00.000-08:00",
  "updated": "2024-12-20T08:45:29.799-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/54195054310/in/dateposted/)\n\nThe magician at the farm performed at least one trick that wasn't an illusion: he had the USBc to HDMI cable needed to share my iPad screen on the trailer television. All this time, I'd only seen that as a port for charging, not for sharing. \n\nAs soon as I got home, I ordered such a cable on Amazon.\n\nSo last night was one of my first times rummaging through YouTube when a movie was suggested and I thought \"why not, I'll put this on the big screen TV\". Deke the Geek gave me a hand-me-down TV earlier in 2024. It has a few quirks, such as turning itself on and off randomly, but for the most part it's working great. I got through Limitless without any but commercial interruptions.\n\nThe protagonist (Eddie Morra played by Bradley Cooper) in this science fiction film is but a struggling writer and we might imagine this whole scenario is his play-within-a-play fantasy, wherein said struggling writer gets a smart pill and turns into his own ideal, the one he's not: an amazingly brilliant, astute and attractive dude whom everyone admires, including Robert De Niro (playing another mastermind). \n\nTo bootstrap himself to fame and glory, given his new superpowers, our writer needs seed money to turn into a fortune and so he turns to organized crime for a loan. This comes back to haunt him later. Why he wasn't smart enough to pay back the loan with interest earlier, in a timely manner, is a bit of a puzzler though, given he’s so intelligent. \n\nWhy give the loan shark his excuse to escalate and in the process get a taste of the same medication, immediately addictive for obvious reasons.\n\nThe Lucy parallels are obvious, including the Faustian price: the drug eats away at you, messing with your sense of time and space, and if one tries to quit... the withdrawal symptoms may be fatal. So the whole business of needing more doses, at any cost, kicks in. This could be heroine, it could be cocaine. The paranoia and criminality that go with the territory certainly comprise a major downside. Flowers for Algernon. Why not just stick to weed?\n\nPraying for higher intelligence is not a sin, but then there's the question of what we mean by \"intelligence\" which is where ethics and values kick in. People came up with EQ (emotional IQ) to counter IQ (intelligence quotient). Why not pray for greater empathy, because isn't empathy a kind of intelligence, ala the Octavia Butler vision? Perhaps empathy is the bigger umbrella.\n\nA funny thing: right after this movie, YouTube rolled me into The Big Short, which I'd never seen either and which has many points in common with Limitless, in terms of the role models it parades. In this one I noticed our star Jeremy Strong from The Apprentice who played Ray Cohen. He's a Wall Street trader in this film, so still very much the New Yorker.\n\nWe could dive deep into the anthropology here. Food for thought. Limitless.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}