{
  "id": "3944474206019100390",
  "title": "Listserv Posting",
  "published": "2015-12-22T19:45:00.005-08:00",
  "updated": "2015-12-22T19:47:27.132-08:00",
  "content": "From: kirby urner\nDate: Thu, Dec 17, 2015 at 1:16 PM\nSubject: Re: Presenting misconceptions detrimental to learning ...\nTo: The Physics Learning Research List \n\nOn Thu, Dec 17, 2015 at 12:43 PM, [ JD ] wrote:\n\nIn particular, many of the most important concepts (in physics\n and elsewhere) are so fundamental that they simply cannot be defined in terms of anything more fundamental.  One place where you see this with particular clarity is in Euclidean geometry, where the fundamental objects -- points, lines, and planes -- are emphatically and explicitly *not* defined.  The words acquire meaning from how they are used, and not otherwise.  \n\nI'd like to riff off this paragraph a little in order to draw a distinction\nbetween \"misconceptions\" and \"alternative conceptions\".\n\nMy approach to the latter w/r to non-Euclidean alternatives is to start \nwith Karl Menger's 'Modern Geometry and the Theory of Relativity' [1] \nwherein he suggests a \"geometry of lumps\" in which points, lines and \nplanes are distinguished not by \"dimension\" (Karl was a dimension \ntheorist) but by shape (topological characteristics).\n\nI combine this with an alternative model of multiplying two numbers, \nwhere the two lengths A, B are posited at 60 degrees in alignment with \nunit-area triangles, such that A x B is the area closed off by the \norigin O, and segment AB. [2] \n\nThis model leads to an analogous \ntreatment of 3rd powering (or multiplying any 3 numbers) that goes to a \ntetrahedron, not a cube.  \"Three to the third power\" is not a cube but a\n tetrahedron.  This is well known from the 1970s writings of geodesic \ndome architect Buckminster Fuller. [3]\n\nGiven the \npronounced 4ness of the tetrahedron (4 windows, 4 points), and no \ndistinction in dimension twixt points, lines and planes (\"infinitely \nthin or small\" e.g. \"depth without height or width\" are handled by a \nconcept of \"subfrequency\" instead), we get a \"pre-frequency\" Platonic \nworld that is considered \"4D\" (tetrahedron = concept of \"container\" i.e.\n that with inside/outside concave/convex aspects), with Time / Energy \nadded as additional dimensions. [4]\n\nThat's all an opening into a philosophical investigation of what's permissible, in \nterms of having different namespaces.  Are these moves \"allowed\"?  It's a\ndifferent way of talking.  I cast it as \"Martian Math\" to acknowledge \nit's alien, but not necessarily \"wrong\".\n\nChallenging the efficacy \nand utility of Euclidean geometry is not the point.  Pointing to \nanother way of connecting the dots that likewise holds water is the\n point.  One needs a limber mind to tackle slippery concepts (like \n\"dimension\") and getting too stuck in a rut is not a good way to stay \nlimber.\n\nKirby\n\n[1] in Albert Einstein: Philosopher-Scientist , The Library of Living Philosophers VII, edited by P. A. Schilpp, Evanston, Illinois, pp. 459-474\n[2]  [https://youtu.be/2B1XXV2Eoh8](https://youtu.be/2B1XXV2Eoh8)\n[3]  [http://www.rwgrayprojects.com/synergetics/s09/figs/f9001.html](http://www.rwgrayprojects.com/synergetics/s09/figs/f9001.html)\n[4]  [https://en.wikipedia.org/wiki/Quadray_coordinates](https://en.wikipedia.org/wiki/Quadray_coordinates) (a \"4D\" coordinate system)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}