{
  "id": "4091821394961797128",
  "title": "Little Women (movie review)",
  "published": "2020-01-13T16:02:00.001-08:00",
  "updated": "2020-01-13T16:08:51.352-08:00",
  "content": "We went to this on request of my sister, visiting from Whittier.  I'm glad she was into it, as I learned a lot from this film, looking through my Anthropology lense especially.  Long movie.  Carol had to go, once we got out, and that's when I learned about the murder plot the Secretary of State was involved in, along with POTUS. Back to the Twilight Zone (oblivion).\n\nI'd never read the book Little Women, and decided to keep myself in the dark until showtime.  I recognized Emma Watson right away, the grownup Hermione of Harry Potter fame.  Her performance was brilliant as was the acting overall.  Speaking of Harry Potter, this was around the time its author came under fire, for some tweets or like that. I wasn't distracted.\n\nThese vivacious women had few prospects, when it comes to owning property and achieving financial security, absent a man, are busy doing whatever they might to cultivate their social virtues, as pianists, painters, or even writers.  I started thinking about [Dora Marsden](https://worldgame.blogspot.com/2014/02/valentines-day.html).\n\nThe writing profession has been especially closed to women, especially if we're talking tabloids or more lurid pulp fiction.  Women writing under their own names were supposed to keep it genteel. Tea-cuppy Victorian puritanism kept the bolder women running brothels, as the class conscious aunt pointed out.\n\nWe left reminded, by the end, that we're in some happy ending fiction, a bound book, whereas the author, one of the characters, is likely not exactly like her avatar in the story.  I'd need to read a biography of the actual author of Little Women to figure out the differences.  I'm going to leave that as an exercise for the reader, including me.\n\nSome weeks after seeing this movie, during the crisis which followed Obnoxico's bad chess (Pompeo et al), I discovered [Swiss philosopher Alain de Botton](https://youtu.be/KkB-kpet3eo) and his mocking attitudes towards Romanticism.  Ironically, a world wherein women were more economically empowered, would likely be more romantic, as relationships would be less \"of necessity\" or \"of convenience\".  That being said, many of the pitfalls associated with romanticism, as characterized by Alain, deserve the bright light of critical scrutiny.\n\nI'm not saying Little Women is about preaching romanticism, it's not a corny comedy in that way.  I saw the movie in a more feminist light, and wished these sisters had more prospects.  Hollywood would come later. \n\nThe US never did pass the Equal Rights Amendment, another nail in the coffin as far as some of us were concerned.  Lets hope future operating systems might serve us better, including those with Stars & Stripes decals.  In the meantime, we're stuck with a lot of phony baloney.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}