{
  "id": "5368169695782571270",
  "title": "Local Activism",
  "published": "2007-01-08T12:02:00.000-08:00",
  "updated": "2007-01-08T12:04:29.544-08:00",
  "content": "Winterhaven parents are up in arms because the School Board plans to close it down, separating the program from the building, and then moving the program to a strategic location far away from its current one, thereby disrupting many lives, for the sake of the children.Their idea is that if the program is such a good thing (which all claim that it is), then it deserves to be in a bigger facility, so more kids might join.  The idea that the school's relatively small size might have something to do with its success, doesn't bubble up as relevant, even though that's what the students are claiming (who listens to them?).Nor can they think in terms of spreading a successful program, rather than closing it down to reopen it elsewhere, as that would mean two Winterhavens, which'd confuse everybody. Rather, they must perform a heart transplant, and save one community by killing another.Something you have to understand about School Board people:  they're volunteers with busy lives, surrounded by paid staffers with hidden agendas.  There's a lot of wheeling and dealing that goes on.  I doubt parents know even the half of it.Some Winterhaven parents were rather vocal this year, objecting when the military came around with its annual bus 'em to brainwashing [\"science\"](http://www.wweek.com/editorial/3249/8087/) briefings (\"wow, look at that cool jet fighter\").  Most schools just get in line because they're \"too poor\" to offer such \"science\" on their own, but Winterhaven, proud of its science, was less compliant.Could there be an element of retribution in this School Board maneuver i.e. let's show activist parents what happens when they question authority a little too loudly?  I'll ask my connections in Salem if they think there's a link.Follow-up:  likely no link, but there're plenty of other reasons to want to kill Winterhaven. On the other hand, parents have gotten wise to the fact that the democratic machinery of government gives them an upper hand.  There's a meeting this evening.  Stay tuned.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}