{
  "id": "5266822312664785221",
  "title": "Looking Ahead",
  "published": "2008-10-30T19:30:00.000-07:00",
  "updated": "2009-01-14T15:16:42.720-08:00",
  "content": "Dateline CubeSpace, 7:30 PM -- me in the back corner, working a bottle of diet Coke, surveying the scene.  Ward Cunningham is here, invented the Wiki.  Jason, talking about open source conferences in Argentina and Chile.  There's a bit of a spread, food-wise, wolfed cookies and chocolate-coated strawberries.Why are we here?  OSCON is leaving us for San Jose, creating a vacuum, which nature abhors, something like that.  We're here to inject new life into our city's vibrant open source culture, not so long ago celebrated in Christian Science Monitor [as a flag bearer](http://controlroom.blogspot.com/2005/11/pdx-open-source-capital.html) for same.  Up to 25% women in Argentina, and climbing.  Tonight's tag team is also all women, designers of Open Source Bridge, or just Bridge for short.This is the same room I last visited in my capacity of PPUGer, [gave a lightning talk](http://mybizmo.blogspot.com/2008/10/ppug-20081014.html) on Python 3.0 and its apocalyptic significance in terms of backward incompatibility.  No one seems especially freaked out about it though, not like the older Pythons have anywhere more special to go.  Python 2.6 is where to poise yourself, if you wanna take the leap.Why we love Portland:  Powell's, bike lanes, farmer's markets, sustainability principles, plus we build things:  a plethora of tech events, user groups, Linus lives here, [Calagator](http://calagator.org/), [open source rocketry](http://psas.pdx.edu/), [OTBC](http://otbc.typepad.com/), [OSL](http://osuosl.org/), [Legion of Tech](http://legionoftech.org/blog/), lots of grassroots energy.So lets have an awesome open source conference!This'll take ongoing community organizing, more doing of what we're doing.We've got time reserved at the Oregon Convention Center, targeting about five hundred attendees.Sponsors are starting to line up (should I join them?), although it's a bit early to throw around numbers.Admission charges are expected but need to be much lower than OSCON's obviously.Rick Turoczy is heading up Marketing, taking on promotion well beyond city limits.  Let's coordinate blogs etc.  He'll be leading one of the seven breakout sessions.Jake Kuramot is taking on Finance.Adam DuVander is looking at IT (\"the technology experience\" -- important in marketing).We've got a Logistics Supervisor, and a Content Management staff.  Looks promising.  I like the way the leadership is already so organized.Some guy wants to know what the \"philosophy\" will be -- he's trying to get at \"look and feel\" issues (as in \"how commercial?\") but that's not an easy topic to grapple with in a plenary session of this size.Shared vision is important though, we should get more of it in writing.This won't be a trade show, is developer friendly, about networking and collaborating.  Knowledge-sharing.  Some discussion erupted about the difference between \"open source\" and \"not for profit\" -- that could get thorny.I'm attending the content breakout session, asking if teaching (as in effective techniques) will be one of the tracks.  Varied formats, unconference section.  Cooking vs. Chemistry metaphor (\"get it done\" versus \"theory\").  Good thinking.Alpha geek [Allison Randal](http://mybizmo.blogspot.com/2008/07/more-oscon-keynotes.html) is here, helps make it official.I encouraged the organizers to look at this as showbiz, something they're staging, not kowtowing to community expectations too much, willing to show off new concepts, show 'em how we do things in Portland.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}