{
  "id": "114687756796924779",
  "title": "Lucky Lab",
  "published": "2006-05-05T19:00:00.000-07:00",
  "updated": "2006-11-15T11:44:17.941-08:00",
  "content": "So I just rushed back from this brew pub, a meeting of [POSSE](http://www.possepdx.org/), where the governor of Oregon made a brief appearance (David Pool, whom I know from our [CollabTech](http://business.newsforge.com/print.pl?sid=04/04/09/1854218) days at FreeGeek, pointed him out to me), and Erik Sten, a local city council member now running for re-election.Erik shared for a good half hour actually, taking a question from me about industrial sector zoning of the east side hugging the freeway. Would a \"think tank economy\" featuring such as the [London Knowledge Lab](http://www.lkl.ac.uk/), but Portland's, be apropos?Erik thought that'd be a swell idea, matched his own vision quite a bit.  And no, I'm not forgetting his \"[render farm](http://en.wikipedia.org/wiki/Render_farm)\" idea either.A TV camera with a separate boom microphone showed up later, during the presentation on open source business models. People got more intelligently talkative. I thought we cut a great tape.I'm burning [Sunanda](http://worldgame.blogspot.com/2005/02/adventures-in-radio-land-part-2.html) CDs from a master at the moment.  As yet I have no clue what he shared on KBOO last night.  [Funny hippie psychobabble](http://worldgame.blogspot.com/2006/01/bumper-sticker.html) is how he characterized it, in the minds of his listeners at least.Later:I purchased Chinese food from [Fujin](http://www.wcities.com/en/record/95,141400/159/record.html), rented [Sister Act](http://www.imdb.com/title/tt0105417/) and [Sister Act 2](http://www.imdb.com/title/tt0108147/) from the nearby Hollywood Video for Dawn and Tara, and picked up medicines at the Fred Meyer pharmacy.  My hope is to visit with [Jon Bunce](http://mybizmo.blogspot.com/2006/03/st-patricks-day-wanderers-retreat.html) (a Wanderer and musician) later this evening.Dawn spent much of the day working on her new studio space, which is rather near to the east side [Lucky Lab](http://www.luckylab.com/).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}