{
  "id": "3997524940776738030",
  "title": "Lyrikal Afternoon",
  "published": "2010-08-19T17:24:00.000-07:00",
  "updated": "2010-12-23T00:57:00.771-08:00",
  "content": "No, not a typo.  Lyrik is a neighborhood hangout in 97214, a place for networking, holding forth with one's peers.  I'm thinking either Dr. Nick or [John the Architect](http://worldgame.blogspot.com/2010/05/architect.html) might join me, though I've made no special arrangements.  Mostly, I'm just wanting to stay out of the way, as Food Not Bombs is using our household's kitchen, might be using the meetinghouse next time.  I offered to help, but my volunteering the facilities was apparently assistance enough.  I'm not widely known for my great cooking abilities, especially when it comes to large groups, although those [Teresina Lentils](http://mybizmo.blogspot.com/2008/07/together-friends.html) are kick ass (not taking credit for those though, just following a recipe).I'm supposed to contact the Property Management Clerk at the meetinghouse and see about transferring Thursday's operations to the more industrial strength kitchen on Stark Street, the former Electroscientific Instruments building.  A lot of the food is uncooked, the same produce you'd find in [a grocery store](http://controlroom.blogspot.com/2010/01/reality-checks.html), so excessive use of energy, pots and pans, is not part of the picture. Indeed, the bike trailer comes with its own cooking equipment, such as it is.I've suggested we take a look at Martian Math as a discussion list, over on [the math teacher forum](http://mathforum.org/kb/message.jspa?messageID=7156127&tstart=0).  So far no takers, so I'm [upping the ante](http://mathforum.org/kb/message.jspa?messageID=7156899&tstart=0).  We don't have \"all the time in the world\" to get to the bottom of some of this stuff.  There's real work to be done and I'm under no illusions that it'll all get done in time if we're just looking to some small group of poor slobs at their workstations.  Recruiting is the name of the game, has been for awhile.To let off steam, I'm back to Punch & Judy on Synergeo, either watching or participating.  Call it a mosh pit.  Synergetics is steam punk, or at least punk, or at least...  slam dancers R us.  Rybo to me: \"You full of whatson bozon poop.....what a lack of moral integrity....  :--( sad\"Speaking of which, we're also trying to torture the Yahoo! rich text editor into delivering up a radical math sign (trademark, whatever).  It's sort of working, thanks to Alan's suggestion we switch to UTF-8.  Let's see what a cut and paste operation does (remember, your browser has settings too, and sometimes \"Western\" is not what you need most):  √яFollowup:[Facebook profile](http://www.facebook.com/thekirbster) is loading blank tonight.  F~B didn't happen as I'd originally imagined -- hardly any cooking at all this time.  Checking into bio-diesel for home heating after re-reading [Hyzy's posting](http://www.kathyhyzy.com/) on that (old newspaper article).[The Willamette Week cover story](http://wweek.com/editorial/3641/14401/) on the open source cure for what's ailing health care, is somewhat encouraging, though the art is looking so retro.  This thing about geeks being \"old hippies\" is maybe [too much lore](http://worldgame.blogspot.com/2009/03/urner-workshop.html), too little technical detail.  Will we go with [something like Cassandra](http://www.facebook.com/note.php?note_id=24413138919)? Given all the problems Facebook is having (not just talking about my missing profile), that's probably not reliable enough a system for medical record keeping.  [Tokyo Cabinet](http://controlroom.blogspot.com/2010/04/cramming-and-cleaning.html)? Thx to Laughing Horse for the tip.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEipKEt9N_FowBRXZtyYNNfvZNW-T_LQ60Nam_qDAi4p7aqOLMi6Yqn5LOgqqZ6gdfedaG5m6QdFcUWjhz94YuJJxbi1GaWY42irIbO5Gbhv9Lr5pvnEF7aYjgHuLElYRkghQCcc/s1600/ww_geeks.jpg)For further reading:[Draft Essay to some Math Teachers (on another list)](http://groups.yahoo.com/group/synergeo/message/62911)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}