{
  "id": "5741994367472142626",
  "title": "Made for TV",
  "published": "2010-11-04T16:10:00.000-07:00",
  "updated": "2011-01-24T12:21:46.080-08:00",
  "content": "So it's a week later at the meetinghouse (see below) and I'm learning a lot more about workflow design, even though that's already on my resume in places.The idea of a \"made for TV\" Food Not Bombs maybe sounds cruel and heartless (too LA, too Hollywood), but in an era when we're [counting down to zero](http://worldgame.blogspot.com/2010/07/countdown-to-zero-movie-review.html), the ~bombs part has broad agreement and appeal, such that sponsors might want their brands front and center (or miss the boat).I might see applying [Centers Network skills](http://mybizmo.blogspot.com/2008/12/voluntary-associations.html) and/or Western Young Friend skills, but then these are somewhat generic and emergent already.  And I'm not seriously thinking this has to be a Hollywood show, unless you mean [Portland's local neighborhood](http://controlroom.blogspot.com/2008/11/neighborhood-associations.html) by that name.  This is [community participation TV](http://www.flickr.com/photos/17157315@N00/5171270462/in/set-72157624742571845/) of the kind we were always promised.  Doesn't mean we can't filter excerpts to the bigger networks like ABC.  Now if we only had real optical fiber, that let small outlets share the infrastructure -- not what the monopolists are intending.In the meantime, there's a lot of local awareness of the criminal syndicates building more bombs, buying their pet politicians, while neglecting [infrastructure](http://worldgame.blogspot.com/2005/07/wanderers-meeting-200575.html) for children and old people.  To the extent there's any [DEW system](http://mybizmo.blogspot.com/2009/11/increasing-military-iq.html) anymore, there'd be some real push back from [the Pentagon](http://mybizmo.blogspot.com/2006/08/mathcasting-about-phi.html).  I still think an [open alliance with Cuba](http://mybizmo.blogspot.com/2010/07/marketing-campaigns.html) would be cool (bridge through [CDI](http://www.cdi.org/)?), a noble alliance versus that nefarious international human rights violator known as Gitmo.Given recent progress within the Global U, I could see where the real dollars would go with us, and not with the phonies.However, I digress.  Back to workflow:  what if the sponsoring donors send too much food to the cooking plaza, where the kids are lining up to learn and showcase their cooking skills?  True, the cooking happens daily, with bike trailers, electric conveyances, delivering servings all over town (yeah, like Meals on Wheels).On a small scale, what this looks like is too much produce piling up. For example, Lindsey (a star student) has a superman complex (very Nietzsche): she enjoys lugging [huge amounts of produce](http://www.flickr.com/photos/17157315@N00/5147844968/) up hills with a bike trailer, distributing it to free porches, sharing it with friends (she built the \"tractor bike\" herself).  Sure, we could use more heroes like her (the more the merrier), but I can see where a plethora of committed horsepower might overwhelm some of the cooking facilities or, more likely, their composting facilities (not every church is so well equipped -- nor every meetinghouse either for that matter).One solution is to cultivate more [urban gardens](http://challenge.bfi.org/application_summary/68), like in Brooklyn.There's a lot of useful work implied in this picture.  In Global U terms, one may not get a cash advantage for participating, but consider the sponsor credits.  Free time in a bike co-op or gym, movie tickets (serious-minded documentaries most likely), even access to conferences, concerts, travel.  I'd advocate sending Lindsey to Havana if we could get that [ice cream factory](http://www.flickr.com/photos/17157315@N00/5098052415/) thing going.Plus like one of the crew was saying tonight (a former Brooklyn resident): hanging out with F~B gives free access to coveted apprenticeships learning to cook healthy vegan and/or vegetarian meals for lots of people.  That's valuable skills building.  Our Gathering of Western Young Friends, using the kitchen facilities [at Camp Myrtlewood](http://controlroom.blogspot.com/2007/12/trip-prep.html), is likewise a training zone.These kinds of rewards, more career related, count as income in anyone's book.  All it takes is some organization and a willingness to pitch in.How wonderful to have [Quakers](http://mybizmo.blogspot.com/2008/07/some-quaker-pr.html) at the forefront.  Logistics R Us.Will Code for America step up to the plate?  We hear a lot about that initiative.  What [open source](http://mybizmo.blogspot.com/2008/04/hackerdom.html) fund accounting software is out there.  [Coffee Shops Network](http://coffeeshopsnet.blogspot.com/2010/11/belated-happy-halloween.html) wants to know.[](http://www.flickr.com/photos/17157315@N00/5382897441/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}