{
  "id": "9101901393572631780",
  "title": "MAGA",
  "published": "2018-02-09T21:01:00.003-08:00",
  "updated": "2018-02-09T22:10:15.634-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/28399033149/in/dateposted-public/)\n\nMAGA = Make America Great Again.  I've always admired how this admission of un-greatness became a patriotic slogan.  Quite a spin.\n\nA question is, how would [a globalist such as myself](http://worldgame.blogspot.com/2018/01/wanderers-2018131.html) seek to rekindle nationalist pride in these United States of America?  Why not take it on as a challenge, even if only as a hypothetical?\n\nI'd go back to the 1980s and focus on the great American Buckminster Fuller's prescient take on corporate personhood in Grunch of Giants. As a futurist, he was pretty good at anticipating memes.  He also proclaimed the innocence of the American people while consigning an obsolete version of the USG to the ash heap of history.\n\nSkeptics will point to Fuller's big mistake: he anticipated a \"design science revolution\" that would rescue us from immanent catastrophe and put the world on a better track, one involving engineering over politics, General Systems Theory (GST) over LAWCAP (i.e. lawyer-capitalist) economics.\n\nI'd counter that the design science revolution indeed occurred, and is continuing, but was branded as the Open Source Revolution, with Portland, Oregon [a capital](https://www.csmonitor.com/2005/1128/p03s02-ussc.html).  OSCON (O'Reilly's Open Source Convention) is coming back this year, after twice trying to get away from the Oregon vortex.\n\nA lot of journalists maybe think said open source revolution was a bust, judging from how the Dot Com Bubble left so many investors in the lurch.  A few made out like bandits, but the narrative, about Linux and free software dominating the world, seemed to have fizzled.  The documentary [Revolution OS](https://youtu.be/4vW62KqKJ5A) provides good background.\n\nI'd disagree with this analysis.  So-called capitalism runs atop these design science layers, even if LAWCAP's bookkeeping fails to properly value their worth.  Where would we be without Python or NodeJS?  That's a rhetorical question.\n\nThe new USA operating system (USG prototype) that's emerging in our midst already contains a hard reset in the 1980s and hasn't been on board with the Grunch in more recent pre-emptive, unilateral invasions and naked attacks.  Imperialism is for the birds.\n\nThe transparently mercenary activities of those abandoning the US Constitution is making history for sure.\n\nI'm not claiming this story-line is going to be popular or well-known. That was more of an exercise in consistency. \n[](http://mybizmo.blogspot.com/2018/01/mlk-day-2018.html)\n[The new USA](http://mybizmo.blogspot.com/2018/01/mlk-day-2018.html) is not at war with [Iran](http://controlroom.blogspot.com/2008/07/psy-war-whos-losing.html) and seeks nuclear disarmament.  Let the LAWCAP puppets say otherwise.  Their credibility is already shot in my book. \n\nThey [lied about Vietnam](http://controlroom.blogspot.com/2018/02/the-post-movie-review.html).  They lied about Iraq and [Afghanistan](http://controlroom.blogspot.com/2009/11/rethinking-afghanistan-movie-review.html).\n\nMAGA!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}