{
  "id": "540870818282966301",
  "title": "Maker Faire at OMSI",
  "published": "2016-09-11T10:08:00.001-07:00",
  "updated": "2016-12-15T19:18:11.176-08:00",
  "content": "Glenn and I headed for Maker Faire, a mini version by some standards, with a known purpose, which I summarize as HP4E:  hexapents for everyone.\n\nFor those just joining us, the \"hexapent\" is a way of subdividing the surface of a sphere with mostly hexagons, a few pentagons, the soccer ball pattern being a first instance.  You might call that a truncated icosahedron, or even a buckminsterfullerene molecule, relative of nanotubes, graphene, other carbon allotropes.\n\nIn recent blog posts, and tweets, I've been cranking out some hexapent examples (see below) using Adrian Rossiter's Antiprism software, compiled for the Raspberry Pi and rendered on same using POV-ray from [povray.org](http://povray.org/).  These are simply still pictures, more for the exterior of the shrink-wrapped box, were the games we're planning actually sold that way anymore (in plastic-wrapped boxes).\n\nWe found the gamer community, showcasing indoors (where we started), ahead of the curve, as predicted by Civilization, a classic hexagonaly-tiled god's eye view program.  Veterans of Civilization are quite well-versed in the hexapent lore.\n\nWe asked about the state of the game engine economy, specifically whether anything open source could serve as a basis for Glenn's many game theme ideas.  Given his years of scholarship, he's brimming with fantasy simulations, some of which connect to known science.\n\nIn Game World, it's fine to indulge in fantasies of lost sciences also.  Those who despise mixing genres, such as \"illusionist\" with \"real magician\" (an oxymoron for them), will welcome the same content provided genre rules are obeyed.  We don't have to insist that only true believers play, whatever it is, that sniggering skeptics back off.  On the contrary, anyone is welcome to judge these games how they will, plus roll their own.\n\nUsing hexagonal tiles is a standard already, no worries that I'm barging in and claiming ownership of ideas as old as the hills.  #CodeCastle philosophy isn't like that.  Speaking of which, this community center model I've been promoting under the hashtag #CodeCastle would resemble a Maker Fair in many ways, just as the Maker Fair resembles OMSI.  Indeed, in touring the Maker Fair, we found ourselves wandering through OMSI's own exhibit construction space — more of the same, really.  Great stuff.\n\nGiven I've been strutting Raspbian artifacts around town, I made a special point of visiting the Intel booth to learn for about the Edison and Minnow.  The latter is closer to the Pi in what it's for, a platform for operating systems and applications. The booth guy said the Minnow was \"more powerful\" that the Pi, which is likely true as the ARM chip is low power by design.\n\nA side benefit of starting in the gamer room is we met up with Don and Tim, in charge of the Tesla coil exhibit and stage presentation.  Their largest coil is not easily accommodated by OMSI, though they managed last year.  A half million volts would be sufficient.  We went back for the light show later, by way of 3D Printer-ville, where Skip and his son were hard at work.  [Skip already knows](http://mybizmo.blogspot.com/2015/01/wanderers-2015113.html) about the \"hedron stuff\", speaking of which, I need to visit Hedron, near Bull's Eye Glass.\n\nI had another goal aside from the global data game hexapent motif hunt (the OSMI Gift Shop had that too, if you looked for it), which was to lookup the PDX Code Guild booth and find [WorkingIT.com](http://workingit.com/) staff if I could.\n\nThe code school's booth was easy to find, and Sheri mentioned seeing Margaux hard at work doing interviews.  I watched Neil expertly assisting curious visitors with the Scratch-controlled robot, Sheri too.  I'm admiring of Scratch and would gladly sit behind someone else more expert and more into showing off.  I'm rather low on the Raspbian totem pole, one might say.\n\nGlenn and I stopped at [Beermongers](http://thebeermongers.com/) on the way back, getting some interesting IPAs not on tap in our neighborhood.  I rarely get to this watering hole, Irish in flavor.  Speaking of which, great getting to walk up Mt. Tabor with Eddy Gunnell the other day.  He's a quick-learning Celt, and former co-worker at St. Dominic Academy in Jersey City, now settled in Portland.\n\n[](https://www.flickr.com/photos/kirbyurner/28659277984/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}