{
  "id": "5576718680508966004",
  "title": "Management by Rotation",
  "published": "2007-12-11T13:16:00.000-08:00",
  "updated": "2011-11-03T10:24:46.761-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgkz8Hmmja7Gx-NjnZffgCdM-SwVNwGRW-zKvt-eDcXPmzsGbd61KF1qPXoFPS2jOXBRDBPPaZCWJupnOBgTfPPTG91XEuZMH-FGAWpI-3tBJsXPFethhP0vxahfDhDsxU1xWAC/s1600-h/bob_mug.jpg)[cafepress.com](http://www.cafepress.com/subgen)Usually the CEO, CTO and CFO of a company have their faces published in various glossy annual reports, on coffee mugs or whatever, so [their ability to \"blend in\"](http://www.flickr.com/photos/17157315@N00/6290986190/in/photostream/) among the rank and file is compromised.A 2nd tier manager enjoys more anonymity, plus may have been recruited from within the company to begin with, so won't be seen as \"just clowning around\" if she or he joins a baggage handling team or some IT project for a spell on the front lines.The CBS News team is another real world example, of a managing editor still doing field work, while those more often on assignment, or hosts of other programs, jump in to anchor from time to time as well.Such management by rotation helps keep a crew limber, cross-trained and resilient, plus sustains a two way street of reality checks flowing, such that \"the field\" and \"the head office\" don't become divorced worlds, each with an exclusive, insular culture.Of course a given special case reality is way more complicated than sketched above.  For instance, you can't just hop between jobs and bleep out the training part, unless maybe you're going back to something you were good at already (frequently the case, but why not challenge yourself, pick up some new skills?).Even as a top manager in your firm, you may need to join a specific \"[away team](http://en.wikipedia.org/wiki/Away_team)\" as a neophyte apprentice, a \"lower down\" in terms skill level, and be willing to take direction from these more adept professionals, even as they learn from your high level ways.Many a Western (movie genre) featured this plot, of an urbanized big shot, say a banker, reduced to needful dependence on local fur trappers, ranchers or even Native Americans in some cases.A stint in the field may be a humbling experience for a boss type although sometimes \"humbling\" really isn't the word for it so much as \"eye opening.\"  A stint in the field may also be refreshing and revitalizing i.e. is duty to look forward to, to welcome, to not shirk or pass off as mere \"busy work\" to an underling.Physicians are especially aware of this revolving door experience, simply because we're all mortals ailing of this or that terminal condition (i.e. life as we know it).  Healers more generally find themselves on both sides of a healing equation, as patients of other healers, and so no wonder then that so many symbols of reciprocity ornament the medical literature.An inspiration in the background:  John R. Coleman, a former president of [Haverford College](http://en.wikipedia.org/wiki/Haverford_College) who used to take low paying [service jobs](http://www.amazon.com/Blue-Collar-Journal-College-Presidents-Sabbatical/dp/0397010303) to keep some perspective.  Another inspiration:  the Centers Network, which implemented quite a lot of rotation among its volunteers and staff.Here we're talking about a consciously designed aspect of a company's infrastructure, set up not as punishment but as an intelligent design aimed at sustaining the vitality and longevity of any long haul business venture.Of course an older archetype is from Chinese philosophy, in which the emperor is forever disguising himself in peasant clothing and going out among his people.  Given published photographs were less prevalent in those days, this was actually a more imaginable practice, plus one could always resort to disguises, various cloaking devices and so on.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}