{
  "id": "7843846836818461982",
  "title": "Manga Code",
  "published": "2009-03-15T12:03:00.000-07:00",
  "updated": "2009-03-18T07:59:26.069-07:00",
  "content": "Computer science (CS) traditionally includes various flavors of pseudo-code, designed to be somewhat agnostic, true (gets one out of the advocacy business), but more important, uncluttered with extraneous detail not relevant to developing the rudimentary level of understanding we're aiming for, i.e. to use a true production code syntax would just bury the lesson in cruft.This is not about dumbing it down, but of being respectful.  You're a busy executive, a [FOSS boss](http://mybizmo.blogspot.com/2009/03/ppug-2009310.html) between meetings, [riding Amtrak](http://mybizmo.blogspot.com/2008/06/train-story.html) both ways, with only so much time for technicalia, best that those sessions be packed and comprehensible, relevant.  You don't need displays of snobbery reminding you that you're out of your field, out of your depth.  This colloquial, non-patronizing style was pioneered by \"for dummies\" and \"for complete idiots\" titles.  \"Explain it to a caveman why don't ya?\".  Pretty soon, cavemen were selling us car insurance.When Python came along as \"executable pseudo-code\" i.e. as very non-crufty, even economizing with whitespace, the new possibility was to write \"manga code\" as I'm calling it, a kind of comic book or cave painting version of a more complicated production environment.  Or call it [the \"open source\" version](http://coffeeshopsnet.blogspot.com/2009/03/open-source.html) (thinking back to Linux and its citations to computer science texts, [its monolithic kernel](http://en.wikibooks.org/wiki/Operating_System_Design/Kernel_Architecture/Monolithic_Kernel) with modular plug-ins extension architecture).Manga code has the advantage of actually running in other words, meaning the runtime environment, not just the compile time source code, has [andragogical significance](http://worldgame.blogspot.com/2005/01/brainstorming-about-pedagogy.html).Buried in my specific example of \"manga code\" for Coffee Shops Network (CSN), is vendors getting the proceeds above a \"worthy cause\" waterline, as if your heroic idealist is now suddenly co-opted, Marcuse style, is now shilling for Mars.  Here's a screen shot:[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiqkJ0LYm8dFDL4cGlzajGLn_JUQcgRDmU4kf_TnVB2W_LMGIwl9pUF3bHafas1MZona7O_2DH0VgmsXP_sXeyyrRpj6rg8_FwBEm8agyjRpRN0WrgEJ0aYFZ5p83rHysNXF7-c/s1600-h/vendor_profit.png)>> [compare with circuit](http://www.flickr.com/photos/17157315@N00/3325262372/sizes/l/) <<I'm proposing a different gestalt however:  having topped out for your worthy cause (e.g. AFSC, FCNL... QUNO), you're now a company MVP taking a victory lap, adding luster (and profit) to your proud back office sponsor.  Yes, you're \"carrying Mars on your back\" so to speak, but not as a slave, as a hall of fame friend of the sponsor, like on Facebook.  Let your vendor glow in your limelight.  Then on to the next game.But doesn't the model show the vendor benefiting from your loss or failure to star in whatever practice session?  The house got some compensation just for booting the game, but we'll say the vendor bonus was simply \"unexpressed\" i.e. the players working for this product don't yet have the strength to intercept its game loop and start feeding their resumes. The trophy goes back to the warehouse, unclaimed.  Better luck next time, takes practice, takes patience.The vendor wants star players because that's better advertising than always winning your bonus back, because your games are simply unplayable, don't help the worthy causes or anyone but yourself.If we picture [the CEO of Mars](http://worldgame.blogspot.com/2008/04/biz-page.html) coming in to CSN and playing for a favorite cause, then the victory lap might feel like \"income to me!\" i.e. \"I've earned good will and now I'm getting paid for so doing, best of both worlds\".  However, the manga code above makes \"Me!\" compete with the other worthy causes, another way of netting a reward, then effectively mailing a negative bonus (cutting in to vendor territory, claiming turf) which the company actually celebrates, as now you're their champion (one of many we hope).Put another way, at the hardest levels, it's between you and the vendor (who may be the game author).  Innocent bystanders (worthy causes) don't get caught in the crossfile.  It's the difference between \"their product\" and \"their product with your name on it\" i.e. those high level points are yours to win.  Games without winners tend not to have takers.  Like sure, a vendor could put out a game that says Game Over right out of the gate, but who'd wanna play it?I'm not claiming to get all of the above across in my manga code.  This is additional description.  The culture already has the pattern ingrained, so once I point to it, I don't have to work too hard to sketch in the details.People know what its like for a company to put someone out front as their figurehead (could be a fictional or cartoon character, [like Popeye](http://mybizmo.blogspot.com/2006/08/hiroshima-day.html)).  CSN is offering miniature versions of that, each game an experience, but also a toting system for adding your gains, should you, the paying customer, wish to keep a tally or track record of your feats.That's a way to [find matching players](http://www.flickr.com/photos/17157315@N00/3353728021/sizes/o/), other coworkers, to strut your stuff in other words, whatever that may be in your case.  \"Showing what you're made of\" is not sinfully prideful (i.e. vain) necessarily, just an honest labeling of ingredients, lets people know what they're getting.  Social networking software wasn't born yesterday, especially if you factor in all the pre-computer analogs.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}