{
  "id": "7623371797920674189",
  "title": "Map Psychology",
  "published": "2007-12-23T08:00:00.000-08:00",
  "updated": "2007-12-26T14:02:28.272-08:00",
  "content": "Having lived in Europe for so many years, I'm aware of the pomp and circumstance attendant upon crossing a so-called border (so-called because these people can't seem to make up their minds, like to gerrymander).Europeans then look at a [map of the USA](http://www.4dsolutions.net/ocn/geoquiz.html) and see more like one color, with the states thinly outlined, and anyway what do those states even matter given everyone eats at Burger King and gases up at Chevron?But the truth of the matter is the territorial USA is even more ethnically diverse than Europe's, having inherited that mother lode plus we had a ton of cultures going before they really got here en masse.  All those plastic franchise signs paint a thin veneer of shared culture over a vast expanse.  We all need gas, we all go shopping (mas o meno).In the history books, you'll find lots of Norte Americanos going psycho over all this diversity, thinking it's a bad thing and must be conquered.  That's laughable if you think about it, because the messianic \"save America for the Americans\" fanatics are always ethnic sectarians of one brand or another, a tribe of some kind.Back to the Euro folk:  in seeing the advance of [Golden Arches](http://worldgame.blogspot.com/2007/07/slow-food-nation.html) and such icons across their land, fantasies turn to occupation by [the Borg](http://worldgame.blogspot.com/2004/10/we-are-borg.html), some single-minded mono-culture that knows what it's doing going into Iraq.  These fantasies are just that:  [delusional paranoias](http://mybizmo.blogspot.com/2007/08/inner-sanctum-storyboard.html).Globalization is not a dictated, creepy cult phenomenon, staged by some chosen few, but a natural consequence of diverse cultures reaching some compromises in order enjoy commerce with one another.  This is not a new challenge (learning to get along), but the pace has picked up, given the big crunch, not so much in terms of population (there's still room to spread out), but in terms of more happening closer to the speed of light (e.g. satellite telecommunications).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}