{
  "id": "1623342255568404643",
  "title": "Martian Math (update)",
  "published": "2024-09-05T09:22:00.000-07:00",
  "updated": "2024-09-05T09:35:36.910-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53973447428/in/album-72157624750749042)\n\nMartian Math has been heating up on the back burner. Now that it's \"back to school\" season, I'm pumping out the educational materials that any Silicon Forest teacher might need, to tell our history. \n\nWho was Doug Strain? How did his scenario overlap the AFSC's here in Portland (AFSC = American Friends Service Committee)? \n\nAnswer: although Doug was a pacifist during WW2, a conscientious objector, he was not a Quaker, and yet he admired the work of the AFSC especially and so when Quakers needed a new meetinghouse, he helped arrange for that to happen, with AFSC gaining some office space in the process (from which it later moved).\n\nThat's Doug Strain of Electro-Scientific Instruments (ESI), one of our Silicon Forest parent companies.\n\nDoug also funded the preservation and renovation of the boyhood home of Linus Pauling, thereby establishing a beloved landmark along Asylum Avenue (renamed Hawthorne Boulevard after said Asylum's head doctor), in the Asylum District where I live.\n\nWhat I did today was add the above picture of AI King Hilbert (named for Hilbert Spaces) to the Storyboard: Martian Math album. I don't want my invisible army of Martian Math teachers (they might not call it that) to feel like I'm only catering to high schoolers and not taking it up to the college level.\n\nWhen the Jesuits wanted to impress Chinese intellectuals with \"best of the west\" inventions, what came to mind was perspective painting, as perfected during the Renaissance. These canvases went hand-in-hand with another Jesuit-favored topic: the mnemonic arts. Memorize the floorplan of a public building, such as might be shown in a perspective painting, and create a VR experience wherein treasured memories could be represented as icons, and thereby organized on a \"virtual desktop\".\n\nMy understanding is the Chinese were skeptical that time-energy invested into realism was well spent, as paintings do not share the burden, later shared with photographs, of providing literal depictions of exactly what's present.\n\nWithout falling into a rift and debating these issues, I simply want to draw the analogy and say n-dimensional linear algebra is a technology around which humans are justly proud. They've made a lot of headway with their matrix-driven apparatus, including in the realm of metallurgy, where graphical processing units (GPUs) do matrix ops with blinding speed, allowing 30 frames a second and higher frame rates, computed in real time, within our computer games and simulations.\n\nThis pride will feed our willingness to devote considerable attention to conventional Hilbert Space presentations, in tandem with delving into the Martian stuff, with its four basis vectors at a mutual 109.47 degrees, ala the methane caltrop (molecular structure). CH4. \n\nInstead of XYZ and 3D space, we have the IVM and 4D space, but moving between the two has become smooth, owing to Qvector <-> Vector conversion algorithms. Qvectors are the 4-tuple \"quadrays\" used to map out the IVM, assigning unique whole number addresses to every CCP ball in the bunch.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}