{
  "id": "1935822286042786768",
  "title": "Marxist?",
  "published": "2018-10-23T18:14:00.003-07:00",
  "updated": "2021-06-04T22:42:03.014-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/44813098734/in/dateposted-public/)\n[on Medium](https://medium.datadriveninvestor.com/gst-versus-econ-28457f03ae9a)\n\nYes, I went to Princeton, so maybe you think I've been steeped in Marx, given current stereotypes of what universities are like, cite Jordan Peterson et al.  However way back in the late 1970s, my thing was Freud and Jung.  Even in high school, psychoanalytic literature was my bag.\n\nI found [the whole idea](http://www.quakerquaker.org/group/liberal/forum/topics/the-earliest-quakers-and-liberal-quakerism-1?commentId=2360685%3AComment%3A162014&groupId=2360685%3AGroup%3A867) of \"mental illness\" rather fascinating, and I don't think in a creepy way.  What a vast landscape, this inner world, and how weird it could become.  Very Tantric (is how I sometimes think of it).\n\nSo yes, when I got to Princeton, I dove into Jacques Lacan, some Adorno, certainly Marcuse.  It's not like I didn't do any homework whatsoever.  I looked at the Hegelian system as a precursor to Marxism. The whole idea of Logic versus History seemed pretty special.\n\nI do remember students protesting the one-sidedness of the Economics curriculum.  We used Samuelson for a textbook in 101.  Stagflation was a problem back then.\n\nThose hoping to get some Marxism in the mix were to be sadly disappointed, or so I gathered from the raging debates, which were printed in various issues of the Daily Princetonian.  I was housemates with the editor.\n\nI do recall roaming the open stacks in the reserve reading room (is that an oxymoron?), and coming across collections of old high school textbooks.  Some of them were so biased, when it came to mentioning Marxism.  Having seen museums filled with textbooks from Nazi days, I've taken to studying the history of ideas through the lens of what we share with kids.\n\nI was focused on philosophy as my long time readers know.  I felt I had a chance at international relations and applied to the Woodrow Wilson School.  However, during my interview I expressed some ambivalence.  I was talking myself into philosophy instead.  Dr. Kahler was disappointed.\n\nMy early fascination with psychoanalysis and the inner world is likely what predisposed me to choose philosophy over international affairs, but then I've never really seen these as all that separate, from psychology either.  I learned about James Hillman from Sue and Bryan.\n\nProcess Work, as developed by Arnold Mindell, somewhat expresses my own sense of unity in this area.  Logic & History...  Like Alex says, mathematics is everything.\n\nPeople sound Marxist to me when they see someone getting public sector benefits as being supported by taxes, and in turn by their work.\n\n\"Only the work of the working provides any value, so if others get value and aren't working, they're gaining at my expense.\"  Missing from this equation: (1) the great bounty of the environment, starting with the sun; (2) the fact that we're all working, regardless of our title and job description in whatever role playing capacity.\n\nI'm not saying taxes don't make a difference (I just wrote a check for $4,831.28 for property taxes). I'm saying that World Game is not zero sum and public sector wealth owes more to the sun, wind and rain than to any issuer of debts.  Banks may pretend to loan us our cosmic heritage, but we're only gullible to a point.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}