{
  "id": "8576720852871277213",
  "title": "Mathy Memes",
  "published": "2015-12-01T11:44:00.000-08:00",
  "updated": "2016-01-16T14:07:34.766-08:00",
  "content": "[ [a first draft](https://groups.google.com/d/msg/mathfuture/2mCCtmdePbA/BUjBkyTQBgAJ) published to MathFuture, a Google Group ]\n\nMy talks at PyCons \n(Python conventions) and OSCONs (Open Source conventions) going back \nshow me mounting the stage to decry \"calculus mountain\", by which I \nmeant the obstacle course and sometimes source of disappointment occasioned by the \"forced march\" through \"delta calculus\" if \nwanting to get into a four year college, and by extension into a STEM \nfield (or \"work for NASA\" as some put it).\n\nMy contention, in those years, was those like me who'd made it over calculus mountain \n-- I got into honors calc at Princeton, skipping the regular, had \nThurston the topologist for a prof; we used Spivak's, Calculus on \nManifolds -- found on the other side some \"cool pools\" i.e. an oasis of \nother mathy topics that could have been just as well taught in high \nschool, providing alternatives to those not turned on by calculus.\n\nAn example of such a \"cool pool\", no delta calc required, is Group \nTheory.  Permutations at play.  More generally, what we today call \n\"discrete mathematics\" was screamingly relevant, in terms of the doors \nit opens, compared with \"integration by parts\", or so I believed.  I \nfound other voices sang with mine.  I was part of a choir.  I also \njoined forces with those wanting to teach \"how to code\" (computer \nprogram) for core credit.\n\nFast forward and I'm in Oregon, \njoining a small lobby group to say to the legislature:  \"You know those \nthree years of math you require for a high school diploma?  We want to \nbring in discrete math topics and open up more space in STEM than just \npre-calculus / calculus, whaddya say?\"  As far as I can tell, pretty \nmuch all the states said \"[OK](https://edhesive.com/blog/2016/iowa-may-require-cs-to-graduate-by-2018)\" in unison i.e. they had no concrete \nobjections to math-credit computer science.  So ruled without objection,\n right?\n\nWhen it comes to marketing the possibility in \npractice however, that's another matter and big publishing gets \ninvolved.  I like to float mnemonics, easy to use -- but we hope not \nmisleading -- memes.  Calling the conventional pre-calc / calc track \n\"delta calculus\", as I do above, is not how most people write.  The \nletter \"delta\", though used in differential / integral calculus, has not\n been made to \"brand\" it in that way.  High school calculus, as \ntypically taught, does not go by any Greek letter.\n\n[My innovation, then](http://worldgame.blogspot.com/2014/09/lambda-versus-delta.html), was to cast \"delta calc\" versus \"lambda calc\" as two flavors of \n\"calc\" (computation), like chocolate and vanilla.  No one said a given \nstudent can't do \"swirl\" (both flavors mixed together).\n\nLets\n be clear:  lambda calc already exists, one might point to the Princeton\n Institute for Advanced Study, a couple generations back:  Alonso Church\n and company.  So where do we want to take it next?\n\nLets remember\n that so-called \"delta calculus\" was at one time esoteric and not \nintroduced pre-college.  In formalizing the work of Newton and Leibniz, \nas filtered through generations of refinement, thank the French, we got \nit into the form of pre-college deliverables, a spiral, a ladder, \nfeaturing Riemann sums and Leibniz notation for derivatives, first, \nsecond, third and so on.  Different school systems have different \nhistories.  Many narratives criss-cross (inter-weave).\n\nIn \ncanning calculus (\"canning\" as in \"canning tuna\" not as in \"firing from a\n job\") for the pre-college crowd, we sliced out most of the history.  We\n take for granted that mathematics, being a \"universal language\" is \nsomehow too eternal to be subjected to a merely tempo-real -- as in \nhistorical -- treatment.  That's considered aftermarket trade book \nreading.  Textbooks must peek at history only in sidebar, or in footnotes \nmaybe.  \n\nWhatever the rationale for so sanitizing the subject, we\n neglect a most important bridge to the humanities i.e. here is where \nC.P. Snow's chasm, betwixt the humanities and sciences begins to yawn.  \nHistory provides at least a rope bridge across, whereas many find \nthemselves trapped, on one side or the other (reading maths or reading \nhistory, but never the twain together thanks to illiteracy barriers).\n\nWere\n we to restore more of the history, we would discover more of the all \ntoo human drama of contention.  But is debate a bad thing?  Isn't moving\n forward a matter of dialog, or \"dialectic\" as the educated say?  \n\nMathematics\n has not evolved quietly, without argument.  Newton and Leibniz argued \nwith each other (a priority dispute) while Bishop Berkeley attacked the \nwhole idea of infinitesimal quantities and proofs based on them (a \nconceptual integrity dispute).  Cantor and Kronecker took different \nsides in some arguments.  There's ferment, disagreement, or at least \nalternative ways to go.\n\nBut that's precisely what gets white washed in going over this material:  schools find it expedient to agree \nthere's at least one subject on which everyone agrees.  Or, if they \ndon't, at least none of the boiling-over arguments should touch the kids.  That math is contentious gets \"dirty secret\" or \"in the closet\" treatment.  \nBut Thomas Kuhn in his talk of \"paradigms\" at least made it OK / safe to\n question the caricature of a \"steady advance\" did he not?  So why be so\n timid?  Why all the shielding?\n\nAnyway, in rolling up \"lambda \ncalculus\" into a more popular form, like was done already with the \nNewton - Leibniz stuff, I've focused on \"composition of functions\" as \nthe primitive notion, with the multiplication operator very soon \nintroduced as a \"composer operator\", so that we further develop that \nsense of polymorphism around operators, the ground of Abstract Algebra.\n\n[A permutation](http://worldgame.blogspot.com/2015/11/permutations.html), a mapping of objects to themselves in another or same \norder, is a primitive function, a set of ordered pairs.  It's \none-to-one, bijective.  And permutations may be \"chained\" (composed).  \nAs a topic, they thicken the soup of whatever computer language, giving a\n gym to work out in.\n\n\"Why use the multiplication operator at \nall?\"  That's where the \"cool pool\" of Group Theory comes in.  This is \nmaterial we currently try to get into around Algebra 1 and 2, just a \nlittle, but we're in a hurry to dive into delta calc.\n\nWe have no time \nfor passing functions as arguments to other functions, as we do in \nPython and other languages (that's a good introduction to delta calc \ntoo, through the gate of functions with function-arguments).\n\nBut now we\n do have that time, because we have a fork in the road and the freedom \nto follow the lambda calc road instead, or in addition, to the delta \ncalc road.  The lambda calc road is certified legal and open to traffic,\n we just need more teachers to help out as guides.\n\nI'm \nunder no illusions that with the snap of some fingers, even more than \njust mine, these \"reforms\" might be injected in short order.  Rather I'm\n providing a road map for like-minded to reference, when explaining to \nthe general public or intelligent layman what the strategy is.  \"All the\n computer stuff we don't currently manage to squeeze in? -- we've got a \nway now, and I can explain it in terms of two Greek letters, lambda and \ndelta\".\n\nI've \"rehabilitated\" obscure disciplines before, \ntoo early to assess with what success.  General Systems Theory (GST) is \nall over the place (somewhat like Tensegrity), as a management \nphilosophy, as a kind of ecology, who knows?  It has a high caliber \npedigree but where does it go from here?  \n\nI noticed how \nEconomists and Economics tend to have monopoly status when it comes to \nadvising the financial markets regarding guns vs. butter, and suggested \nGST muscle in under the banner that \"monopoly breeds inefficiency\" owing\n to lack of serious competition.  GST was about giving Economics a run \nfor its money.  Still is.  That's easy to understand, no?\n\nCourses in \nGST could just as well provide rungs of that \"climbing some business \nworld ladder\" as more science-oriented than Econ in some dimensions, \nincluding around issues of climate change we might hope.\n\nFinally, another axis or spectrum I've contemplated, as have many, is what oft \ngoes by \"left brain\" versus \"right brain\" as a dichotomy.  My track \nrecord is riddled with slides talking about \"lexical versus graphical\" \nby which I somewhat mean the same thing as the brain hemisphere people \ndo.  We're talking about bridges again.\n\nIn STEM a goal is to have \nnoodling-with-symbols (call it \"algebra\" or \"being lexical\") match up \nwith visualizations and other experiential presentations or summaries.  \nWe want to understand what we're looking at when interpreting all that \ndata.\n\nControl panels, dashboards, instruments, sensors...  we \nhave a kind of model, view, controller architecture to consider, where \nwhat we reason about and codify using semi-numerical algorithms is the \nmodel, the business logic, and what we view and measure is feedback \nregarding our direction, as a company or enterprise or whatever.\n\nWe \nhope for some kind of decision-making or steering capacity, where \nchoosing a more promising direction, over a less promising one, remains a\n possibility.  We're hoping to be more like pilots, not just witnesses \nto the inevitable, spectator-fatalists with no active role.  \"Activism\" \nis not a negative, but informed and effective activism is better yet.  \n\"Passivism\" is not an English word, but needs to be, as many are \nmilitantly passivist in their anti-activism.  I think \"reactionary\" is \ngetting tired and needs a rest.\n\nOne of the best \nleft-right i.e. lexical-graphical connectors I've found is using string \nsubstitution in lexical computer code to build a script that, when \nrendered, provides a ray tracing and / or perhaps a 3D printable \nobject.  VRML and POV-Ray scene description language were often my two \ntop choices, with similar choices in Elastic Interval Geometry land (a \nbranch I was following).  \n\nThe 2D fractal, the Mandelbrot Set in \nparticular, coupled with some historical timeline information, is a \nperfect topic, a sweet spot.  A strong lambda calculus course could set \nits sights in that direction:   doing the vector math lexically, with \noverloaded operators (like + and *), yet driving graphics on the \nscreen.  Gerald de Jong's \"creatures\" provide a great example, of \"math \npuppets\" turning logic into animations.\n\nAnother \napproach to bridging model-lexical with viewable-graphical is to simply \nbuild up the skills to create a dynamic web page, where things happening\n graphically are driven by things happening lexically in the code.  In \nmy Digital Mathematics outline, I cover that in \"[Supermarket Math](http://wikieducator.org/Supermarket_Math)\" which\n would cover \"e-commerce\" (but regular commerce as well, as brick and \nmortar stores use SQL just as much).  Mine is but one more sandcastle on\n this pretty big beach -- just take a few ideas, flatter me by copying.\n\nThe goal is to forge these left-right connections, even as we bridge the C.P. Snow chasm by remembering to share more history.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}