{
  "id": "7907670886049339525",
  "title": "Mathphobia",
  "published": "2008-08-27T07:44:00.000-07:00",
  "updated": "2008-08-27T09:12:54.699-07:00",
  "content": "Re: Managing Emotions in the Math Classroom                                                           [Posted](http://mathforum.org/kb/thread.jspa?threadID=1792482&tstart=0):                 Aug 27, 2008 10:36 AM> Mathphobia is a matter of feelings. Has anyone talked> with their math students in the classroom about their> feelings for math and continued the discussions with> lessons or exercises that help the students be> realistic in their emotional response to math?Re: MathphobiaI agree feelings come into it, but there's also an intellectual component behind the repulsion I think we should take seriously.  Lots of psychology going on, in that here's an inter-generational setting with some wisdom of the ages being transmitted, and it's kind of dull and not beautiful, how could that be?  Why is geometry especially so godawful bereft of gorgeous visuals etc?  Why are we so far away from the arts?  Where's the stuff about music, which if you've looked into it at all, is highly mathematical, all about ratios, not talking about Mozart Effect or listening to Bach to get smart, talking about restoring some integrity to the culture, instead of feeding it out as ground beef, fast food.Unless other teachers in other classrooms make a special point of some \"phobia\" then I think dwelling on this in math is merely digging a deeper hole, like how [Condi](http://mybizmo.blogspot.com/2008/08/weird-stories.html) put it -- gotta stop digging.  Math teachers just make it worse by making student resistance into some form of mental condition.  They should be looking at the content of their discipline with an eye towards radical reform i.e. the last thing on earth [Haim](http://controlroom.blogspot.com/2008/03/underfunded-schools.html) wants us to really talk about.KirbyPS:  so what's your trick for embedding little emoticons that show up via the web interface to this archive?  I've never seen that done before on this particular list (sort of makes my point no? -- a math list with no pix should be an oxymoron of sorts).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}