{
  "id": "2155632023841154274",
  "title": "Meanwhile:  TV as Usual",
  "published": "2019-04-29T20:17:00.002-07:00",
  "updated": "2019-04-30T00:47:52.692-07:00",
  "content": "Crazy TV:  the nutcase killer is lionized in puffed up police \npunditry as \"wanting to weaken the United State\" i.e. this was an \ninternational event involving a terrorist organization (Mr. ISIS pops \nup, out of cold storage, right here on CBS).\n\nThis isn't another\n brain dead victim of our zombie media, not a completely out of his \ndepth gun nut with a case of the Columbines. No, this is international \nwarfare, as this veteran (so many of them veterans) was on the brink of \njoining ISIS, or no, he'd joined \nalready, no wait... the details won't matter, now that the link has been\n made (for us, by the media mogul caliphate).\n\nAnother worn out husk of an NPC (non-playable dead end scenario, no \nmore good cards) of the type we used to see in a medical facility \n(called an asylum or sanitarium) and not necessarily in a jail.  \nCuckoos' Nest if you wanna be unkind.\n\nThen compassionate \nAmerica decided to give them all shopping carts and to push them out on the \nstreets.  Vets get shown the same door. \"Go enjoy vulture capitalism, \nthey need to feed.\"  \"Go be in some Breaking Bad episode.\"  \"Have a midlife opioid crisis.\"\n\nWe made a distinction back then, in the old \ncountry (the one before this one), between a mental case and an enemy\n soldier, also between a mental case and an international terrorist.\n\nNow we live in Crazy TV Time, wherein every mutant monster, \nevery victim of some hideous epigenetic meme virus disease (some go back\n centuries), is really who they think they are, in their dying rants \nand manifestos.\n\nWe get to be in their world.  Lucky us.\n\nNow the\n crazies get to help dictate, be a central part of,  some epic inter \nreligious violent melodrama, starring heroic fighters who will keep us \nsafe, praise Allah.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}