{
  "id": "1880186598008279527",
  "title": "Medical Privacy",
  "published": "2009-06-27T16:39:00.000-07:00",
  "updated": "2009-06-29T16:55:11.878-07:00",
  "content": "A theme in this blog is the unscrolling white paper, like D.W. Jacobs used in [his play about Bucky](http://worldgame.blogspot.com/2008/12/its-show-time.html), reminiscent of Turing Machines as well, also electroencephalographs, electrocardiograms, all that good stuff -- lots of wiggly needles (polygraphs, whatever).Except we're not so into those analog metaphors (continuous graphs), prefer lots of data points, more like alphanumeric stuff. Of course it's not either/or. You might even have cines (what heart doctors call the little movies they make, of your heart beating and stuff, perhaps with a dye for contrast). It's a lot like a blog actually, a time-stamped scroll that starts before you're born with some ultrasound, continues awhile after you die, giving cause of death information.What Joe Public wants to know is what prying eyes are going over his records, looking for information to use against him, like to hike his premiums or other blackmail.These are legitimate suspicions, not to be pooh poohed, and fortunately at the vanguard of medical science are our military services.This is not fortunate in the sense that we wish for bloodshed (better to [not fight](http://controlroom.blogspot.com/2006/09/crosscultural-workouts.html) like that), but in the sense that institutions professionally concerned with defense will thereby be somewhat savvy about encryption, and Joe Public's privacy is best assured if we make wise use of cryptographic tools to ensure that high standards of medical ethics are upheld.Instruments [might sign their outputs](http://controlroom.blogspot.com/2009/06/tuesday-at-work.html) for authentication e.g. the hospital maintains a trusted ring of devices certified to spit back measures. Sometimes we'll want to trace back to that device by serial number, in case of a suspected calibration error, or more likely we're simply keeping cross-checks \"because we can\" i.e. for future research purposes.Like if I'm doctor X in Cincinnati, seeing this patient recently arrived from Singapore, and they zap me a pass key to the \"main lobby\" of this patient's history, I might then request further types of authentication just to verify that this is indeed what it purports to be, i.e. the instrumentation checks come back affirmative, like a microscope saying \"yeah, I looked at that once, and I really do exist in room 14A\".I'm not suggesting we're anywhere close to the above, just that doctors, like patients, needn't assume an all-or-nothing vista, when it comes to accessing medical records, either another's or one's own. On the other hand, summary certifications that you aren't infectious in various ways might save you the trouble of getting tested, for job situations where contaminants might be dangerous (space station?).In other words, you'd have easy ways to assure those with a \"[need to know](http://mybizmo.blogspot.com/2008/07/pseudonymizer.html)\" that you're over eighteen, have adequate night vision etc. etc. -- just like a note from your doctor, signed and everything.I'm thinking if we're successful in starting up some more [ecovillages with quasi-autonomy](http://worldgame.blogspot.com/2004/09/usa-os.html), more like company towns (though often with more democratic structures) that we'll see these problems addressed in many a microcosm.And yes, of course [open standards bodies](http://www.flickr.com/photos/17157315@N00/3638445679/in/set-72157619963850814/) will grow up in between, with vendors touting their compatibility with those standards, same as it ever was. But word of mouth tourism will also be important.You don't get away from anecdotal evidence that easily, especially where medical care is concerned. [Some cruise ships](http://controlroom.blogspot.com/2009/06/recruiting-commercial.html) do it better, and you can't always trust those commercials now can you? That's what travel agents are for, to steer you away from \"sights unseen\" (and better left that way) as well as towards a healing destination (some perfect spa perhaps).The medical staff will simply be a part of the community, continuous with the Chief of Health and Fitness if there is one (no doubt with a bevy of coaches, as smart cultures invest in preventative measures way more aggressively than in any \"mindless consumer\" model, a kind of self-lobotomizing lifestyle, such as the one popular in 1900s middle America and centered around \"[junk food](http://mybizmo.blogspot.com/2008/12/water-cooler-buzz.html)\" and spoofed in the movie Supersize Me).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}