{
  "id": "2077884020192153897",
  "title": "Meeting House Haps",
  "published": "2012-01-08T18:46:00.000-08:00",
  "updated": "2013-01-09T18:12:37.628-08:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/6664117791/)\nmeetinghouse tree\n\n[Wilderness Way](http://www.wildernesswaypdx.org/) was having their regularly scheduled meeting when Tre showed up at the Stark Street meetinghouse, rapping on the window.\n\nHe asked if they knew [Kirby](http://controlroom.blogspot.com/2009/10/subgenius-devival.html), which they didn't, but then, when he climbed the tall tree outside and started ranting, they decided to call [Lew Scholl](http://worldgame.blogspot.com/2010/09/fnb-food-prep.html), clerk of property management, their contact person for [Friends](http://worldgame.blogspot.com/2009/11/company-business.html). The neighbors just called the police. \n\nI was [on EmoKid](http://www.flickr.com/photos/17157315@N00/6186598239/) (the bicycle) heading towards some union hall on Foster & SE 64th when I got the call from Oakland, CA.  It was [Lew](http://worldgame.blogspot.com/2011/11/global-warming.html).  Did I know Tre Arrow? He was in our tree at the meetinghouse.\n\nI revectored the bicycle and showed up there promptly (in about 10 minutes).  Lew called back Wilderness Way and let them know to expect me.\n\nThe [fire department](http://www.flickr.com/photos/17157315@N00/3121074067/) had already responded and the police had blocked traffic on Stark St.  [The police](http://www.flickr.com/photos/17157315@N00/3868961534/) had their lifting device, like for fixing phone poles but fancier, positioned high up.  Someone was up there interviewing Tre.\n\nI was asked not to contact him on my cell phone while this was going on. I called Lew back to let him know it was a pretty big production, and then Melody.  Then my phone died (battery out) so I couldn't call anyone.\n\nFor the emergency teams, this was no big deal (that's what the sergeant said), but I thought it was a bigger ordeal than a [cat stuck in a tree](http://petsupplies.about.com/b/2011/12/18/do-firemen-really-rescue-cats-from-trees-the-answer-is-yes.htm) at least.  The truck needed to hoist the interview booth required quite a bit of support logistics.\n\nThey said they wanted to ascertain if he was planning to jump or anything.  He was not.\n\n[Rick Seifert](http://www.flickr.com/photos/17157315@N00/6307089705/), our clerk, showed up and talked to the police sergeant in charge.  They were already in the process of dispersing.  Dusk was swiftly turning to darkness.  [Rick later journaled](http://theredelectric.blogspot.com/2012/01/guest-in-tree.html) about the event as well.\n\nThe Wilderness Way people understood Tre's ecological message and were willing to shout up their moral support.\n\nRanters gathered on each side of the sidewalk, starting a polarized debate familiar around Portland.  They shouted about taxes versus the environment versus jobs, stuff like that.  OPDX has somewhat changed the political climate and there's lots of passion for change.\n\nThanks to the Internet, bike swarms etc. were poised to offer more support and to send up gear were Tre planning to stay there a long time.\n\n[Lindsey](http://worldgame.blogspot.com/2011/10/processing-symbols.html) caught the events on Livestream pretty much as they were happening, at least towards the end. Twitter and cell phones had spread the word and she [just randomly happened](http://www.flickr.com/photos/17157315@N00/3976635920/in/set-72157622380858315) to be tracking, had no foreknowledge of Tre's plans.\n\nChannel 12 asked me off camera if we Quakers had [foreknowledge](http://controlroom.blogspot.com/2011/11/adult-discussion.html) of this action.  I assured her we did not.\n\nRick really hoped [John Munson](http://www.flickr.com/photos/17157315@N00/5508942386/) would be reachable, and called Carl and Marge Abbott for his number from the clerk's office, but found out John's off serving in the Peace Corps someplace (that had been his plan all along).  John and [Tre](http://controlroom.blogspot.com/2011/08/doing-hard.html) have had communications in the past.  I know John more from AFSC work.\n\nAnyway, the police understood [Tre](http://www.flickr.com/photos/17157315@N00/6218466985/in/set-72157624742571845) was not really breaking any laws.  He's a [well known guy](http://www.flickr.com/photos/17157315@N00/5308404427/) around here, an activist, [in Wikipedia](http://en.wikipedia.org/wiki/Tre_Arrow) and everything.  He does stuff like this.\n\nI assured Tre the Quakers weren't looking at this as criminal trespass or anything, and there was no contemplation of seeing this as a criminal action (people are allowed to climb trees in Oregon).  I think that's what he expected from me (kind of a no brainer), and said he'd be down shortly.\n\nHe came down in the darkness (with occasional flashes and TV lights) and made some eloquent remarks to the cameras.  Channels 12, 6 and 8 each had small news teams.  People crowded around and listened to his message.\n\nHe said we were raping the planet and needed to love Mother Earth.  He wanted to know why more people weren't moved to defend her.  He was quite coherent and everything.  He's good at what he does.\n\n[](http://www.flickr.com/photos/17157315@N00/6664118949/)\n:: tre addresses questioners ::\n\n[](http://www.flickr.com/photos/17157315@N00/6665051505/)\n:: sharing on Facebook ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}