{
  "id": "8416132004884202990",
  "title": "Meetinghouse Again",
  "published": "2010-10-28T15:25:00.000-07:00",
  "updated": "2012-10-25T08:36:32.146-07:00",
  "content": "Food Not Bombs came off brilliantly last week.  However, this week we're decimated by illness, though with a crew of under ten, that might not be the best word choice.  I'm still fighting a bronchial condition, with abdominal pain from so much coughing (more at night).  I'll steer clear of the food prep except for sterile procedures.  Lindsey is just as under the weather with different symptoms, so is wisely out of the picture.\n\nSatya and Cera came by the Blue House the other evening and spoke at length about Bhutan with my mom.  I made a cameo appearance after Pauling House, saying the plane was early, so I had to move quickly.  I was in and out the door in about 30 seconds.  The MVP in question is the chairman of Python Software foundation, in town for GOSCON.\n\nSpeaking of GOSCON, [the Ignite.gov event](http://mybizmo.blogspot.com/2010/11/goscon-2010.html) was the first ever Ignite for the government (.gov).  O'Reilly is OK with the meme transfer, i.e. the spread of the brand from non-governmental services (NGOs etc.).  The Ignite format allows for 20 autopaced slides at 15 seconds per, or is it 15 slides at 20 seconds per -- seems that should be up to the presenter?\n\nIn any case, the talks were excellent.  I sat with two of the same folks I'd shared a table with [at Barcamp 4](http://mybizmo.blogspot.com/2010/10/barcamp-4.html), along with Rami Kassab (a presenter) and someone else from [his company](http://www.typethink.com/).  Steve and I were both wearing Holden Web badges.  Most the tables were occupied but were by no means packed.  Small intimate conferences are a rarity in some circles, especially with so much going on between the developer community and government.\n\nWhat did I come away with from these talks?  Government is today seeing itself as a provisioner of data sets.  That's something governments often do well:  amassing data, statistics, large pools of information.\n\nMaking the presentation layer attractive, or thinking of ways to combine data sets to tell a story, is not something government should have to worry about.  The developer community, the app builders, have those skills.\n\nBy providing a level playing field of data set libraries, the government fulfills its side of the social contract.  Different players will come along and mine that data, sometimes for private gain, sometimes for public service, often as a combination of both (serving the public garners good will and customer loyalty to the brand).\n\nPortland, Oregon has a fairly advance community accustomed to using data sets to create what are called civic apps.  This might be iPhone and/or Droid apps.  The data might be real time relevant i.e. when is the next bus set to arrive.  That's a service anyone with a cell phone might avail of today (I was using it last night in fact, when talking the 14 back from downtown).\n\nThe data might be long term chronological and only changing slowly.  We could say all of it is geographic at some level, defining geography rather broadly (biochemical processes within the body use energy in a time and place, so are geographic in that sense).  Not surprisingly, many of those attending GOSCON have a GIS background.\n\nI introduced Chairman Steve to Selena Dickelman, one of the chief organizers of this event.  Amber Case was also present but too surrounded by discussants for me to want to break in.  Later, at Kells, we met up with Deb Bryant of OSL, the lead protagonist in [that Willamette Week article](http://worldgame.blogspot.com/2010/08/open-source-health-care.html) some weeks back.  She and Nate were both primed to talk about public-private partnerships.\n\nNate had lots to say on the topic of EMRs (electronic medical records).  Deb kindly consented to having her picture taken with the PSF totem (Naga, our mascot).  Such as I've been around at the edges of GOSCON, I've been serving in the capacity of \"snake wrangler\", same as at Djangocon some weeks ago.\n\nMy request for a discount on school lunches was denied within just 24 hours.  I probably shouldn't have reported gift income, nor does the form anywhere ask about expenses.  That $500 a month for catastrophic coverage...  when it comes to civic apps, I did not really see how this was a well designed one.\n\nLindsey's solar panel came today, for powering her battery charger and perhaps an XO-1 (experiments needed).  How does one live lightly on the earth?  She's very conscientious about recycling, including fabric and materials.  Her boots, scavenged from a free pile, have lasted about a year with frequent patching.  They're close to worn through.\n\nTwo of the cross-country bicycle guys from a few weeks back have showed up.  Their buddy was hit on the road near Cocquille and had to be life flighted to Emanuel in urgent condition.  They hitched back to Portland and are researching their options....\n\nHere's Cera, gotta go.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}