{
  "id": "3777641106276222470",
  "title": "Meetinghouse Event",
  "published": "2012-08-28T22:58:00.001-07:00",
  "updated": "2012-08-28T23:24:52.793-07:00",
  "content": "Melody told me about this event, some presentation about the Zapatistas.  What's up in Chiapas, Mexico?  I was curious, so I wandered over, hopping the 75 for a few blocks to save time. \n\n[The replacement camera](http://mybizmo.blogspot.com/2012/08/scatter-brained.html) (Nikon Coolpix S8300) had just arrived so I dropped by Freddy's for an SD card (none included).  Kingston 16 GB SDs were on sale for only $13 or something.\n\nAs it turns out, it was fortunate for the event leaders that I showed up, as their A/V solution wasn't working out.  The projector stayed blurry no matter how close or far from the screen so reading the menus was impossible, plus they hadn't brought any speakers.  \n\nThe Meeting rents out space but tends to not rent A/V equipment, however since I was there, I could access the meeting's projector and speakers and wheel them out.  After some futzing, we got everything working.\n\nPortland has its own relationship with Chiapas and the Zapatistas.  Our presenters, not native Spanish speakers (many Zapatistas aren't either), [had been eyewitnesses](http://worldgame.blogspot.com/2011/12/protecting-lawyers.html) fairly recently (though not with PBI). \n\nThe indigenous people of Chiapas are trying to develop their locale independently of the central government and that's hard for many nationalists to stomach.  The fact that Zapatistas want to run their own school system is hard for the control freaks to accept.\n\nThe Zapatistas are routinely bullied, their crops burned, their assets stolen, by rival political parties (read \"rival gangs\").  The expectation is the new Mexican president, a PRI member, will turn a blind eye to the PRI's persecution of the Zapatista minority.  Other parties also engage in systematic harassment and terrorization against this unwanted (by them) upstart party.\n\nThanks to video campaigns, knowledge of this kind of harassment and displacement (ethnic cleansing etc.) is [widely publicized](http://occupydenver.org/teach-in-tactics-that-work-from-zapatismo-to-occupy/).  New Yorkers know about it too.\n\nThe conversation then turned to [the Drug Wars](http://controlroom.blogspot.com/2009/08/drug-wars.html), which rage more in the north of Mexico, not in Chiapas.  One of the Mexican nationals in our group made a speech about how USAers only needed to educate their children to not want drugs, and all would be well.  \n\nThe impact of [ending Prohibition](http://worldgame.blogspot.com/2008/12/repeal-day.html) was not discussed, although that's the direction many states in the North American Federation have been taking, slowly but surely.  Another Mexican national pointed out that we had strayed from the core topic, as the war on the Zapatistas was distinct, politically and sociologically, from the Drug Wars (aka Prohibition).\n\nThe primary group leader was in a hurry to catch a plane.  She went through a few more slides, after showing two videos and going over the history.  She put the meetinghouse doors on self locking, and returned the key to the mailbox (standard procedure).  I helped with cleanup, and locked the projector away, but then left the other group leader in charge.\n\nI joined [Patrick](http://worldgame.blogspot.com/2011/08/reconnecting.html) and Steve at The Bagdad, staying on until Happy Hour.\n\nTomorrow I have [an AFSC meeting](http://tools.afsc.org/austin/austin_search_detail.php?ID=311) and will mention attending this event.  Melody was aware of it thanks to her AFSC connections I'm pretty sure.  She used to work with AFSC more concertedly back in Austin.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}