{
  "id": "3873037391189351891",
  "title": "Memorial Day",
  "published": "2015-05-26T19:52:00.001-07:00",
  "updated": "2015-05-27T23:34:45.682-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/17913211868)\n\nPeople were out in droves in my neighborhood, enjoying those establishments choosing not to close for the holiday, but stay open.\n\nI'm reminded of [my quick visit](http://worldgame.blogspot.com/2006/04/london-knowledge-lab.html) to London Knowledge Lab on a bank holiday when no one sane would be at work.  But a kind Lab guy, knowing my itinerary (guest of Shuttleworth Foundation, hot off a jet from Pacific Northwest), realized it was now or never.  I gave a presentation.  The gig was recorded and for many years made the rounds, plus I got to brag to the Foundation folk I'd already briefed LKL, sounded important.\n\nThis year, 2015, I drove Deke, a fine fellow, on an errand to Dr. Bolton's hood, out Tryon way.  We stopped in to visit with Sir Charles, an emeritus sociology department chairman and contemporary of my dad's.  The Boltons started to tune in Urners at University of Chicago, but then went their separate ways.  Not until they got together again in Portland did the conviviality really develop, such that when we moved to Rome, we made the trip to Positano, to hang with the Boltons, on sabbatical.\n\nThe intersection top of Boones Ferry, where Stephenson T's in:  that's been a rough corner and a lot of redesign has gone into it recently, I think for the better.  This was my landing quad i.e. my starting sector in the World Game of Portland I started playing, off the plane from Bangladesh.  Mom & Dad were pulling up stakes there, I'd gone to help them pack up, take another look around Dhaka, and then I stayed with the Boltons rather than resume an East Coast existence.  Time to get back to my Portland roots.\n\n[The Nissan](http://worldgame.blogspot.com/2014/08/comic-material.html) has a fuel system issue that I'll trace to poor maintenance on my part, casting no aspersions on Nissan for this one.  The Altima I drove to and from, on my recent mid-west tour (St. Louis MO etc.), was a world class motor vehicle.  I like how rental car scenarios let us try before we buy, or rent again, or whatever.   Anyway, the Maxima bucks like a bronco sometimes, even shutting off.  Good thing it's OK to restart in neutral.  But hey, Deke and I both remarked how overall smooth the whole trip was.\n\nFunny part:  Charles was just showing us a postcard from Maureen, [in dense handwriting](https://flic.kr/p/tiACA9), and saying he thought she might still be in Europe when, knock knock, there she was at the door, pretty funny.  I alerted them to Carol's immanent arrival and suggested we all get together again soon, Deke included (he liked our energy, think he might join). \n\nMaureen was at the WILPF Centennial like mom was, with [her son Erin](http://worldgame.blogspot.com/2011/05/philosophy-talk.html) in a supportive role. \n\nMom did a lot of her five weeks solo, also tackling NYC YMCA on her own (for visits with UN people) and DC.  She routed herself back to LAX via JFK and fortunately made standby on JetBlue, shortening her stay in JFK by a good six hours, way to go Carol!  She said she'd gladly take [JetBlue again](http://mybizmo.blogspot.com/2005/07/jetblues-bizmo.html).\n\nThe day before, I got together with my friends the Gunnells, new in Portland.  I took pictures at the wedding, my former co-worker Eddy's daughter the bride.  Eddy and I were high school teachers at St. Dominic Academy, for girls (young women) in Jersey City, New Jersey.  That was back in the 1980s, great gig!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}