{
  "id": "2189299000086601998",
  "title": "Memorandum to Global U",
  "published": "2020-07-06T15:41:00.001-07:00",
  "updated": "2020-07-06T15:54:16.622-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/43363682844/in/photolist-2hKtcBm-PsF7iu-294Ud9d-tsZP7c-unvH8E-oYSR11-m8ks2p-dSjF7p-dNAp5M-cG5ijo-c6ktfG-c5xz3J-c3P9iJ-bYigz7-bv1z8y-bt8tDL-bFHykD-b66Nd8-aAQkub-azBaf2)\n\nMemorandum\n\nAs y'all know, I'm into putting PWSs (personal workspaces) on like an AirBnB network, except I called it the Housing Project in the 1980s, and a lot of it was about swapping, so more like those timeshare vacation spots. \n\nDorm space, faculty lounges, study pods...\n\nWiring up the Harrison Street facility to the global Coffee Shops Network (charitable) and to the connected think tank community, has been a long term project. \n\nKnown to some as the \"Blue House\" in our Buddhist Ghetto (Portland proud of), or in Asylum District  (also celebrated -- named for the sanitorium that used to anchor the neighborhood), we've been a hub for Food Not Bombs, established covens (music bands).  \n\nPortland's creatives called us Blue House to distinguish us from Pink House and some others.\n\nTomorrow I'm having a contractor spec the place for roof replacement.  Long overdue.  The other big project would be the upstairs bathtub drain situation.  \n\nThen you'd have the perfect faculty housing or student group housing, with included study space and studio, just like it is now, perhaps re-furnished.  Do you like the diner kitchen, a relic of the 1950s?  The main timbers date back to 1905 according to my records.  There've been some add-ons.\n\nIn my dreams, I'd like to come back on a circuit and stay here myself from time to time.  The XRL (Extreme Remote Livingry) \"middle of nowhere\" type boarding schools, the mixed use skyscrapers, the other city-as-campus configurations... I might not be in Portland as frequently as I have been.\n\nMy daughters, friends and family would be welcome here, perhaps in some admin capacity.  Tara is next in line to help design the circuit.  \n\nThe family business is merging with the Global U in a way that keeps logistics non-onerous.\n\nI'm a big believer in institutional wealth.  You don't need to own an aircraft carrier or submarine to live on one. Ownership of the supersonic jets, the space station, the racetrack, is likewise not my forte.  On the other hand, I'm into storyboarding, like an investment bank, or movie-maker.\n\nAs one more student-faculty member, I'm into enjoying the Global U responsibly.  That's how I bring credit to my school.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}