{
  "id": "7761419861277979543",
  "title": "Men Without Honor",
  "published": "2015-10-06T01:00:00.000-07:00",
  "updated": "2015-10-19T14:29:53.894-07:00",
  "content": "Official Washington got disgraced by its military again today, a bunch of unprofessional uber-cowards.  No one in the Pentagon resigned.  The Secretary of Defense still gets a paycheck.  [Disgusting](https://www.washingtonpost.com/world/afghan-official-hospital-in-airstrike-was-a-taliban-base/2015/10/04/8638af58-6a47-11e5-bdb6-6861f4521205_story.html). \n\nAn inveterate glutton for war toys, way beyond reason, and with zero self control, Washington has made the mass killing of civilians a somewhat routine event.\n\nThis most recent massacre was much worse [than in Roseburg](http://mybizmo.blogspot.com/2015/10/more-on-gun-control.html) obviously (do the numbers), but with the same cause:  mental illness, an inability to face reality, unrestricted access to weapons by those who shouldn't have them.\n\nThe perps in this case used a monster death machine against defenseless Doctors Without Borders and their hospital.  The logistics were so bad that phone calls from the hospital made no difference to \"central command\" (a [headless chicken](http://worldgame.blogspot.com/2005/02/memorandom-fs-4702.html)).\n\nPresident Obama said [nothing public](http://mybizmo.blogspot.com/2015/10/truisms.html) about it.  He's going to Roseburg, Oregon, apparently because only American lives matter, whereas his own sickly mercenary forces murder children routinely.  The hypocrisy is palpable.\n\n[Some slob](http://www.bbc.com/news/34461462) with stupid medals all over his chest tried to make it all better with his lame excuses, but of course WDC lost this [stupid war](http://worldgame.blogspot.com/2013/11/a-khan-at-thirsters.html) long ago in the hearts and minds sense.  Who needs an enemy when you have [goons like these](http://worldgame.blogspot.com/2015/07/comments-on-news.html) running the show?\n\nLets see if anyone takes any responsibility whatsoever for this [obvious war crime](http://www.bbc.com/news/world-asia-34462538).  I'd reckon the loss to WDC in the billions over this, but [that city](http://controlroom.blogspot.com/2013/08/city-of-morons.html) has negative money anyway and will never repay, bankrupt as it is, morally as well as financially.\n\nFlags at half mast?  Why have them on the pole at all?  Definitely the Pentagon should take theirs down, at least for a few symbolic minutes.  Show some public remorse maybe?  Just [a tiny bit](http://www.bbc.com/news/world-us-canada-34471182)?\n\nIn any case, stop claiming to represent [the American people](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html) already!  Your services are neither required nor admired.  Your cowardice will echo through the annals of history.  [Citizen diplomats](http://mybizmo.blogspot.com/2015/09/citizen-diplomacy.html) disavow this war and the perps behind it.\n\nJust because one wears a military costume doesn't make one a respectable human being.  More is required.\n\nI somewhat expect the story to morph such that the \"Afghani forces\" who supposedly requested the strike were actually [Taliban infiltrators](http://www.nytimes.com/2011/06/28/world/asia/28infiltrate.html?_r=0) looking for ways to embarrass central command and make it appear like a headless chicken -- a way to deflect criticism and make the Taliban share the opprobrium.  The story has already morphed away from [NATO itself](http://humanrightsinvestigations.org/2011/07/27/great-man-made-river-nato-bombs/) making the request.\n\nEveryone knows [NATO can be tricked](http://www.nationalreview.com/feed/253774/nato-us-and-afghan-leaders-tricked-negotiating-taliban-impostor-greg-pollowitz) into doing just about anything, if one just acts and sounds like a warlord.  Finding a way to blame \"the terrorists\" would be the typical response here.  [Lets see](http://www.bbc.com/news/34461462) if that's how it plays out.\n\nWhy an organization so easily duped should be allowed access to war planes would be the next question but that's easy to explain:  no background checks required, just a credit card and the signatures of a few paid-for well-paid elected officials.  [Talk about corruption](http://worldgame.blogspot.com/2015/09/investigating-how-things-work.html)!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}