{
  "id": "4771362924617090102",
  "title": "Mesopotamia",
  "published": "2016-06-09T10:25:00.003-07:00",
  "updated": "2023-06-26T17:13:49.455-07:00",
  "content": "Decades of intervention (including but not limited to invasion) and hacking away with blunt tools, have left the infrastructure in a shambles, such that the illusion of governments providing protection and civil services, has gone away.\n\nThe illusion was not very persuasive in the first place for a lot of the affected peoples.  The national governments ignored them, much as the political machine in Chicago ignores southern Illinois.\n\nThe status quo today is armed gangs and warlords, some with NATO backing, others with other backing, all fighting one another and trampling on the human rights of civilians, the [so-called collateral](http://controlroom.blogspot.com/2016/05/captain-america-civil-war-movie-review.html).\n\nBlowing up hospitals, attacking medical vehicles, is considered routine.  There's no legality to these actions on any side.  No one has time to consult the lawyers anymore.  They take too long to think it through.  Many of these lawyers are unarmed and therefore of no account in the eyes of the warlord deciders.\n\nThe collateral has done its best to flee the scene with NATO's warlords not really lifting a finger to help them.  No evacuation convoys, or hospital ships, mostly just journalists and bloggers with their cameras, standing by observing and reporting on all the children attempting to swim, after their rubber rafts have overturned.\n\nWe see a lot of hand-wringing, a lot of people drowning, between adverts on television.  The ones who don't drown get to walk to Europe.  NATO calls this self-organized walkathon \"destabilizing\" and [appears to blame Russia](http://mybizmo.blogspot.com/2016/05/cold-war-interview.html) for all the bombing, like of Libya and so on.\n\nThose helping the collateral escape the war zone (or escape detention for trying) are branded predatory, since no authorized charity is there to help.  The Red Cross doesn't know how to operate watercraft is my understanding.\n\nMeanwhile the Grunch keeps spoon feeding its audience with baby food pabulum regarding all these ghostly unbelievable nations that only exist because National Geographic shows them on its globes.\n\nWe're supposed to keep believing in Iraq and Syria, but not Kurdistan, Israel but not Palestine.  It's too confusing, but as long as one has faith in the corporate media, we'll be rewarded.\n\nHardly anyone knows what \"[the Grunch](http://grunch.net/synergetics/grunch.html)\" means anyway, as they believe as they're told, as good doobies are wont to do.  No one tells them about any \"giants\" making off with all the cash, and paying for all this storytelling they're believing.\n\n\"Let the dweeb journalists pander to their corporate masters while we consume the advertised goods.  That's our job as viewer-voyeurs\" is the attitude.  \"Tell us more unbelievable stories about these 'nations' we're meant to believe in.  We'll buy on faith.\"\n\nWe're already taught by organized religion that \"blind faith in nonsense\" is a religious virtue and we'll be rewarded in heaven for it.  The news media let us practice for life in heaven, by respecting their authority.\n\nThe collateral was largely left to fend for itself all this time, or was herded into [detention camps](https://youtu.be/n2178SPJCKw).  These camps may prove to be dead ends, as although they're billed as temporary, there's only slow turnover, with some detainees getting stuck in the pipeline for years before they die, like at Gitmo.\n\nThose with access to weapons are trouncing the unarmed.  Somehow it's considered heroic and brave to slaughter the innocents with precision weapons guided by satellite.  The voters like the spectacle.  Bread and circuses.\n\nWelcome back to the Roman Empire.  Being a superpower is such fun ain't it?  You get to kill at will, sometimes for no other reason than out of boredom and low ratings.  Killing is thrilling and is all part of making America great again.\n\nWashington DC is [a special city](http://controlroom.blogspot.com/2013/08/city-of-morons.html) in that it gets to order up bombings pretty much anywhere it likes.  The Pentagon is under tremendous pressure to use up its ordnance, as replenishment means job security for [Iron Mountain companies](http://controlroom.blogspot.com/2008/12/iron-mountain-revisted.html), many of them nonprofits.\n\nDistributing ordnance from the private sector, to the theater, is the job of many \"heroic\" individuals.  Raining down death on the unarmed is well-compensated work.\n\nThe audiences back home love the \"mil porn\" they get in exchange for their taxes.  The \"violence voyeurs\" buy bigger and brighter screens and cheer on their favorite gangs, sporting whatever decals.\n\nThe so-called Holy Land has always been a theater for gladiatorial Hunger Games and blood sport.  Nothing much has changed in over two thousand years, beyond the lethality of the weapons.\n\nGod signaled with a rainbow though, that He'd keep His temper under control next time, dim-witted though we be.  We've got only the one ark to place our stock in, and it's spherical.  Some are eyeing Mars as a next world to \"conquer\" (do a number on), however terraforming this one still takes most of our attention.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}