{
  "id": "4615395541533869493",
  "title": "Migrants Everywhere!",
  "published": "2013-07-01T20:50:00.006-07:00",
  "updated": "2013-07-01T22:41:56.553-07:00",
  "content": "I was an invited guest at an intra-office staff meeting of the AFSC today, a joint meeting of Seattle and Portland in advance of some organizational reshuffling long in the cards.\n\nOn some level, Seattle may have been interested in Portland's experiment with [an Area Support Committee](http://worldgame.blogspot.com/2012/05/afsc-program-committee-meeting.html), the latest version of what used to be called a Program Committee, yet more integrated across programs.  Lots of offices have them, not just Portland.\n\nPortland's experiments have produced some useful outcomes, such as more cross-fertilization among the various groups represented (e.g. PSR), however, as always, the devil is in the details and it would be difficult to make sweeping generalizations, or conclusions that apply to Seattle in particular, based solely on Portland's unique experiences.\n\nI learned more [about A New Path](https://afsc.org/resource/new-path), an AFSC publication designed to contribute to the ongoing discussion on immigration reform.\n\nThe new immigration bill, which has just passed the Senate and is headed to the House (US Congress) is heavy on enforcement and further militarization of the US-Mexico border.\n\nMany of its provisions for advancing towards citizenship are contingent on militias claiming success in their war on freedom of movement and human liberties.   Unless the border is declared \"90% secure\", some of the proposed pathways to citizenship will remain closed off, i.e. the presumptive landlords will pick up their marbles and go home.\n\nThe majority of indigenous Americans have seen nothing but their rights further curtailed as successive presidents have asserted ever greater imperial control over their would-be / wanna-be empire.\n\n[Elizabeth Furse](http://controlroom.blogspot.com/2013/03/wanderers-201336.html) could tell you more of the story (she might have assumed Senator Packwood's position were it not for Ron Wyden's strong sense of entitlement).\n\nSpeaking of a sense of entitlement, lets add up the number of migrant workers wearing military uniforms, including with US insignias.  You'll find these migrants all over the world, lording it over the \"little people\" that live there.\n\nOkinawa [hosts a large number](http://www.stripes.com/news/ready-or-not-okinawa-aims-to-wean-itself-off-of-military-dollars-1.152708) of such migrant workers, as does Cuba [at Gitmo](http://www.npr.org/templates/story/story.php?storyId=4715995).  Of course these are actually [occupations](http://www.nytimes.com/2012/02/21/world/asia/in-okinawa-some-still-toast-era-of-us-control.html?_r=0), as the migrants have [no need of permission to squat](http://www.nytimes.com/2012/01/11/opinion/give-guantanamo-back-to-cuba.html) in these countries.  They are present mainly through force of arms (including arm twisting), papered over. \n\nSometimes they pay rent, [like in Kyrgyzstan](http://mybizmo.blogspot.com/2009/02/news-and-views.html). \n\nIn the case of Cuba, one rent check was cashed, post Cuban Revolution, and this was considered a green light to move in forever.\n\nIn the Philippines, it took a volcano to get Clark AB and Subic NB closed, or at least scaled back.\n\nThese migrant workers also expect to be serviced by large red light districts in most locations. Local people are encouraged [to prostitute themselves](http://www.ebaumsworld.com/blogs/view/81246843/) for the benefit of these migrants (various types of destruction engineer mainly, trained to destroy life and property).\n\nTalk about the tenant from hell.\n\nWe learned more about the \"driver card\" which gives some North American migrants a right to drive, but doesn't serve as a valid ID the way a real driver's license does, such as when boarding an airplane serving a domestic route.\n\nI think putting a large shroud over the Statue of Liberty is in order, given the utter hypocrisy [of the inscription](http://www.scrapbook.com/poems/doc/3061/4.html).  It rings too hollow to be seemly in public.  The Shroud Project:  mourning the death of Liberty in America.\n\nMigrants to the US have pretty successfully hijacked the place and now want it for themselves alone, having driven off or rounded up the Cherokee, Apache, [Wabanaki](http://worldgame.blogspot.com/2013/03/from-afsc-corporation-meeting.html) etc. \n\nSeasonal migration patterns going back thousands of years were interrupted with fences and now the ranch owners have become vigilante-minded about their so-called [Doctrine of Discovery](http://controlroom.blogspot.com/2010/02/notes-from-lunch.html), which was followed by the \"annexation\" of vast territories (a mental process in Washington DC).\n\nOne group of migrants tries to lord it over the rest, as \"the defacto landlord\".  The landlord migrants rule by de-legitimizing (criminalizing) everyone else.  Vast military encampments (called bases) are just fine and dandy, but if you pitch a tent in a public park, you've criminally disobeyed the ban on camping.\n\nThese landlordy migrants are adroit when it comes to twisting the English language to make up whatever rules will keep other migrants subjugated and at their mercy.  Lawyers sometimes act surprised that the subjugated migrants defy the landlords.  Don't they see further encroachment of their rights as better than no rights at all?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}