{
  "id": "4983768428544498345",
  "title": "Mind vs Brain",
  "published": "2022-08-01T14:25:00.001-07:00",
  "updated": "2022-08-10T10:51:19.506-07:00",
  "content": "What I'm not expecting the new biography of Bucky Fuller to dive into, given time and space constraints, is Fuller's relationship with P. D. Ouspensky and/or his philosophy.  \n\nWe know there was some kind of connection from Linda Darlrymple Henderson's book, on non-Euclidean geometry's influence on modern art.  Apparently Fuller sent a copy of his limited edition 4D Timelock to Claude Bragdon as soon as he self published it, with a note mentioning the importance of Tertium Organum. \n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgi8Tg8pNQpKW444ILsBEQUOPxkVhpodMMKQ9ceN-h3p-1U7HCvBb5U8ifWZve-uOcXd-nsCcU2Fm4VKiUa8Mfa7kjNQzK1ib2_rCbhzdy5NRooA7hRmY1D4Ev7xcyVoJ4yHKSXjoQOvRAK0DOKWUhnOw69IMUmjH3fdnwYGBizK2-LCm-Dtw/s440/4dtimelock_essay_recipients.jpeg)\nWe may conclude Fuller read Tertium Organum, which gets into the \"dimension talk\" so pervasive at the turn of the millennium (1800s - 1900s). \n\nFuller’s appreciation of trailblazers who rose above their peers with \npioneering ideas was also influenced by mystically oriented teachers \nwhom he met in New York City at the beginning of the Great Depression. \nHe gravitated to esoteric teachings in spiritual development by the \nRussian mystic George Ivanovich Gurdjieff (whom Fuller met in Greenwich \nVillage in the late 1920s) and his pupils P. D. Ouspensky and Claude \nBragdon, and, in the 1930s, the controversial French American scientist \nAlexis Carrel. Drawing on these various sources, Fuller merged the \ndesign conceptions of his single-family house with mystical iterations \non self-propelled evolution. [[source](https://academic.oup.com/minnesota-scholarship-online/book/15100/chapter-abstract/)]\n\nThe connection I'm seeing is between Gurdjieff's picture of \"man, a machine\", striving to awaken, and Fuller's own emphasis on automaticity, i.e. on processes not carried out consciously, such as digesting and growing hair... including consciousness itself?  \n\nWe don't know how we do it.  Look ma, no hands.\n\nOur automaticity is not something we need to moralize about or feel guilty about, so much as wake up to. Like they said in est:  guilt is that thing you hold on to so you can keep doing that thing you feel guilty about.  \n\nPer Bucky, and just ordinary language, waking up to inappropriate reflexes is more a matter of correcting for awkwardness, once a habit gets way out of whack vs-a-vs the actual challenges.  But doesn't this beg the question as to what's inappropriate?  Who's to judge?\n\nTaking a page from Krishnamurti, is it a matter of seeing the cost?  Or call it sticker shock.  We snap out of it to the extent we catch ourselves falling into it, whatever that is.  The shock of realizing you about to doze off in the driver's seat is what might finally persuade you to pull off, the better practice in these conditions.\n\nAssuming \"the Self\" in the Jungian sense is an anchoring equilibrium, then a disequilibrium might be a daydream or system, a set of beliefs, a faith and practice.  We accept an aberrational system, always needing Self correction in principle.  But what shocks us into actually shaking off the old habits to make room for new grooming?\n\nI bring est into it because in retrospect it doesn't surprise me that these two philosophers would precessionally orbit one another, but not necessarily converge.  Fuller never did the est Training.  Yet his and Erhard's karma most definitely intertwined.  \n\nI'm pointing to a common lineage:  \"esoteric\" teachings that begin with the unconscious and/or sleeping and/or habitual nature of the human psyche (including thought), with respect to a possibly unrealized self awareness potential.  \n\nI put \"esoteric\" in scare quotes because none of the actors mentioned was actively working to make their teachings private and/or secret.  What makes the teachings \"hidden\" is the need to work on oneself, which can be difficult and may imply a workshop setting, with exercises and self-disciplines.\n\nAs Applewhite mentions in Cosmic Fishing somewhere, Fuller was not prone to demonize.  He was not into pointing the finger of blame or indulging in resentment, the paradigm negative emotion.  \n\nHe could see what he was up against, in terms of pattern integrities.  Yet he is adamant about having no goodies or baddies at the heart of his mechanics.  He's taking after Nietzsche in that way, in revaluing all values. \"Accentuate the positive\" was his motto, from that song.\n\n\"Man cannot do, because man is a bureaucracy\" might be one way to provide a synopsis of the Fourth Way teachings.  \n\nTo will the good is to will one thing, according to Kierkegaard.  But how often are we free of ambivalence?  Don't we fragment into numerous \"I\" types, each with a point of view?  We fight with ourselves, in a battle of self overcoming.\n\nFuller wanted to accommodate the namespaces he trusted, even where the shop talks diverged.  He'd have his own way to keep Love and Gravity connected, including through ample discussion of Newton's Law.  \n\nThere's that one-on-one love, of two black holes, swirling around one another, one day to converge.  Then there's that peeling off from a 90 degree orbit and making one's own way, neither tugging nor resisting, what Fuller labeled \"precession\".\n\nIn Fuller's shoptalk, the \"brain bureaucracy\" may be semi-paralyzed in an awkward state, looking to pull out of a tailspin.  The mind is able to reshape the aberrational, provided one stays open to it.  Whether it's able to do so in time is touch and go in some cases.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}