{
  "id": "1396798281130238256",
  "title": "Mind Control",
  "published": "2020-06-17T16:17:00.000-07:00",
  "updated": "2020-06-24T12:12:47.360-07:00",
  "content": "I have no ethical problems with consenting adults getting together and agreeing to take some personality test (say OCEAN) that shrinks each to a set of numbers.  Then feed those numbers as machine learning features, paired with one extra Y, such as \"voted for...\", such as \"preferred to purchase...\". Do we have a model? Did we discover some predictability?  Not?\n\nWhat data scientists sometimes ignore or forget to study is whether outliers in one study might be outliers in another or, put another way, are those least predictable (a measurable trait) in turn predictive? Lots of mythology swirls around this question. The predictably unpredictable, the anomalous, do they exist and, if so, what do they teach us?\n\nYou might call this an artificial intelligence class, with the twist being our question: so just how artificial is our intelligence, anyway?  Are we all really phonies?  There's some fear of that, which psychoanalysts raised in saying they could predict our lot in life on the basis of our relationship with the mother, or per some other archetype.\n\nBut that's astrology in a nutshell: shrink me down to some numbers. Comforting. Back to OCEAN.\n\nI know what you're thinking: we already know OCEAN is predictive and that's what Cambridge Analytica used to tip the election to Trump and blame the Russians.  That's why Facebook was duped, then later took the fall, accused of being too greedy or too loose with its data or whatever.\n\nAmericans are stuck believing their every belief is in a database somewhere, and that these beliefs make them predictable, pliable, dupable. That's disturbing.\n\nNo one likes learning, from machine learning, that they're a machine.\n\nMy response is no, we don't know any of that.  The mythology of marketing and PR is to create an aura of all-knowingness, if that's your line of business (omniscience sells by the \"square\" they tell me), creates a swirl of doubt around what the true state of psychology is.\n\nWhat is the state of the art?  With uncertainty so much a tool in the toolbox, how could we know?\n\nThe uncertainty principle is not about minimization in psychology, as it is in physics.  The squid ink of purposeful juxtaposition of intended states is what keeps the whole situation fluid, and that's a plus when you're hoping to hover above any literal meaning, indefinitely.\n\nI'd happily join other grad students in this experiment, with or without the Float On floatation tanks. Float On, a nearby business in Asylum District, has also ventured into publishing, resharing some of the John C. Lilly works, on telepathy with dolphins.\n\nI know that's all fringe culture silly stuff, but thar  (as in them thar hills) is where the pirates encode their secret treasures.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}