{
  "id": "6142411096183094061",
  "title": "Mission Impossible: Dead Reckoning (movie review)",
  "published": "2023-07-22T12:07:00.001-07:00",
  "updated": "2023-08-14T10:43:07.302-07:00",
  "content": "Right, Part 1, I could've added that.  Hey, I've found a new favorite channel, when it comes to talking film.  She's not Siskel & Ebert (just the one photogenic head), but she's smart and for a me a doorway to movies, directors, actors I might want to track going forward. I'm a large ignorance-cratered surface when it comes to Movie Moon (as I'll call it, branching out from pure Planets -- yes, Urbit's an influence).\n\nI was just on a Cohen Brothers kick, and regret not a minute. \n\nA commenter on YouTube agrees with me:\n\n@3TNT3  10 days ago (edited) \n Maggie is pretty-much as good /great at reviewing movies as anyone else is at doing whatever it is they are best at. She never ceases to amaze and impress me. I am absolutely certain Rodger Ebert would have luuuved her!!!\nI like how the hero gets a meetup with the CIA director:  sneak into a major meeting, lurk in, and spoiler alert, make everyone else oblivious with a men in black gas.  They talk, he gets an assignment, and it's off to the races, ala Lawrence of Arabia.\n\nThere's a DNI too, which makes this world reflective of the one I blog about here, recognizing it's my responsibility to design my intel networks.  Each of us must model and role model, even if not up to 007 standards in terms of fighting bad guys on moving trains (a piece of action every movie in this genre is obliged to tackle, and MI does as good a train scene as it gets).\n\nThe stereotypes are there, in a formula that knows its a formula, and celebrates formulae.  We open with those silly Russians, always shooting themselves in the figurative big toe, the butt of jokes in the old school movies.  But now, thanks to Terminator (the guv), and Sophia (the AI Barbie) we're on to AI. Dave and I agreed there's much to recommend a War of the Worlds trend, in that we're not stirring up new suspicions of our fellows (the old ones still comprise a full plate of karmic noodles).\n\nIntel people are characterized by having lots of files on others, certainly Applewhite did.  One realizes that's already a step above average, as a lot of people are deeply focused on their own lives only, and have little interest in enlarging their perimeter of concern.  \n\nMy grandma Esther was high level intel by this criterion, in that she had a deep interest in other peoples' scenarios.  She was an eclectic reader, and with some help from our family, a world traveler.  She can be our family agent, undercover as a sketch artist specializing in women's fashion.\n\nIn the case of Tom's character, he's naturally drawn from crush to crush, favorite gravity wells or gw candidates.  The delivery seems organic. \n\nSpeaking of fashion and all these characters dressing up (in Venice especially), I'm well aware that I've overly narrowed my wardrobe, and/or costumes I'm ready to wear, whether I \"own\" them or not.  Given I'm in fasting mode, pending a medical test (involving echograms, but not heart), my mind turns to staying in shape enough to keep playing active roles, operational ones.  \n\nLike two days ago, when I was enlisted to help move a lot of irrigation pipe, both aluminum ancient and PVC (leftovers from what got buried).  Does that make me some kind of Hercules?  Far from it.  I'm acutely aware of a need to shape up.  I'm always looking for coaches, who sometimes show up already internalized.  Smile.\n\nI just need to line up the right movies, in which to direct and/or star and/or write for (I'm not inside the Hollywood ecosystem, so still have writer rights and am the host of my own show on YouTube etc.).\n\nYou'll have to go back quite a ways to find any CIA / DNI type references here in these blogs of mine, to see how and where I impart my spin.  And don't forget to search for KGB while your at it.  The tone is quite retro by design, somewhat Asteroid City but later in time.  \n\nMy writing is closer to John le Carré's than Tom Clancy's, by a long shot.  I'm more of the school that my friends need not be uber gun savvy, contrary to the cowboy WestWorld stereotype.\n\nLike Maggie, I loved the classic car chase in Rome, with our protagonists in the little Fiat.  Yes, long, but when do we ever get this again?  Bond did a little under powered car at one point.  This time they're up against some Bradley or one of those, piloted by another spy we'd like to know more about, beyond that she's a fighter.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}