{
  "id": "6448726180478683651",
  "title": "More Marketing",
  "published": "2009-02-20T13:17:00.000-08:00",
  "updated": "2009-03-05T07:34:18.937-08:00",
  "content": "A lot of today's [marketing meeting](http://http//controlroom.blogspot.com/2008/10/coffee-shop-philo.html) focused on Portland's supposed inferiority complex.We're wedged between Washington and California, which both have a reputation for attracting venture capital.  That's Silicon Valley to the south and Bellvue/Redmond to the north.From my angle it's more symbiotic than competitive as we have more of a FOSS meets healthcare angle (a stimulus focus), whereas Microsoft [has Xbox](http://osdir.com/ml/python.education/2003-05/msg00001.html) and San Jose [has disk drives](http://worldgame.blogspot.com/2005/05/sky-camp.html) and routers -- not saying I'm not biased.My attitude is we're happy to accept sponsorships for program expenses, but what we really want are program participants getting to work with us as a part of their job descriptions.Don't just send us your money, send us your people too.  That's more the non-profit psychology, with paid volunteers (e.g. paid by their own companies to help reboot the schools, a self interested practice if your long term plan is to stay in business, recruit new players).Of course there's a product placement angle to all this.  Who wants to be seen as a champion?  You don't get it about marketing if you think there's no glory.Speaking of Portland and champions, I liked how [Portland Mercury](http://www.portlandmercury.com/portland/Home) handled the [Michael Phelps story](http://www.portlandmercury.com/portland/oned-day-at-a-time/Content?oid=1122809).  Way more honestly than [the Kellogg's approach](http://worldgame.blogspot.com/2009/02/cereal-box-rant.html).  We still have some free speech left in \"Little Amsterdam\" (FOSS capital).  We may be corporate and button down, but we're also sanely liberal (as in catholic) -- OK, so maybe \"Little Vienna\" then (as in Vienna Circle), likewise a hotbed of liberalism (as in \"liberal arts\" as in \"open and sharing\").The upshot:  market Portland as the Nashville of Open Source, laptops as like guitars, geeks as like musician, with lots of different sounds (more than \"just country\" -- in Nashville as well).  The analogies run deep given how player pianos fed into the punch card era. [ Gibson Guitar](http://mybizmo.blogspot.com/2005/08/gibson-bizmo.html) already saw this a long time ago, as our sponsor at OSCON.  I paid my respects on [my last visit to TN](http://worldgame.blogspot.com/2006/07/movie-sunday.html) (to Jack Daniels as well).And no, we're not ashamed of our Wild West ethics, park [American Cowgirls](http://mybizmo.blogspot.com/2008/07/open-source-database.html) right across from our Oregon Convention Center.  Don't think we're not proud of our night life.  Our streets are packed when many a city shuts down, everyone home in the suburbs watching TV.  We'd call that scary (even creepy), much prefer to nurture our own, have music clubs galore.  That's a feature, not a bug, as we say in the business (show business).\"Shocking maybe, but not shabby\" could be our mantra, because we're very serious about studying.  [We're book readers](http://worldgame.blogspot.com/2006/07/math-they-wont-teach-you.html) in this City that Works (another slogan).  We plan, we have meetups (oft times at CubeSpace).So don't underestimate Portland's value, would be my advice.  Like if you're really serious about being a Grunchie, get a footprint in this town (to sound esoteric about it -- not everyone reads our [buckaneer syllabus](http://mybizmo.blogspot.com/2006/09/yar.html), gotta remember that).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}