{
  "id": "1080554427970727244",
  "title": "More Grist for the Mill",
  "published": "2012-10-09T14:40:00.001-07:00",
  "updated": "2012-10-12T08:30:54.032-07:00",
  "content": "Comment originally posted [here](http://www.nontheistfriends.org/article/doctrinally-open-membership-in-the-religious-society-of-friends-2/#comment-74456), hyperlinks added.\n\n[Kirby Urner](http://www.grunch.net/)\nOctober 2, 2012 at 10:39 pm\n[#](http://www.nontheistfriends.org/article/doctrinally-open-membership-in-the-religious-society-of-friends-2/#comment-74456)\n\nAnother approach to doctrinal openness is to actively involve \n[compatible attenders](http://worldgame.blogspot.com/2012/09/attenders-to-spirit.html) in the life of the meeting where, in some cases, \nthese attenders clearly and openly are not considering membership in the\n Religious Society.\n\nYet their ways are compatible, they celebrate Quaker testimonies and \ncontributions in the world, and their skills are considerable.  If such a\n person practices among Friends year after year, in our meeting they \nmight eventually be nominated to Oversight.\n\nIndeed, I don’t think our operating manual (Faith and Practice) specifically forbids the clerk from being a non-member.  Follow-up: I stand corrected, the nominating guidelines do specify this position is member-only, meaning a member of our meeting in particular (some meetings allow for \"affiliate membership\" and have permitted affiliate members to serve as clerk).\n\nBy state requirement, we need an identifiable membership and should \nbe able to point to our officers. Nonprofit structures, churches \nincluded, have no “clerk” in any case, so maybe the Assistant Clerk is \n“executive director” for the state’s records, while the Clerk is a \nnon-member, perhaps a visiting rabbi of great compassion and repute.\n\nThe Meeting recognizes what a golden opportunity this could be and \nafter a little seasoning, Business Meeting gives us the green light.  \nLet this rabbi be clerk for a couple years, why not?  We know and trust \nthis person.  Doctrine is not an issue.\n\nThis may sound far fetched, but lets remember how the AFSC is \nconsidered a “Quaker organization” and yet depends a great deal on non \nmembers.  Meetings may be the same way.  \n\nSome of our longest term most dedicated participants are not seeking \nmembership.  They don’t feel it’s a requirement to be among Friends at \nthe deepest levels.  That’s probably in part owing to our not reserving \nany corner of the life of the Meeting to members in particular (other \nthan the process of becoming a member).\n[](http://mybizmo.blogspot.com/2012/09/the-parable-of-amusement-park.html)\n[Think of rides at a carnival](http://mybizmo.blogspot.com/2012/09/the-parable-of-amusement-park.html).  You may become a member of the \ncarnival (get a card in the mail), but the rides stay open to all.  You \nmay become a member of an art museum.  That doesn’t mean you should \nclose off some rooms and make them “members only”.  That somewhat \ndefeats the purpose of an art museum, which about sharing art with the \nworld, more than stroking member egos.\n\nLikewise, a Quaker Meeting is not about denying a seeking public an \nopportunity to experience Quaker community — including its committees, \nother events.  Members have no special secrets.  We’re not Masons or \nMormons or Illuminati (even if there’s some overlap, among attenders \nespecially).\n\nI’m not saying just anyone should be able to walk in off the street \nand jump on any committee.  Nominating has a real job to do, and getting\n the right balance of attenders and members on every committee is a kind\n of alchemy.  Some attenders are especially good at it.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}