{
  "id": "7054869789491362006",
  "title": "More Escapism",
  "published": "2024-09-27T18:33:00.000-07:00",
  "updated": "2024-09-27T18:42:08.808-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiaa86HTvboAigstEGft8d1CbHkXgkKDlEPrMt2h2d6-5wWQPLOC0ZlaPP5KSKRBV6TQqYC9vL66dAPOWvDDxfI5HxmMS_omIC-LY2dETSi9-Zp-rcMDMXAMPNNQ5JJkhHHDxXBNPoMMvCB4divVAhQY9HWvgmrIcBtxBstK6PnuXW8OmZnJVto/s800/ball_in_rt_e.png)RT_E[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh0MGNQdTkB3yrqOKXpEri5huZPsUvvpVL0SNH6c4qHDSE0BSu1C3SjxXhXa4mg4qqbWwJN9Y1DjMRzPSiyQyf4lsTmeQaN1B6_xKE5aPxv4zp5PjZAV41vt7XNEcnxHfRMsfemz1ojJX3DxX_xZd-gmFj28LB0v-XxGh1HeQY5yLp97Ynl1E-Z/s800/ball_in_rt_t.png)RT_TBoth RTs have a unit radius IVM ball inside, but only the RT_T is small enough to let it poke through. The RT_E enwraps the uni-ball completely, its body-center to face-center radius matching that of the ball's exactly.\n\nThe workflow or pipeline I'm employing is an old one for me, in operation since the 1990s, using POV-Ray the whole time as my final rendering engine, and Python behind the scenes to write the scene description language.\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgNtLU_L8g1E1XYdkqWWX-QoFeLONhN3W03LRL5NFJAaBBczE6dO1csfmW7wXrfFJdk_Jdioe7xqPLlA-21IAeiD5_xpRxlxyo1rtFgcrFclIRKp1x9uVW19IfXvITtbB_rrdBX6EjZT3fw0o0PcSVgcek02ExbqcYLSX9RhdmixBBcmGCocI5B/s1520/Screen%20Shot%202024-09-27%20at%2011.27.44%20AM.png)The above eight lines are sufficient to generate all of what's needed to get the above RT_T graphic. Note the 0.9994 which students of Synergetics also learn as an algebraic expression.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjmWc_3jTVUGKXLEPb53CwEmqqpyrtOhlgg9nkiW2d7twqsvkHEp2aCoPwPV-J1nykmrlCy0I9HOWQiDQWEPb8v8k9oiU1kIYq6e2e5vufaxj6eEhGb-PhZLSFJkrUQOGnKOvKxn7oOjwclObX2yHOA95DzjKKI3kfONm5yy5Z5LH_VDAoaqT_0/s741/Screen%20Shot%202024-09-27%20at%206.11.15%20PM.png)A question I get is what does it all mean? I usually say it means we have a ladder in spatial geometry for becoming more advanced at CAD (computer aided design). Fluency in right-brained spatial imagery is an end in itself, or one could say a skill that comes in handy along many walks of life. The ladder is accessible to middle and high school level students, with elementary school segments as well (e.g. All Sixth Grade Assembly).At the college level, we're talking about America's leading positive futurist, getting smeared and then memory-holed by the Grunch, a monster he helped to foster. The fight isn't over however. As Bucky spelled out in Grunch of Giants, a mytho-poetic and prophetic work, the front lines run through our colleges and universities, with some presidents having the guts to allow deeper dives among faculty, in response to student demand. We want our positive future back.The Global U is coming together, helping to fill the power vacuum left by a fading nation-state system, with the Middle East already in the blender. Even as I write this, we're [seeing Bibi](https://mybizmo.blogspot.com/2024/08/posting-from-cyberia.html) quit the UN after lecturing legacy diplomats about how he's surrounded by non-nations he doesn't believe in (Jordan, Lebanon...), mere lines in the sand, against a backdrop of targeted explosions and terrorism among the well-armed paramilitary gangs. The political data layer is in turmoil, as people try to wrap their heads around the new post nation-state status quo that pertains therein. These gangs help themselves to factory-fresh inventory, amassed and allocated under the cover of nation-state decals, as politicians on the take grease the skids. That inventory proliferates and propagates in a free market, as economists predicted it would.That means [Refugee Planet](https://controlroom.blogspot.com/2023/09/the-refugee-biz.html) is here, and is going to need more asylums, places for people to go who aren't wanting to participate in all the outward violence. Even soldiers, most of them economic refugees themselves, stuck far from home thanks to low living standards, are not always on board with the [oligarchic mafiosi](https://mybizmo.blogspot.com/2023/03/beltway-mafia.html). Getting bossed around by privatized criminal syndicates takes some getting used to. One must overcome any sense of patriotism or honor.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhQg3ll5kpplfjzoEED4b4URPdlboRnJkG9NxwJKX2OY7T-0gUtqA27ELueRhxPatuZLqVKR9LwXCr9r_kSG1Fif4Vu9Z177EEg3JXmtMjAuPZ88FUDuIYRHxg88n8aE3wsLIAdroxPqFD2FiN4ioDOk7OkNGtn196Cb9BXsRRHOjOO5tbBZ6zS/s2012/Screen%20Shot%202024-09-27%20at%208.59.17%20AM.png)\nPrompt:  Uniformed soldiers and other economic refugees from many countries gather in a playful Epcot-like village featuring high tech yurts and electric ATV vehicles.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}