{
  "id": "1068170940250755218",
  "title": "More Gardening",
  "published": "2009-09-29T12:10:00.000-07:00",
  "updated": "2009-09-29T17:10:54.466-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/3926676055/)\"[we also teach gardening](http://mathforum.org/kb/message.jspa?messageID=6855004&tstart=0)\"The philosophical underpinnings of the garden remain important.  Better the seeds be harvested directly from the local scene than obtained through the cash economy.The game is to develop using biological methods having root access in ways money does not, unless converted from bracelets back to cows (a few bulls) per [the Critical Path codec](http://mybizmo.blogspot.com/2008/01/wheres-beef.html).The dirt pile was developed with assistance from a borrowed pickup truck.  Various flavors of compost will be mixed for raised beds.  This is a process any family with a lawn might engage in, if [seeking urban edibles](http://controlroom.blogspot.com/2009/08/urban-edibles.html).  Which reminds me, we met at Back Space again.  I got it all working on [the Starling](http://www.flickr.com/photos/17157315@N00/3951019433/), with Mark giving me some invaluable pointers on how to operate it more successfully.  He's a pretty [brilliant guy](http://controlroom.blogspot.com/2007/09/september-ppug.html) I think.  And yes, there's a plan to [go with GeoDjango](http://controlroom.blogspot.com/2009/09/geodjango.html).  I'm recruiting talent from PSU and such places.We elected not to view Constant Gardener at [the Boltons'](http://controlroom.blogspot.com/2006/12/limiting-ball.html) last night, though I am eager to learn of [Maureen's adventures](http://mybizmo.blogspot.com/2007/10/fine-friday.html) in Kenya.  [I'd seen the movie](http://mybizmo.blogspot.com/2006/05/constant-gardener-movie-review.html), even read the book, had all this pending business to attend to, including around Quarterly Meeting.Speaking of which, Glenn and I just met Lisa at the corner of 37th [at Bagdad](http://www.flickr.com/photos/17157315@N00/2943807898/) to discuss options.  She was on a bicycle, whereas my party was walking Weird Sarah to Laurelhurst Park (a designated off-leash area in the neighborhood).[The Private Party](http://coffeeshopsnet.blogspot.com/2009/09/coffee-shop-show.html) at [Duke's Landing](http://worldgame.blogspot.com/2009/09/private-party.html) was recorded live (about 3.5 hours) and sliced up into 109 separately entitled tracks for archiving and blogging.  At least half of them are dialog.  Some of the song takes are headed straight to [the Myspace site](http://www.myspace.com/lindseywalkermusic) whereas some of the more private stuff will go exclusively to event participants, at least at first (the most recent plan, as of this writing).We're happy to have a mobile sound studio solution so that rough cut recordings get some air time.  I'd like to add video at some point and find some R-rated TV slot on community access, or just burn straight to DVD.  The various video products will then draw from this raw footage.  [Coffee Shops Network](http://coffeeshopsnet.blogspot.com/2009/02/outreach-to-japan.html) is already a client.Lindsey is not playing covers so there are no issues around who controls the music at this point.  Most cities have a Wild West of this kind, frequented by talent scouts, intrepid tourists.  I've not spent much time [in Nashville](http://worldgame.blogspot.com/2006/03/temple-to-athena.html), yet imagine [something similar](http://mybizmo.blogspot.com/2005/08/gibson-bizmo.html).  Savannah must not be that different either, given Lindsey's duck to water transition to the PDX music scene.Glenn suggested I nudge Trevor to get Lindsey a slot at the upcoming [Esozone conference](http://www.esozone.com/).  That's smart thinking, whether it happens or not.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgHZbY-mdjIJdzP9jETpFhYy-LaLerMFCyEa4GSbetGXRO4gnLv7kTSrfQTodph-Kq2FiotsDnARKVwwDFVAmbjNhQsZry9CQsw-UhUq9V8WUw5OA3yHgSouhvZSvkck0yoSQWn/s1600-h/kgb_party_cia_invited.JPG)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}