{
  "id": "2709318512484038432",
  "title": "More Americana",
  "published": "2016-05-11T07:34:00.000-07:00",
  "updated": "2016-05-11T11:16:20.933-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/26913377586/in/dateposted-public/)\n\nAnother time in Richmond, I stayed at a Best Western and shot a picture across I-40 to the north.  On this trip, I was in that picture, at the Bob Evans, looking back.  Dawn preferred Bob Evans to Cracker Barrel, both mid-west phenomena ([restaurant chains](https://mail.python.org/pipermail/edu-sig/2015-February/011200.html)), extending on into the southeast.\n\nWhat I have to keep remembering is how much closer the so-called \"mid-west\" is to the Atlantic coast, in comparison to its distance from the Pacific coast.  It's only a day on the road to Washington DC, whereas it's three times further to Portland.\n\nI used Google Maps to plot a route from Champaign, Illinois to Portland, Oregon.  The computer said we'd have to drive a day and seven hours.  That's if we were in a Google car and could sleep a lot of the way, only slowing for gas and brief pit stops.  [A crewed bizmo](http://mybizmo.blogspot.com/2016/05/rejected-meaning.html) could do the job, though ideally the schedule is not that hectic.\n\nMy route from Champaign to the Budget rental car return at the St. Louis airport took me through Springfield, Illinois.  On the way out I'd stopped in Decatur for lunch.  The Abraham Lincoln Museum was well attended, especially by kids arriving by the bus load.  My schedule was tight and I was low on coins for the parking meter, [which had failed](https://flic.kr/p/GXc2eT) anyway, as it turns out.  [Shades of Detroit](http://mybizmo.blogspot.com/2014/08/visiting-downtown-detroit.html).  I took hurried pix in the Gift Shop by way of keeping souvenirs.\n\nWe hear a lot about Greece and its dire financials, but lets talk about Illinois.  Here's another state out of money, completely in the hole.  To whom does Illinois turn?  The Federation as a whole is even deeper in the red and mostly just likes to make rules it won't pay the states to comply with.  The old social contract is wearing thin in that sense. \n\nThe European Union is projected in US media as being in trouble, but as the Lincoln museum reminds us, it's the US union that's been through some tough times recently.  The EU has had nothing quite like the US Civil War (which was anything but civil).  This is not a nation that gets along with itself.  The breakdown [into eleven states](http://mybizmo.blogspot.com/2016/01/eleven-nations.html) helps make sense of the jumbled war of words happening through talk radio, other social media.\n\nSkywest operates a relatively new service for Alaska Airlines that got me from the St. Louis airport to PDX in under four hours.  We got in early and had to wait for our gate to free up.  I noticed an Icelandair parked at the concourse.  How long have we had direct flights to Iceland I wonder?\n\nI sat next to an Illinois farmer, his wife across the aisle.  Their daughter is a professor at OSU and just had a first baby.  They'd been out before, but not frequently.  He didn't know what \"IPA\" was (as in \"India Pale Ale\").\n\nI said the Brits invented this kind of beer to help prevent spoilage in the hotter Indian subcontinent, adding more hops than usual as a preservative.  In the Pacific Northwest, more fresh hops get infused later in the process, which actually shortens the shelf life of the beer (with refrigeration, which the Brits did not have in those early days, aging slows).\n\nWith the fresh hops IPA, the whole point is to drink it down soon after it's kegified.\n\nI had a beer on the plane and another at Beaches, from whence I sent a note to Lindsey, as we'd earlier planned to talk around now, but then she realized there was no point renewing her cell phone contract, given where she'd be.  For the most part I'm not doing beer but for ceremonial and [diplomatic occasions](http://mybizmo.blogspot.com/2016/05/more-adventures.html).  This whole week was about diplomacy.\n\n[](https://www.flickr.com/photos/kirbyurner/14782760696/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}