{
  "id": "3805673128672308948",
  "title": "More Counting Down",
  "published": "2014-08-07T08:27:00.002-07:00",
  "updated": "2021-03-05T15:17:04.684-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157646239918001)\n\nAs in \"[countdown to zero](http://worldgame.blogspot.com/2010/07/countdown-to-zero-movie-review.html)\" that is, a meme brought to you by the abolitionists, versus nuclear weapons that is (the anti-slavery battle is ongoing as well and they're related).\n\nThis year we again enjoyed fine weather, perfect shade, and a relaxed summer park atmosphere, with members of the public towards the back performing acrobatics quietly, in much the same way Joe Snyder does with kids' program during talent night at Annual Session ([which I mostly missed](http://controlroom.blogspot.com/2014/07/replacing-broken-camera.html) this year, [OSCON a priority](http://worldgame.blogspot.com/2014/07/i18n.html) -- still got some IT committee prep work done though).\n\nA fun wrinkle was this mom & pop \"[radio station](https://www.flickr.com/photos/kirbyurner/14662361408/in/set-72157646239918001)\" showing up with what appeared to be equipment for making interviews.  I didn't see them make any, but one of their colleagues posed during Congressman Blumenaur's speech, with a black on yellow sign calling for Barack Obama's impeachment.  Carol later remembered [Bonnie Tinker's](http://worldgame.blogspot.com/2009/07/good-witch.html) fascination with the prospect of impeachment vis-a-vis George Bush.  My take both times is the same:  USAers are still PTSD from the Nixon Era and now see impeachment ([a kind of scapegoating](http://controlroom.blogspot.com/2014/05/raging-against-king.html)) as a solution for everything.\n\nThe highlight of course were [the en Taiko Drummers](http://entaiko.org/en_Taiko/about_us.html), teens and tweens, led by taller girls but all obviously enjoying themselves and the audience feedback.  Mom took the opportunity to leaflet the front row during their 2nd performance, a stunt reminding these theater mode duffsters that it was theirs to stay active, get involved, not just to expect entertainment.  Or at least that's my spin.  She really didn't block anyone's view and she had relevant information.\n\nVeterans for Peace is always high profile at this event.  The Native Americans were less foreground this year.  These things come and go.  I was wandering off site to savor local context and widen my perspective, and stumbled into a photo exhibit regarding some event called [Vortex in 1970](http://www.opb.org/television/programs/oregonexperience/segment/vortex-i/), which according to the proprietor was [like a state sponsored Woodstock](http://en.wikipedia.org/wiki/Vortex_I) aimed at keeping a surly hippie generation out of trouble for the summer, by organizing some \"lets get naked and pretend we're Indians\" event.  That puzzle piece fit with my [recent airplane reading](http://www.amazon.com/Hippies-Indians-Fight-Red-Power/dp/0199855595).\n\nCarol reminisced in the car about some of the early versions of this annual event, now pushing fifty years.  Fellowship of Reconciliation used to be involved but FOR must see Portland as \"over it\" by now, pretty much reconciled by now.  Mercy Corps is just across the street but not an active sponsor.  I was off in [a Chinese second floor restaurant](https://www.flickr.com/photos/kirbyurner/14662425118/) having a Tsingtao and [watching Chinese TV](https://www.flickr.com/photos/kirbyurner/14846612654/in/photostream/) for a part of it.  Like I said, I was taking in surrounding Portland (Old Town), [adding nuance and new angles](http://mathforum.org/kb/message.jspa?messageID=9547309) to an event I've attended for almost fifty years (but with a huge gap from like from age six to fifty).\n\nCarol was given full credit for helping start this ceremony / memorial [by Polo](http://worldgame.blogspot.com/2012/10/disarm-day.html), a community / city leader, some years back.  She knows a lot of these people and had a walker full of stuff to compare notes about.  She's looking forward to another workshop today in fact, on the military's misappropriation of drone technology.\n\nOK, time to stop blogging and head out to an [AFSC-related meetup](http://mybizmo.blogspot.com/2013/09/afsc-fundraiser.html) (AFSC is an old time co-sponsor of this event, right from its inception). The Portland office has relinquished its hold on [its historic digs](https://flic.kr/p/7dHjH1) on E Burnside, though the outdoor sign is still there.\n\nWhere to go next, that's fully ADA compliant?  Old houses like that one usually don't even begin to qualify.  E Burnside has a ramp, with some turning radius in the restroom but I don't have the exact figures.  I'm suggesting we camp out, at least on billboards:  picture an AFSC tent overlooking a grand canyon (doesn't have to be the famous one):  \"Really Out There, and Lovin' It!\" could be the slogan (would [McDonalds](http://en.wikipedia.org/wiki/McDonald%27s_advertising) sue?).\n\nThe idea is like we're into scouting and stuff.  Like the old days in some ways, when AFSC ran work camps for COs.  The idea of a recruiting tent right [in R2DToo](http://mybizmo.blogspot.com/2013/06/right-to-dream-too.html) itself has some appeal.  AFSC has a long history of working with stateless / houseless / refugee populations.\n\n:: [source](http://mybizmo.blogspot.com/2014/04/right-to-dream-too.html) ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}