{
  "id": "6647264737013710363",
  "title": "More Rocket Science",
  "published": "2008-02-17T11:42:00.000-08:00",
  "updated": "2008-02-18T07:45:58.065-08:00",
  "content": "Yeah, the Russians are right, there's an [ASAT aspect](http://en.wikipedia.org/wiki/Anti-satellite_weapon) to this USA-193 story, and the military'd rather have kept the whole op covert, rather than make a public spectacle of itself.But this is an election year, and a leap year, and the public wants a reality check.  Just what have we been paying for with all this Star Wars stuff since Reagan?  Now is a chance to find out.  And given it's not so clear [why we fight](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html), in the old fashioned way, old conventions about cover-ups have evaporated.  Too many privatized civilian agencies, ready to blow the whistle -- and so it's [official news](http://news.google.com/news?hl=en&tab=wn&ned=&q=hydrazine+spy&ie=UTF-8) then, can't have it both ways.Indeed, it's spun as not so hopelessly staged, like one of those test shots from [Vandenburg](http://www.vandenberg.af.mil/), but as still with plenty of variables (almost realistic): an expensive piece of equipment, lost in a risky game of chance, is plummeting towards Earth filled with toxic fuel, no predicting where it'll hit (Moscow? London?).  Hollywood couldn't have done it better, and I'm not saying I don't believe it, even if [Britney](http://thecelebritytruth.com/lynne-spears-full-declaration-against-lutfi/00899) doesn't.Whereas the old Pentagon might've just said \"fuck 'em\" (and what else could they say? -- no sense running around like [Chicken Little](http://worldgame.blogspot.com/2005/11/chicken-little-movie-review.html), setting off a public panic), the [new Pentagon](http://mybizmo.blogspot.com/2006/08/mathcasting-about-phi.html) has to put some walk behind its talk and actually try and shoot the sucker (because sometimes stray sats need to be shot?), or else fess up that rocket science is still pretty darned hard to get right (we knew that already).  At least there's a window for more than one shot (80%, the declassified figure, is hardly for sure).Also, in my view, orbiting space junk full of poison / toxic stuff is already a \"weapon in space\" so it's not a matter of if / when.  Another victory for military intelligence, to have that thing out there, being evil.  Or does Hubble have that same ['zine stuff](http://www.nasaspaceflight.com/content/?cid=5359) inside?  I like Hubble.  Time to go Google and bone up on \"sat guts\" (satellite anatomy).  I'll see some of you out there.Oh, and put a self-destruct feature in next time guys (we've all seen those movies) -- not really spies are ya, or you'd've thought of that (or did the failsafe break this time?  [Malesh](http://easilyenter.blogspot.com/2005/09/inshallah-bokra-malesh.html)).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}