{
  "id": "4391685841514214467",
  "title": "More Quaker Politics",
  "published": "2008-01-27T21:44:00.000-08:00",
  "updated": "2009-07-14T20:28:55.103-07:00",
  "content": "I realized in my meeting with Gordon today, at [Jim and Patty's](http://www.publicpress.org/entity?action=showEntity&id=7891) for coffee and tea, that I don't need to disturb the peace among Quakers just because I think I'm some kind of futurist (and hey, so does The Oregonian -- with two articles in back issues, featuring me predicting \"hypertext kiosks\" in one, more global grid action in the other).There's a whole spectrum to accommodate and if the goal is to be free of encumbering and unnecessary bling, then there should be a flavor of Quakerism that fits.In a kind of [Sims 2 cartoon](http://worldgame.blogspot.com/2007/06/are-video-games-addictive.html), I think of our own [Kathy Hyzy](http://www.kathyhyzy.com/index.html) in the MMM library, talking about diversity among Friends.  We treasure diversity, even as a relatively small liberal group, which makes us all that much more impressive.  My [Quakers on YouTube](http://www.youtube.com/watch?v=8grBdF8uXE4) distillation, which I shared with Gordon by [iPod](http://worldgame.blogspot.com/2008/01/homework.html), gives some sense of our multifaceted shape.On the other hand, I think the AFSC, the action arm of Friends, should be more willing to embrace the future, in the name of staying effective, using the available tools.  Lots of non-Qs in AFSC, by design, so making [AFSC](http://mybizmo.blogspot.com/2005/10/rambling-on.html) higher tech does not necessarily imply Qs are all on the same page, with regard to technology (lots of [diversity](http://mybizmo.blogspot.com/2008/01/one-whale-of-wanderer.html), lots of experimental approaches -- our F&P not set in stone, even within just [NPYM](http://controlroom.blogspot.com/2007/12/quaker-infrastructure.html)).My thanks to [Gordon](http://mybizmo.blogspot.com/2007/08/making-rounds.html), another geek, and others I've been in dialog with recently, for helping me get more clarity on my potential role.  Also, having met with [AFSC](http://mybizmo.blogspot.com/2007/12/more-meetings.html) a few times recently, I'm not too worried.  Staff was teaching me stuff about [Facebook](http://mybizmo.blogspot.com/2008/01/pin-ball-in-pdx.html) I didn't know, not vice versa.  Where AFSC is concerned, I'm on the receiving end of a lot of good teachings and I kind of like it that way (humbling).  Keep up the good work ya'll.Speaking of The Oregonian:  Opus quite funny today (high tech a concern), Dilbert too.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}