{
  "id": "4697173142255468922",
  "title": "More Andragogy",
  "published": "2014-07-01T01:25:00.000-07:00",
  "updated": "2015-10-20T17:28:52.284-07:00",
  "content": "I've been \"watching\" the World Cup, sometimes actually watching, on HDTV at a sports bar, e.g. Jolly Roger, while waiting to help on a move of some archive, but other times only hearing, being at the wrong angle to view, but hearing the cheering, the sounds of an engaged audience.  Such was the case at Horse Brass, where we sat around the corner from the TV (HD).\n\nI've been advising my students to kick back and watch it though.  You'd think I'm self serving, just trying to have less work, but my view is programming requires some neural rewiring, or whatever model you like of \"mental work\", and that happens during sleep and off moments, not just when you're focused and concentrating.  Those two moments go together, a dialectic:  fierce concentration, followed by relaxed inattention, while you let the rest of your brain catch up, so to speak.\n\nBucky Fuller used Doppler Effect to mean something different:  the fact that we're not all on the same page all of the time, nor need we be nor should we be.  We roam around (wander) and find others on the same page, but not everyone, and sometimes only our own selves.  It's that \"non-simultaneous only partially overlapping\" stuff he talked about incessantly.  We get it in different orders, \"it\" being the thing we assemble from the puzzle pieces, per the constructivist view.\n\nI'm calling this [More Andragogy](http://worldgame.blogspot.com/2009/03/wanderers-2009317.html) because it's pedagogy, familiar, but recapped for adults.  You might be a child reading this, but your peer readers are likely older, given the demographic for writings of this type.  I'm not thinking to be exclusionary and welcome child readers.  Fairy tales are for adults as well, as the muppet-masters manifest.  Inter-generational banter, message traffic, is the stuff of civilization, torch-passing and all that.\n\nToday was a jumble.  We'd had a rule change at work awhile back, a consequence of growing towards new archetypes, as an academy, such that students were frantic to have finished X by today, a deadline.  Carol, mom, needed some professional attention and with help from Carl's Jr. and nearby Oregon Clinic (closed), I was able to snarf the WiFi I needed to keep up with said frantic students, enjoying a milkshake at the same time.  Carol's X-rays revealed nothing serious and we have follow-up care planned and covered.  The system worked for us today.  And yet: today was a jumble.\n\nI hear the back gate swinging open as my door to the back deck (upstairs) is open, Sarah-the-dog taking in the night air, meaning Lindsey must be returning, our extended house guest from Savannah, GA.  She was introduced to me by Patrick, fellow mentor, with whom I just had a beer (not the first time).  We're a neighborly bunch, in our partially overlapping scenarios, experiencing the Doppler Effect by weaving through one another's lives in Scenario Universe as Bucky called it (\"it\").",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}