{
  "id": "6704238449079088712",
  "title": "More Movies @ McMenamins",
  "published": "2012-07-02T17:49:00.000-07:00",
  "updated": "2013-08-25T20:02:01.780-07:00",
  "content": "McMenamins has been showing Cabin in the Woods, and more recently [Chernobyl Diaries](http://en.wikipedia.org/wiki/Chernobyl_Diaries), both horror films, and both featuring bizmos.  So you'd think I'd post this in BizMo Diaries, but then they both featured Control Rooms as well.  You could say they were linked other tomorrows in that sense, via their control rooms.\n\nIn the meantime, Glenn provided [a happier backdrop](http://www.nature.com/news/2005/050808/full/news050808-4.html), talking about the wild creatures of Chernobyl (ala Keith Lofstrom and Stewart Brand), and of [the light comedy Accepted](http://www.imdb.com/title/tt0384793/).\n\nCabin in the Woods has Joss Whedon all over it, going back to the Buffy sequence with the boyfriend from some subterranean government.  Shades of Lost.  They've got a hexafence, takes out an eagle.  There's a hell mouth.  What's missing is the Catholic Church.  They're all engineers down there, minding the store.  They're actually the collective mind of the viewer as in [Woody Allen's control room](http://www.youtube.com/watch?v=djQ7WZlb140) in the movie about sex.  That's today's control room in so many ways.  Of course Sigourney Weaver would be part of it.\n\nChernobyl Diaries starts out with [Blair Witch jerkiness](http://worldgame.blogspot.com/2006/08/drinking-liberally.html), prompting fears the movie will be all bouncing camera, but then she settles in under more confidant direction and I could relax and enjoy the ride more.  I'd had a long day and was still on duty, more like [in Indianapolis](http://worldgame.blogspot.com/2012/06/our-week-in-indy.html), which was also a barrel of monkeys.\n\nThe bizmos are quite similar in both films and serve as conveyances into Other Tomorrows.  I've been thinking a lot about [my high desert schools](http://mybizmo.blogspot.com/2007/03/high-desert.html).  The planetarium (you need one [even there](http://controlroom.blogspot.com/2008/08/escaping-light-pollution.html)) looks a lot like [those golf balls](http://www.harrogate-news.co.uk/2011/07/03/protest-planned-for-independence-from-america-at-nsa-menwith-hill/) in the UK countryside, big ones, so as you round the corner, perhaps in a van, but maybe on foot, you see like colonizers from another somewhat higher civilization.  They're living up to our heritage, more a maritime set?  We're not near the ocean necessarily.  Bhutan was like this (Druk-yul as they call it), minus the golf balls (back then).\n\nBoth bizmos met a similar fate, and neither proved a secure shell against danger.\n\nWhat I found myself thinking, is when you have intelligent young people like this, at their peak in abilities in many dimensions, why not have some serious work in store, rather than all idle vacation.  Hard work actually builds skills.  Not that these troops didn't end up working hard -- much too hard, almost in compensation.  We resent they get a vacation I suppose, when all we could afford was a movie ticket.\n\nAnyway, a \"business mobile\" is deliberately not portrayed as a \"recreational vehicle\" (RV).  That doesn't mean the work can't be fun, but this is expensive equipment and lots of communities have [some serious needs](http://mybizmo.blogspot.com/2005/09/more-bizmo-tech.html) that need documenting.  The teams get to swap around a lot.  This was also a topic with Glenn -- like time shares in Orlando but really nomadic sometimes: few possessions, yet institutionally wealthy.\n\nSpeaking of work, I was hitting the queues more than usual for a weekend, having an unusually occupied work week.  We got a lot done, turned a lot of corners.\n\nCabin... suggests it's helping us turn over a new leaf in that the horror film formula is not unconsciously / religiously followed: the [Scooby Doo guy](http://en.wikipedia.org/wiki/Shaggy_Rogers) gets away with it. His smoke actually helps in the fight against Satan -- game changing.  He and the virgin somewhat turn tables on the eager voyeurs (deep out of site) as we don't see them ritually punished any more than we are at the end of the day.  The creatures of the deep become restless.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}