{
  "id": "8569472002497778454",
  "title": "More School Business",
  "published": "2009-01-26T18:12:00.000-08:00",
  "updated": "2009-01-26T19:29:58.572-08:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/3230290894/)[Anna](http://mybizmo.blogspot.com/2008/07/exchange-student.html) continues chopping wood for her Thunderbird Early College Charter.  Her meetings [with LEP High](http://mybizmo.blogspot.com/2007/11/more-business-news.html), which I arranged, had to do with governance structures, model UN, and relationships with local institutions of higher learning.The K-16 pipeline isn't about regimenting by age too strictly, especially in terms of technical content -- orthogonal to \"lore\" I would argue, e.g. there's nothing to stop Big Bird from teaching [about complex numbers](http://controlroom.blogspot.com/2008/12/exxon-math.html), other than reputation (character) -- no small asset in his case, [ditto Barney](http://mybizmo.blogspot.com/2008/05/comment-on-news.html).So, if Jill shoots ahead up the fish ladder, [wants to geek out](http://worldgame.blogspot.com/2008/06/father-still-learning.html), the well-designed charter obliges by providing early access to college materials, presuming that's what she craves.  This presumes [good town-gown relations](http://worldgame.blogspot.com/2005/10/saturday-academy.html), between administrators and faculties.Closer to home, I've continued lallygagging [with OS Bridge](http://controlroom.blogspot.com/2009/01/os-bridge.html) organizers Audrey and Selena, Igal and Ed.  I referred them to [my letter of introduction](https://wanderers.pbwiki.com/PyconPromo) to the new PPS superintendent, about promotiong Portland schools at Pycon 2009, a possible source of marketing ideas?How to interest teachers, executives, activists of all stripes, in the prospects of free and open source software (FOSS) and hardware?  What good is \"open source\" if you can't read it or change it?Not just the Gutenberg Press sparked a renaissance; also critical was learning how to teach reading effectively.[Private sky namespace](http://mybizmo.blogspot.com/2008/07/more-wild-west-biz.html): I'm liking CHR for \"chief of human resources\", rhymes with CTO, CSO etc., plus HR also stands for human [rights](http://controlroom.blogspot.com/2008/12/wanderers-2008129.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}