{
  "id": "115596450044216629",
  "title": "More Cast",
  "published": "2006-08-18T22:10:00.000-07:00",
  "updated": "2006-11-15T11:44:25.272-08:00",
  "content": "Another strong writer I've collaborated with over the years is Gene Fowler, of which you'll find several, but this Gene wrote [Waking the Poet](http://home.earthlink.net/%7Eacorioso/Waking_TOC.htm), and corresponded with Bucky over the years, and with his myriad progeny.Gene thinks in terms of Amerish, a science fiction name for a language we're going into, as speakers of American English.  Co-modeling and sys-talk figure in to his version, which I've scanned at some length.Plus he taught himself Delphi (Borland's OOized Pascal) and XML, all so he could express his vision in eWriter.  Not bad for a self taught old guy who'd done some hard time on the inside (not the only Fuller Schooler to have done so).Gene's [vision with eWriter](http://home.earthlink.net/%7Eacorioso/ew_main.htm) is that we should keep XML in the conscious forefront, the way we do punctuation.  Sure, we stop thinking about punctuation as much, after we learn it, but it's still the writer's responsibility to manage it.Gene wants to enlarge our notion of Amerish grammar, by adding XML into its native machinery, one might say.But as I understand it, this would not necessarily mean our eyeballing XHTML all day long.  We already know that if the markup is for style, then its point is to remain hidden in the final viewing.The writer/author knows that it's there, as do the viewers, but as when watching a stage play, your mind shouldn't be with the props and lighting the whole time (not if you're there to be enthralled).I think this Google Blogspot interface is actually a good example of what Gene was talking about:  as a blogger, I'm mostly using a WYSIWYG (wizzy-wig) browser-embedded text editing tool, but if I click on Edit Html, I'm able to mess with the markup (reminds me of WordPerfect's \"reveal codes\").As an [Amerish speaker](http://mathforum.org/kb/message.jspa?messageID=5030331&tstart=0), I'm not dismayed that my responsibilities have increased.  It's a small price to pay to engage in a shared space of [world-readable files](http://homepage.mac.com/rupert/SNEC/PhotoAlbum160.html), all interconnecting everywhichway in a great global matrix, and in so many intelligent languages!Related reading:  [in a gnu math thread](http://mathforum.org/kb/message.jspa?messageID=5041979&tstart=0) @ Math Forum (Aug 20, 2006)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}