{
  "id": "3583065237125526142",
  "title": "More on Thanksgiving",
  "published": "2006-11-22T17:39:00.000-08:00",
  "updated": "2006-11-23T10:20:37.306-08:00",
  "content": "In the original telling, the colonists were ill prepared, after a life in the English countryside, ala Wind in the Willows, for the challenges of harvesting before winter, surviving 'til spring, in their magnificent New World.In neighborhoods where Anglos and Navams got along, the theme was fellowship and mutual enjoyment of the fruits of one's labor, and, overwhelmingly greater, the generosity of Nature herself, to those who respect her.Yes, Navams were romanticized, [then as now](http://worldgame.blogspot.com/2004/11/thanksgiving-for-dummies.html), as the early pioneers of American cultures. They'd had many generations to get it right, through trial and error, through encoding their findings, before those colonists arrived from over the Atlantic.Other immigrants didn't respect the Navams much and assumed all along the challenge was to just get rid of 'em or, failing that, to pen them inside of demarcated areas, cut off from adjacent lands, there to be forgotten, neglected. Of course this strategy was doomed on many levels, but did spawn a large bureaucracy and lots of map drawing.Today, in 2006, many of the original nations have reconstituted sufficiently to set up self-sustaining businesses, casinos in particular, in some cases as stepping stones to further ventures. For example, in the State of Oregon we have the Confederated Tribes of the Grande Ronde and its[ Spirit Mountain](http://www.spirit-mountain.com/) casino, a funds-generator for [many worthy causes](http://mathforum.org/kb/message.jspa?messageID=5386609&tstart=0), including grants to [OMSI](http://www.omsi.org/), our science museum.Further north, in the State of Washington, in Stillaguamish country where I'm writing this, the [Angel of the Winds](http://www.angelofthewinds.com/) casino performs similar community service, helping to revitalize both the tribe, and the surrounding ecosystem (a large percentage of the profit is earmarked for [wild salmon](http://worldgame.blogspot.com/2004/12/nehalem-watershed-wanderers-meeting.html) restoration).Thanksgiving is a time to take some time off to just celebrate what we already [have](http://www.grunch.net/synergetics/gst1.html) (so many treasures) versus what we still have ahead of us, both to be and to do.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}