{
  "id": "439391778453892566",
  "title": "Morning Coffee with Kirby",
  "published": "2023-07-12T10:35:00.002-07:00",
  "updated": "2023-07-13T13:04:38.449-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52223273879/in/album-72177720300617518/)\n\nDuring the 2020 presidential election, my line on social media was I personally liked Tulsi Gabbard and saw lots of presidential qualities, but more in a storybook fairy tale sense.  Tulsi as Little Mermaid.  \n\nI would go on to say we needed a mafia in the White House (note lowercase, as in one of many) because presidents are at a place where \"the rule of law\" runs into limits, where storybook views start to crumble. That's how we talk about \"black holes\" too:  the laws of physics tend to \"break down\" yet we're obviously still curious about what goes on in them.\n\nSo here, \"laws of physics\" is a metaphor for \"laws on the books\" whereas inside the White House, all kinds of \"against the law\" and/or \"above the law\" planning goes on, often because no laws yet chart the territory the White House has to navigate.  \n\nThe law is based on precedent, argument before judges, debate, and takes time to distill.  The real world, on the other hand, \"waits for no man\".\n\nSo my view was the Little Mermaid (is she really that little?) aka Tulsi was \"too straight of an arrow\" whereas the office calls for someone more bent and twisted (crooked), more pathological in some ways.  \n\nHow could one be commander in chief of Pentagon types, who rotate into domestic policing, if one is simultaneously a crusader against all forms of corruption?  JFK was at least smart enough to appoint his bro as attorney general and let the latter typify \"moral virtue\" by going after the mob.\n\nLets talk more about cocaine, a very popular upper among the upper classes, as the stuff is expensive.  I followed Lt. Colonel Prouty's logic on that topic.  \n\nOf course NORAD knows a lot of those small planes are carrying the stuff, said Prouty.  During the undeclared war against Nicaragua's Sandinistas, the Contras were smuggling the stuff to make money, and to fight for a cause close to the heart of many in the executive branch (West Wing types).  \n\nMaking wars self funding keeps them off the books and away from public-congressional scrutiny.  Just keep the air force from going on some crusade to cut the small aircraft supply system, and the warriors will self fund and fight in a quasi-autonomous fashion.\n\nThe stereotype the corporate media seeks to encourage is that drugs come into the Lower48 by means of pedestrians making illegal border crossings.  Sure, that happens, no question.  \n\nBut what about those airplanes making a beeline for Arkansas or somewhere else more inland?  Lets talk historically as well.  How does this circuitry all work?\n\nSpeaking of stereotypes, the movies show us Wall Street casino math types, with high expense accounts and lots of money to manage, lots of bonuses to win, needing cocaine as a job-related substance.  Much as jazz musicians smoke weed (stereotypically), your average Wall Street genius has to be in the mood to take risks, and cocaine is a mood enhancer / inducer.  \n\nThe donor class wouldn't be what it is if it wasn't for all that smuggled powder.  \n\nThe White House, aware of Wall Street, aware of the DEA and DoD, has to mediate what might be construed as conflicting interests.  Wall Street perpetuates Dulles Brothers practices at some level.  Giant corporations don't turn on a dime.\n\nThe public wants scandal and righteous rage to keep it fired up and so has an appetite for finding cracks in the facade, through which the upper class is glimpsed operating \"above the law\".  \n\nFrom the point of view of the courageous hero risk-taker, fighting communism, terrorism, authoritarianism i.e. whomever are the bad guys du jour, dealing in controlled substances is another cost of doing vital business, in defense of the country, i.e. in the name of national security.\n\nSpeaking for myself, I work to steer clear of Victorian teacuppy \"soccer mom\" and/or \"leaf-blower dad\" morality and not be shocked or scandalized by predictable patterns.  I'll play devil's advocate for the so-called corrupt some of the time.  \n\nProhibition comes to mind.  I imagine myself angry with the government for taking away a freedom.  I'd be a classic criminal back then, frequenting the speakeasies.  \n\nI'd be a criminal now if I weren't in Oregon, or other state where possession of many controlled substances has been legalized.  I'm free to accept weed as a gift, and have zero guilt about it.  Yet my critics will insist that I'm guilty, and should hang my head in shame therefore.\n\nSo am I saying I'd also be open to people gifting me with cocaine?  \n\nActually no, I'd rather not be involved with this substance (meth either) but I'm approaching that question from the point of view of medical science.  I don't want to get hooked on, and/or get others hooked on, a substance with those particular risks and side effects.  That's not my cup of tea.  I tried the stuff once or twice, decades ago.  It wasn't for me (nor was oxy).\n\nWhat I dream about are specific Coffee Shops that operate openly as places you can try various potions, poisons, concoctions, other toxins.  Yes, they're modeled on opium dens to some extent, but they're not clones of one another either.\n\nThose operating these establishments are well trained (in theory at least) and psychologically attuned to the needs and wants of their customers, but they're also up on medical science (as are most customers, some in medical fields).  \n\nThese coffee shops may be like a health club in being membership based, and like bars in exercising their rights to eighty-six specific people (bar access), based on their track record.  Like a video rental shop (remember those?), they may have a record of customer orders (as do the streaming services).  They may be highly regulated.\n\nIf you're the kind of cowboy who jacks up on some substance, then starts brawls on a regular basis, don't be too amazed if your membership fob (or key) stops opening doors at specific establishments.  Operators have the right to ban access, just as they have the right to ban firearms on private premises (like hotels), perhaps checked into a safe or locker (retrieve when you check out).\n\nWas I saying above that I was personally supportive of the Contras and/or encouraged cocaine smuggling and money laundering through whatever banks?  Not really.  I was busy doing my research and learning about my world back then, and so I learned about these patterns.  \n\nI'm also aware that big pharma has contracts with many militias, to provide legal prescription drugs (the ones they push) in place of substances trafficked by unauthorized gangs.  \n\nSome gangs get authorized, to push Oxycontin for example.  The upper classes and organized crime merge into one big cloud once you go high enough.  \n\nThat's more my point:  I don't see law abiding philosopher kings running human affairs so much as crime bosses (e.g. presidents) operating in a more ad hoc manner, making it up more as they go along.\n\nThe morally outraged tend to want jail for everyone (\"lock her up\";  \"lock him up\";  \"lock them up\").  When they see a president's son being treated with leniency for a profligate lifestyle, which many of them envy, their reflex is to demand \"equality before the law\" and demand prison time for said offspring.  \n\nHowever, it would be just as logically consistent to demand everyone living similarly profligate lifestyles be treated with more leniency.  Treat us all more like presidential offspring why not?  The founding fathers might've liked that better.  Let freedom ring.\n\nHave the net outflow from prisons increase, versus increasing the net inflow.  Tell the truth about what's happening, but don't spin the truth to create a feeding frenzy among those seeking vengeful justice through punishment.  \n\nIt'll be a lot easier to get more of the truth out once we subtract a lot of the righteous moralizing.  Lower48 might learn a thing or two from South Africa on that score.\n\nAm I saying I favored that pardon for Lt. Col. Oliver North, in no way as sharp or clued in as Lt. Col. Prouty?  At this point I'm content to remind readers he needed a pardon, whereas no pardon has been issued for the perpetrators of the Nord Stream sabotage, an act of extreme vandalism and an expression of a juvenile psychology.  \n\nMy profile of a Nord Stream saboteur, at the planning level, is someone lacking even a high school education, but then I've taken it upon myself to redefine what that means.  Concentric hierarchy anyone?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}