{
  "id": "4243053153499841734",
  "title": "Murder Mystery",
  "published": "2013-06-02T21:00:00.000-07:00",
  "updated": "2016-11-10T18:07:19.386-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/30266806843/in/dateposted-public/)\n\nThe Kennedy Era comes into different focus as [the generations fly by](http://controlroom.blogspot.com/2006/10/american-pop-movie-review.html).  Peter Janney has done a lot of groundbreaking legwork for [this book](http://www.amazon.com/Marys-Mosaic-Conspiracy-Kennedy-ebook/dp/B007IVBH42/), including digging up and reacquainting people with a cast that has mostly exited by now.  In some cases he's finishing work [others started](http://mybizmo.blogspot.com/2010/05/cold-war-operations.html).  As an investigator he tells his story with great proficiency as I am guessing Seymour Hersh would agree.\n\nI see a few names I know in the book, going back to times in Washington / Georgetown and [friendships](http://mybizmo.blogspot.com/2009/12/scholarly-christmas.html) stemming from my deep dive into Fuller School Lit.  Plus I've done some reading in the Kennedy Conspiracy bookshelf, of course taking in the Oliver Stone film.\n\nIn particular I've studied the writings of Col. Fletcher Prouty and bought his CD.  Prouty talks a lot about [the U2 incident](http://worldgame.blogspot.com/2009/02/u2.html) which Janney casts as the CIA engineering its own downfall for some reason.  To derail a peace conference?  That's the story.\n\nEisenhower was suddenly on the defensive, with Gary Powers on Russian TV.  [Allen Dulles](http://prouty.org/dulles.html) didn't seem so in control of the situation either and really needed that \"shot down\" coverup lest he be seen as [outmaneuvered](http://controlroom.blogspot.com/2016/10/emerging-cyberia.html).  He needed to boss the Warren Commission as well, more the outsider than the insider on some days, but loyal to what was obviously the official line.\n\nThe whole business of violating the USSR's territorial integrity was creating blow back.  The Cold War would continue, with no peace while one superpower acted like it owned the place and lorded over the other.  People push back in the face of insecurity.  Proxy wars would be waged while [a \"Third World\"](http://mybizmo.blogspot.com/2009/07/2nd-life-2nd-world.html) struggled to step away, not get sucked in on either side (more like Switzerland). \n\nProuty also focuses on the Kennedy assassination, but from the point of view of someone more connected to the mixing of American and Southeast Asian intelligence.  He makes it clear that [Hanoi Jane](http://mybizmo.blogspot.com/2005/10/hotel-oregon.html) was not the first to find these people poetic.  The OSS (called the OS by Janney) had some serious admirers of Ho, an ally against Japanese imperialism in those days.\n\nThe foreign policy whereby Vietnam would be handed back to the French and colonialism continued was not the way every school was thinking it should go, especially among America's elite Asia-philes.  [Enlisting Nazis](http://mybizmo.blogspot.com/2009/11/into-fire-movie-review.html) to fight the Soviets was likewise not a universally popular move.  Truman came to distrust the CIA as much as anyone, as Janney makes clear.\n\nA key passage in Janney's book is where he portrays JFK as deeply upset upon learning of Ngo Dinh Diem being murdered, with [Robert McNamara](http://controlroom.blogspot.com/2009/07/slowing-down.html) the source.  This scene should be contrasted with [A.J. Langguth's account](http://books.google.com/books?id=vQorBRYyu_gC&pg=PA245&lpg=PA245#v=onepage&q&f=false) in Our Vietnam: The War 1954-1975 wherein Gen. Lansdale, ever hopeful of returning to Vietnam, maybe serving as ambassador there, was brought before JFK earlier as perhaps a candidate to orchestrate Diem's demise.  It's not like the Kennedys were any less capable of plotting murders (Lansdale either), or at least wishing for them to happen.  Dragon tears for a fellow Catholic? Lansdale said no, Diem was his friend.\n\nProuty does not claim Diem's murder was according to plan -- on the contrary, he was supposed to fly to Belgrade that day and got as far as the airplane before turning back, perhaps realizing a coup was likely in his absence and not wanting to face that outcome?  Gen. Krulak's Pentagon office, where Prouty worked, had everything to do with that planning.  Prouty was sent to Antarctica as a military escort shortly thereafter, while JFK went to Dealey Plaza.\n\nMcNamara in this scene is livid with Lansdale afterwards when the latter declines such a mission and charge from his commander in chief.  The Secretary of Defense (coming over from Ford) [hisses](http://mybizmo.blogspot.com/2009/10/apocalypse-africa-movie-review.html) that no one should deny and defy a president (top boss) like that, his survival instinct as middle management lashing out at a relatively quiet general who'd spent a lot of time in the Philippines already, where the US fancied itself the latest landlord in a series (Japanese earlier, with Americans before that -- this was Part 2 with [MacArthur](http://controlroom.blogspot.com/2011/11/fire-and-ice-korean-war-movie-review.html) in a starring role -- Spaniards before that (though they ate Magellan (my joke from when we lived in [Magallenes Village](http://controlroom.blogspot.com/2007/10/more-autobio.html))). \n\nLansdale's purported idea to scare Castro with the prospect of [a second coming](http://books.google.com/books?id=Lxs7w9U2-lcC&pg=PA83#v=onepage&q&f=false) (of Christ) also reads like a reminder of Catholic catechism (Colby was also Catholic).  But according to Helms [in Veil](http://4dsolutions.net/synergetica/veil.gif), Kennedy had other ideas, more prosaic, at least in the early days.  Johnson saw it [as \"Murder, Inc.\" ](http://mybizmo.blogspot.com/2006/08/blaming-castro.html)i.e. lots of people were getting snuffed or \"disappeared\".  Yes, that's the way it still was in the 1960s and I'm not saying it all stopped in the meantime.  The US had been a gang land all along, from the Streets of New York to Chicago to Vegas.  Organized crime is a serious power, when you make some of the most wanted things in life also illegal (or too scandalous to talk about in adult fashion with your polity).\n\nThe idea that a strong woman was fighting for JFK's soul, trying to \"hippify\" him, is highly believable.  CIA wives were trying to be a vector for a psychology sweeping the nation (universities especially), and that included using more psychedelics.  The conservative old codgers whom Ed Applewhite assured me made up the bulk of the CIA (akin to Ralph McGeehee's \"football players\" (Ralph had [been one](http://en.wikipedia.org/wiki/Ralph_McGehee))) would not be at all comfortable with JFK's hippification, and the military-industrial complex was indeed seeing dollar signs in endless proxy wars with a familiar ideological basis:  the defense of \"capitalism\" against \"commies\" (this was before the \"dot commies\" and \"[software libre](http://youtu.be/uFMMXRoSxnA)\" etc., which capitalism has embraced).\n\nThey (the industrialists) got more of what they thought they wanted with their man Johnson, a chance to try out napalm and other weapons.  As made clear in the book Human Smoke, the itch to try new weapons is almost irresistible.  War is a spectacle, it's theater.  Some people love it dearly, from the angle they get.  A grand sport (Hunger Games -- like that blockade against Germany).  A great game.  If life is a battlefield, then what's the alternative to loving your fate as a warrior?  These metaphors go back to [the Crusades](http://en.wikipedia.org/wiki/Sovereign_Military_Order_of_Malta) and are more than just metaphors -- people live by these credos, [good Christians](http://controlroom.blogspot.com/2013/05/spring-breakers-movie-review.html) included.\n\nProuty is clear that an underlying [pessimism and fatalism](http://www.grunch.net/synergetics/gst2.html) was acting as an invisible hand in this picture.  He quotes Buckminster Fuller as someone saying astute things in that regard.  [Applewhite ](http://mybizmo.blogspot.com/2005/02/ayatollah-of-tetrahedron.html)moved from Mockingbird to retirement to working on Synergetics, per Cosmic Fishing etc. Fuller would continue to write about the CIA (Capitalism's Invisible Army he calls it) right up through Grunch of Giants, mostly as a vector for post-WW2 business interests as inheriting from East India Tea (his own father was [a \"company man\"](http://www.crwflags.com/fotw/flags/gb-eic2.html) in that sense, i.e. in the tea business) -- to be followed by the age of networks and networking (the one we're still in, lots of Web foo).\n\nThese were [scary times](http://worldgame.blogspot.com/2011/10/another-october-maneuver.html) and the Kennedy brothers were fighting Irish, not afraid to make some serious enemies.  Having a president who seemed subject to blackmail depended on the sense of scandal that would erupt had the truth been known, about the trysts, the drug use.  The movie industry had yet to do much to crack the surface of \"[aristocratic lifestyles](http://controlroom.blogspot.com/2009/02/neverland-movie-review.html)\".  The public was believed to be too child-like, too puritan, too soft, to really face reality.  This seemed a theme in Hyde Park on Hudson ([movie](http://controlroom.blogspot.com/2012/12/a-heady-xmas.html)) also.\n\nI'm thinking that might be a fair assessment, but in retrospect we let ourselves see more and more, and it's actually a relief to get some of the misinformation out of the system.  Fuller's Critical Path seems an unbelievable fairy tale in some dimensions, as many in the West have a self congratulatory story about their ultimate victory in the Cold War.  Books like Janney's paint a somewhat different picture wherein Russian penetration was [more complete](http://controlroom.blogspot.com/2007/11/good-shepherd.html). Telling Americans what they want to hear makes 'em shop more (is better for business); they buy more Coke and Pepsi.  So why not pander to a thirst for more truth if they're ready -- and maybe put some coke back in Coke ([just a little](http://mybizmo.blogspot.com/2009/08/before-prohibition.html)) while we're at it?  Could be good television.\n\nAfter some years of pretty edgy TV, I think the general polity is more conditioned to look reality in the face, as [Chögyam Trungpa](http://en.wikipedia.org/wiki/Ch%C3%B6gyam_Trungpa) ardently advocated.  Looking at the Kennedy Era with the eyes of hindsight, there's a willingness to see \"that of God\" as the Quakers put it, in this cast of players upon the stage, on a Titanic in some ways.  This was a time of great turmoil and disappointments, with many killed in wars overseas, but also many in outright [urban warfare](http://mybizmo.blogspot.com/2009/11/murder-of-fred-hampton-movie-review.html) in the USA's own meaner streets.  \"[America eats its young](http://mybizmo.blogspot.com/2009/06/music-scene.html)\" -- sometimes it's well to see it that way.\n\nI'd like to dial back to the scene where [Rufus Jones](http://worldgame.blogspot.com/2013/03/from-afsc-corporation-meeting.html) is saying something positive about [Cord Meyer](https://www.flickr.com/photos/afscportland/15310633088/).  What was it about World Federalism that failed to stand up under pressure?  There are more routes and trail heads to explore here, thanks to this new groundbreaking.\n\nOf course a lot has to do with archives that are independently managed, estate affairs.  Historians don't get made privy to everything.  People have secrets.  However it may be a cowardly thing [to keep too many](http://www.azlyrics.com/lyrics/alanparsonsproject/eyeinthesky.html) and Janney is bold about lashing out, being harsh with the dead even.  He sculpts himself as a character for future scholars, and [enters the drama](http://www.huffingtonpost.com/2012/04/19/mary-pinchot-meyer-jfk-mistress-assassinated_n_1434191.html) himself, not only an investigator, but an affected individual who also had sincere love for the murder victim (as Jack Kennedy did).  He wants to be remembered in that light as well.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}