{
  "id": "2189290596315946629",
  "title": "My Comment on QuakerQuaker",
  "published": "2015-10-04T14:31:00.001-07:00",
  "updated": "2015-10-18T12:07:21.423-07:00",
  "content": "Yeah,\n it's hard to not get cynical about religion once one sees how it's \nharnessed by the temporal powers to their own ends.  [Emperor Constantine](http://controlroom.blogspot.com/2013/12/twelve-years-of-slavery-movie-review.html)\n learned his lesson:  if you can't beat 'em, join 'em, i.e make the \nRoman Empire officially Christian and you'll have the tools to keep \ngrowing.  \n\nMass produce Christian baubles for the gift shops, and\n the faithful will follow you blindly, as their \"blind faith\" (so very \nsimilar to blind loyalty to one's King) is built right in as a virtue, \nat least in the more decadent brands of pyramid scheme hierarchy.  \n\nObedience, not defiance, is what to cultivate in the masses.  Any religion able to do that is worth more than gold.  \n\nReligion\n is used to create that state of reverence and solemnity, gravitas.  The\n Cross gets planted on some South American beachhead, and voila, miracle\n of miracles, this is now Papal Property.  Amazing.  It's downright \nBiblical!\n\nUnfortunately for emperors and dictators, crime bosses \nof all kinds, Christianity is not quite tame enough to support a Borg \nCube forever.  Whereas most humans seem eager to the point of desperate \nto surrender their free will to experts, professionals, pundits of all \nstripes, a tiny minority seems hell bent on doing its own thinking.  \nIrreverent Quakers pop up, questioning authority, refusing oaths of \nloyalty.  WTF!?  Where does the operator's manual say how to deal with \nQuakers?\n\nAs a result of such obstreperousness, micro-fractures \nemerge, and every so often, we get a meltdown, like the 100 years war \ntwixt Catholics and Protestants [exemplary of a \"meltdown\" not saying Quaker caused -- KTU ].  Or the Civil War in the US.  Or maybe \neven something good happens.  A shakeup in world religions might be just\n what the doctor ordered.\n\nFor whatever reason our species refuses\n to settle into any one Kingdom or Reich.  I consider this hopeful and \npositive.  The Tower of Babel is maybe my favorite Bible story.  Silly \nhumans, thinking they could create One System to Rule Them All.  Ain't \ngonna happen.\n\nThanks to some divine spark within common humanity,\n the peasants, handed a gun and a picture of their God, sometimes \ndisobey their \"superiors\" and refuse to kill the enemy, seeing through \nthe manipulation.  They see The Man behind the curtain, and, like \nSmedley \"Fighting Quaker\" Butler say out loud that [War is a Racket](http://worldgame.blogspot.com/2011/10/esozone-talk.html).\n\nHowever,\n to see religion as a tool of social control is not to see the falsity \nof all religion.  Cynicism of that variety is simply too easy.\n\nRather,\n the many religions and psychologies, not to mention philosophies, do \nindeed give us insights into something both collective and transcendent \nabout the individual human mind.  \n\nOne could simply say \"religion is the power of God's mind combined with\n the human being's endless ability to distort it\".  The idea that \nhumanity is simply a distorted image of what true angels must be like is an\n old one and I think I'll land it there for now -- a friendly / familiar\n airport.\n\n[original context:  [comment](http://www.quakerquaker.org/profiles/blog/show?id=2360685%3ABlogPost%3A137344&commentId=2360685%3AComment%3A137639) re So What's So Terrifying About Christianity? ]",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}