{
  "id": "2986225176609868544",
  "title": "My Pipeline",
  "published": "2025-02-17T21:16:00.000-08:00",
  "updated": "2025-02-17T21:16:15.398-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/54335161238/in/dateposted/)\nI just ate some popcorn. Glenn Stockton introduced me to the silicone popper genre, goes in the microwave. Two minutes is enough in mine. I use corn oil at the bottom, where the kernels get to explode.By “my pipeline” (blog post title) I mean a sequence of steps or transformations, in this case going from a computer programmed framework, to a scene description language, to a rendering engine, to picture files (png format) to animated gif (with additional tools needed to accomplish that transformation).\n\nThat’s what I’m talking about in the above Facebook post, snipped for my Flickr Photostream scrapbook. My framework makes use of sympy, allowing me to keep computations algebraic until I’m ready to write out to scene description language, at which point actual numbers are needed. You don’t want to say (sqrt(5)+1)/2 or phi, or 𝞍 or whatever, you want to say 1.618, maybe with a few more optional digits.\n\nThis use of the word “pipeline” is pretty standard. For example in data science we think of a pipeline starting from whatever gathered raw data, through a sequence of cleaning, rectification and normalization steps, in preparation for feeding some idol, who spits out the magic flutes.\n\nWoah! WTF? Data science doesn’t have any magic flutes! What perversity am I spewing?I’m referring to the matrix of weights computed during training phase, of a working model, a multi-layer neural net. Once steeped in terabytes of data you get an object that’s lean and mean, might fit in a phone, and that has prophetic properties.When I say “prophetic” you might think back to Thomas Paine and his thesis that being prophetic has everything to do with knowing how to generate music, and not just any music, but trending, viral music, already in alignment with the Zeitgeist. In that sense, prophecies do often tend to be self fulfilling in that they give expression to what people are thinking but can’t quite get into rhyme.A chatbot is “prophetic” in the sense that it strives to be predictive of what the most articulate and acculturated would likely say, given some initial momentum, a direction in Hilbert Space, by the prompt, the impetus input. From there, the magic flute takes over and plays what sounds like music to our ears. If you find yourself nodding along in agreement, even humming the same hum, that means you’re finding the music credible, and so the magic flute has done its job. Or call it a mind reader, wherein here “mind” potentially means the collective verbiage, the universe of discourse, of an entire civilization, distilled to weights.Another pipeline has to do with Hubble, or these days JWST, which instruments beam back lots of raw data that has to go through signal processing, various kinds of filtering, before most prepared for the human eye. Our own neural nets absorb the info and thereby accrete awareness of the cosmos.I just add yeast and salt to the popcorn sometimes, like tonight. No need for melted butter. The initial oil pool is sufficient when it comes to adding lipidity. [](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgMu3q04XbCALSDbiyPK43c-ayfCdUGxee0WhZ_6eW5idO_-AZkXugFdWLzLApdHsBbJyzhrJJujZfwtWF8N7-33-Rf_fDHw0Str_7A6UgXIP4dXbrteWp8ANjq-PCFNDchMuTnF2NWA6s-JXA674Lh3dzel1BeEjYeLRK2U8FyH6NQoo4Q0or7/s1669/54335371895_0392c29715_o.jpeg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}