{
  "id": "7226087038873762707",
  "title": "Mycology Festival",
  "published": "2014-10-19T20:03:00.002-07:00",
  "updated": "2014-10-23T12:49:49.600-07:00",
  "content": "I'm super-uninformed about the fungal inhabitants of Planet Earth, in terms of their names and ecosystem niches.  That doesn't mean I don't find them fascinating.  Given Christine is a professional photographer of same, i.e. makes a part of her living selling beautiful pictures of these guys, I was happy to use that as an excuse to pay a visit to Miller Hall, a part of the World Forestry complex near to the Oregon Zoo (shares a parking lot).\n\nIndeed, parking can be a problem in that lot, so if you're a tourist or smart Portlander, consider parking below in Goose Hollow or nearby and visit Goose Hollow Inn for some fine local fare (I had Country Boy IPA).  Then hop the Max for one stop and study the quirky yet excellent timeline made from a core sample drilled as a prelude to carving this deep tunnel Max station into hard rock.  The elevators will take you hundreds of feet, to the surface.\n\nPatrick, a co-worker, was on an independent health hike from Asylum District to the zoo.  I used my Max ticket to revisit Goose Hollow Inn to meet him for some Sunday [Headless Chickens](http://worldgame.blogspot.com/2007/06/nightmare-alley-movie-review.html) (Bloody Marys).  We rejoined the Mycology Festival and I sampled yet more of the exquisite shroom-based miso the Culinary Institute was serving.\n\nThe Pacific Northwest is haven to a large number of fungal species, so no wonder you have a legion of shroom-heads out here.  The festival was well attended.  Hugely knowledgeable experts were on hand, to identify specimens and give advice to hunters and collectors.  Again, I'm quite on the fringe of this subculture, but I appreciate the well-organized event.  The [white square](https://squareup.com/) worked fine when swiping my card.  Encouraging.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}