{
  "id": "6208454877114365333",
  "title": "N8V American",
  "published": "2017-03-26T18:30:00.001-07:00",
  "updated": "2017-03-26T23:33:48.727-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/33608752816/in/dateposted-public/)\n\nThe Indian Wars are cranking up again, with the Yanqui drive to nail down the borders once and for all. Reclassifying Latinos, from Hispanic to Native American, is not exactly what's going on, as many Pueblo are happy with \"Pueblo\" and don't need to care what's put on the check boxes.\n\n[The US president's visit](http://time.com/4699849/donald-trump-andrew-jackson-grave/) to the tomb of Andrew Jackson was a signal to the General Custer types to become more militant about reporting when indigenous folk might be migrating in violation of Ranger rules. Incarceration is the big industry, next to human trafficking.  Bounty hunters keep queuing at Information, asking when and where to saddle up.\n\nI've been suggesting our Third Party (we could call it that) get advisers among the Born Free (or Free Born) of South Africa, those emerging from a post-Apartheid zone. A spirit of \"not waiting for the government to do it\" should warm the hearts of church-going citizens, eager to return social services to the pastor class.  Does your Meeting get hip hop yet?\n\nQuakers were never fans of the Indian Wars, preferring to do business among equals and profit all around. They were already heavy [into negotiations](http://mybizmo.blogspot.com/2008/07/some-quaker-pr.html) with the locals when [the Indian Wars were declared](http://worldgame.blogspot.com/2009/09/catholic-analysis.html), and briefly pressed into service afterwards, as minions in charge of Boarding Schools. [AFSC got an earful](http://worldgame.blogspot.com/2013/03/from-afsc-corporation-meeting.html) that year in Philadelphia, when I was a corporate delegate from NPYM.\n\nI just got off the phone with Maureen Long. She's a part of the [extended Methodist community](http://worldgame.blogspot.com/2005/02/methodist-morning.html) around Portland and so of course knows Pat, who thought I'd be female when we met, based on my name Kirby (she's a she). I'll join one of their Wednesday feedings at [Ghost Church](http://worldgame.blogspot.com/2016/06/ghost-church.html) (what I call it) in Sunnyside, when Maureen gets over her \"case of the time zones\" (she's recently back from west Thailand, visiting a son).\n\nMy Third Party, just revving its engines (no candidates yet, more like a record label) cares a lot about voting technology, wants a lot more openness, a lot like the California's Pirate Party, a natural ally.\n\nWe care all year around about polling and voting infrastructure and agitate to let US public schools feature said technology as a part of what students learn about and understand. Where are the museums about [Vote Tech](http://www.linux-magazine.com/Issues/2017/194/Welcome)?\n\nAll the more reason to keep it open source.\n\nQuakers tend to use consensus in Business Meeting however that only works when clerks have done sufficient homework ahead of time to smooth a path ahead for whatever minutes.  The process is time-consuming and we call ourselves Friends for a reason. Come role play and discover your own talents.\n\nThat being said, among strangers or ships in the night, one expects a different system. Voting has its place, as does polling, and the infrastructure is progressing with leaps and bounds, given WiFi and encryption. Universities don't need to wait for governments to give their student bodies more practice. \n\nClosed source elections with no audit trails have far less legitimacy, and contribute to the Banana Republic quotient, now skyrocketing in North America.\n\nOur Third Party gains an edge simply by pointing to the sullied reputations of the colluding parties, which have aided and abetted, not to mention covered up, the dirty tricks in some cases.  With nothing to lose, we have everything to gain.\n\nSure, universities here in North America might have some stake in more transparent elections, but don't they depend on the largess of Congress in many districts? How eager is Congress to invite more transparency in the electoral process I wonder?  Do we see any signs of [dawning awareness](http://www.linux-magazine.com/Issues/2017/194/Welcome) yet?\n\nSouth Africa, home of [Chappie](http://worldgame.blogspot.com/2015/03/chappie-movie-review.html) and Die Antwoord is more liberal about sharing the bash shell with more ethnic groups, through [Shuttleworth Foundation tuXLabs](https://tectonic.co.za/?p=534) and so on. North Americans still suffer under the tyranny of TI.\n\nI focus on these more liberal policies in my recent [Is Code School the New High School?](https://medium.com/@kirbyurner/is-code-school-the-new-high-school-30a8874170b), which looks at all these connections in more detail.\n\nOn another topic, just to clarify: \"[Project Truckistan](http://worldgame.blogspot.com/2017/02/trucking-again.html)\" is about more open borders for truck drivers, not just in terms of fewer mandatory check stops along the lanes, but in terms of getting to exchange truck routes more readily.\n\nGet good in Ukraine and South Africa both. Give labor (work-study people) the freedom to move, not just their pseudo-human corporate employers. Cross-trained truckers might also serve as tour guides, two revolving door careers.\n\nTrue, not everyone drives on the same side of the road, nor in all weather conditions. I was not suggesting dispatching drivers purely randomly was I?  Transcripts matter.\n\nThe trucking issue comes up around truck routes in the Americas as well.  How long must trucks sit in line waiting at borders or weigh stations?  People tend to favor a policy of keeping the borders open between states in Lower48.  Other regions of the world would like more of that freedom too.\n\nWe may need big data to help us on the metrics, and universities like MIT, or that one in Austin. I've not put any Jupyter Notebooks out on that myself, with or without [Bokeh](http://bokeh.pydata.org/en/latest/). Perhaps the Google Earth team will show some leadership in this area?  We shall see.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}