{
  "id": "885377897283562576",
  "title": "National Pride Day",
  "published": "2023-12-03T07:59:00.000-08:00",
  "updated": "2023-12-16T18:36:55.985-08:00",
  "content": "A question is what we want from our nations. Job security? A marked grave? A criminal record?  As a first approximation, lets ask what we might get from somewhere else. In what aspects of life do nations have any competition?\n\nA religious order is the chief analog of the state it would seem, in having the power to assign rank to members, assign them tasks, insure their well-being in various dimensions, and mark their graves. \n\nIf we claim Israel is an apartheid state, then is the Vatican any less so? It’s walled-around after all. \n\nOne question is whether rank has a basis in immutable physiognomic characteristics, such as skin color. Does an apartheid state have to be racist by definition? Might the barriers be entirely class based while blind to physiognomy?\n\nThe Vatican does not espouse dogmas regarding racially based ranking to my knowledge, but did it ever? I’ve not done much digging into whether white supremacy, for example, found much foothold in the daily sermons and catechisms shared with noobs. I’ll need to explore in the Museum of PR some more if I want to find out.\n\nWhat I do know something about (if not a lot) is how organized religion provided ammo for supremacists of various stripes.\n\nLets remember how “supremacist” is close to “chauvinist” in meaning, and to be “chauvinist regarding X” is to “take pride in one’s Xness”. However no transitive law insists on equivalence here. One may take pride in X without claiming X is best. X and Y might be equally good, but what’s considered virtuous and natural is to be proud of what one is. Root for the home team: that’s your job and your mission.\n\nWhich brings us back to nations, “patriotic” being close to both “chauvinistic” and “proud of”. In Achieving Our Country, author Rorty takes “hating one’s country” as a kind of “self hate” which as such is pathological, where “achieving our country” might mean healing or overcoming this complex.  How might one “fight for one’s country” without any sense of cognitive dissonance?  I’ll get back to that.\n\nMy closing question for this entry (not really) is: what other institutions might we imagine that could provide us what nations provide, outside of organized religion? Consider the university for example. Imagine a global university consisting of a network of campuses, with students and faculty free to transit from campus to campus without bothering the nation-states i.e. these movements would not concern them.\n\nBefore you reflexively express skepticism regarding this alien idea, ask yourself whether every troop deployed by the Pentagon has a visa i.e. permission from the bureaucracy claiming jurisdiction over the territory. Do US troops in Guantanamo have “red cards” from the Cuban government, permitting open-ended stay on the island?\n\nLots of times, a corporation will ensure job security (a playable role) and creature comforts (including the necessary minimums: privacy, sanitation, opportunities to stay healthy, mentally and physically). Through your employment, you get a gym membership, health insurance (guaranteed access), a cubicle, pod, and dorm, cafeteria, meeting rooms, a travel budget. Do you need a state at all? How do rich people achieve statelessness to the point of paying zero taxes? Do corporations own graveyards? They certainly memorialize their dead.\n\nI was looking at the Las Vegas football stadium from the Goodyear blimp a couple nights ago, watching from an Asylum District sports bar, as the Oregon Ducks lost out to the Washington Huskies. That looks like a scale model of an Old Man River city (OMR) I was thinking. The new MSG Sphere aka “EyeBall” was visible in the distance as well.\n\nWhat if Boeing or the like could do an aerospace version for delivery on demand? A spanking new campus, with terraced apartments, transportation, and with rail to an airstrip. The stadium-shaped city would be big enough to host a stadium.\n\nWe don’t build on that scale now, unless you count whole cities as singular projects, which we’re free to. NYC is a campus, with ancient infrastructure. So is Portland. One of our main bridges is sitting on wood pylons in hard mud subject to liquefaction under earthquake conditions. We’ll be closing that bridge and replacing those pylons with metal ones that go deep enough to hit bedrock.\n\nMight a city have “a fuselage”? Not in today’s city planning yet and likely never. However I do expect more interpenetration of these shoptalks:  land-based construction and spacey-maritime. \n\nShall we test one (an OMR) near Yakutsk? That’s a big city in Siberia. I spent much of my morning on YouTube following travel vloggers to that area, just to remind myself of the challenges of permafrost.\n\nWhat would it take for a Stadium Campus City (SCC) or any city, to feed itself without over-plundering its surroundings, to the point of becoming untenable? I’m not sure the Mayans ever mastered these equations. \n\nA big part of the plan involves planning for recycling, of the skeleton itself, should the city become unneeded, or simply in need of a remodel.\n\nIn fighting for my country, I’m somewhat careful with my “we”. I’m not too quick to ally myself with those having nuclear weapons for example, on the basis of shared citizenship alone. We the people of the United States do not necessarily own or claim to sponsor those nuclear inventories, and some of us fight to make sure we necessarily do not, unless in the capacity of safe disposers thereof, and recycling perhaps, but not in the form of WMDs. ‘\n\nI’m free, as a patriot, to explicitly disown properties I do not consider legitimately a part of my country’s inventory. “Who ordered these?” Not us. \n\nBut then others operate their virtual worlds differently, and maybe in their namespace, the USA is some last/only superpower. That position is then taken for granted by an ego (eggo) and becomes a symptom of what we call the “military-industrial complex” a deep-seated psycho-pathology president Eisenhower warned us about. Fighting to restore sanity to these poor citizens is part of the good fight. Obviously, my country contains its share of drug addicts and crazies. I’m proud of it anyway, the metaphysics.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}