{
  "id": "199757947776940289",
  "title": "National Beer Day",
  "published": "2016-04-07T16:25:00.001-07:00",
  "updated": "2016-12-15T19:22:20.765-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/26026809020/in/dateposted-public/)\n\nI wonder if CBS Evening News, Western Edition, will have picked up on the beer day meme.  So many memes, so little time (under 20 minutes, subtracting commercials, right?).  I just returned from Hop House where I met up with Glenn Stockton (Global Matrix) and Patrick Barton (Portland Energy Strategies).\n\nI picked up a Vortex magazine, somewhat ironically about the gentrification of the Portland scene (ironic because Vortex is so slick and glossy, and reminds us of the [government-sponsored rock concert](http://www.opb.org/television/programs/oregonexperience/segment/vortex-i/) set up in 1970, partly as a diversion to keep angry hippies away when Nixon came to Portland that time — I wasn't around anyway).\n\nOne good thing that happened while Nixon was president was those needing kidney dialysis were given a government dispensation and allowed to live, at least a little while longer, on the government taxpayer tab.\n\n[My friend Nick Consoletti](http://worldgame.blogspot.com/2012/05/twenty-one-guns.html), indigent, a wanderer, and a walking encyclopedia of useful cultural information (memes again) had his life prolonged by some months thanks to this Nixon Era program, which would likely go unfunded in today's climate.\n\nI saw our mutual friend Quinn, who organized the memorial service, running by Glenn and I (summit meeting) on Mt. Tabor.\n\nYes, Glenn wants to fire up more awareness of his Global Matrix meme and since he's all about global data displays, I thought:  what better project for the Global Data Corporation (GDC), a meme I've been using since the 1980s at least?\n\nGDC was not incorporated using \"white man law\" (in the Federal jurisdiction).  I guess we'd call it \"off shore\"?  Anyway, I added [a new Github subfolder](https://github.com/4dsolutions/GDC) about it this morning, containing some buried PR for Glenn's initiative.  Other PR is buried even more deeply.\n\nSpeaking of \"buried\", did you know the official word for where the urns are kept (containing ashes) is called a columbarium?  That's funny.  \"Bury 'em\" (an alternative way).  Given my first name, Kirby, is sometimes translated as \"Kirk By\" i.e. \"By the Kirk\" as in Churchyard (\"Kierkegaard\"), I sometimes say \"Kirby means cemetery\".  So then \"Urner\" sounds likewise funereal.  But it isn't.\n\nMore fitting with \"Urner\" is URI, or \"universal resource index\".  Some writers found that too pretentious or something and \"URL\" (as in \"Uncle URL\" — I had an Uncle Earl, married to Aunt Betty my grandma Margaret Reilley's husband) became more common.  Either way. the World Wide Web was invented in Switzerland (CERN) where the Canton of Uri is.  That's [where \"Urner\" comes from](http://worldgame.blogspot.com/2005/12/whats-urner.html) (Urner = person from Uri).\n\nSpeaking of Urner, Kirby, I'm a complete idiot sometimes.  Like today I was preoccupied thinking about who knows what (not me) and wandered away from the cash back I'd requested at the supermarket.  Those were the most expensive Diet Dr. Peppers I ever purchased. I also confessed on Facebook and publicly resolved to make it up by giving up beer for two weeks at least.  $5 / pint x 8, plus it'll actually be good for me.\n\nReally, I don't need to drink beer, which mainly contributes to my stupidity and waistline both.  An old theme in these blogs. I'd be better off savoring the memories.  Yes, the IPAs are really great here, one should definitely try one or two — and I have, many times.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}