{
  "id": "7512125504992276152",
  "title": "Necklace Theory",
  "published": "2010-02-17T21:37:00.000-08:00",
  "updated": "2010-02-18T16:50:39.570-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjJCMzyVOpbe-yvxUXDrKTyp_-owFQH_KZMO-l54P0vP01jrXegLHeYvy8v1-1NrDsCjy-r5lrBudVT4UzZ2hUBcyL_TOYffE3vfTJCpp8WqWFADHENKxU3McevcZkq7ysJx6ql/s1600-h/fungus.png)People glance in my cage and wonder what makes me so fanatical about [Polyhedra](http://mybizmo.blogspot.com/2009/05/show-me-polyhedra.html) and such.  What's this guy's problem.  Writing today:Regarding 60-degree coordination, we have this focus on the tetrahedron instead of the cube. In this case you find many published books, some coffee table arty, some on the web, magazine articles, web pages, Youtubes, other scholarship, and *still* it's almost impossible to get the time of day from busy (too busy) people.I'd say it's the Necklace Effect that I'm after, in that the 60-degree aesthetic forms a glue language, a rubric, like a string, with concentric hierarchy, octet truss, Fuller Projection, world game, geodesic domes, high tech eco-villages, healthier lifestyles... mom and apple pie, all beads on that string.Yes, I note the family resemblance to \"domino effect\", well exploited in [the movie Robots](http://worldgame.blogspot.com/2005/04/robots-movie-review.html).[The concentric hierarchy](http://mybizmo.blogspot.com/2009/12/another-rant.html) is the best bead to keep nudging, because it's so mathematically correct.  Those defending the bastions of rationality tend to close loopholes with hard logic, if any might be found.Or will they try to fake it?  Using some flavor of CS BS perhaps?  Is this about Computer Science versus [Neo-Platonism](http://mail.geneseo.edu/pipermail/math-thinking-l/2010-February/000621.html)?  Ghosts of Bourbaki?  What do the artists say?You'd think the intelligentsia might at least appreciate the marketing challenge.  Here's a fun puzzle for [you Madison Avenue types](http://worldgame.blogspot.com/2007/01/random-walking-in-ivm-fm.html).  Is this a \"too bitter a pill\" scenario?  What sugar might we coat it with?  The eye candy is already tops.Once in, we find the concentric hierarchy is a bastion of rationality in its own right, and worth defending.Then it's on to the adjacent bead, and so on down the line, like firecrackers going off.  Some kind of celebration?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}