{
  "id": "351281859593834821",
  "title": "Network Theories",
  "published": "2018-01-10T16:51:00.000-08:00",
  "updated": "2018-01-11T18:23:06.744-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/38925026084/in/dateposted-public/)\n\nSorry for the dry title folks.  I tire of the journalistic headline, today known as click bait. Lets keep it low key, yet warm to the topic, as network theories (lots of math) are both interesting in themselves, and have real world applications.\n\nJeff Goddard shared with Wanderers about his work for LittleBird, at one time a free-standing company, but with a tool that makes sense more as one in a suite, if you're a big company seeking to maximize the potential of social media.\n\nThe Twitter API has many powerful and unique attributes and is a great place to start.  We might think of LittleBird as living at the headwaters.\n\nSuppose I want to find the top most influential people around the topic of Climate Change.  Jeff ran that search for us, also Beer, Python, and a few others.  Terry Bristol, author of [Give Space My Love](https://www.amazon.com/Give-Space-My-Love-Intellectual/dp/0940530015), wondered how these search tools might help with book sales.  Jeff had some suggestions.\n\n[@DekeBridges](https://twitter.com/dekebridges) was there, asking good questions.  He's also the man behind [@LeadersBest](https://twitter.com/LeadersBest).  Deke is our most influential Wanderer by far, from the standpoint of Twitterverse.\n\nSo what is LittleBird? Jeff has poured in the hours, using Clojure and ClojureScript, to implement those network theories, or shall we say algorithms, to query Twitter through its API in high volume (more than a single developer account would afford, times ten thousand).\n\nThe information one obtains through the API is the same info tweeters agree to share by virtue of establishing a Twitter account.  \n\nIt's not like those using this \"back door\" have any special access to otherwise hidden data.  Rather, they have the ability to aggregate the data more successively (at higher volume), as a \"front door\" individual user, using human eyeballs, is like a 300 baud modem compared to a T1, relatively speaking, and using tech terms most will have forgotten by now.\n\nLittleBird was acquired by Sprinklr, adding to the tools brought to bear on behalf of clients seeking to manage their cyber-presence and/or media campaigns through this company. \n\nWe did a test run using \"Python\" as our topic and, sure enough, the tweeters percolating to the top were mostly people I recognized.  I showed up as influential regarding Python when we ran [@thekirbster](https://twitter.com/thekirbster) individually, but that doesn't mean I'd make it to the top thousand. \n\n[](https://www.flickr.com/photos/kirbyurner/38925028014/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}