{
  "id": "768409616740196188",
  "title": "Neuroscience",
  "published": "2017-11-05T09:25:00.002-08:00",
  "updated": "2017-11-05T10:26:47.995-08:00",
  "content": "Before I forget, it occurs to me that neuroscience might turn its attention towards \"scheduling\" soon, as in prioritizing, as well as not giving too much credence to improbable story lines.  Humans are easily led astray in some circumstances, but not that easily, if you give them some time to think about it.\n\nA lot of cultures give young people a chance to meditate.  We talk a lot about \"the service\" in many of the federated states in North America, while the various religions, even the mainstream ones, have no real expectation of having such barracks full of meditators as one might find in Thailand.\n\nWhat comes closest is a liberal arts college, but is that a luxury investment or albatross of debt or what?  Joining a religious order for some years and getting discipline in a schoolish setting, is not normative.  We call that \"joining a cult\" where I come from. \n\nA scheduler keeps a lot of pots bubbling and doesn't expect laws of physics to be circumvented. Planning is key.\n\nWe have the AI neural net recasting of linear algebra, with statistics now data science, with data now very big, so lets get them anticipating developments we might be able to stop or avoid.\n\nThis fatalism suggesting we all freeze in a panic and watch the ship sink is not necessarily the most useful.  Get your counsel from multiple sources, right?  White water rafting includes some steering, more in the Friendly sense of steer, meaning feedback loops can be non-obvious.\n\nGiving young people a shot at seeing the world while pondering deeply about a future direction, is the mark of a generous economy that feels able to invest in its own future.  A sinking ship economy is more inclined towards slavery for all.  No one gets the time to think about anything.\n\nActing out scheduling challenges in a kind of theater setting could be informative, a genre of animation maybe. Think of a traditional classroom wherein numerous students each need attention and help with a specific problem and two teachers roam among them, lending such assistance as they find practical.  That's all about scheduling and accommodation and to some extent triage (an algorithm designed to maximize health care worker effectiveness).\n\nComputer science with its many processes and threads (from the OS point of view), its many pipelines, parallel goings on, is about life in a big city.  Yes, things move insanely fast.  We always feel behind, and in the dark, to some degree.  As mortal beings, that's our lot.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}