{
  "id": "4464521077277012624",
  "title": "Neverland... (movie review)",
  "published": "2009-02-28T14:09:00.000-08:00",
  "updated": "2009-04-06T11:26:53.600-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjeOegUfDX-GARjdC74OsGZsFDWS_-yK-pwX4vk7JdLlBfpEi0cPlnU8JeQSTMXK1uXEqnYL_ejSfjfAmUw5HOjavbgjCj-OP8GdOm-Z2eHc9Pb2C0g2676AGBsNmk1RbNxXxuK/s1600-h/patti_hearst.jpg)I've had this [since NPYM 2008](http://mybizmo.blogspot.com/2008/07/more-explorations.html), a Netflix borrowing: Neverland: The Rise and Fall of the Symbionese Liberation Army about the abduction of [Patty Hearst](http://mybizmo.blogspot.com/2008/05/cry-baby-movie-review.html) and surrounding events.  What a slacker I must be, eh?  We tried playing it at Dave's just now, but it's either too scratched, or the format is just not backward compatible.Anyway, here I am waiting for Alexia to give some guidance on her birthday cake, just blocks from [Helen Bernhard](http://mybizmo.blogspot.com/2006/06/doing-nothing.html), a family favorite.  I've got the DVD playing in the background, determined to get through it this time, sipping a mocha.These were high achievers who couldn't follow the [post WWII logic](http://worldgame.blogspot.com/2009/02/u2.html), wherein the army that defeated Hitler now seemed to have come down with the same disease, akin to mad cow.  [The students](http://groups.google.com/group/bit.listserv.geodesic/msg/43fc36869b8cfebf?hl=en) went crazy, mirroring [Nixon's apoplexia](http://worldgame.blogspot.com/2005/01/assassination-of-richard-nixon-movie.html).[The nation](http://controlroom.blogspot.com/2006/10/us-versus-john-lennon-movie-review.html) was in turmoil.Having Nixon elected to a second term went down pretty hard.  [Paranoia ran high](http://mybizmo.blogspot.com/2009/02/enhancing-education.html) and the scene got to be [very 12 Monkeys](http://worldgame.blogspot.com/2007/01/solving-puzzles-in-algebra-city.html), crazy Brad Pitt their natural born leader.  SLA: \"White farmers in Rhodesia?\"Murdering Marcus Foster made no sense. Walter Cronkite's voice....I'm reminded of the turmoil reflected in Japanese student culture, [in this other movie that's fun](http://controlroom.blogspot.com/2006/02/mishima-life-in-four-chapters-movie.html), not a documentary though.Why is the audio so good?  Overdub?  Are the mikes really that good?  I like the spooky \"symbionese\" music -- sounds Middle Eastern.  Reporters yukked it up quite a bit, lots of booze at the crime scene, very Hunter S. Thompson.The [U2 and CIA](http://worldgame.blogspot.com/2009/02/u2.html) got involved.Mr. Hearst reminds me of William F. Buckley in some ways.  Patty's accent is also pretty upscale: \"Mom should get out of her black dress, that doesn't help at all.\"A drawback of DVDs like this is you don't have footnotes and sources clearly displayed (the captions help).  We need a new format that drives Web links on the side -- hit pause and follow.OK, management is kicking me out.  This coffee shop is not 24/7 after all.  Alexia called about her cake.  Marionberry cheesecake it is.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}