{
  "id": "8063289051973542383",
  "title": "New Views on RBF",
  "published": "2023-12-16T15:03:00.000-08:00",
  "updated": "2024-01-14T07:10:43.717-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/53401054082/in/datetaken/)\n\nGiven Stanford University agreed to acquire the Buckminster Fuller archives in the end, metonymically dubbed the Dymaxion Chronofile, it stands to reason that the Stanford University Press would produce an anthology entitled New Views on R. Buckminster Fuller (2009) drawing upon the content of said archive.\n\nI acquired a copy only recently and brought it along to Atlanta, for airplane reading and so on. I managed to get through the first two essays during the flight.\n\nHere’s a paragraph worthy of comment, by Barry M. Katz, boldface added:\n\nThere is no issue to which Bucky was more sensitive than that he had somehow \"failed\" -- as if this charge rekindled the feelings of self-doubt that were burned into his psyche in 1927.\" Thus his constant recitation of his complishments and his continual reimagining of his story. But if he was not a failure, neither was he a success by any reasonable measure or even by his own unreasonable one! Bucky's lifelong campaign was not to invent a new kind of house, car, or map. It was to use his \"anticipatory design science\" to complete what might be called \"the unfinished project of industrialism,\" and this he manifestly did not do.\" It is not enough to point to his collection of honorary doctorates or to three hundred thousand geodesic domes scattered about the globe, from the northern Greenland of NATO to the Moscow of Khrushchev and Nixon to the fairgrounds of Montreal's Expo 67 to the communes hidden away in the Santa Cruz mountains. An honest reckoning would have us ask why there are no domed communities in downtown Detroit or suburban Chicago; why Americans still drive to their neighborhood grocery stores in modified military assault vehicles rather than three-wheeled Dymaxion teardrops; and why \"Synergetics,\" rather than such parochial disciplines as mechanical engineering and economics, is not taught in our universities.\n\nYes, I’m being selective with my boldfacing, emphasizing what I call the “Poor Slob Bucky” meme. \n\nHe was purportedly not successful “by any reasonable measure” because humanity continued in its wasteful ways and the universities neglected his magnum opus.\n\nOn the contrary, I find it quite reasonable to conclude from his many achievements that he was one of the more successful human beings on record. Let’s not forget all the books and patents. He could sail and fly an airplane, He received many awards, including the Medal of Freedom.\n\nIs it Bucky’s fault that universities have yet to find a way to accommodate his somewhat difficult philosophical writings? They’d rather whine about his language, while having no problem continuing to teach Heidegger’s.\nSince these essays in 2009, Alec Nevala-Lee has combed through the same archive to flesh out a more complete biography: Inventor of the Future, The Visionary Life of Buckminster Fuller (2023). “He seems to have spoken to everyone living who had a personal or professional association with Fuller” ([Witold Rybczynski](https://www.nytimes.com/2022/08/02/books/review/nevala-lee-inventor-future.html), New York Times)  — not including me though, which is fine, as I thereby escape any guilt by association with this project. I gave it [a positive review](https://mybizmo.blogspot.com/2022/08/new-bucky-bio.html). I enjoyed the prescient connections to science fiction world, one in which Alec specializes.I had more interactions with Applewhite than with Bucky, and know Ed was pleased about the Stanford solution. He was pretty upset about the disposition of the archive in the previous chapter, immediately following Fuller's passing, when the underfunded BFI (Buckminster Fuller Institute) was attempting to manage the collection all on its own. A lot of Applewhite's curated materials ended up in the Fuller archive as well. He was an assiduous filer and cross referencer himself per his CIA background, as is proved by his Synergetics Dictionary (1986).What makes a big difference regarding our assessment of Bucky's success at predicting, which is what he claimed to be good at, is whether we connect [the open source revolution](https://worldgame.blogspot.com/2023/11/postmortem.html) (preceded by the PC revolution (PC = personal computer)) to his design science revolution. This is something CJ and I discussed quite a bit.I think we should identify Fuller's anticipated design science revolution with the open source one, given both were about creating artifacts, potentially useful to almost any type of ideologue. We see the life-advantaging qualities of the internet today, in every aspect of life.A next step would be to move into our new mass-assembled [computerize dwelling machines](https://mybizmo.blogspot.com/2023/12/january-sixth.html) as, in a sense, more smart devices ([per Education Automation](http://worldgame.blogspot.com/2008/05/squanderers.html)) and then to [open source bioengineering](https://controlroom.blogspot.com/2012/02/munching-on-medical-data.html) in a more concerted way. Keep watching trends. Fuller's contention was akin to Teilhard de Chardin's: that our success is driven by teleological concerns larger than any one ego, corporate psyche or national will.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}