{
  "id": "263587586021594470",
  "title": "New on the Job",
  "published": "2010-12-16T15:38:00.000-08:00",
  "updated": "2010-12-17T14:46:25.141-08:00",
  "content": "This feels like that first day [for Centers Network](http://worldgame.blogspot.com/2008/12/coffee-shops-network.html), getting balled out by a lower chief for forgetting the golf pencils.  Checker cab full of bankers boxes, straight from supplies.  Then to seminar setup.  Sometimes in the snow.  \"Damn, forgot the damn pencils\" forgetting to censor my own train of thought.  I had some between-jobs soap opera guys on my team as well, I'll call them fans.  They booed when Ron gave me a dressing down, stayed in my corner.The training today was well crafted.  I followed along on screen.  On other fronts, I was putting out fires.  But the main situation in my control room is mundane:  a leaky roof.  Pictures will be forthcoming but I must say I'm grateful for the break in the weather.  Patrick turned me on to some goop that appears to be just the ticket.  His sample had hardened to [onyx chewing gum](http://www.flickr.com/photos/17157315@N00/5267609063/), which is kind of the end state I'm aiming for, but [the new stuff](http://www.flickr.com/photos/17157315@N00/5269241047/in/photostream/), going on, is more like [thick cake frosting](http://www.flickr.com/photos/17157315@N00/5269241197/in/photostream/).  I went to town with this stuff. Like slag from some oil refinery, like where David was pulling night shift.At least the math teaching forums are being peaceful.  I sense a broadening consensus about where to go next.  People are getting used to their iStuff and are ready for more outdoorsy experiences.  Hiking and geocaching, camping and maintaining trails, look like a better bet than just lying on the couch all day with a diet coke shooting at pixels in high def.  Your thumbs get strong, hand-eye improves, but you're still not getting much exercise or team player skills (not counting your on-line buddies).It's not like they won't have video games at the school, twenty miles walking in.  You'll have other stops along the way too, complete with wifi and interesting activities.  This isn't about wasting a lot of your time, but on the other hand what are the skills?  Sometimes watching and waiting is one of them.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}