{
  "id": "7299608493609503761",
  "title": "New Thought",
  "published": "2008-06-17T17:06:00.001-07:00",
  "updated": "2011-02-05T00:43:46.469-08:00",
  "content": "One usually hears \"New Thought\" with reference to a series of evolutionary events in the recent history of contemporary religions.  The Unity Church network, related but different from [Unitarianism](http://worldgame.blogspot.com/2008/06/literary-investigation.html), has served as an avatar of this movement.A related meaning would be a more literal \"new way of thinking\" brought on by technological change.  In his [provocatively titled](http://worldgame.blogspot.com/2008/06/random-zine-covers.html) Is Google Making Us Stoopid? Nicholas Carr suggests something obvious:  that the Internet is changing the way we think.  We [think differently](http://worldgame.blogspot.com/2008/06/staying-weird-in-portland.html).  Dr. Vannevar Bush predicted as much in the 1940s (given this is Atlantic Monthly, avoiding all mention of [MEMEX](http://www.google.com/search?hl=en&q=+MEMEX) is part of the fun (or did I scan too quickly?)).He calls this a \"crazy quilt\" and I can see why, but then so much of what we had before was maddeningly [slow and plodding](http://controlroom.blogspot.com/2006/02/boosting-bandwidth.html), formulaic.  Once you've read that paragraph about clocks changing our sense of time a few times, it reduces to an ideogram.So many paragraphs have appeared before, reworded slightly, but known segues nonetheless.  We lose our taste for these displays of learning, as everyone seems to be purveying essentially the same product.Google lets us sift for the new, to find what really is different.  That takes work, and without competent search engines, we probably couldn't do all this work.So let's enjoy these new freedoms, even as we go back to reading whole books now and then -- once the authors come up with new content worth a \"[slow reading](http://schwitzsplinters.blogspot.com/2007/12/should-philosophy-be-read-slowly.html)\" treatment.That we endlessly recycle the same old ideas, hardly ever have new thoughts, is one of the disappointing truths that Google reveals.I liked the Nietzsche-at-a-typewriter image, [very Archy](http://www.donmarquis.com/archy/) in some ways. How many monkeys would it take, to write a superman comic book, to screw in a light bulb?Let's remember an important urban legend, [a fable](http://www.utdallas.edu/~liebowit/keys1.html) if you will:  that sometimes designers purposely dumb it down (no kidding), precisely to keep humans' thinking abilities in check.In building \"search\" into everyday thinking, adding to [AI](http://mybizmo.blogspot.com/2008/04/philosophy-posting.html) in this way, Google is helping the hardware to keep up with our very human (non-artificial) capabilities.  Go Google!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}