{
  "id": "3710360713054293775",
  "title": "News Room",
  "published": "2017-09-08T12:40:00.000-07:00",
  "updated": "2017-09-08T14:02:02.245-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/36964657141/in/dateposted-public/)\n\nWhat's amazing is how in a few decades, the personal workspace (PWS) \nhas evolved into a newsroom.  Instead of a few papers having these telex\n machine feeds, we get this blizzard of news reports, some half baked, \nothers slickly misleading, all ready for editing in the virtual studio.\n\nThe\n CSN CRO and I were checking out the Florida freeway system this \nmorning, using Google to suggest where the worst logjams are, then \npulling up stories.  How many freeways have committed all four lanes \nnorth?  Any concept of \"evacuation bus\"?  What's up with the trains?  \nWhy not commit railways to getting people out?  Insufficient rolling \nstock?\n\nHouston decided to hunker down, more than \nevacuate, yet more freeways fan out from that hub, going inland, then \nyou get leaving Florida.  The two sides of the peninsula provide the two\n main arterials.\n\nIt'd be easy enough to get all these \ncomputers on different channels with several sources per screen.  Then \nit'd look more like a newsroom or monitoring station.  Like a control room.\n\nI took public transit out to PDX last night for a meetup with a [JetBlue](http://mybizmo.blogspot.com/2005/07/jetblues-bizmo.html) pilot's sister (she was flying JetBlue).\n\nHe's retiring today, or at least bringing in his final flight, from Fort Lauderdale as it happens.  They're having a gate party at JFK today, a JetBlue tradition.\n\nI used to live full time in Florida, in a mobile home park in Bradenton.  A lot of the news stories are focused on changes to building codes since Hurricane Andrew but what's special about Florida is how much of it is [mobile home estates](http://www.naplesnews.com/story/weather/hurricanes/2017/09/08/hurricane-irma-thousands-living-s-florida-mobile-homes-face-greater-threat/644103001/).  Lets not just focus on fancy beach side apartments and condos.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}