{
  "id": "5837527399465890756",
  "title": "No Immune System?",
  "published": "2017-03-24T10:29:00.000-07:00",
  "updated": "2017-03-29T00:21:19.875-07:00",
  "content": "Excerpts from my postings to Facebook:\n\nPeople expect so much from politicians. The institutions are what's broken \nthough, starting with voting itself.\n\nA federal contest to come up with \nthe best open source not black box voting system with auditable / \nanalyzable results, which the government would then adopt and own, \nnot outsource, might help resurrect that \"democracy\" idea.\n\nIn the meantime, states need their own foreign \npolicies and workarounds. DC is an obnoxious capital with no legitimacy \nat this point. Too many irregularities in the voting, [per Palast](https://youtu.be/U2pUmcvOB0M) etc.\n\nNot talking about \"fraudulent voters\", talking about purging voter roles\n by the millions, Rove-style, thanks to deliberately sloppy matches.\n\nNeither mainstream party wants to look at that (except Black Caucus) \nergo USA is dead, long live USSA, the Imposter State.\n\nI don't think it makes much sense to have a healthcare debate and \nexclude public health / CDC type epidemics such as Zika and Oxy.\n\nOr the \nquality of food in government facilities, be those schools, prisons, \nhospitals or military.\n\nFocusing purely on the nuclear family and how \nfamily physician type medicine will be provided is letting politicians \noff the hook in too many dimensions.\n\nWe need to see if there's any \ninterest in public health.\n\nMy impression is the FDA is like in \nIdiocracy, helpless to protect Americans against the merchants of bad \nhealth.\n\nUncle Sam has no immune system?\n\nProbably\n [a 3rd party](http://controlroom.blogspot.com/2017/03/n8v-american.html) would do well if it focused very concertedly on the \ninfrastructure of voting itself. Why don't public schools at least, have\n voting machines 24/7 that they get to work out with, come to \nunderstand?\n\nOr is it that the public should not understand the vital \ninfrastructure of democracy (exactly right, but our party could change \nthat).\n\nAs campaign manager, I'd widely show the new Palast film, The \nBest Democracy Money Can Buy, about the Rove-style purge of some \nmillions of voters in the build-up to the most recent presidential \nelection, on the pretense that the algorithms were protecting against \n\"double voting\", somehow a common practice in a population hard pressed \nto vote once in most cases. \n\nThis magic trick, like the one in Florida in Bush vs Gore, likely swung \nthe election, but no the Russians are to \nblame (we'd mock that \"look the other way\" campaign, to distinguish \nourselves from Dems).\n\nWe'd probably also talk about Apartheid a lot and \nadvertise our friendly ties with South Africa, home of Die Antwoord (a \ncampaign needs music).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}