{
  "id": "5502100965231484643",
  "title": "Nobody for Education President",
  "published": "2019-12-06T20:57:00.001-08:00",
  "updated": "2019-12-09T23:03:50.792-08:00",
  "content": "I'm not getting that anyone wants to be the \"education president\" this election year cycle.  That was a Bush Sr. thing, having come off serving as Reagan's veep.  He wanted to lead us towards the thousand dots of light.\n\nI feel I've learned quite a bit about the veep position, thanks to revisiting Nixon's tenure under president Eisenhower.  That's where Nixon developed his friendship with the various bosses, including Howard Hughes if I'm not mistaken.\n\nA lot of antipathy towards the Castro takeover of Cuba kept building momentum, to where JFK would get the ball.\n\nBack to \"education president\": those of us in the open source movement (where I take \"free software\" to be a hard kernel) projected the new accessibility, thanks to lower price, of computing environments, would transform middle and high school mathematics teaching.\n\nSQL would merge with vector graphics.  Polyhedrons would be stored in, and retrieved from, a database, as a routine class exercise.\n\nNone of that happened to the extent we expected, as computer science was expected to fend for itself in the harsh turf war jungle.\n\nMy idea to go with \"lambda\" (λ) versus \"delta\" (Δ) calculus, to stand for computer science versus the older calculus track (each a \"calc\" of a kind), hadn't yet gained much traction, maybe never would.\n\nCase in point:  a Linux box such as FreeGeek was giving to volunteer recyclers, running Python... or lets say a Raspberry Pi... both already have a tiny SQL machine included, as a part of the \"batteries included\" Python Standard Library, in the form of sqlite3.\n\nWe've had a whole generation go by and maybe some elite prep schools reflecting the new realities. The world needs social engineering, long feared and/or satirized as a bugaboo, but how can we deny the engineering component of designing for a better society?\n\nI'm not surprised the game in my region is keeping current with China | Asia as the trend setter.  True, the Pacific Rim has been like that for awhile.  Japanese culture has strong roots on my town of Portland (Oregon) as well.\n\nGetting more \"SQL tea\" infusions going in the Silicon Forest is perhaps not the same uphill battle others might face, in less technophile-dominated areas.  We understand engineering has converged with the bureaucracy in the world of operating systems, networking, project management.  Government is not just for lawyers anymore (or perhaps what it means to \"program\" is changing).\n\nI've not given up on the math-programming hybrid as you might discern from my Youtube channel.\n\nHowever, I've been over on the PATH side more than STEM recently, working on our bridge over the C.P. Snow chasm (know the one?). Philosophy Anthropology Theater History.  Theater encompasses rhetoric and politics.  Anthropology encompasses architecture and art, and so of course appears likewise in STEAM.  A lot of you know of this wordplay.\n\nHaving a philosophy you're clear about, able to defend and explain, is often helpful when it comes to prioritizing STEM projects, either for oneself or others.  People may not share your priorities, but will nevertheless be glad to know what yours are.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}