{
  "id": "2245709499698215320",
  "title": "Nomenclature",
  "published": "2008-06-26T14:11:00.000-07:00",
  "updated": "2008-11-15T02:35:56.636-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh-FWOeYDq18RrjgPXiK_EXLsA4C9nPWUFm1jDbAYkS09tsqVpNXSSYjAfppHJaSf9nhP3XPgU6z7Z6SEgo-uQMGzD6G3VaK05TaHQHO3VETJLOxiCX3nEcD1IxAmajsV_3lSmF/s1600-h/debate_iraqi.png)excerpt from a censored replyI've been [debating with math teachers](http://mathforum.org/kb/thread.jspa?threadID=1761784&tstart=0) whether it's OK to describe [al-Khwarizmi](http://www-groups.dcs.st-and.ac.uk/%7Ehistory/Biographies/Al-Khwarizmi.html), the man for whom our word \"algorithm\" is derived, as \"Iraqi\" in some of our lesson plans.Of course the modern state of Iraq didn't exist in the 800s, but on the other hand you'll find people referring to [Fibonacci](http://faculty.evansville.edu/ck6/bstud/fibo.html) (1170 - 1250) who studied al-Khwarizmi's writings (among others), as \"Italian\" whereas Italy-the-nation didn't come into being, as the Kingdom of Italy, until sometime in the mid 1800s.My opponents in this debate prefer saying al-Khwarizmi was \"Persian\", more closely associated with the modern state of Iran in their minds, regardless of the fact that his career as a mathematician took him to Baghdad, where he joined the House of Wisdom.  He may even have been born near Baghdad, the record is somewhat in dispute.Be that as it may, I think if we look at nation-states like zip code areas, tiling most land masses, then it makes sense to use adjectives like \"Iraqi\", \"Italian\", \"French\" etc. as a convenience, to indicate a specific geographic region, but with the qualifier that we're not necessarily talking about citizenship.Citizenship isn't about where you live in any case, as people routinely hold citizenship in one country while living in another.  Obviously al-Khwarizmi didn't have an Iraqi passport, but then neither did Fibonacci have an Italian passport.I'd enjoy this debate more if my side weren't being censored by the moderator, but that's life on [math-teach](http://mathforum.org/kb/forum.jspa?forumID=206) (Math Forum, Drexel University, Texas Instruments a sponsor).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}