{
  "id": "668169669855785057",
  "title": "Notes from Asylum Village",
  "published": "2023-07-07T09:21:00.001-07:00",
  "updated": "2023-09-20T16:36:33.993-07:00",
  "content": "Now that my little MAP corner (Maths / Anthro / Philo) is getting some attention, I feel again the tug of many alliances.  The I Ching and/or Machiavelli probably have/has passages on this phase or status.  The category space of political objects contains lots of arrows, not to mention slings.  \"Morphing\" is the name of the game.  Tarot Cards as objects. aRb, bRc implies aRc (R = relates to).  Associative thinking.\n\nSeen from my critics' angle, I'm proposing eco-tourism as a panacea, envisioning sustainable lifestyles that involve cleanup and improvements, post disaster or perhaps pre-emptively.  The eco-tourism for Donbass could be seen as a heading off more military action, with lots of folks taking selfies in Donetsk etc.  The focus is on civilian activities, not bolstering anyone's military ranks.  Not just the Donbass of course, just that's a hot spot these days, with plans for high speed rail to/from Moscow still in storyboard.\n\nIn my science fiction, we may also have a direct Aeroflot flight from PDX to Vladivostok, as inter-hemispheric west-east eco-tourism remains a two-way street.\n\nPortland is likewise a disaster zone.  I've been hoping to drum up business around prototyping, per my EPCOT West scenario.  The tendency today is to experiment with lifestyles around sport camping equipment and RVs.  There's no appetite for terraforming ala the Rajneesh Purum experiment, even if the jobs are all in Wasco County, with Salem's supervision.  There's the Country Faire, about to start.  Hardly 24/7/365.\n\nI've got my Asylum City playlist and am tracking what the city is doing around Tiny Houses and so on, where geodesic domes make a token appearance, more to mark a public space than to cover it.\n\n\"All math is ethnomath\" was my bumper sticker like summary, of my math-teach position (Math Forum). I was arguing we could broaden our own minds, be less ethnocentric, by inventing new ethnicities, including around maths.  I have some new ethnomaths up my sleeve in fact.  I travel around in Cyberia presenting slides about it, and Jupyter Notebooks.  \n\nOther experimentalists have carried some of these same memes forward, with or without my knowledge.  I'm not the bottleneck.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}