{
  "id": "1057403846648128615",
  "title": "Note to Translators",
  "published": "2017-03-18T10:26:00.001-07:00",
  "updated": "2017-03-24T04:26:43.462-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/33496191825/in/dateposted-public/)\n\nTranslators might feel OK with simply adopting the simple Synergetics words for them, while supplying various synonyms and equivalents: the Mite, Rite, Bite and Lite. Also Kite, Syte (see below).  Each is one syllable and therefore easily pronounced.\n\nWe're in the ballpark of [space-filling and tiling](http://mybizmo.blogspot.com/2017/03/lucky-lab-hawthorne.html), figurate numbers.\n\nEarlier threads trace the convergence of Bridges type art-math content with the mosque patterns, already converged with geodesic architecture in the 1900s.  We might say [Humans in Universe](http://worldgame.blogspot.com/2010/02/more-from-97214.html) by Anwar Dil was a precursor to the Iranian SpaceX, in hindsight.\n\nThe TetraBook \"job\" (Montessori meaning) pays the bills when it comes to adding insightful software to your PWS (a GST term). A page wags back and forth, its altitude the radius of some circle, symmetric \"book covers\" lying open on XY (Z is \"up\" except in POV-Ray in most Oregon Curriculum Network chapters, with [quadrays](http://controlroom.blogspot.com/2009/03/quadpod.html) more relative and zero-gravity).\n\nThe Mite, remember is Aristotle's space-filling tetrahedron. He didn't call it that, nor did Coxeter, which is why translators need to study the source documentation (Synergetics) more directly, if in doubt. The full text, with diagrams, has been online since W3 (WWW) got started, more or less, as many of you well know. \n\nTwo Mites face bond in various (not many) ways, one way yielding the Rite, another the Bite, using this [namespace of Martian Math](http://www.4dsolutions.net/satacad/martianmath/mm28.html).  The Rite explodes into four sections ala quadray quadrants, to give additional not-handed (outwardly identical) space-fillers, identified by Sommerville (1920s). Our K-16 has all that in the pipeline, where and when subject to local jiggering.\n\nI've got the magnetic Mites in my Pergamon Press bag, the kit I carry to local schools sometimes, when yakking up 3D printers.\n\nSo far, that mostly happens through the Linus Pauling House, a birthplace of organic chemistry (alpha helix...) in that I meet with teachers and retired teachers at that venue, through weekly meetups going back some years.\n\nDuring the latest election cycle, I was hoping to expand the number of teachers I get to work with, but the anticipated costs for professional development would have needed Measure 97 funding, so that plan got scrapped, and I went back to working more directly with the students, more like on the Saturday Academy model, some of whom are ESL (not native English speakers).\n\nGiven Synergetics and Python are not native English either, but different languages, we have more of that \"even playing field\" that keeps English from over-dominating.\n\nI did over a year of Python work in California (over the wire, declared as income in Portland), and that included at least showing some of the Jupyter Notebooks at my repo in this area.\n\nThe [Business Accelerator building](https://github.com/4dsolutions/Python5/blob/master/STEM%20Mathematics.ipynb) has an IVM outside (an octet truss), inviting students to remember about A & B modules. The international school is blocks away.\n\nSytes (2 Mites): Rite*, Bite*, Lite\nKites (2 Sytes): Kate*, Kat*, Kit*\n\n* space-filler (1/4 Rite also a space-filler, not-handed) -- note that only some of these are tetrahedrons (Rite, Bite and 1/4 Rite).\n\nKates, Kats and Kits build the Coupler of tetra-volume 1 (space-filler). Mite volume is 1/8, A & B both 1/24 (same as T). Typically we'll show ESL classes how Mites make not just Rites, but a Rhombic Dodecahedron (RD) of volume 6, a transition to the \"NCLB Polyhedron\" (RT) for those into parochial jargon. Montessori Schools are not guaranteed to have 3D printers.  Look on-line for teaching supplies? Koski is supplying the name Kit, for the Syte made of two face-bonded Lites.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}