{
  "id": "3713876965767493772",
  "title": "Notes from Lunch",
  "published": "2010-02-04T13:18:00.000-08:00",
  "updated": "2010-10-11T18:25:37.349-07:00",
  "content": "I was just having lunch with [Arthur Dye](http://worldgame.blogspot.com/2007/11/more-networking.html), whom I meet with periodically.  We caught up from both sides to some degree.Arthur is interested in the homelessness situation, especially along SE Belmont, has been looking in to what Methodists might be doing.  I filled him in on how the art community, the musicians specifically, have been responding.  Lindsey is out delivering a shipment of camping supplies, UPS delivered to the Laughing Horse collective just recently.  [Muddy Waters](http://coffeeshopsnet.blogspot.com/2010/01/bookkeeping-cartoons.html) (soon to close) and [Duke's Landing](http://mybizmo.blogspot.com/2009/11/think-tank-techniques.html) are among the dots of light in this network.We went over some of AFSC's recent travails.  Arthur's view is the Vietnam Era was so horrific, so unlike anything the agency had hitherto encountered, that it may not have recovered fully, is still crippled.  Quakers were picketing their own meetings for refusing to declare Nixon a war criminal.Anecdote:  when Richard Nixon was newly out of the army, first running for Congress, his mother Hannah phoned the then director of AFSC and conveyed her concerns, that her son was drinking a lot and had become a warmonger, and could you, Clarence Pickett, come out and talk to the guy.  Director Pickett got out there by train (Philadelphia to LA is a long way) and indeed had two days with Nixon.  However, shortly thereafter, Pickett died of a heart attack in San Francisco.  No one knows much of what transpired during their visit.Thanks to the Laughing Horse connection, I've seen a whole lot more American history, up close and personal in documentary form.  Were I a degree-granting institution, I'd give myself one or two, as this has been a crash course and not especially easy to digest.  Recent history is still not a mainstream topic, as [Colonel Fletcher F. Prouty](http://www.prouty.org/) points out, in connection with [the U2](http://worldgame.blogspot.com/2009/02/u2.html) for example.  It's easier to fight about Darwinism and global warming, than it is to really look closely at one's own recent past.\"Nixon\" has been among the [examples of proper names](http://www.freelists.org/post/wittrs/Wittrs-Re-Re-Proper-Names-Wittgenstein-Russell-Kripke) going by on the Wittgenstein list, where Sean Wilson has been leading a thread.  I chimed in with some [stuff about EPCOT](http://www.freelists.org/post/wittrs/Wittrs-Re-Re-Re-Proper-Names-Wittgenstein-Russell-Kripke).  If you're already steeped in this literature, you know that [Saul Kripke](http://en.wikipedia.org/wiki/Saul_Kripke) writes about \"Nixon\" sometimes (as Google will disclose).In terms of where Quakers might be going, Arthur had brought along a recent story (December 2009):  Quaker Indian Committee disavows Doctrine of Discovery affirms Declaration. Said doctrine is a product of the 15th and 16th centuries.  The Episcopal House of Bishops had already voted unanimously on their \"Repudiate the Doctrine of Discovery\" resolution, the House of Delegates likewise repudiating said doctrine by a strong majority, during their 76th General Convention in July.  The affirmed declaration (in the story's title) is the UN's on human rights.The Parliament of World Religions in Melbourne, Australia (December 3-9) provided [another networking opportunity](http://controlroom.blogspot.com/2010/03/wanderers-2010316.html), for those working this angle.  Both the Anglican and Catholic churches have been called upon to respectively rescind a 1496 charter, and repeal some papal bulls.  These are rather esoteric back office doings.  I wouldn't expect to read much in The Oregonian about all this, but maybe in the Metro section some Sunday.Quakers have a [long affiliation](http://mybizmo.blogspot.com/2008/07/some-quaker-pr.html) with Native Americans, even though Pennsylvania was to some extent expropriated or commandeered.  Power sharing continued, with Quakers then losing some clout by staying loyal to the \"Indians\" resisting war taxes to fight their friends.  Arthur and I had both read the same [Catholic pamphlet](http://worldgame.blogspot.com/2009/09/catholic-analysis.html) on this topic.Arthur also reminisced about [Floyd Schmoe](http://controlroom.blogspot.com/2009/11/go-humans-go.html), who spent much of his life working on behalf of Japanese families during the [internment camps fiasco](http://worldgame.blogspot.com/2005/02/adult-first-day-program.html).  Arthur remembered attending Floyd's 100th birthday at the meeting house in Seattle.  Floyd had noticed the grass hadn't been cut and was working the lawn mower, making the place look nice for his party.Speaking of Quakers and lives that speak, my mom Carol Urner and I were talking recently, about a productive meeting in Whittier.  An Islamic bank in that area, operating by different rules, is doing fine as an institution.  There's nothing to keep various types of bank from sharing the same infrastructure, plugging in to the same grids.  This idea that it's either/or, when it comes to banking, is bogus.  Diversity is what banks themselves preach (as in \"diversified portfolio\").",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}