{
  "id": "4509276385085636319",
  "title": "NPYM Annual Session 2013",
  "published": "2013-07-19T00:33:00.001-07:00",
  "updated": "2020-07-04T10:30:06.006-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157634746045269)\n\nWelcome Friends.  Margaret Coahran is Registrar this year.  I find that one of the most challenging jobs in the Quaker rotation (we tend to [manage by rotation](http://controlroom.blogspot.com/2007/12/management-by-rotation.html)).  I've expressed to her a few times my admiration, but not before agitating for a single.  My written note had been miss-transcribed to say I'd dwell with other snorers, but that's not what I'd said.  She and the Pacific University students handling conferences got me a single room efficiently, in Clark Hall.  I was impressed.\n\nAt the AFSC meeting during lunch in the Alumni Room, some of the Friends were expressing appreciation for FCNL and AFSC working together on something (I forget exactly what).  For the record, I have mixed feelings about this.\n\nThere's a [broad brush stroke](http://controlroom.blogspot.com/2009/02/broad-brush-strokes.html) psychology that has given up on working closely with Washington, DC, which doesn't mean the relationship is necessarily adversarial.  But why bottle-neck everything through one city that way, especially where groupthink (like-mindedness) has proved capable of entirely pathological acts:  invading Iraq for example.  That's enough right there to sideline this city until it learns to play the game (\"world game\") less awkwardly.  This neo-imperial period is a waste of fossil fuels by living fossils.\n\nAFSC should cater to those not especially focused on Washington DC and its institutions, at least not in the sense of sucking up to them and/or trying to stroke its politicians' egos.  That's FCNL's job and the two approaches are not easily combined.\n\nThat's partly why I am [not a fan](http://worldgame.blogspot.com/2013/06/recent-meetings.html) of the \"if I had a trillion dollars\" video contest:  the \"winners\" got to visit the very city that's been wasting their trillions, swindling young people out of their could-have-been brighter futures, and now they get to learn how to \"lobby\" or maybe \"write letters to the editor\" -- a long list of ineffectual, not-working techniques that have not prevented Washington from making disturbingly horrible mistakes.\n\nLet FCNL teach people how to \"lobby\".  AFSC should focus on how to work around these clowns and not waste its time inside the beltway so much.\n\nOur Friends in Residence are from Jubilee House [in Nicaragua](http://coffeeshopsnet.blogspot.com/2011/05/learning-from-friends.html).\n\nI don't know if they associate Jubilee with the idea of hitting the reset button and rebooting key relationships, an old Catholic notion of zeroing out debts.  Recommended:  [Debt, the First 5000 Years](http://en.wikipedia.org/wiki/Debt:_The_First_5000_Years).  I like the way Greaber points to all the mythologizing that goes on in Economics, about how we got to where we are.  Storytelling R Us.\n\nThe Friends in Residence presentation aimed to get at the psychology of community work, something religious people get to take on full time thanks to their religious orders.  Doing work one considers ethical and obviously helpful to those in need is its own reward in some ways, or so the theologians have tended to agree? \n\nWhy?\n\nOne actually strengthens and develops as a result, and so prospers psychologically.  Doing the work that needs doing, if one can swing such a thing, tends to be satisfying, even when there's too much to be done and one is always facing inadequacy.  There's team work, there's relationship, and there's a shared sense of purpose.\n\nSo lets not talk of \"great sacrifice\" in the sense of giving up high living standards.  You may not be as physically consuming, but for a lot of us that's healthier anyway.  Malnourishment is a much a matter of consuming too much as too little.  \"Affluenza\" they call it.\n\nI've mostly been hanging out with the old timers, like Sonya Pinney, whom I've known all my life.  Her kids are my age, and their kids are going to college (as is mine).  Gail Sanford.  Barb Janoe.  We sat outside during dinner, comparing notes.\n\nAlthough I tell people I'm on retreat, I'm actually working full time, not having gotten off teaching.  Given my students are online, all I need is a not-too-choppy Internet connection.\n\nSpeaking of which, my 4dsolutions.net disappeared for awhile when Webfaction moved it and set the wrong DNS numbers.  I contacted them from my single dorm room in Clark and they realized their mistake.  I'm about to re-up with the registrar as well and momentarily wondered if the DNS issue was related to that (a company called Jumpline, Inc. is registrar for 4dsolutions.net).\n\nCarol has been working hard with her doctor and Apria to make sure she can get some portable oxygen equipment in early August.  I helped her fill out and return a PDF on-line, harder than it sounds once you factor in all the settings Windows has regarding Wifi authentication.\n\nTara is maybe doing a few things for The Open Bastion.  Her summer has included working with them, Patrick in particular.  TOB produces Djangocon and Apachecon among others.\n\nSometimes I look up from my Python and post something math related.  Tonight that was [to edu-sig](http://mail.python.org/pipermail/edu-sig/2013-July/010862.html), but earlier today, [to math-teach](http://mathforum.org/kb/thread.jspa?threadID=2581851).  Will my postings get through though.  I invest considerable time in those and yet sometimes they don't make it through the moderators.  Sometimes I park them elsewhere then.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}