{
  "id": "916504324234051175",
  "title": "NPYM Interest Group",
  "published": "2016-07-15T16:26:00.001-07:00",
  "updated": "2016-12-15T19:21:11.755-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/28069353590/in/album-72157671056618626/)\n\nFortunately, Mary Klein, the Western Friend editor, was well prepared to lead this group, which I helped brainstorm along with Friends in other Yearly Meetings.\n\nShe even brought a projector (not that Whitworth University doesn't have those — this is a well-endowed campus).\n\nMeetings that own their own buildings, and have Wifi, have discovered that renters, people using the building as an event center, appreciate the facility.\n\nNPYM meetings tend to have websites.  Do they have current slates on-line?  Western Friend encourages a public, open policy.  Each Yearly and Monthly Meeting sets its own policies.  I've been encouraging NPYM to always share an-up-to date slate.\n\nQuakerism is a [form of role-playing](http://controlroom.blogspot.com/2016/07/npym-interest-group.html).  How can we role play if we don't know who's doing what?  The whole process breaks down.\n\nAlso, given my background of working with nonprofits, I'm thinking at least the meeting's \"officers\" (i.e. clerks) should be publicly available.\n\nOlympia may have the most open listserv, in terms of freely sharing unfiltered content.  My question is why don't most if not all committees have listservs?\n\nWouldn't Peace and Social Concerns benefit from more communications, not less?  What are the concerns?  Listservs are self-archiving, helping build organizational memory.\n\nWestern Friend has one of the most sophisticated websites and staffs on the Quaker cloud, [archiving back issues](https://archive.org/details/westernfriend) of what used to be called Friends Bulletin. \n\nFGC also has its trademarked Quaker Cloud, which a lot of meetings use.\n\nI've found [QuakerQuaker](http://www.quakerquaker.org/) to be an interesting and usable website.  People create their own accounts and publish interleaving content, enabling discussion.\n\nDorene: accessibility, in terms of readability of websites, is an important feature.  The NPYM Drupal site is [somewhat responsive](https://youtu.be/snQp757_Rr0), could be worse.  [Try it](http://www.npym.org/).  It's sure hard to search though.\n\nFriends worry about confidentiality (rightly so) and get paranoid (many meanings attached), like a lot of people.  Many are reluctant to share contact information publicly, with spam being maybe the least of their worries?\n\nThe Monthly Meeting developed in horse and buggy days, when most pedestrians could make it to meeting one day a week at most.  We had other business to attend to on other days.  Given electronic communications, the ability to get work done telepathically (OK \"remotely\") suggests \"clerking\" gravitate to include \"moderating the listserv\" for whatever committee. \n\nAt issue is [the practice of Quakerism](http://worldgame.blogspot.com/2016/07/npym-rest.html) itself.  What is it?   Continuing revelation...\n\n[](https://www.flickr.com/photos/kirbyurner/27735609584/in/album-72157671056618626/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}