{
  "id": "7765641425718525594",
  "title": "Occupy Unmasked (movie review)",
  "published": "2012-11-28T12:18:00.000-08:00",
  "updated": "2012-12-05T20:44:31.732-08:00",
  "content": "This analysis piece, by Citizens United, strives to make sense of the Occupy movement in the terms of the Cold War.\n\nAmerica's enemies, i.e. capitalism's enemies, manipulate the unwitting, especially students, and collaborate with a more criminal underground, to mount a domestic challenge to the rule of law.\n\nTraitor democrats tend to be sympathetic to these leftist movements, whereas true patriots understand the true dimensions of the global enemy.\n\nThe analysis is somewhat insular in that it excludes much if any mention of so-called Arab Spring and the spread of protest movements in Tunisia, Egypt, Iran and so forth.  Parallels are drawn to the 1960s and 1930s, keeping the history more a domestic one, not a global one.\n\nThese are the same hippies and Black Panthers and labor movements that brought down Nixon and stopped the Vietnam War from continuing.  Behind the scenes, it's the SEIU (a union) and people who like Fidel Castro.\n\nCertainly Occupy people include some angry citizens.  The phenomenon of camps and camping echoes the Hooverville Era and the Business Plot chapter, starring [Smedley Butler et al](http://worldgame.blogspot.com/2011/10/esozone-talk.html).  The number of military vets and their importance within Occupy was somewhat bleeped over by this movie.\n\nMore from my point of view (disclosing [my own bias](http://worldgame.blogspot.com/2012/04/occupation-nation-movie-review.html)):\n\nSome rogue government had hit the gas pedal and sent us careening over a cliff, invading Iraq on false pretenses and in ways many of the principals would acknowledge were in error.  The same pressure on the gas pedal was being felt again, this time against Iran.\n\nOccupy was not so much a lunge toward some utopian future as a slamming on of the brakes.  The level of brokenness needed to be dramatized.  The people (99%) were not seeing eye to eye with their would-be rulers (1%).  The level of discontent needed to be demonstrated.\nI saw some of [my friends](http://mathforum.org/kb/message.jspa?messageID=7932419) and associates in the Portland segments.  Lindsey is in the scene with Michael Moore, then touring Camp Alpha.  Troy, who used to be [with Duke's Landing](http://mybizmo.blogspot.com/2009/06/music-scene.html), makes repeated appearances.\n\nThe term \"community organizer\" is given a negative spin by the writers.  A \"community organizer\" is a behind the scenes mastermind who manipulates pawns.  Obama was and is a community organizer.\n\nSaul D. Alinsky is also singled out for special treatment as one of the top / most influential activists behind these lefties.  Hillary Clinton did her thesis on him.\n\nThe problem of aggressive males feeling able to rape with impunity, other socio-pathic behaviors, is endemic to crowded unpoliced settings such as the Occupy camps.  The Occupy camps were similar to [refugee camps](http://mybizmo.blogspot.com/2012/11/burma-human-tragedy-movie-review.html) in some ways.  Providing sane and sanitary camping situations as a kind of base line:  Occupy Portland was experimenting in that direction, but [the public restrooms](http://mybizmo.blogspot.com/2011/11/endgame.html) failed to keep up, as Portland the City was not participating wholeheartedly.\n\nIn my view, Occupy camps were a fertile recruiting ground and good hands-on experience in logistics i.e. providing food, shelter and educational experiences.  The camp had a generator.  However, the cycle of life was not complete.  As a camp, we were only partially established.  More experiments to come, and, we hope, a better life for refugees ([wanderers](http://worldgame.blogspot.com/2012/11/wanderers-20121128.html)) around the world.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}