{
  "id": "7391221920765861395",
  "title": "Occupy Silicon Valley",
  "published": "2012-03-14T10:20:00.000-07:00",
  "updated": "2013-06-23T23:32:57.398-07:00",
  "content": "Silicon Valley is a spread out motherboard accustomed to dealing with convergence / divergence.  We were whisked in and out of San Jose airport by taxi, van and shuttle bus.  Others simply drove from nearby digs and parked out behind the Convention Center, which is attached to the hotel, a Hyatt Regency ([shades of Chicago](http://controlroom.blogspot.com/2009/03/airplane-reading.html)).\n\nSome critics of our Portland setup express frustration that the Oregon Convention Center, built to a similar scale, is unattached to a residential suite.  However an overflow event such as Pycon occupies several hotels in the vicinity, so the question is moot in the experience of many attenders, or at least Portland's easy Max ride from DoubleTree should be contrasted with hoofing it from the Hilton in Santa Clara across the highway.\n\nPython plays well with others, like I sat next to a Rails guy at lunch on the 2nd day.  There's a natural affinity between our respective communities, with several revolving doors. [The 1st day](http://mybizmo.blogspot.com/2012/03/pycon-2012-day-one.html) I was at the PSF members lunch, trying to herd Jack Diederich there in border collie fashion as he'd mentioned his intention to be dutiful at the party on Thursday night (I got a haircut on Hawthorne, but am still recognizably some blend of sheep dog (he got away)).\n\nFacebook switched to the timeline format around now, so more like that long sheet of butcher paper in the [D.W. Jacobs](http://www.flickr.com/photos/17157315@N00/2950384443/in/set-72157608139268797) rendering for Portland Center Stage.  That was the [2008](http://controlroom.blogspot.com/2008/12/loose-ends.html) apogee of \"Bucky Power\" in Portland.  I've been surfing the ripple effects ever since.  Allegra joined in the opening festivities, where [mom and my daughter got to meet her](http://www.flickr.com/photos/17157315@N00/2951236420/in/set-72157608139268797/).  [Trevor](http://www.synchronofile.com/) was very much a part of these events, [delivering a lecture](http://controlroom.blogspot.com/2008/11/trevors-talk.html) on the Portland Center Stage mezzanine, [as I had](http://worldgame.blogspot.com/2008/11/ieee-presentation.html).\n\nI was networking with the Friends of Fuller at Pycon for sure, with David Koski [phoning](http://www.flickr.com/photos/17157315@N00/6976467961/in/set-72157629206299498/) from the vicinity of the TC Howard dome in Ohio, [getting his shots](http://www.flickr.com/photos/17157315@N00/6834704198/in/set-72157629206299498/), while I had the [ESRI guy](https://us.pycon.org/2012/speaker/profile/103/) pause for this picture:\n\n[](http://www.flickr.com/photos/17157315@N00/6976457819/)\n\nFor contrast, distorted Mercators all over the place, with (some) geeks conscious of the discrepancies (cite Spotify meeting).\n\n[](http://www.flickr.com/photos/17157315@N00/6976460899/)\n\nHaving the [OST badge](http://blog.oreillyschool.com/2012/03/us-pycon-2012.html) made a difference in terms of who wanted to talk to me.  We have [little direct competition](http://mathforum.org/kb/message.jspa?messageID=7744284&tstart=0) at the moment.  Steve had hosted an all night gathering in his suite the night before and left Vern to discover me as the interviewer for a sampling of posters.  I yakked with climatologists (including financial), the CERN software guy, and the guy from Bump, which [runs Diesel](http://www.flickr.com/photos/17157315@N00/6830339192/in/set-72157629206299498) (an open source project with adapters to MongoDB).  You might try following links [through Python.tv](http://pyvideo.org/category/17/pycon-us-2012) (not redirecting, texted Holden Web) if you want to find those and other snippets.\n\nHow was this an Occupy then?  Well, you could say this is an economy [contra to Wall Street's](http://controlroom.blogspot.com/2007/11/technation.html).  Although JP Morgan had a booth, Silicon Valley is somewhat self feeding and not taking direction from any \"bosses\" in New York or its puppet DC (the latter being more about lawyers than engineers).  That doesn't mean \"non-compliant with government\" though, as the latter has come to depend on [the same GIS / GPS infrastructure](http://worldgame.blogspot.com/2009/04/gis-2009.html).  Google Earth and the space program (e.g. NASA) go hand in hand in a lot of ways.  Geeks have their Ignite.gov and their [GOSCON](http://mybizmo.blogspot.com/2010/11/goscon-2010.html), so what else is new?\n\nYes, there's a counter-culture with hubs in California that thrives on diversity and is friendly to the world.  That's really news to nobody, so it's not necessarily a CNN story when these kinds of Flying Circuses self-organize and happen, in the US, Brazil, Cuba or Singapore.  The [media trucks](http://www.flickr.com/photos/17157315@N00/6218977974/in/set-72157627710609369) don't fill the parking lot.\n\nI came back to my co-workers with news of potential recruits, pretty much as I had around [Occupy Portland](http://worldgame.blogspot.com/2011/11/scrap-book.html) (OPDX).  Interesting and talented people frequent these places.  Call it a freak show if you like, we won't necessarily be offended (were you trying to be mean?).\n\n(I\ncome in at 29 mins 10 secs or so)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}