{
  "id": "6919688518022152891",
  "title": "Occupy University",
  "published": "2018-11-27T13:24:00.000-08:00",
  "updated": "2021-11-14T15:47:29.734-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgioSHIMGHbFiVGPC3Q-IVppCFyljdEd8BI4feQPWGvXvF1HpUq9msvt8mlekOgPtypZEAFtrYXONiLU92oHQU78sPexIyqkH99qwt6uj5b0fwpScOjPnhGDaVlUETqVUZnzZba/s1600/opdx_map.jpg)\nOPDX - Occupy Portland\n\nThose of you looking for Occupy University (OU) have come to the right place.  I've been out recruiting faculty, as I did when we staged [a non-virtual OPDX](https://controlroom.blogspot.com/2011/11/adult-discussion.html) in downtown Portland, in the same place where WWI vets staged their March to Washington.\n\nThat led to the DC Hooverville which General MacArthur destroyed, in a misplaced show of bravado (a form of friendly fire).\n\nIn the faculty lounge, one discussion is whether animation, both 2D and 3D, constitutes a form of \"coding\" or not.  These are the kinds of nitpicky debate one expects in Faculty World.\n\nClearly the art of television programming, the sequencing of shows to fill dead air space, is a kind of programming.  Think \"programme\" when it comes to theater.\n\nEnglish makes a big point of not using \"programme\" to mean \"program\", obscuring the fact that source code scripts actually orchestrate and direct platform action, much as a play does, or a musical score.  English is somewhat (horse and) buggy, we all know that.\n\nThe word \"code\" is likewise ambiguous, as we have \"codes of conduct\" at geek events, which tend to be treated like Codes of Hammurabi, meaning they're enforced, with transgressions confessed or uncovered.  That's \"code as law\" one might say, where \"obedience\" is a keyword.  However \"code\" also means what computers execute directly (we could say \"obey\" but usually don't for some reason).\n\nIf you think the bottomline is \"it's all semantics\" you're correct.  \"There's semantics, and there's nothing\" is about as helpful as my other dictum \"There's science fiction, and there's nothing.\"\n\nBoth are meant to emphasize the universality of the leading term, in contrasting them with nothing.  The dialectic goes away at that point, but then tautologies provide no traction.\n\nTautologies are more about emphasizing and underlining a grammar, and show more than say.  They're not about making empirical claims so much as delineating the boundaries of sense-making.\n\nThis is what Wittgenstein meant when he said his philosophy was not about stating theses, as if it did so, they'd by of the kind no one could disagree with.  In delineating sense, one borders on nonsense, by definition.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}