{
  "id": "6205942687736527271",
  "title": "Of G & O",
  "published": "2022-09-06T09:57:00.009-07:00",
  "updated": "2022-09-06T12:10:05.919-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/36022710973/in/photolist-JoV1qn-WTcNXF)\n\nI recall a new relative, from South Africa, kind of squirming at TG a few years ago, when I brought up Die Antwoord, the music group.  Although self cast as a duo, the Ninja guy and Yolandi, the group has lots of off screen talent, visiting dancers and the rest.  The movie Chappie...  \n\nI'm a fan.  But in her circles, this showbiz act was an embarrassment, as maybe some UKers felt around The Beatles, at least originally, back in the day.  This is what you admire in British culture?  What about our Victorian tea cups?\n\nThat's an odd segue to G & O I suppose:  Gurdjieff and Ouspensky.  These were not heroes in my youth, as I'd barely heard of either.  I followed Freud, Ernest Becker, Norman O. Brown, Wittgenstein... that's up through university, when I jumped into Erhard & Fuller, a dynamic duo back then (see the new bio).  I've continued to add to my graph (tree) of course.  We don't wanna be stuck in the 1980s.\n\nI'll admit I'm thinking politically in making Ouspensky a focus, in wanting to include some folks from St. Petersburg (I'm talking Eurasia, not Florida), Moscow and like that, in the foyer of fecund philosophers.  Yes there's a \"self help\" angle to what they were doing.  So what?\n\nWhereas psychoanalysts must needs be psychoanalyzed as a part of their training, we might be worried the philosophers have no therapy.  Enter Wittgenstein, with his philosophy a therapy for specific metaphysical pathologies he knew only too well.  \n\nThere's no crime in philosophy wanting to have workshops or seminars, meetups with exercises (rituals) or whatever.  The so-called church has no monopoly on soul searching and/or making.\n\nI have other ulterior motives however.  Gurdjieff is someone Bucky jokingly found congenial, and a fellow alcohol user back then, or so Dr. Richard Buckminster Fuller seemed to suggest.  He talked about the interminable toasts to the many types of idiot, with each a raised glass of something.  Wine? Did the great master use colored water?  Random Google:  \"Although Gurdjieff did show some of the signs suggestive of alcoholism, such a daily drinking, drinking early in the day, and driving after drinking...\". OK, I get it, he liked to drink.  Shades of Alan Watts.\n\nThat brings us to EST:  The Steersmans' Handbook, a copy of which I've only recently (relatively) acquired and consumed.  That's where Bucky is mentioned, and this was all pre Erhard Seminars Training.  Then Bucky and est would cross paths (read the new bio for more of the story).  \n\nThat's some pretty tight semantics, and summarizes our chapter:  man the machine (\"man cannot do\"), man the Spaceship Earth program (woman the \"womb man\" -- if that's the etymology). \n\n[ Using \"man\" or \"guy\" as a generic actually has a feminist dimension.  The words no longer work to discriminate or distinguish.  The default could just as well be female, in our 300 man brigade, task force or group. ]\n\nIs my point that \"overcomers\" (as in \"we shall overcome\") might be drinkers?  More to the point is the similarity across these self help systems:  how to address one's robotic behavior, complete with habits one sometimes feels at a loss to control.  Some philosophers look down on philosophies with much of a psychological dimension, especially where self improvement is involved, and use lots of pejorative language (negative adverts, attack modes), versus jumping into the fray as honest competitors (self promoting, proving positive worth).\n\nIn other words, both Bucky and G&O accentuated the positive, and we see that in their respective trackers and backers quite a bit.\n\nI'll fade to Medium here, quoting one of my stories:\n\nEST\n = Electronic Social Transformation in some passages, although Stevens \nis clear about the Latin meaning as well, as in “to be” (also a part of \nErhard’s spin).\n\nThe\n book is McLuhanesque in terms of attributing the great generational \ndivide to respective diets in terms of media, between the linear \nbook-reading Establishment of legislators, and the immersed “simulsense”\n TV generation he calls the Movement.\n\nWhat\n he calls Est people are the bridge types that still read and write in \nthe manner of the older civilization when needing to, but that \nexperience the new ultra high bandwidth of total immersion in an \nelectronic field of simulcast stimuli and programming, of which \ntelevision was only the beginning.\n\nBuckminster\n Fuller is a “simulsense man in spite of his advanced years” (page 34) \nand Bucky blurbs about the book excitedly on the front cover (see \npicture above):\n\nMagnificent…\n an extraordinarily lucid and powerful book. It may well be the straw \nthat will save the camel’s back, of Earthean crisis.\n\nFor me, this book helps bind Fuller to McLuhan again, an old nexus I’ve talked about before,\n and paves the future for the “chummy” relationship achieved by Erhard \nand Bucky around the time I was leaving Princeton for Jersey City and my\n first job as a high school teacher at St. Dominic Academy.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}