{
  "id": "61638450751256469",
  "title": "Of Sex and Gender",
  "published": "2022-12-29T09:39:00.016-08:00",
  "updated": "2023-01-14T22:47:03.831-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52500751965/in/datetaken-public/)\n\nI've been delving into the various echo chambers (choirs) regarding sex 'n gender recently.  I haven't seen What is a Woman? yet, the documentary style talking points maker, but I've watched several reviews, which feature excerpts.  I catch Tucker Carlson from time to time, who rants on these and other issues.  I tune in channels by trans, feminist and academic content creators.  The internet makes it easy.\n\nBeyond the internet, I've also had my share of life experiences, and welcome my continuing education.  I'm not done developing my views, but do have habits of mind, or call them ruts, or grooves.  I'll lay some tracks, to give a sense of where I'm at.\n\nWhen I say \"rants\" coming from a Quaker background, I mean \"as a ranter would do\" which, in Friendly parlance, is in contrast to the \"quietest\" who mostly says nothing at all in Meeting for Worship.  Call me a \"ranter\" too then, as I'm outspoken in my Quaker journals (aka blogs).  Expect some polemics in other words, some invective.\n\nWhat I'm patting myself on the back for these days, is noticing how \"race versus ethnicity\" parallels \"sex versus gender\".  In both cases, the former is something they inform you of, tell you about.  You don't get to contradict them.  \"You're Black\" says the world, and you'd better believe that, or else. \n\nIn the case of race, there's no surgery or hormonal pathway for transitioning, say to Red or Yellow (that's how the game goes) and it wouldn't matter anyway as the whole point with racial categories is people are stuck with what they are, even if they try to \"disguise the truth\" and \"pass\" for something else.\n\nBefore you attack me, the messenger, for this news about \"race\", its indelibility and immutability, let me assure you I'm no believer in \"races\".  I am not a lawyer for this concept.  It has too many holes.  They were already practicing racism when I got here, never asking me what I thought.\n\nToo many perfect humans fall through the cracks as \"mixed race\" and the pure archetypes (how many? how many pure races are there really?), the primary colors (from which others derive), are hard to come by and agree upon (does \"white\" really have to be one of them, only to then be treated as \"special\" as in \"white is not a color\"? -- seems corrupt and/or bad design). \n\nI've traced a lot of racial thinking to the story of Noah and family in the Bible.  Since humanity had been \"pinched off\" by the Great Flood, racial diversity could only be explained in terms of Noah's descendants.  It took the Tower of Babel to get them to spread around.\n\nSpeaking of humans spreading around the planet, the social construct they call \"the system of nation states\" isn't working out all that well either (nice try?).  Too many have had to live their whole lives as \"undocumented\" and/or as nationless refugees, while in the meantime the whole concept of \"sovereignty\" is routinely violated.  \n\nI've been a lifelong fan of the United Nations, yet its credibility has diminished over time, thanks to all the flagrant violations of international norms by member states.  I see a broken bureaucracy.\n\nDo we have some alternative?  Not really.  Citizen diplomacy maybe, i.e. human-to-human relating.  \n\nDiplomacy is everyone's business, not just of those with diplomas.  \n\nThe Truckers for Peace Program fits in here.\n\nThe \"race meme\" is inextricably mixed with the \"breed meme\" of animal husbandry.  Humans can, in principle, be bred into breeds, with various traits deliberately inbred to define the brand.  I'm not saying I'm in favor of such eugenic practices.  I'm saying the practice of animal husbandry provides a conceptual foundation for racial concepts.  \n\nMost of us qualify as mongrels, or commoners.  The purebreds count as royalty.  It's an archaic system, a blend of many mental habits, including the arithmetic of fractions (as when one is 1/8th or 1/32nd some specific race or races).\n\nIn any case, I'm no eugenicist, nor even a dog breeder (not that I'm against breeding dogs, or cats, or horses...).  \n\nI'm for humans having babies with whomever others consent and commit to such a project.  \n\nI'm also fine with humans choosing not to have any babies at all.  \n\nWe get lots of babies, and don't care for them sufficiently, as it is.  We abort a lot of them in theater, on life's battlefields, and a lot of others before birth.  Adoption makes sense.  I'm not proposing anything new in making these remarks, nor telling you how to live your life.\n\nEthnicity, on the other hand, is more fluid, like gender.  \n\nYou may be born into a cult, and not even see it as a cult into you grow out of it later (perhaps with no hard feelings, as growing is not always \"escaping\" -- perhaps this cult was benign).  Looking back, you see a lineage of \"former yous\" (the yous you used to be).  \n\nThat's like a movie synopsis of your individual journey, in the course of which you may take on the traits of many ethnicities, from language to eating habits to political outlook and so on.  \n\nYour ethnicity is akin to your personality, of which your gender forms a part, and attaches to your psychic life more than to your physicality.  Ethnicity is more epigenetic (transmitted outside the chromosomal mechanism).  Buddhist priests come in all shapes and sizes (makes and models).\n\nRace wants to be genetic but has an insecure foothold in contemporary science (no race genes) and could better be ditched all together, to our collective advantage, as \"man's most dangerous myth\" to quote Dr. Ashley Montagu.\n\nHow might we apply the word \"trans\" in anthropology and philosophy, in connection with changing one's ethnicity?   If an aspiring Jesuit decides to abandon that path and marry a Korean partner instead, isn't that a kind of transitioning?  No plastic and/or cosmetic surgery may be involved.  \n\nMight the more gender fluid trans from gender to gender on a moment by moment basis?  People are allowed to have chimerical, enigmatic and/or mercurial personalities.  How might \"gender\" figure in?  What's the upper limit on \"rate of change\"?\n\nHaving pride is on the healthier side, feeling ashamed less so, would be my rule of thumb.  But then, as a reproach, we may ask a stranger, with some moral outrage \"have you no shame?\".   Those incapable of embarrassment (let alone shame) seem lower on the ladder of moral righteousness.  Is that a problem with the ladder?\n\nAs teachers, as conveyors of cultural values, we may be enlisted into, cast and tasked with, making clear what shame is all about and when one should have some. \n\nTo this day I recall Mrs. Cunningham in my third grade Junior English School describing the shameful behavior of these strapping young boys on the public bus, too thoughtless, too unaware, to consider offering a seat to frail elders around them.  What were the other passengers thinking of them?  I road the bus a lot as a kid.  I'd always offer my seat to the old people.\n\nWe should investigate \"guilt\" in this same context.  I'd say in all cases there's pressure to develop self awareness, which is the flip side of seeing oneself from many points of view.  \"You're not stuck in traffic, you are traffic\" is a good one.  \n\nNags of guilt suggest new camera angles, perhaps previously unconsidered, and corrective action.  The stimuli feed an \"OODA loop\" to use some jargon.  Guilt is worthless if not eventually turned into consciously considered cues, to be dealt with.  To be consciously ignored (dismissed) in some cases, wisely heeded in others.\n\nTalking about these surgeries as \"cosmetic\" gets people riled, as when you call it all \"world game\" and they say \"it's not a game\" i.e. to seemingly trivialize and make shallow is insulting and offensive in their estimation and they fight back, feeling provoked.  Perhaps the speaker was being provocative?  I don't know, I wasn't there.\n\nI'm one of those who think growing a thicker skin is usually a better and more practical strategy than socially protecting fragility by means of covert hostility, threats of canceling and deplatforming (what hanging by the neck also entailed). \n\nRailing against those engaged in \"hate speech\" is too often itself a form of unreflective \"hate speech\".  At least it's speech, lets give it that.  If someone claims a speech inspired one to commit violence, does blame automatically adhere to the speaker?  Is the speech itself the crime, or the violence committed?\n\nThe contest is forever politeness (polity) and civility versus what's rude and crude.  What does it take to maintain equilibrium in psychologically buffeting weather.  Sometimes what's cruder also adds more intelligibility.  Electric storms have a way of clearing the air.  Sometimes a civil synopsis and summary restores equanimity and further processing capacity.\n\nThe Bible gets away with \"all is vanity\" and that's definitely a way of looking.  What's psychologically healthy is when God is proud of His creation (in patriarchy), not so much when the individual is bursting with self pride in some zero sum game against the balance (i.e. \"the other people\").  \n\n\"Me against the World\" pride is at least a tad demonic, but in a divine, angelic kind of way that God Himself loves and forgives (as He does the Miltonian devil).  The only sin is in not being proud of all of it, which we mortals are incapable of being in the first place, hence the original fall.  In the minimal mirror of all Creation, God is eternally regenerative, to summarize Synergetics.\n\nHaving seen Avatar 2 recently, I do wonder if a combination of \"cosmetic surgery\" and \"breeding\" will move some of humanity towards under ocean living.  We wouldn't be the first big brained mammal to choose this environment.  I've used an \"aqua lung\" in my day (scuba diving equipment).  \n\nI've sometimes joked I foresee a three pronged future for humans:  those that stay as we are, those that adapt to life underwater, and those that adapt to life in outer space.  \n\nAm I talking about three wholly separate species eventually, that no longer biologically interbreed?  \n\nHey, it's science fiction.  Lets explore the possibilities.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}