{
  "id": "4043664753940315224",
  "title": "Okinawa:  The Afterburn (movie review)",
  "published": "2016-12-07T09:19:00.000-08:00",
  "updated": "2016-12-14T17:12:43.724-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/31371152211/in/dateposted-public/)\n\nMales especially, as future breadwinners, need training in being fathers and fixers, flyers and foes (for self defense). The military is their school or institution for providing these things, free of charge but at a price similar to the one exacted by prison: a loss of freedom, and possible death by legal means (the state has pre-authorized you to die defending said state, just as prison guards may use lethal force).\n\nOkinawa was such a training ground.  Lots of Japanese proto-wives to have and to hold, lots of children to share candy with, lots of B-52s to fly around and maintain.  They'd go home to Ohio and Alabama all the more ready to care for their families and communities in a civilian setting, having served, and therefore skilled and deserving of honor and respect, as veterans.\n\nThe reason one needs bases far away is to absorb the dominance culture and feel the might of one's homeland.  Soldiers impress other soldiers, by ordering locals, making them accept base after base, servant ranked jobs, and all the sex trafficking that entails.\n\nAlso, no one wants to be seen by one's friends and relatives, stumbling around in a drunken state, experimenting with sex and so on.  Best to go off and do that alone, with strangers, in a forgiving environment, then maybe straighten up and fly straight once home, grateful to not be dead yet.\n\nThe Okinawans did not take on this role without resistance.  Whole cave-fulls committed suicide or mercy-killed one another, having been trained since birth to equate hostile takeover with a death sentence, an instruction to self destruct.  That programming worked in many cases.  Parents euthanized their own children.\n\nOthers stumbled around in the Battle of Okinawa getting shot at, losing their people.  Many of them get interviewed for this movie.\n\nAfter World War 2, Okinawa became a US military base, the Japanese military having been pushed out.  The Americanization process had started with Commander Perry, who sailed his fleet into harbor in the late 1800s and started bossing people around right away.\n\nJapan to the north understood Americans were planning on having bases (not so much schools or resort hotels) all over and pushed back, as we know, with bases and prison camps, and comfort stations, of their own.  Korea, China and the Philippines bore the brunt of their counter-empire.\n\nThe option to have bases [more like schools](http://worldgame.blogspot.com/2016/12/at-berkeley-movie-review.html) and resorts is always just beneath the surface.\n\nThe same Iron Mountain command structure that enslaved Okinawa has [enslaved North America](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html) for many years, is striving to hold the world hostage more generally, with its nuke weapons and all that.  We're to obey, not question.  However some questioning still goes on, some reminding of the locals of our democratic values (similar to Okinawan values).\n\nA lot of Okinawans misunderstood the Nixon Era and thought \"reversion\" i.e. \"returning Okinawa to Japan\" (like what the Brits did with Hong Kong) would mean an end to the US military bases.  They'd come to think that was what \"reversion\" meant.\n\nSo when Okinawa reverted, yet the bases stayed, even grew, some belief systems imploded.  Okinawans came to see themselves more as an ethnic minority people take advantage of and feel superior to.  The push back there has been more identity politics and island nationalism, not unlike in Puerto Rico. \n\nGiven all the inertia and the needs of males for dominance in situations, as expressed in their pressing need for these military bases, I'm not seeing any office in the USA that's powerful enough to command otherwise.\n\nFigurehead presidents won't phase them out, whereas [the Pentagon's fantasies](http://controlroom.blogspot.com/2015/10/diplomatic-gaffs.html) of the future all depend on this network of bases, all interconnected in their own underworld.  Civilians have been stripped of any real power to stop the global dictatorship of a controlling military.  They just don't have the weapons. The whole planet seems like Okinawa in a nutshell, the prisoner of an evil genius, [the Y chromosome](http://mybizmo.blogspot.com/2016/12/wanderers-omsi.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}