{
  "id": "7001270901739751917",
  "title": "Old Pipes",
  "published": "2012-10-30T22:20:00.002-07:00",
  "updated": "2012-10-30T23:09:33.465-07:00",
  "content": "One of the technologies I half expected, that didn't materialize to much degree (yet), was the [DwellingMachine or JavaDome](http://worldgame.blogspot.com/2006/01/location-scouting.html) (programmed in Java).  No, it wouldn't have to be a dome.\n\n[Stewart Brand](http://controlroom.blogspot.com/2011/03/stewart-brand-at-reed-college.html) is happy to see most timeline hours spent swept up in some city, a concentration of humans that's relatively easy to feed and doesn't sprawl out all over the place.  That would leave more absolute wilderness for the pure nature lovers.\n\nYou really could still get away from it all and, more to the point \"it all\" could be more free of you and your impacts.  Those \"sapiens\" (self named) created [radio-toxins in signature quantities](http://controlroom.blogspot.com/2010/05/wanderers-2010511.html) and that last a long time.\n\nPatrick has volunteered to saw into my pipes so we can snake them from a different angle.  I find myself whining about the lack of home optic equipment for snaking pipes.  The gizmos are still too expensive to buy [at Home Depot](http://controlroom.blogspot.com/2005/12/presents-for-iraq.html).  Maybe rent?  Anyway, I'd like to see what I'm up against.\n\nIn that Other Tomorrow wherein people were smarter and cared more for one another, we would have all those pipes in the DwellingMachine docs.  You'd have lots of diagrams and could grow up studying house wiring / internals, getting a sense of the aerospace level technology that we'd be applying.\n\nOur homes would be [made by Boeing](http://mybizmo.blogspot.com/2009/01/about-habitats.html) and like that (companies you've never heard of).  We'd be at peace enough, like on Star Trek, to be able to focus on civilian dreams.  The big extravaganza killing of ourselves as \"extras\" (to some egos for sure), would be getting people imagining a brighter future for themselves.  [Smart houses would arrive](http://grunch.net/archives/38).\n\nThis Jetsons-like reality was not really to be, though in other ways it was.\n\nMy wood frame home was built in 1905 and if an upgrade were done to make it more of a \"node\" (the Blue House has some institutional responsibilities, helps with various series shall we say, like manga and/or anime, we would want to treat the old wood with respect.\n\nAn Art Deco layer was added, the [hemi-cylindrical bookshelves](http://www.flickr.com/photos/kirbyurner/4015630210/) and black tile fireplace, flush to the wall (no mantle).  Then came the 1950s steel countertop Diner look, with vinyl surfaces (walls and ceiling).  [We still have this](http://www.flickr.com/photos/kirbyurner/3302072052/), in light pink and blue, yellow and white.  What the throwback.\n\nThe place where Patrick would cut is already sawed out.  It's not like there's no flow at all, just that it's somewhat microscopic.  The smart thing would probably be to... we'd have the CSN architect-engineers keeping themselves busy.\n\nCity codes need to be respected.  We're not zoned to be a commercial TV studio and that's not what I'm suggesting.  More turnover and throughput maybe, as more houses came on-line.  Students are always coming and going in the Global U.  We could ramp it up slowly. \n\nCongratulations to Cleveland High School for the sweep at Willamette University, far and away ahead of the pack.  That school is a phenomenon and Tara helped stir the pot, in starting the team, now objectively Oregon's best -- but I say that only to encourage rivals to have their own surprising successes.\n\nGonzo writes:\n\nWe finished October with a first time Overall Sweepstakes Award at \nWillamette University by a huge margin.  Most of the 26 schools finished\n with between 20 and 40 points.  A few reached 70. Lincoln and Sprague \njust broke 100.  The [Cleveland] Cannibals earned 187 points.\nThese debates could become more international in flavor.  Not model UN, not model NATO.  Other formats.  Invent them.  Watching really thought out debates is educational.  There've been some communications barriers to overcome.\n\nThe fantasy of an overhaul of this dwelling unit thanks to some education-related scenario, is [an old theme](http://mybizmo.blogspot.com/2011/11/office-studio.html) in these blogs.  Lots of near future believable science fiction weaves in and out, creating some just around the corner feelings.\n\nThat's a common technique in writing, and in life, and beats always painting bleak pictures, landscapes drained of much hope.  This idea of some obviously good things happening is always appealing.\n\nHumans feel drawn to improve their own lot, versus wallowing in despair.  Fuller attributed to Einstein, in his mind a great philosopher-scientist (mine too), the tug of longing versus fear.   That's a really important axis about which the world turns, thought Bucky, and I tend to agree.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}