{
  "id": "112586449465086718",
  "title": "OMR?",
  "published": "2005-09-04T12:40:00.000-07:00",
  "updated": "2018-10-02T23:01:57.646-07:00",
  "content": "Is now the time to dust off shelved megaproject proposals, e.g. Old Man River City (OMR)? Trevor brought this up at our meeting yesterday -- seemed apropos.\n\nThis stadium-shaped A-frame features terraced living, with apartments taking the place of bleachers (obviously its scale dwarfs ordinary football stadia), plus a cover.\n\nI updated [a web page](http://www.grunch.net/synergetics/domes/domeproto.html) on my site with a pictured scale mockup (see Bucky Fuller's Critical Path, 1981 for more details).\n\nOn synergeo (Yahoo eGroup) some guy thought I was talking about replacing New Orleans with this leviathan, but I'm more thinking how to bring something on-line that'd be faster to start using (it could go up in sections), while employing companies starting now, thereby giving folks some options (shades of New Deal thinking).\n\nThe eventual fate of New Orleans needn't hinge on what we do or don't do in the East St. Louis area.\n\nAnd we might have learned something in Baghdad about building in transparency (sorely lacking in that context).\n\nThe tsunami story isn't over yet either, by a long shot. Disaster relief could and should be one of the world's principal industries (like the body's immune system), fading into construction, communications, health care and education at the civilian end of the spectrum.\n\nEmergency response becomes part of the military way, what with its chain of command and experience with heavy equipment. Restoring order means reverting to a natural state of nonviolent civilian living. Putting out fires is the name of the game -- not starting them.\n\nI don't know if OMR is just a solution looking for a problem here, but bouncing back from Katrina with megaproject proposals, one of which would be rebuilding New Orleans itself (a daunting task), is a healthy response. However, going to the moon wouldn't be that relevant (thinking back to Hurricane Camille, which came [shortly after](http://vlib.iue.it/history/USA/ERAS/20TH/1960s.html) Apollo 11).\n\nFloating city ideas should also be revisited while we're at it, with realistic attention to natural disaster possibilities. Not every technology is suitable to every ecosystem -- presumably we know that much by now.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}