{
  "id": "4156796991713060241",
  "title": "On Break",
  "published": "2009-08-29T18:36:00.000-07:00",
  "updated": "2009-08-31T19:15:34.231-07:00",
  "content": "Per my power lunch [with Trevor](http://www.synchronofile.com/), we're probably going to need to decorate Bucky a @creationist, a kind of war paint, given [limited debating positions](http://controlroom.blogspot.com/2009/02/wanderers-2009217.html) in Lower48, with \"anti-reductionism\" maybe too highfalutin for post Scopes Trial killer bees.Any top-down synergism is creationist in that sense.  Certainly there's an entry on teleology in Synergetics Dictionary, as like \"voltage pressure\".  Likewise, [Teilhard de Chardin](http://worldgame.blogspot.com/2009/08/holding-pattern.html), though friendly to fossils, happy to embrace Darwin, was not above a more Masonic \"intelligent designer\" world view, with an Omega in place of [a G](http://worldgame.blogspot.com/2007/11/fixing-g.html).[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhoMpPUnY5unLoC98ZF1POUUNPgZP7JJGo2fekRqKmEX6bUw67E_nUDiyDds-VYZhFKgtAuxUjUHUVGlj3uOz6SIoXn2LghrBcDoyDkphW9-GSI6IJqrAuHbbUtB3f9lRExvBj4/s1600-h/babel_masonic.png):: [the tower](http://www.shopmcmenamins.com/categories/112-Posters/products/1479-The-Tower) ::I'm on break from chauffeur duties for the Lindsey Walker Show, a private party at Duke's Landing, though we're not encouraging alcohol (BYOB is a right since [the end of Prohibition](http://worldgame.blogspot.com/2008/12/repeal-day.html)) on the off chance there's still a way to repair the relationship with the neighbors.  Zoning permits a street of dreams in SE Portland, but youth culture is traditionally repressed in post-Victorian societies.  Portland is scarcely out of its Wild West years, has a long way to go in some dimensions.[](http://www.flickr.com/photos/17157315@N00/3865452725/)Anyway that private party with 80 people staged by Babies with Rabies might've helped tip it in favor of the killjoys. OLCC looks for people stepping on the sidewalk with anything boozaholic.  That's the name of the game, when they want to crack down.  Duke's had its alcohol monitor, sure, but that wasn't enough to satisfy the referees in this case.I'm learning a lot about the Wild West these days, am looking forward to Lindsey's playing.  I've invited a bunch of people.  Glenn, another Wanderer, is on his way over.  She's a top talent though her loud edgy sound is not for everyone.  Here's [her latest circular](http://mybizmo.blogspot.com/2009/08/lindseys-flyer.html) on Bizmo Diaries.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj-boRJ32uY_C7_3jviQF-098_6k4so0M8Z2HX1MGe7oARMBzxkEk0WHToMk-f6QhgxB1mqnqDAu0XKlgWRf2XE3y7_xeM9vQ7xhCq9dJi7COK6tigFVqsH3Apd7mfV3f1NwFSF/s1600-h/lindsey_tweet.png)I had a fine time with Tag recently although The Annex turned into a hoot and holler fest (some sports team, full of gusto).  We wound up at Ringler's instead, much quieter.  Our main order of business:  [help Python.org](http://wiki.python.org/moin/Languages) tune in the [Arabic speaking](http://wiki.wxpython.org/index.cgi/ValidI18nCodes) blogosphere and, more important, look for NGOs wanting to make a difference in [helping small businesses](http://mail.python.org/pipermail/edu-sig/2009-August/009506.html) get going, jump start new careers in the arts, in design, in banking, in food services, health and education.I'm steering her towards the next PPUG meeting, even if I'm to be at the Django conference.  We have a lot of [Idealist.org people](http://www.idealist.org/) at most of those meetings, perhaps from other world domination shops I'm still clueless about (I'm far from omniscient, even regarding geekdom here in Portland).  What would it look like, to code Palestine on Rails?  I should put her in touch with [DemocracyLab.org](http://democracylab.org/) as well, to yak about Google App Engine solutions (Dr. Chuck a new Plaxo friend).[](http://www.flickr.com/photos/17157315@N00/3869359449/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}