{
  "id": "6156993423896034817",
  "title": "On Forming Future Feds",
  "published": "2023-12-08T12:34:00.000-08:00",
  "updated": "2023-12-11T07:18:03.236-08:00",
  "content": "Per recent posts, I've been looking at pride in one's country as an individual's creation, integrating into the background yet always in some ways distinct. Bringing these distinctions into the foreground and having them catch on is one way of fighting for one's country. \n\nDistinctions may take the form of differences in curriculum.\n\nSome private schools, given the makeup of staff and faculty, lineage and history, are like grooming grounds for future Feds. I'm not assigning any negative spin to the grooming or finishing, polishing aspect, nor to the end goal of turning out highly skilled future bureaucrats. Rather, I'm highlighting the power of some private schools to embody what public schools might wish to emulate. Curriculum distinctions thereby spread.\n\nLet's take a concrete example: RSA, the algorithm. Mathematics for the Digital Age and Programming in Python has its roots at the Phillips Academy at Andover, where it was written by two faculty members, Maria and Gary Litvin. \n\nAlthough using a programming language, the book builds towards communicating public key cryptography, which underpins what I'm calling Supermarket Math (aka Commerce World). Familiarity with cryptography is one hallmark of a future Federale (federalist). The public schools now have Phillips to imitate, not that they really can or will given the grip of the private sector on schoolbook publishing.\n\nI don't mean to sound defeatist however. In fighting for my country, I point out that schools on paper at least have the freedom to go electronic while customizing their learning and teaching materials. \"One size fits all\" is not competitive versus economies that understand how to optimize. \n\nDifferent schools exploring in different directions, running in parallel, are going to find and establish a stronger track record, just watch. The private schools I've worked with all get to RSA as a topic, somewhere in the curriculum.\n\nSunshine Elite Education (SEE) was one such client. I was given three outstanding students and a free hand to accelerate through a whirlwind tour of core topics they'd re-encounter at places like Jesuit and Central Catholic, other top schools in our area. Catlin Gabel. Oregon Episcopal. You know the ones (if you're in Greater Portland that is). These were 8th graders and already computer literate.\n\nYes, I'm aware the Elliptic Curve algorithms have superseded RSA in many contexts, but from a high school curriculum development viewpoint, we need the history and the number theory that RSA provides. Nothing bars deeper EC treatments going forward, but as a forewarning they're likely not coming from me i.e. you'll find only so much about a topic before I'll hand it off to a better positioned teacher or teaching. \n\nI'm more a transit lounge than a final destination for a lot of students, with connecting flights (I'm getting more metaphorical on you).\n\nMy USA is into Martian Math, meaning future Feds from my province, Cascadia, might not even call themselves Feds. They'll be Pythonista Federales or something more Hispanic sounding. We're keen to brand differentiate from the overly Anglo. We're a lot more Asian-Latino here in Portlandia. \n\nThose are my years of AFSC background talking, per my community service resume: Latin America Asia Pacific Program (LAAP). I wasn't a staffer so much as supervising Quaker.\n\nOur Stark Street meeting was originally a dual purpose building: Religious Society of Friends and American Friends Service Committee both had their facilities there, with many doorways and staircases connecting them. AFSC later outgrew the small office and took over a whole house on E Burnside, which is when I was around and LAAP happened. \n\nI also served at the Yearly Meeting level, as a Quaker delegate to the corporation (AFSC), bolstering the latter's legitimacy as a Quaker-backed nonprofit staffed by mostly not-Quakers.\n\nOur regional AFSC programming was not centrally focused on Mesopotamia, which is more an Atlanticist thing. During my tenure, wearing various hats, the focus was (a) youth leadership training and (b) tapping into Asian and Hispanic subcultures through after school extra curricular activities. Does this all sound subversive? To me it sounds like church work, kinda mainstreamy.\n\nHowever, Portland has quite a few expat Palestinians from the early diaspora, families who migrated to Kuwait, Jordan and elsewhere the first time an expulsion happened. They had to take up statehood outside of Palestine and some of them ended up around Portland. \n\nBut that's only the tip of the iceberg when it comes to our Arabic speaking communities. I like to think my ties to the Free Open Source movement tied me to Arab speakers, more than my AFSC work in this town. Dr. Tag an I overlapped through CUE and her having roots in Ramallah (site of Ramallah Friends School).\n\nI see the USA as acting responsibly in the Refugee business, but more from the point of view of a Diaspora nation, a global dispersion that includes a lot of expats, as well as base dwellers. We cannot easily turn our backs on our heritage, Statue of Liberty and so forth. \n\nA lot of Anglo-Euros who came here were more interested in being imperial (versus the locals at first, later more globally), or setting up some \"government in exile\" or what have you. \n\nI'm more focused on keeping travel circuits opened up and available, including people falling through the cracks per the United Nations, the so-called stateless or undocumented, and among the most oppressed.\n\nPeople don't talk about the Tibetans nearly as much as they do about Palestinians, when it comes to examples of recent diasporas. However, as I was saying above about Portland, and more especially here in the \"Buddhist ghetto\" (term of endearment) in which I live, we do have that more Asian focus.\n\nAlong those lines, my Uncle Sam is allowed to operate in that spookier space of the has beens, as a past tense entity, given the nation-state system as a whole has been superseded, we see all the signs. There's a chthonic quality to governance, sending more energy to mythos, that dream world where virtual nations get born in the first place, in glimpses and glimmers.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}