{
  "id": "110918458996455537",
  "title": "On the Edge of Chaos",
  "published": "2005-02-23T10:12:00.000-08:00",
  "updated": "2006-11-15T11:44:08.581-08:00",
  "content": "Recent mathematics has converged to a state of \"controlled chaos\" which many consider the optimized space for innovation and creative response.  The degrees of freedom are many, but not so many as to destroy any sense of rules, of a game.  But nor are freedoms so restricted as to make every response \"by the numbers\" -- a game for AI robots instead of human beings.War gamers well know that simulations never fully anticipate all the ripple effects of wartime scenarios.  An attack commences, and the avalanche of unintended consequences begins. Then come the ad hoc responses, an attempt to keep some semblance of control over events.  Finding a way to stop a war becomes central -- they're relatively easy to start, but hard to reign in, once the violence is unleashed.World Game likewise acknowledges the limitations of simulations.  This emphasis on \"control rooms\" may seem perversely control freaky to some, as they know in their gut that life on the edge of chaos cannot be controlled.  There's a dance, a set of feedback loops, but it's ridiculous to suppose any mastermind is on top of everything -- which is why these Dr. Evil paranoias so rarely make any long term sense.However, given World Game is concerned with building a lot of civilian infrastructure, there's more confidance going in that the synergies will be positive, whereas war gamers rightly expect increasingly grave situations. Dee Hock of Visa talks a lot about \"chaordic\" enterprises.  They're designed to self-organize and spread, but not under anyone's thumb.  The Internet is another obvious example.  And we've seen many positive synergies in both scenarios.  Visa cards are a great invention, even if they're abused in many cases.  Likewise the Internet has given rise to many unforeseen (plus anticipated) abuses.  Yet in both cases, I'd say the positives far outweigh the negatives.So yes, I'll readily admit that I'm not in control, even as I sit here in my control room, enjoying a lot of overview, plus some sense of steering the ship.  I'm a powerful guy, sure, but I'm not masterminding the whole show, any more than any Dr. Evil is able to, from his cybernetic fortress of solitude.  I'm one world game player among many, trying to do my part for the cause.To war gamers, I may appear somewhat reckless, in my willingness to trigger avalanche effects, knowing in advance that I'm not going to be in control of them.  But it's a two way street:  I wonder how war gamers get away with being so cavalier, so blithe, so full of hubris, when their triggering events (e.g. aerial attacks) contain so much violence and pain.  At least I'm not misanthropic.World Game involves putting a lot of positive artifacts and tools out there, a Johnny Appleseed approach.  Pepper the landscape with goodies, stuff people may find useful.  Then look for ways to switch energy towards these somewhat sketchy circuits, maybe throttling back if unanticipated show stoppers arise. In my view, this is how the USG itself got off the ground:  a lot of well-architected infrastructure was implanted and set running.  Over two hundred years later, the resulting controlled chaos is still a source of positive synergy.  But we can't stop seeding the future.  It's up to us to plant and nurture, even if we don't really know what all the ripple effects will be.  That's just life. However, if the focus is lasting/sustainable success for omnihumanity (Fuller's goal), versus myopic \"you or me\" survival of the most brutish, then the likelihood of reaping a reward vastly increases. If your game is death and destruction, you're basically incompetent and need to be sidelined.  That doesn't mean I'm anti-military though.  Defending the long term integrity of the USG, by defending against inferior and undermining ideologies, remains an important aspect of World Game.  The Russians do the same, and more power to 'em.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}