{
  "id": "113868632623318905",
  "title": "One: The Movie",
  "published": "2006-01-30T21:46:00.000-08:00",
  "updated": "2006-11-15T11:44:15.084-08:00",
  "content": "Dawn and I caught [this one](http://www.imdb.com/title/tt0493155/) at the Bagdad free of charge. Given the offgassing of fumes from the floor varnish in the soon-to-be pool table room (behind the big screen), management decided to forego the $3 admission and just sell refreshments.The staff never dimmed the house lights, although I made a special trip to the counter with this request. The dimmer guy was on the phone. Oh well.Anyway, as the liner notes and movie script spell out: some middle aged, middle Americans take it into their heads to get a DV cam and make a movie on the meaning of life. As might be expected, given no training or background, they come up with a hodge-podge.The saving grace of this film is they manage to record some trully talented people sharing honestly and sincerely, including but not limited to several [VBNs](http://worldgame.blogspot.com/2005/11/acting-locally.html) on the spirituality circuit ([some of whom I'd read](http://www.grunch.net/synergetics/kiyoshi.html), but never seen, like [Robert Thurman](http://www.imdb.com/name/nm0862201/)).But the interviewers, being somewhat clueless and inane, tend to squander the opportunity by asking \"big\" questions instead of probing or insightful ones. Now if only we'd had Bill Moyers... There's also some storyboard about some guy on a \"journey\" (he rides buses and stuff).In sum, this isn't very good reality theater, much as I admire the players.My sense is there's tremendous talent out there, especially in the religious sector, ready and willing to rise to the occasion, but a lot of this talent goes untapped. We just don't have the needed directors yet.The solution may be for more religious groups to see the making of film and television as a divine calling, and not leave it to others to get it right. A role model here might be [Khyentse Norbu](http://www.imdb.com/name/nm0634897/) of Bhutan.And let's script in more technology working to alleviate suffering in tangible ways. I'm tired of this ridiculous stereotype that spiritual people can't do engineering or use computers.Add to all this dumbing down all those supposedly God-directed clowns brandishing firearms and making terrorist TV, and you can see why so many good people tend to marginalize religion as irrelevant at best.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}