{
  "id": "621467378218418775",
  "title": "Ongoing Wanderers Conversations",
  "published": "2019-12-15T10:26:00.003-08:00",
  "updated": "2020-03-24T08:45:24.625-07:00",
  "content": "Now that Yahoo! Groups is no longer archiving our Wanderers discussions, some of the same threads have meandered over to Facebook, where they gain a different audience.\n\nHere's an example from recent weeks:\n\nKirby Urner Terry Bristol in this one I give the cosmologists the benefit of the doubt and accept a \"heat death of the universe\" scenario. Even so, after making that concession (for the sake of diplomacy if nothing else), there's still no justification in physics for the world \"going downhill\" in the near term. Using \"heat death\" scenarios to justify poor management is merely farcical, not tragic, and involves extrapolating a misbegotten Malthusianism, coupled with Social Darwinism. I bet Romer would agree.\n\nEdit or delete this\n\n- \nLike\n\n-  · Reply\n-  · [2d](https://www.facebook.com/thekirbster/posts/10157680182093965?comment_id=10157680204288965)\n\n- \n\nTerry Bristol The universe is NOT running down. The supposed low entropy beginning is 'impossible to explain – if all processes are entropy increasing. Suggest watching my summer talk in Russia: How the Elements came to be as they are, July 28th, 2019, Mendeleev 150, St. Petersburg[https://youtu.be/fKWLoBOZUtw](https://youtu.be/fKWLoBOZUtw?fbclid=IwAR29QFcMDG1N53GKxvpnLimry7ebLDZEcGuuccRv04x-JN0x8OqnK1qGgMM)\n\nDelete or hide this\n\nYOUTUBE.COM\n\nYouTube\n[YouTube](https://youtu.be/fKWLoBOZUtw?fbclid=IwAR3Hok7UF_Gh9h7Py0JUF09awj7WBXxpbksXPPB4eua2toQDyWumPaNlxIw)\n\n[](https://www.blogger.com/null)\n\nLike\n\n · Reply\n · [3h](https://www.facebook.com/thekirbster/posts/10157680182093965?comment_id=10157680204288965&reply_comment_id=10157687662208965)\n\n- \nLike\n\n-  · Reply\n-  · [3h](https://www.facebook.com/thekirbster/posts/10157680182093965?comment_id=10157680204288965&reply_comment_id=10157687662208965)\n- \n\n[](https://www.facebook.com/thekirbster)\n\nKirby Urner Only some processes are entropy increasing, not all, in everyday thermodynamics e.g. planet Earth considered as an open system could as easily be syntropic as entropic. To what extent is that difference up to responsible engineering? What difference do the humans make, if any?As to whether the universe is ultimately running down, even were we to concede that as a debating maneuver, I would still argue that this has nothing to do with the fate of our Earth for the next million years at least.\n\nEdit or delete this\n\nLike\n\n · Reply\n · 2m\n · Edited\n\n- \nLike\n\n-  · Reply\n-  · 2m\n-  · Edited",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}