{
  "id": "4251766068408852818",
  "title": "Open Source Photocopier",
  "published": "2011-03-22T09:29:00.000-07:00",
  "updated": "2012-02-09T13:41:56.850-08:00",
  "content": "I rewatched [Revolution OS](http://www.youtube.com/watch?v=CjaC8Pq9-V0&feature=related) last night, after a well attended FNB.  Jay did a good job with those zucchini from the Blue House (prepared at St. David's).  Melody gets the potatoes this afternoon, for Pink House prep.\n\nThis time I notated the time signatures where O'Reilly was mentioned or featured, as I was sharing this with [OSTers](http://www.oreillyschool.com/), many of whom have probably seen it.\n\nCombining the ethic of Make: and DIY, I'm envisioning a course built around an open source photocopier, meaning you may explore and experiment with it in any direction without hitting a brick wall of proprietary \"eyes only\" layers.  \n\nThe microcode, circuit diagrams, drum architecture (if it has one), are all laid out and for free, with parts obtainable.  Robotics has already taken this route, as has bioengineering.  Sometimes we overlook the more mundane, yet printing machines of various description play a huge role in the workings of human societies.\n\nHow might your average city kid, male or female, of whatever \"race(s)\" and/or \"creed(s)\" avail him- or herself of said assets?  Or average rural kid, or statistical outlier?  There'd be these learning shops full of strategically placed products, much like is found on some university and corporate campuses today.  People who already know the business get to be trainers.\n\nI was thinking to see Inside Job this week (with Tag, Jody and/or Suzanne?), which is not about 911, but about all those people playing real estate games in airport hotel seminar rooms, being like the Werner Erhards of \"get rich quick\" Ponzi-like operations, all dressed up and corporate (a lot of this was post the dot com bust, another big let down for many canny investors).  \n\nWhen that all went away, as obviously it would, many dream bubbles burst, kind of like in Yugoslavia (more Ponzis gone wild), which became once again Balkanized.  But I haven't seen the movie yet, so I'll save it for my review.\n\nI also need to write to Nick (still in Eugene, where Rick and Cody went).  Did Amber ever find her way back to Hannah's and John's?\n\nI don't know if the University of Havana would be interested in the photocopier idea, on top of [all the ice cream ](http://mybizmo.blogspot.com/2009/08/diversity-training.html)(another set of open source plans).  Perhaps Japanese campuses already have closed source versions they'd be willing to declassify.  Even if they're older models, you're building up the folk knowledge any service-oriented culture will need.  Yes, of course I have my eye on the Pauling Campus, as usual.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}