{
  "id": "1361353990091599591",
  "title": "OSCON XVI:  Wrap Up",
  "published": "2014-07-24T11:12:00.001-07:00",
  "updated": "2014-07-25T18:47:07.334-07:00",
  "content": "If you've not been to an OSCON, you might find it surprising how many talks are of a \"psychological\" nature, meaning about inter-personal skills, not in the sense of compensating for not having them, but in the sense of being a community manager or developer evangelist for a global company that depends on Agile / OSS for strategic advantage.  [Neo4j](http://neo4j.com/) is such a company, and their developer evangelist did [a dynamite job](http://www.oscon.com/oscon2014/public/schedule/detail/34471) outlining exactly what the job is, using graph theory.\n\nOlder companies may not appreciate what a \"community manager\" even is, as that sounds like some touchy-feely PR job, some icing on the cake associated with lobbying and schmoozing with members of congress.  There's some of that \"special interest\" or \"lobbyist\" flavor, for sure, but you're more serving a team of expensive race horses, your developers, your sled dogs, who are pulling this chariot towards fame and glory, or just plain old towards helping people, making life less of a drag.  Graph databases are doing that for people and Neo4j is a serious player.\n\nAnother talk was on [Dealing with Disrespect](http://www.oscon.com/oscon2014/public/schedule/detail/34248), by a seasoned community manager with Ubuntu on his resume, one of the premier users of, and of course developers of, free and open source software.  He sketched a sorting system of three buckets:  agreeable, disagreeable and unacceptable communications, and techniques for dealing with the disagreeable most especially, as that's where attention to context matters.  Get beyond just content and tone.  The basic posture is empathy.  As an empathetic attender to communications, you're less likely to just go off in the face of provocation.\n\nWhat I found refreshing and agreed with in this talk is we're not attempting to criminalize offending content, such as satire ala South Park or whatever.  Offensive content, like toxic acids, has its place on the chemistry shelf, as an ingredient.  The public spaces are free to protect themselves from too much \"push content\" but if you wanna watch HBO, that's your business.  Content providers are not always trying to reach that \"agreeable to everyone\" market, or only are some of the time.  That's all my spin on the presenter's remarks, what I took away as validation, given my content is sometimes offensive.  It's not like I didn't put that skull and crossed bones on the bottle (smile).\n\nI stayed at my workstation Thursday morning (atypically a last day, as the usual format is Monday-Friday, not Sunday-Thursday -- next year back to normal), getting back in the groove.  This was not vacation time for me.  On the contrary, it was double duty.  True for all in the mentor pool who manned the booth (Kelly, Patrick...).  Our main booth guy is not a coder by training but is fairly able to converse in Portuguese, Russian and maybe some other stuff.  Given i18n was a theme for us, he was just what we needed from central casting.  I sat around looking silvery gray and professorial, in my blue blazer (no elbow patches).  I brought Naga ([@psf_snake](https://twitter.com/psf_snake)) in her special carry-on and draped her over the OST counter on Wednesday.  I'm talking about the Python mascot in past OSCONs (she'd flirt with the Perl camel), this year mute on Twitter as I'm no longer her puppet master behind the scenes.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}