{
  "id": "6659478428742003642",
  "title": "OSCON Followup",
  "published": "2015-08-15T14:35:00.000-07:00",
  "updated": "2015-08-30T12:24:24.909-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/21019659901/)\n\nI feel fortunate to have had a high access path through OSCON this year, as one of the proposal readers.  I'm able to [watch the videos](http://mybizmo.blogspot.com/2015/07/oscon-2015-wrap-up.html) of all the talks, the majority of which I missed, obviously.\n\n[Seeing R0ml](http://worldgame.blogspot.com/2014/07/r0mls-talk-why-schools-dont-teach-open.html) teaching Haskell brought me joy and I started downloading Part 1 immediately, having had some trouble with the online player.\n\nThat's a segue to my next piece of good news:  CenturyLink has finally brought optical fiber speeds to my neighborhood.  We've seen the trucks.  Yes, I'm [ready to starve a little](http://worldgame.blogspot.com/2015/08/health-talk.html) bit to get more of the world online.  I hunger for bandwidth, both up and down.  These OSCON videos are a case in point.\n\nI want to download copies for my phone, other devices, for train and plane viewing (cars not self driving yet but Bolt Bus... to Seattle maybe?).\n\nI hope to get the try-out setup before the month is out.  Today I'm still Mr. DSL with my slow uplink.\n\nGlenn and I did Atlas Pizza today and talked about floating \"flextegrity cities\".  We've both had experience with [Sam's material](https://flic.kr/p/crzsp1) and the way it might deal with waves, damping them, seemed worth its weight in science fiction at least.\n\nWhy not speculate?\n\nI was saying in general I think more experience with oceans, before tackling Mars, might be smart.  The rigors of ocean living would help the landlubbers clean up their act, which would pay for itself right there.\n\nI told Glenn Stockton about Dan Suttin, who's birthday it is today.  He was so taken with what we call [the Octet Truss](http://www.grunch.net/synergetics/octet.html), or IVM, that he made a museum about it, now [getting more recognition](http://www.mysanantonio.com/news/local/communities/southside/article/Eccentric-Octa-Tetra-museum-finds-safe-haven-5757526.php).  He's 71 today. \n\n[](https://www.flickr.com/photos/kirbyurner/20605039975/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}