{
  "id": "5127765664889489981",
  "title": "OSCON XVI",
  "published": "2014-07-22T16:55:00.000-07:00",
  "updated": "2014-07-25T19:10:07.286-07:00",
  "content": "I've got a different angle on OSCON this year, from behind a booth counter some of the time, also in front of a TV camera in booth 818.  OST is booth 717.  We're well integrated into the O'Reilly ecosystem, with the mother ship booth to our west at the Expo Hall Center.\n\nOur program opened with a series of videos encouraging OSCON attendees to strive towards being \"full stack engineers\".  What that means is awareness of one's place in an ecosystem.  Know about how you and your skills fit in to an environment.  Basic sense making, but in geek parlance.\n\nBluehost and HP are especially visible as one comes in the door.  Both gave keynotes this morning, Bluehost in tandem with Raymond Henderson of Grassroots.org, a latter-day CUE (where I used to work; Center for Urban Education) in the sense that it helps non-profits leverage free and open technologies (CUE was at its peak prior to Open Source going gangbusters, around the time of the IBM PC).  IBM was here in force this year as well, with Softlayer.\n\nGrassroots.org will get you some reliable hosting for your footprint in Cyberia, as long as you meet specific criteria.  Your ability to do quality bookkeeping is relevant. \n\nThe keynotes were somewhat psychological with the theme being inclusivity, the flip side (as in, same thing as) diversity.  What about children?  What about introverts?  Say what?  The talk on \"coming out as an introvert\" by Wendy Chisholm was quite ingenious in taking the term \"coming out\" -- usually associated with gender -- in a different yet related direction.\n\nWendy, an Accessibility expert, had found a way to pace herself that didn't go against the grain so much, in terms of her need to be alone with her thoughts and process in tranquility.  Someone with a daily meditation practice would sorely miss it for the same reason.  In allowing for her own needs, her stamina had greatly improved.  She encouraged conference attenders to attend to their own inner rhythms and maybe cutting back on stimulation as a way of engaging more fully.\n\nWe also heard from the younger generation, from a precocious programmer with parents up to providing guidance, and a community smart enough to appreciate his talents.  These factors:  access to the tools, guidance and encouragement, had led Shadaj Laddad to achieve maturity as a coder, with adult-level skills.  That he had done so much work in Scala was something the audience could appreciate.  Did I see Python code with a decorator aimed at adding trail call recursion of some kind?  That turns out to be [a deep topic](http://tomforb.es/adding-tail-call-optimization-to-python) in the literature I was unaware of.\n\nI took the nap lady's words to heart.  Not right away, as I had booth responsibilities and time on camera with Patrick and Steve, but later.\n\nWill Marshall of Planet Labs rounded out the inwardly focused talks, plus HP on OpenStack, by sharing about his plans to open global data to user via some API. He already has a lot of satellites out there.\n\nCarol Smith from Google, [another Diamond sponsor](http://www.oscon.com/oscon2014/public/content/sponsors), along with Citrix and HP, recapped ten years of Summer of Code.  Much has been accomplished.  The \"design science revolution\" (Fuller's coin) lives on.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}