{
  "id": "1990643475848559166",
  "title": "OSCON / ORM",
  "published": "2013-07-28T01:44:00.000-07:00",
  "updated": "2013-08-22T22:20:56.589-07:00",
  "content": "Steve held an [OSCON](http://worldgame.blogspot.com/2013/07/oscon-xv.html) Survivors' Breakfast at the Hilton.  I was pleased to have some face time with [Deb Bryant](http://mybizmo.blogspot.com/2011/07/oscon-2011-continues.html), [Allison Randal](http://controlroom.blogspot.com/2008/10/looking-ahead.html), [Eric Holsher](https://readthedocs.org/), [Lindsay Epstein](http://portland.activatehub.org/) and others.  Some of us Portland natives also attend the Wanderers meetings.\n\nLater that evening, again with Steve as a catalyst, I enjoyed a fine dinner with Julie Steele (with O'Reilly Media), Steve and Yarko, followed by more conversation at Greater Trumps.  From Julie I learned I should never skip [the Friday keynotes](http://www.youtube.com/watch?v=hVZxkFAIziA), which I had.  Good thing [they're taped](http://www.youtube.com/watch?v=e0H0BKrF4HY).\n\nThe chair's party was well attended.  Edd Dumbhill is the outgoing chair, with incoming chairs Matthew and Simon.  I got permission to invite David Feinstein to this party and introduced him to Simon.  I then drifted off and joined Yarko and Alex Martelli, who were speaking with the Code for America CTO, Michal Migurski.\n\nCode for America focuses on making government more accessible and transparent.  The process has its pitfalls.  Local IT is maybe itching to try its hand with newer technologies but gets slapped down by management. \n\nThen C4A shows up, a whiz bang team, and wins praise from the same management as genius outsiders.  The natives grumble.\n\nHow might C4A catalyze more appreciation for in-house talent?  Show management what's possible but then fade away.  It's a tiny program anyway.  Inspire but don't micromanage.\n\nOf course I'm thinking \"[USA OS](http://worldgame.blogspot.com/2004/09/usa-os.html)\" the whole time, what with whitehouse.gov folks working on some public APIs.  These petitions people sign:  there's mineable data there, which should be shared.\n\nThe confusion about Open Source versus Open Data is still prevalent.  When you invite development using shared open source tools, you are helping to level the playing field.  They have access to these tools without high cost barriers.  However tools are not data and confidentiality stays important.\n\nWhen the free tools are used, the schools aren't left out, because they can afford free software. They can also help improve it, to where the free tools are often among the best tools in their class.\n\nOne trains up an army conversant with PostgreSQL, other open APIs.  So then what?  Does government have the courage to use the same tools that schools can afford to teach?\n\nThat's a critical equation.  In some countries the verdict is in:  yes.\n\nOpen data offers its own set of advantages, but should not be confused with sharable tools.  Just because you know how to hack does not mean you have automatic access to private records.\n\nI missed way more talks than I managed to attend, that much is certain.  Netflix gave a good one I'm told.  People are turning to the Internet for their information and entertainment more and more.  Cell phones have only accelerated this trend.\n\nFacebook is building special data centers with their own power specs, for all those pictures you want to keep in your profile, but which no one retrieves on a daily basis.  Cold storage, which doesn't mean unresponsive.  Humanity is evolving new organelles.  Motherboard Earth is an evolving picture.\n\nAs usual, I was inspired to dive more deeply into various technologies thanks to these talks.  Simon's talk got me interested in Erlang, while the drone talk (a keynote -- nothing weaponized) impressed me with the relevance of Clojure.  I now have both installed and am working through Safari Books in my copious free time (sarcastic chuckle).\n\nTomorrow:  more chauffeuring of MVPs.  Another trip to the airport.  I'm happy to play [the role](http://mybizmo.blogspot.com/2009/03/chauffeur-duty.html).\n\nCongrats to Tara, who attended the brunch, on getting the driver's license and repairing her phone, two summer goals.\n\n[](http://www.flickr.com/photos/kirbyurner/9564623905/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}