{
  "id": "7842661237663253305",
  "title": "Out of Mind / Sight",
  "published": "2015-07-05T18:13:00.000-07:00",
  "updated": "2016-01-23T15:29:40.784-08:00",
  "content": "The usual phrase is \"out of sight out of mind\" and has numerous applications.  In Madness & Civilization, Foucault traces what he considers to be a series of signal flips in Western Europe's perceptions of, and ways of coping with madness, which we may also call \"extreme deviance\" to the point of inconveniencing others and prompting them to seek a radical solution.\n\nIn the Middle Ages, a town might drive its indigent, especially its beggars, outside the city gates and impose on them fines for returning.  Towns alongside rivers or canals might have their madmen hauled away by boat, creating the image of the Mad World as a large place \"out there\" beyond the boundaries of the Polis (city-state, police).  Foucault makes much of this \"ship of fools\" image.\n\nWith the Renaissance came the view of Madness as a window into a cosmic Other, a demonic realm, making it sacred in some ways, more shamanistic or shamanic.  The deranged had their own wisdom which likewise glorified [the Good Order](http://worldgame.blogspot.com/2014/02/the-lego-movie-movie-review.html), showing how derangement was integral within the wheel of life.  Reason and Unreason both derived from the same holy root.  This attitude sounds more Oriental to me.\n\nBy the Age of Reason, after the French Revolution, madness was more a pathology associated with \"not working\" (as in \"not making sense\") and the strategy became one of confinement.  The mad should be made to work, as under Protestantism, virtue was in one's discipline and obedience to God's ordained.  What drove the mad mad was not a demonic order but an untamed bestiality, an \"animal nature\" which normal humans had transcended (risen above) in a moral sense.\n\nA giant hospital system, left over from when leprosy was more of a scourge, was re-purposed to warehouse the scandalous, with the truly insane on display as people to feel superior to.  For a fee, one could visit the Asylum and mock the crazies and the freaks, or exude pity according to one's temperament.\n\nI'm reading all this against the backdrop of JFK and the Unspeakable by James Douglass (a well-read theologian) wherein some random guy, [Ralph Leon Yates](http://www.dcdave.com/article5/120418.htm), picks up a hitchhiker in his pickup.  The passenger has a gun-shaped bundle he claims are \"curtain rods\" and he wants to keep them in the cab.\n\nThe driver saw later this man looked just like the Lee Harvey Oswald on TV and the curtain rods were likely the gun he'd smuggled into the Book Repository and killed John Kennedy with.  He'd left the Oswaldy guy close to there.\n\nThe problem with this story, according to Douglass, was the Warren Commission had already included the one and only \"curtain rods\" story it wanted, with this extra Oswald story a loose end. Having two variations of the curtain rod story pointed back to a cover-up, as did all the suspicious shenanigans in Mexico City, which had to be rejected also, for much the same reason.\n\nAn overzealous crew of [Ollie North types](http://www.peacebuttons.info/E-News/peacehistoryjuly.htm#july51989), imagining themselves clever operatives, had seeded the field a little too zealously with incriminating memories, very likely using an Oswald look-alike -- including in the movie theater where he was later arrested (the \"other Oswald\" was in the balcony and arrested later per Douglass).\n\nThe fate of the driver?  He went to the FBI with his story, but since the Establishment understood its job was to support the Warren Commission, they had to commit him to a psychiatric hospital at the end of the day, and subject him to \"drug therapy\".  His crazy story was too much of an inconvenient truth.  He'd passed a polygraph test but that only proved he believed in his delusion, all the more evidence he was insane.\n\nWe shouldn't stop there in associating Yates's \"treatment\" with the rigid Rationalism of France.  Why not see Langley itself as a mother ship of \"hospitals\" dedicated to the [treatment of the deranged](http://controlroom.blogspot.com/2015/07/spy-movie-review.html)?\n\nLets remember though, that deep within the Agency, subterranean, riddled with moles, many an operative was even then delighted to see the cover story was so transparently a cover-up.  It would unravel in time, it would have to.  Many would participate in the unraveling, even as others would insert new stories designed to misdirect.  Right from day one, LBJ refused to blame the Russians, knowing where that could lead, dashing hopes many held for a more serious confrontation.\n\nThat's what a \"cover story\" is, when of this magnitude:  it buys time, is but a time capsule.  One generation hands it off to a next, an obvious puzzle, a mess.  One might as well stamp \"cover up\" on the box.  It's radioactive, and has a half life.  But in slowly leaking its information, whispering its truths, it's less explosive, and that's the intent.\n\nWere FDR-era Americans ready to accept a coup?  Had they heard of the Business Plot?  Coups were the stuff of Banana Republics.  The people of the USA needed a different narrative, the truth could wait.  They needed an official madness, a story that couldn't get them in trouble at work.  The job of the Warren Commission was to provide that.  People needed something to say that was not crazy, in a crazy world.  \"A lone gunman, acting alone...\" that story would become their security blanket.\n\nBeyond the mother ship is a network of secret prisons, all interconnected by torture taxis.  We're familiar with this Gothic infrastructure, as a result of the latest wars.  Large chunks of major office buildings, airstrips and old bases, [sympathetic contractors](http://mybizmo.blogspot.com/2005/10/hotel-oregon.html)... Capitalism's Invisible Army.  Yet another Gulag.\n\nThe madhouses of Reason's Europe were simply re-purposed, yet again, to confine extremists, inconvenient parties.  Madmen were not usually suicide bombers in Medieval times.  Even lepers were not that suddenly contagious.  Advances in the design of explosives changed the profile of insanity towards that of a Unabomber.\n\nIn sketching an appealing profile in courage, of Jack and Robert Kennedy, Douglass somewhat skirts the issue of madness in the Oval Office itself and what that might mean.  [Other books](http://controlroom.blogspot.com/2013/05/murder-mystery.html) take up that issue, including in relation to the Kennedy profile e.g. Royal Babylon and [Hersh's book](https://www.nytimes.com/books/97/11/30/reviews/971130.30powerst.html) The Dark Side of Camelot.\n\nIn going here, I find much that's fascinating yet think there's a danger in over-personalizing what were clearly crazy times.  The Oval Office, in its shape, is clearly a metaphor for the skull.  Craziness in the Oval Office just means in [the Executive Branch](https://youtu.be/qcpqHSAzDtU?t=356), West Wing included.  So we've come full circle, wherein craziness fights craziness (so who wins? -- it's the dialectic that matters, so who cares?).\n\nProhibition (still lingering) had turned the majority of Americans into criminals (aka \"sinners\") by that time so I'm never impressed by \"organized crime\" as anything worse than \"organized religion\" -- both have done their dirty business.  To Douglass, I maybe sound like [Quaker Mafia](http://worldgame.blogspot.com/2015/05/mad-max-fury-road-movie-review.html).\n\n\"Goodies and Baddies\" are so much less nuanced than \"Cowboys and Indians\" (a clash of ethnicities) -- unless you've learned to like villains.\n\nA lot of people felt excluded and shoved aside by that Imperial Presidency.\n\nWe have a lot more hindsight today, regarding what the Kennedy brothers were up to.  At the time, they were likewise considered inconvenient extremists by many factions, as Douglass well documents.  Participation in the cover-up was widespread, including by people with no clue about the truth -- they just saw it as [their duty](http://worldgame.blogspot.com/2016/01/conspiracy-dynamics.html) to support the official line, for [sanity's sake](http://worldgame.blogspot.com/2015/02/running-from-crazy-movie-review.html).\n\n:: another puzzle piece, take it or leave it ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}