{
  "id": "1532316221522366058",
  "title": "Pacific Islanders Meet",
  "published": "2013-11-10T18:55:00.005-08:00",
  "updated": "2013-11-11T07:27:45.103-08:00",
  "content": "For those unfamiliar with history, after Washington, DC imposed its post WW2 victory and Pax Americana in the so-called American Lake (the Pacific), it proceeded to betray a lot of peoples, starting with\n\n- [the Vietnamese](http://controlroom.blogspot.com/2008/09/paved-over-past.html) whom it sold out to its former colonizers after getting [Ho's help](http://mybizmo.blogspot.com/2012/06/looking-ahead.html) against the Japanese\n- then the Filipinos, whom [it liberated](http://controlroom.blogspot.com/2011/11/fire-and-ice-korean-war-movie-review.html) only to reimpose a heavy hand (having enslaved the Filipinos in an earlier chapter) and then of course\n- the Pacific Islanders, who saw their homelands turned into a nuclear testing range, with entire islands obliterated and/or rendered uninhabitable, while generations were subjected to previously unknown levels of long term low level radiation, the effects of which are still making themselves known.\n\nThis evening, a group of Marshall Islanders got together in Portland to reminisce and celebrate small victories.  DC had taken away their eight year driver's license, treating them as \"undocumented\" on their own islands.  They got that overturned.  Now they'd like their medicare back.\n\nTheir major atoll, Kwajalein, was taken over by a culture-crushing, despotic military, [the same one ](http://mybizmo.blogspot.com/2009/06/prisoners-for-pelau.html)that destroyed, and/or pushed to the edge of extinction, so many native American cultures.  DC has been lying ever since, about the true magnitude of its ecocide in the Pacific.\n\nGetting that [City of Morons](http://controlroom.blogspot.com/2013/08/city-of-morons.html) off the backs of free peoples in the Pacific is a worthy goal, but is difficult given DC, like Rome before it, counters open defiance with brutal aggression.  \n\nMore effective:  laugh at DC behind its back and work around it.\n\nPrivate corporations may be effective as DC understands and obeys those with means.  Money talks to politicians even when few others can make sense of what money is saying.\n\nTo paraphrase Wittgenstein, \"if money could talk we would not understand it\" -- unless privy to one of the code languages the monied use amongst themselves.\n\nCarol was too busy packing for her semi-annual migration to make this event, but I had Giff Johnson sign [a copy of his book](http://www.flickr.com/photos/kirbyurner/10792236324/) for her.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}