{
  "id": "8833610440783708549",
  "title": "Page Turner",
  "published": "2017-01-29T18:13:00.004-08:00",
  "updated": "2017-01-31T15:30:46.676-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/31790932943/in/dateposted-public/)\n\nI was reminiscing with David Koski recently, about the \"operating manual\" he placed flat open on the table, triangular book covers, just the one page.  The edges of the book covers, including hinge, are all two, the diameter of a unit sphere.\n\nImagine a page swinging back and forth, wagging, a triangle just as big as both book covers. It has an eye hook at the apex, something for taut string to pass through, should we want to emphasize this sixth edge of the two tetrahedrons. Yes the \"page\" can stay stiff. This is a moving sculpture I'm describing.\n\nThe two tetrahedrons have this page as their wall-in-common. As the page wags back and forth, two neighboring tetrahedrons co-vary and thanks to \"base times height\" have equal volume.  One may be a regular tetrahedron, with the other more a wedge, yet they'll both have the same volume, whatever we set that to be.\n\n[](https://www.flickr.com/photos/kirbyurner/31790934463/in/dateposted-public/)\n\nImagine holding three ping pong balls in a triangle, a fourth one in the valley between. That's a starting place. Now take one of those balls (of radius R, diameter D) and pivot it around any two-ball valley to assume an angle of 90 degrees to the no-longer-touching furthest ball.  That's √6, ball center to ball center (longer than 2 for sure).\n\nThe equilateral triangle of edges 2, both page and two book covers, has a vertical mid-edge to opposite vertex altitude of √3. The Pythagorean Theorem hasn't changed.\n\nThe right triangles defining each book cover have legs 1, √3, and hypotenuse 2. Area?  Base times height over two = 2 * √3/2 = √3 per each book cover.\n\nSo what's the volume of each right tetrahedron defined by the single page pointing straight upward, at 90 degrees to the book covers open flat?  The string from each book cover apex, to the eye hook in the page, is √6.\n\nEven without that fact, however, we have the base, √3, and we have the height, also √3.  Multiply those together and divide by three, per volume of tetrahedron formula, and we have 1.  Exactly.\n\nHaving achieved a volume of one, lets switch to a corresponding cube of edges R, with R being the radius of diameter D spheres.  Our original tetrahedron, recall, started with four of those.  Then we spread a pair further apart. Anyway, our cube of edges R has a volume identical to each of the two right tetrahedrons just described.\n\nWhat do we do with this fact?  The starting tetrahedron of four closest packed ping pong balls was where we start when measuring volume in our Synergetics namespace, perhaps branded as Martian Math in your neighborhood.\n\nThe right tetrahedrons associated with the vertical page each have a larger volume, by a factor of the √(9/8), about 1.06.  We may want to use this constant when switching back and forth between [two volumetric evaluations](https://youtu.be/FaKpOmKJ6Yw) of the same vista, in doing unit conversion.\n\n[](https://www.flickr.com/photos/kirbyurner/9533711958/in/album-72157624750749042/)\n\n:: from Martian Math storyboards ::\n\n[](https://www.flickr.com/photos/kirbyurner/32483803682/in/dateposted-public/)\n\n:: calcs by D. Koski ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}