{
  "id": "56575052310867699",
  "title": "Party Time",
  "published": "2018-09-23T21:25:00.001-07:00",
  "updated": "2018-09-24T12:35:18.819-07:00",
  "content": "Hey, I'm pleased [the Idlib scenario](http://controlroom.blogspot.com/2018/09/ironclad-logic.html) didn't go straight to blood, like some shoot out in Westworld, or should I call it the Park?  Remember [Punishment Park](http://controlroom.blogspot.com/2009/12/punishment-park-movie-review.html)?  Now there was a dark movie.\n\nI have some Proseco to celebrate, no not especially Islamic of me, but many ethnicities stand to gain, if we're able to move the Global U towards a more constructive set of rivalries.  Congratulations to everyone working on the rebuilding of Aleppo, especially that central mosque.\n\nI'm also celebrating the Fall Equinox.  ISEPP hosted Wanderers at the Linus Pauling House.  Terry explained his research into the history of the philosophy of engineering.  He's on a first name basis with Sadi (Nicolas Léonard Sadi Carnot) and Lazare Carnot  (Sadi's dad).\n\nThe latter was smeared in some circles because of his loyalty to French Republicanism.  Nietzsche respected him for his sticking to his guns.  Laplace was smeared too.  This happens to intellectuals, as their power and influence, including postmortem (especially postmortem), gains them enemies.\n\nRussian and Turkish commanders are working on the Idlib scenario.  Erdoğan and Putin had hours and hours of meetings.\n\nSpeaking of Turks, I've been picking on the Gulenists a lot, expecting them to advertise a future-friendly STEM through the charter schools, in tandem with the Quakers.\n\nHowever that's putting a lot on their shoulders, given they're transplants in many cases.\n\nRaising the flag of some Verboten Math is just going to attract the spotlight, when they've already been the subject of any number of FBI investigations.  Wading blindly into American politics is a recipe for getting in too deeply i.e. \"in over one's head\" as they say.\n\nI think I'll give those Sufis a break and switch my focus to the Jesuits for a change.  That's another religious sect with a commitment to education.\n\nI've worked quite a bit around Catholic schools (and teaching hospitals) and don't doubt the high level of commitment.  The decision to keep a tight lid on the Bucky stuff must trace to the highest levels.  Surely pure inertia can't be the explanation.\n\nI've taken up the investigation (inquisition?) on Gab.ai for the time being.\n\nTerry has discovered some engineering literature we might have taken for granted would already be translated into English, but has not been.\n\nTake Coriolis  for example.  We may have learned about the effect, but what do we know about the actual guy?  A lot of his writings have never been published in English.\n\nI've never been put off by skin color, and mostly get along well with the dead.  I'm not averse to learning more from the \"dead whites\" (and will soon enough be joining their number -- not to sound morbid or anything).\n\nA long time ago, scientists argued about [\"vis viva\"](https://en.wikipedia.org/wiki/Vis_viva) or the motive force.  They considered it a property internal to a moving body and akin to its inertia.  How to account for it mathematically, in symbols and computations, was a question for that day. \n\nMass figures into the equations, most certainly, but then so does velocity, and perhaps to a second power?  Is a projectile with twice the velocity thereby empowered to do four times the work?\n\nJean Bernoulli contributed some clever reasoning showing why E = mvv was more likely to get us somewhere, and indeed it did.\n\nNowadays we have E = mcc (Einstein), as well as E = hf (Planck).  E is for Energy, v for velocity, m for mass, h for Planck's Constant and f is for frequency.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}