{
  "id": "2766959080651800714",
  "title": "Passing the Torch",
  "published": "2009-07-28T08:26:00.000-07:00",
  "updated": "2009-10-26T01:33:53.064-07:00",
  "content": "Having joined the over-50 set, I'm supposed to role model \"showing the ropes\" to a younger set, then gracefully bow out, although I'm allowed to keep doing that (always new ropes to show ya).In the context of Quakers, this means recruiting people to committees more of the age Dawn and I first were when we started with Friends in the 1990s, when we were married under our meeting's care (on 9-11, 1993).Our Quarterly Meetings have become a signature blend of oldsters by and large, even though our theme last year was The Future of Friends.  Elizabeth Fischer, clerk of Multnomah's program committee, was eloquent in pointing this out at our planning meeting last night.[I suggested music](http://worldgame.blogspot.com/2009/10/wqm-day-one.html) as one possible theme for our October gathering, thinking of social action through lyrics, or at least social bonding.Fifteen minutes after that meeting, I was listening to a young woman rap her heart out about the cruelties of high school, where the power of a woman to \"just say no\" (to all kinds of stuff, not just sex) is often challenged (as in ignored).  Her imagery became violent which, as [an AVP technique](http://worldgame.blogspot.com/2009/02/avp-again.html), I have no problem with (fantasy violence in lyrics is sometimes a way of venting and staying cool headed).The group was supportive and welcoming.  [Belly dancing](http://mybizmo.blogspot.com/2007/12/charlie-wilsons-war-movie-review.html) broke out (for real, not just an imitation) in what was clearly a safer than average environment for free self expression without fear of intimidation and reprisals.Dr. Tag was there on a different schedule, in the midst of her gender studies research, a true professional, as was [Lindsey Walker](http://lindseywalkerblogs.blogspot.com/), my Pauling House associate and fellow denizen in Richmond (she and Dr. Tag know each other thanks to our meeting of the minds, with Scott, at Belmont Inn last week).I'd invited some other Friends in hopes of starting to bridge the generational divide.  Our Ben Selker was there, representing the younger set, folding little [geometry things](http://www.flickr.com/photos/17157315@N00/3767330948/), talking about a lecture he'd seen.Ben is a great example of someone who might thrive in Portland Free Skool, as a teacher and a student, if only we could design the right classes (I have a meeting today...).[Elizabeth](http://homelessnesspdx.blogspot.com/) has also been working with a potential base:  Portland's homeless.  [Trevor's](http://mybizmo.blogspot.com/2006/07/around-town.html) experience with Outside-In might likewise prove an asset.  As I reminded my colleagues [on edu-sig yesterday](http://mail.python.org/pipermail/edu-sig/2009-July/009441.html):  America eats its young.  Fight back!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}