{
  "id": "3094671732095282922",
  "title": "Pedagogical Artifacts",
  "published": "2017-03-17T11:05:00.001-07:00",
  "updated": "2017-03-17T12:25:18.275-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/33455208146/in/dateposted-public/)\n\n:: Mites make Rites, space-filling Sytes ::\n\nEthnographers use fancy words for \"educational toys\" sometimes, [Lux Blox](http://worldgame.blogspot.com/2016/08/commerical-message.html) for example. Once a toy becomes a model of something serious, it's no longer a mere toy. Skeletons hanging in the medical school, even if made of plastic, are serious tools of science.  I've used \"toyz\" to cross that line, as in \"toyz for the adult-minded\" (but then that has its own connotations).\n\nThe TetraBook is [my standard example](https://medium.com/@kirbyurner/a-case-study-in-ethnomathematics-d4731f4d090d) at this juncture. Consider the rhomb (diamond) as two triangular book covers laying flat. A diamond has long and short diagonals, corner to corner, and either could be the book's spine. Then we have a single page that flaps back and forth, a gizmo not unlike the unit circle in that the page tip traces out a circle, but of variable radius.\n\nGetting to build these gizmos in a shop and/or 3D print them is a privilege many of us do not have. I [checked out Hedron](http://controlroom.blogspot.com/2016/09/art-car.html) as a possible studio but 4D Solutions is mom & pop scale-wise, not really NASA or a government lab, in terms of budget.  However one doesn't actually require anything that fancy to [construct a Rite](http://worldgame.blogspot.com/2009/02/mite-fight.html), a space-filling tetrahedron.  You may follow the links through to Sommerville (a mathematician).\n\nAnother pedagogical artifact is the Adidas soccer ball, the pattern, which in chordal form is called a truncated icosahedron, well known to Leonardo da Vinci.  We're at the heart of so-called Western culture here, the realm of the Platonics, [all duals](http://worldgame.blogspot.com/2010/03/view-from-abroad.html) of one another. A rich genesis for geometry begins here, with or without Euclidean definitions. Menger's \"[geometry of lumps](http://coffeeshopsnet.blogspot.com/2009/03/res-extensa.html)\" has equal access, for something more like claymation (what distinguishes points, lines and planes is topological but not dimensional).\n\nDawn Wicca was the mom in this [mom & pop operation](http://controlroom.blogspot.com/2017/03/psychotherapy.html) and the family is [missing her today](http://worldgame.blogspot.com/2010/03/remembering-dawn-wicca.html) (and always). We had a family business doing programming and bookkeeping: Dawn Wicca and Associates, with 4D Solutions a DBA (business alias). She kept herself alive through a vicious cancer, pulling her community together for a healing process, wise woman that she was.\n\nEven back when we had DWA as a partnership, I was investing a lot of time/energy into my [Oregon Curriculum Network](http://4dsolutions.net/ocn/index.html) website, as well as [Synergetics on the Web](http://www.grunch.net/synergetics/). The Wikieducator stuff came later, along with Martian Math (one of four components of a [Digital Mathematics curriculum](http://wikieducator.org/Digital_Math), more developed in my various pilots).\n\nDavid Koski is working on the TetraBook project. He envisions some of the shop course options, such as motor-controlled, with the cover tip to page tip strings stretched between counter-weights hanging beneath the book's plane.\n\nI've kept it more screen-based, given my skill set, thinking of segments for hypertoons (a Portland Knowledge Lab project, back when Dawn had the annexed office at ActiveSpace).  Making Portland a \"toontown\" and source of claymations, other technical animations, was and is my goal as a curriculum developer.\n\nThese days most \"toyz\" in the US are for authorized personnel in the military, where most have no clue about the heritage denied, unless a privileged officer from West Point perhaps.  That's where people learn about radomes and the DEW line (Cold War history). I imagine few below the rank of general on active duty have had much time for Grunch of Giants (St. Martins Press).  Don't ask an enlisted US army soldier about A or B modules, or whether [MITEs make a RITE](http://www.rwgrayprojects.com/synergetics/s09/figs/f5012.html).  Standards for K-16 vary.  I don't know any [public school math teachers](http://worldgame.blogspot.com/2017/02/three-bucky-tapes.html) who aren't free to teach this stuff.\n\n[](https://www.flickr.com/photos/kirbyurner/33496193375/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}