{
  "id": "3003961752767734760",
  "title": "Pedestrian Thinking",
  "published": "2015-09-07T11:21:00.003-07:00",
  "updated": "2015-09-08T07:22:58.839-07:00",
  "content": "WDC could very easily charter a bunch of ships, or use its own Navy, to help alleviate the refugee situation, the result of a nation-state breakup and breakdown in zones opened to aerial bombing versus [some Islamic State](http://worldgame.blogspot.com/2015/07/wanderers-2015728.html) (hypothetical, not a UN nation at this moment in time).  Civilians, caught in this theater, are understandably scrambling to get out of the way.\n\nHowever [WDC](http://worldgame.blogspot.com/2011/11/city-as-campus.html) and its Media Army (WMA = Washington's Media Army) are spinning it like this is all about the EU standing up for its principles.  The EU is now a proxy for Statue of Liberty rhetoric, as so far you don't see much evidence of open arms in North America.  However, I expect this will soon change, as the hypocrisy of thinking the Atlantic Ocean is a meaningful barrier, where refugees are concerned, was exposed long ago.  In the 21st Century, you can ferry them by jet.  Lets talk troop numbers and how many ferried so far.\n\nThe perception that the US exports its refugees from the civilian economy, as people not needing visas, to military bases around the world, such as in [the Marshall Islands](http://controlroom.blogspot.com/2013/11/pacific-islanders-meet.html), is somewhat based in fact. The US itself is a nation of refugees, is closer to the bigger picture, including those hosting [Fourth Reich meme viruses](http://worldgame.blogspot.com/2015/09/best-of-enemies-movie-review.html) (\"[USA uber alles](http://mybizmo.blogspot.com/2008/02/philosophy-101.html)\" nut cases abound in DC, where they might be properly looked after).  In founding this Federation, there was no way to close the doors to descendants of ancient Romans with imperialist reflexes, as filtered through Normans and Anglos -- long story.\n\nThe pedestrian thinking on display is that Syrian refugees can walk to Austria because these are connected landmasses, whereas we don't need to talk about Ohio or Michigan or Oregon each taking 20K, because there's an Atlantic Ocean in between, and whatever happens in the Holy Land stays in the Holy Land.  Obviously such thinking is not in touch with reality, which is why I'm expecting that bubble to pop soon.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}