{
  "id": "620426631581611887",
  "title": "Penalty Box",
  "published": "2020-12-06T18:04:00.007-08:00",
  "updated": "2020-12-06T20:44:30.495-08:00",
  "content": "I got slapped on the wrist for some unfortunate use of \"cannibals\" and \"Tyson\" (as in chicken) in the same comment. Some story about the spread of covid in some corporate setting: we get a lot of those stories in our news feeds these days. Our feed bags.\n\nThe last time I got a time out, or maybe it was just a deletion, is when I forwarded a political cartoon in which Mickey Mouse appeared in an unflattering light.  Again, covid related.\n\nOK, that's fine. I'm treading on the edge, hitting up against the Facebook electric fences. I'm assuming this is AI all the way, given the blizzard of snowflakes (comments) assaulting the service very second. There's no time for a human censor.  Perhaps these come along after the fact and audit, en masse.... if government were transparent, we'd know more.\n\nThinking over the situation, I'm pretty content with the ammo anyone would have, thanks to me in particular, if wanting to pursue a positive futurism, probably the best we've got, since for the most part people don't consume themselves with \"planning\" as a pass time. I was born into a planning + activist family.  My education was appropriately big picture, as was my worldly upbringing.\n\nPart of the promise of the Synergetics philosophy is inherent in its reliance on tension over compression. This isn't about pushing hard to make happen.  Lets see if humanity wants to pull itself together.  We know it could, has the option.  If it doesn't, that looks more like a choice than some tragic heroic failure.  The angels will chuckle.  Or call 'em demons, whatever.\n\nMy efforts and curriculum design have been enabled at every turn by the latest technology, so it always feels like my skills might be equal to the task.  To a point.  Then it's no longer about my skills in particular. I'm happy to kick back. Show me what you've got.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}