{
  "id": "6638417086796570499",
  "title": "Penguins of Madagascar (movie review)",
  "published": "2014-12-08T15:45:00.001-08:00",
  "updated": "2014-12-09T05:39:54.851-08:00",
  "content": "Strange as it may sound if you're not used to thinking of movies in a curriculum context, ala film school, this cartoon deserves doing some homework first.\n\nThe [Madagascar franchise](http://worldgame.blogspot.com/2012/08/madagascar-3-movie-review.html) is already well evolved, and this narrative follows an off shoot:  the special ops team of penguins, so endearing in the earlier episodes. \n\nIdeas come quickly at high bandwidth, fighting boredom all the way (I was never bored); ideas about physics, about relationships, and about human (or octopus) motivations.\n\nThe villain feels royally dissed that all the zoo patrons coo over penguins and not him.  His revenge:  \"monsterize\" penguins.  The giant ray gun, a staple of villain cartoons, is playing the usual role.\n\nAnother special ops team appears on the scene, somewhat modeling the so-called \"special relationship\" between the US and UK.\n\nThe US broke off from the UK at a high management level, as well as in the rank and file, and the two cultures still have a lot of the same attitudes toward what \"special ops\" looks like (ala James Bond, though I didn't catch that many direct references to this Ian Flemming character).\n\nSeeing Penguins of Madagascar and [Big Hero 6](http://worldgame.blogspot.com/2014/12/big-hero-6-movie-review.html) both on the same day, with a few hours in between (enough time to visit Yard House for dinner, bus home, come back with the car), made for some interesting thinking.\n\n[John Malkovich](http://www.imdb.com/name/nm0000518/?ref_=tt_cl_t5) plays a great villain, bravo.\n\nNote closing credits:  they get it right with [the hexagons](http://controlroom.blogspot.com/2006/12/limiting-ball.html) as connoting high tech.\n\nBy 2014 we have successfully migrated from the right angled XYZ look to the more futuristic / organic IVM look, when it comes to connoting high technology.  [Graphene](http://mybizmo.blogspot.com/2013/05/the-age-of-carbon.html) is where it's at.\n\nWhen buying two 3D movie tickets at once (the 2nd for Big Hero 6 at 9:50 PM) for like $29, I mentioned something about breaking the bank.  The ticket lady said she didn't mean to be rude but if I were age 60 or greater I could claim a discount.\n\nAlthough I have the requisite white hair, I wasn't sure if she'd card me so demurred: \"I couldn't prove it\" I said, \"but I'll be 60 soon though, and then I can watch all the cartoons I want!\".  The guy behind me thought that was funny.  Me too.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}