{
  "id": "5440571477201329444",
  "title": "Persia Power",
  "published": "2017-07-31T10:24:00.003-07:00",
  "updated": "2023-06-26T17:16:14.551-07:00",
  "content": "There's a lot of truth to the idea that a sorry-ass \"deep state\" (a clique) is pushing to make Iran the uber bad guy again, in the wake of funding the Iraq side for many years, then turning on Iraq and making it the enemy.  Make up your mind?\n\nA problem with [Kissinger-style real-politik](https://mybizmo.blogspot.com/2015/12/world-pax.html) is once you cut loose from meaning what you say, on the record, you may lose your moorings. The District of Columbia is somewhat adrift.\n\nMaking Russia the arbiter of the last presidential election (or why all the fuss) is a feeble call for help?  Maybe Russia will take it that way; NATO's bluster as an empty search for meaning on the part of some neocons hoping to play hero against some invented geopolitical backdrop requiring much suspended disbelief (most of us are not buying).\n\nThe bigger news is Persia's collaboration with India in competition with China's collaboration with Pakistan.  The journalistic class wants to keep it either/or (contrary to fact) and play up the India-Pakistan rift (e.g. Kashmir), but the engineer class, more globalized, is less impressed by the tabloid press (or tabloid politics).\n\nTwo ports, not far apart, feature in this so-called competition, with India shipping to the one in Iran, China using the one in Pakistan as a springboard to the Indian ocean, bypassing the Malaysian Straits. A lot of new infrastructure is coming together.\n\nThe nation-state terminology still helps us talk about the world geographically, as states themselves disappear into the global circuitry.  We all know where Israel / Palestine is, in the context of Mesopotamia.\n\nI see global trade route planning as an application of graph theory in a lot of ways, as in networking on a sphere.  The[ international school curriculum](http://worldgame.blogspot.com/2017/07/more-manicuring.html) I'm co-developing gives ample airplay to graph theory and global planning.\n\nWhere do the airlines go?  I have a database of world airports, incomplete but at least on topic.  We use pandas, SQL, JSON... what they call \"computer science\" in English, somehow not statistics or math (\"data science\" maybe).\n\nIs English broken?  I think the linguistic turn combined with basic self-critical reflection, puts English-as-a-first-language folk in a front row seat regarding the efficacy of this mother tongue.  I'm glad many diverse traditions continue feeding in to this meme-chest, as at the very least it's a language that's ripe for continued overhaul.\n\nIran's leading role in the [Nuclear Weapons Ban Treaty](http://controlroom.blogspot.com/2017/07/ban-treaty.html) has not yet worked its way into the narrative as the \"cynical journalist\" culture doesn't really have a narrative and looks to politicians to carve out the talking points.\n\nPoliticians, not being engineers for the most part, may not have much insight into investment banking either.  They're on the take, more than willing to take campaign contribution bribes and spout lobbyist language in exchange, but as originators of policy.... I'm not thinking the District of Columbia is any longer original in that sense. DC is a district of followers, not leaders.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}