{
  "id": "6254035782330617631",
  "title": "Persepolis (movie review)",
  "published": "2008-07-16T07:19:00.000-07:00",
  "updated": "2008-07-16T19:04:31.964-07:00",
  "content": "Although [this cartoon](http://www.imdb.com/title/tt0808417/) pokes fun at the Japanese at one point, for their seeming obsession with Godzilla movies, I sensed more than a little Japanese influence, to positive effect.In anime, we get this motif of \"[the sudden outburst](http://www.imdb.com/title/tt0457246/),\" a kind of formalized volatility against a background of uniformity and social conformity.  Outbursts form \"key frames\" in the [punctuated equilibrium](http://judson.blogs.nytimes.com/2008/07/15/lets-get-rid-of-darwinism/index.html) of character development, and this film is all about character development, in a hellish forge called Iran in some circles.Authorities like to see their wills reflected in terms of fashion, which pulls them into popular culture in competition with [movie stars](http://worldgame.blogspot.com/2006/07/mi3-movie-review.html), [rock stars](http://controlroom.blogspot.com/2008/04/meeting-math.html), [other role models](http://worldgame.blogspot.com/2008/06/poor-slob-bucky-psb.html), many out of reach, yet present in the media, raw material for rebellious counter cultures.This pattern is not unique to any one capital or metro area i.e. that sense of \"subversive influences\" is all pervasive, only differs in outward form. That sense of \"[future shock](http://controlroom.blogspot.com/2006/01/power-of-nightmares-movie-review.html)\" (a shocking future) is not confined to Islamic and/or [Gringo](http://worldgame.blogspot.com/2008/07/more-quaker-futurism.html) cultures.Persepolis is all about keeping hope alive while surrounded by oldsters facing both different and similar challenges.  Our Iranian girlfriend must \"dismiss as irrelevant\" ([a Buckyism](http://www.grunch.net/synergetics/omnihalo.html)), i.e. do her own thinking, just to get through her day, and yet her grandmother, uncle, parents, give her useful and very necessary guidance (regarding divorce for example).She sure could have used some better girlfriends in Vienna though.  Going straight from nuns to boys is a huge leap for anyone.  Don't jump off a cliff, use the stairs (build yourself slowly, take your time).  She survived, but just barely.Herbert Marcuse argued that private business worlds tend to commodify subversive artifacts, in the form of [underground comix](http://en.wikipedia.org/wiki/Hentai) for example, instead of banning or burning them outright.  Capitalism was subversive of subversion in [his book](http://www.marxists.org/reference/archive/marcuse/works/one-dimensional-man/index.htm), a source of undermining mindlessness (sounds kinda Zen, come to think of it).Rather than decry this tendency to \"one dimensionalize\" (render harmless), one should consider the alternatives.  The message I got from this film is spirited female civilians don't necessarily support or admire spattering blood everywhere (it's [hard to get out](http://www.mrscleannw.com/tips/blood-stain-removal.html) for one thing).If the fashion-minded authorities and their pop culture nemeses are inwardly consumed by horrific fantasies, and spoiling for opportunities to act them out, then why not flatten them to the screen, as cartoons even, [or video games](http://controlroom.blogspot.com/2006/09/crosscultural-workouts.html), and [order pizza](http://mybizmo.blogspot.com/2005/10/good-night-and-good-luck-movie-review.html) instead?The Iranian gals really seem more civilized, just wanna have fun, while the guys keep [wrecking it](http://controlroom.blogspot.com/2005/10/control-rooms.html) with lots of atrocious behavior masked with vapid preachiness.Persepolis is potentially a step up from [Gotham](http://mybizmo.blogspot.com/2005/09/batman-begins-movie-review.html), again thanks in part to Japan's spirited business world, a welcome source of pacifism in the currently shrill and shallow climate.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}