{
  "id": "2126719503313492085",
  "title": "Philosophy of Science",
  "published": "2013-04-13T14:56:00.000-07:00",
  "updated": "2013-04-14T01:26:41.285-07:00",
  "content": "[](http://www.flickr.com/photos/kirbyurner/8643923071/)\n\nYesterday was a philosophical day, in terms of ethics / aesthetics (some say \"esthetics\").  \"How much shall I eat?\" was one of the queries.  Quakerism bases itself on \"queries\" and \"knowing experimentally\":  probably a reason Quakers tend to not run away from STEM.\n\nTwo philosophy parties were in the Friday night picture.  I went to both.  I ate at both.  Then I went back to the first one and had a (very thin) slice of cake.  I should call them \"dinner parties\" to be more accurate.  The second was in the Heathman and followed a philosophy of science lecture by John Dupre.\n\nNow today, Saturday, I'm with Dupre again.  We're in the Pauling House listening to Terry bounce around in his namespace, influenced by John Dewey.  If we look at this as the philosophy that steers his choice of lecturers, then I'd consider it elucidating.  We're hearing what makes Terry tick.\n\nI brought two books in my briefcase I don't expect to get to share, except asynchronously, such as here.  Both books were edited by Robert G. Fuller, the physics professor.  He died not long ago.  One book is about Robert Karplus, his mentor, the other about Aung San Suu Kyi, his student from that time he taught in Rangoon, at British Methodist Academy.  He continued to track her trajectory ever since.\n\nWe learned more about that region of the world [from Peter recently](http://mybizmo.blogspot.com/2013/03/wanderers-2012320.html), the [other Princeton grad at Elliot's talk](http://worldgame.blogspot.com/2013/04/wanderers-201349.html) (besides me) who therefore knew about Blair Hall and Blair Arch.\n\nTerry casts two archetypes named the Scientist and Engineer, which he contrasts.  In theater or psychology, we could set this up in two minutes as a premise for some melodrama, yet to be unveiled.  That's the suspense:  will there be a plot, after the preamble?  Stay tuned.  In Bucky's namespace the plot is eternal regenerativity, how to keep it all going.\n\nEarlier today I showed Christine, a photographer, the Kenneth Snelson book.  I was wanting to share the 360 degree photographs, but she went through all of it, including his [Portrait of the Atom](http://www.kennethsnelson.net/icons/atom.htm) with its curious electrons, sometimes rendered with quirky effects.\n\nComplementarity, experimentally demonstrable, is another of Terry's plot elements.  He says local vs. nonlocal, particle vs. wave, are similar to left and right handed.  We have a minimum of two paradigms, says Terry, and they're not reducible to one another.\n\nAt the first party, I received a gift from the scholar who's birthday we were celebrating:  Wittgenstein's Poker.  That's a book I've long been meaning to read.  I will post about it more on Sean's list.\n\nTerry's philo is a lot like Erhard's but presented differently.  He gets to where there's no determining \"the meaning\" and that's freeing for him more than angst-producing.  Meaninglessness is not heavy but an invitation to create meaningfulness.\n\nTerry's attack on the Scientist archetype coming from the Engineer's angle is in danger of being a straw man argument.  To have straw men, one may need straw worlds.  It's the world of one static truth, a machine, that's made of straw here.  Terry advocates pluralism.  One still needs theories and models though.  To say there's no ultimate final ideal car is not an argument against having cars or developing new ones.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}