{
  "id": "3845265471433581726",
  "title": "Philosophy of Mathematics",
  "published": "2018-05-12T18:15:00.002-07:00",
  "updated": "2018-05-12T18:22:00.512-07:00",
  "content": "Bertrand Russell ([source](https://users.drew.edu/jlenz/br-geometry2.html)):\n\nThe limitation of the dimensions to three, though it is empirical, is not liable to the uncertainty and inaccuracy which usually belong, to empirical knowledge. For the alternatives which logic leaves to sense are discrete – if the dimensions are not three, they must be two or four, or some other integer – so that small errors are impossible. Hence the certainty of the axiom of three dimensions, though in part due to experience, is of quite a different order from that of (say) the law of gravitation. In the latter, a small inaccuracy might exist and remain undetected; in the former an error would have to be so large as to be utterly impossible to overlook. Hence the certainty of our whole axiom is almost as great as that of its a priori element.\n Compare with D'Arcy Thompson, [writing to Whitehead](https://www.huffingtonpost.com/entry/three-dimensions-of-space-darcy-thompson-letter_us_59f040a0e4b00a4ce5a222cd):\n\nNow suppose, on the other hand, that we were of so minute a size (or lived in a medium so dense) that gravity would have no sensible hold upon us; and suppose, owing to our minute size, that we were mainly under the influence of other, say molecular, forces. Then, to begin with, we should know nothing about a vertical, and care nothing about a right angle. And suppose, in the next place, that we lived in some sort of ‘close-packed’ or crystalline medium, say a tetrahedral one, we should never dream of three-dimensional space (unless perhaps after long mathematical investigation), but we should automatically refer everything to tetrahedral coordinates. In short, we should solemnly believe that we lived in a four-dimensional space.\nSo what about \"[space is 4D](https://goo.gl/zoVYF1)\"?  That's a link to some Google slides.\n\nHere's a segue to Synergetics, no ifs ands or buts about it.  Just in case you imagined philosophers had been denied access at some point.  Was the draw bridge raised?  No, the philosophers simply chose not to cross it, wary of what the consequences might be.\n\nMight they become prisoners of the [Ayatollah of the Tetrahedron](http://mybizmo.blogspot.com/2005/02/ayatollah-of-tetrahedron.html) then?\n\nOf course choosing not to do something may prove just as consequential as doing it, whatever it was.  Sometimes the risk of inaction is the greater risk.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}