{
  "id": "3317828045045816466",
  "title": "Philosophical Essay (2nd Draft)",
  "published": "2010-08-23T17:10:00.000-07:00",
  "updated": "2010-08-24T13:15:17.415-07:00",
  "content": "[In recent essays](http://mathforum.org/kb/message.jspa?messageID=7160153&tstart=0) regarding how we've countered the knowledge explosion, in ways other than by simply narrowing our respective knowledge domains, I've come to a notion of Philosophy (as a discipline) as an incubator for glue languages.A \"glue language\" is one that is deliberately designed to cohere multiple other disciplines.  I would claim this is (a) not a new vision of what philosophy does and (b) is akin to some types of poetics, which stands to reason as metered oral tradition ragas & sagas were indeed a way for cultures to encode and transmit vital knowledge.Another thesis, non-Wittgensteinian in the sense of arguable (debatable, either way), is that the recent chapter in philosophy (pre linguistic turn) namely the rise of analytic philosophy in the form of symbolic logic as a \"mirror of the world\" (Tractatus idea), was about the noosphere (zeitgeist, holy ghost) giving birth to computer languages, as dreamed of by Leibniz, Ada, [Grace Hopper](http://worldgame.blogspot.com/2010/07/computer-scientist.html)... a different lineage than those analytics like to own, but arguably more the main line, with the benefit of hindsight (a view of history).Logic matured into that which runs most of our infrastructure by this time, at the low level record-keeping level, and even at the real time control level, where humans tend to spontaneously operate.  Philosophy again appears in the driver's seat (as it might have been seen in trivium-quadrivium days) once we allow it to give birth to computer science as one of its own (as Athena from Zeus).However, this computer logic is low level and largely content free.  It gives us ways to store and retrieve, but is not spontaneously integrative except insofar as it allows us to sift through, synthesize and summarize super-human amounts of data (more than any one researcher could hope to personally collect and analyze).The next level or challenge, is to develop more glue languages, designed as tools for human thought, that help us navigate these wilds, this new \"cyberspace\" (\"steering place\"), i.e. this new governing area (not to be confused with Area 51).Wittgenstein's later philosophy opens doors to glue languages by leveling the playing field, providing a clean beginning.  How could many languages be true at the same time?  Isn't that just relativism?  [SWM and I](http://worldgame.blogspot.com/2006/02/moral-relativism.html) used to debate this on wittgenstein-dialognet.In focusing on the \"doing\" in symbolic games, rather than their \"pointing\" to some supposed \"public object\" or one true \"in itself world\", he turned language inside-out, made it seem more like what we see in the case of computer languages:  a kind of executing or processing of energy, a vectoring of content this way and that.  A strong religion is like an efficient FORTRAN program, in keeping memory working hard for the greater glory. A different ideology or religion would operate differently, yet still get work done.  The \"forms of life\" approach allows for different reference frames that all share the same \"c\" (\"c\" for \"certainty\").Lots of computer languages do the work, not just one, and we see no contradiction.  We see \"forms of life\" connecting to \"grammars\".A human glue language provides inertial guidance, a kind of homing device, a gyroscope, except this \"glue language\" is not monolithic or \"the one true system\" ala Hegel or the Tower of Babel -- both closer to the logical core / divine order than your average joe and/or structure, but neither the \"last word\" as the world keeps changing, which in turn requires upgrades (sometimes in answer to our prayers).We're ethically precluded from calling \"it\" (our glue language) \"finally done\" and/or \"instantly true\" (as if \"the truth\" could be captured in a snap shot per the old \"picture theory\" of meaning) i.e. living systems are about becoming, adapting, not about \"the end of history\".  One comes to see in a new way.My final thesis will be that this Bucky Fuller gestated glue language called \"synergetics\" (not to be confused with its fraternal twin -- see Wikipedia for disambiguation) is one such post linguistic-turn philosophy.  Its purpose is less to \"corner truth\" than to \"orient and contain an outlook and overview\" i.e. to organize a vista around some \"me ball\" (the observer). This is a legitimate service for a philosophy to perform and is what many a philosopher has sought to provide.Synergetics explicitly glues polyhedra, long a source of fascination and insights for natural philosophers, to a \"connect the dots\" model of \"thinking in the round\" (i.e. systematically).  A lot of \"hard science\" content is linked in by this model and glued together using a prose-poetic style.  Jungian psychology would be another example of a prose-poetic style, another glue language.A lot of geometry enters in as well.In Synergetics, one gets a kind of \"mnemonic brew\" that might be considered toxic or corrosive if branded as a pure science (see the [preface by Dr. Arthur Loeb](http://www.rwgrayprojects.com/synergetics/intro/preface.html)), but refiled as a literary philosophy, this potion turns out to be benign, safe to swallow (or so I would report -- though others might say it has rendered me alien).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}