{
  "id": "7192205155823126696",
  "title": "Physics in the First Person",
  "published": "2018-12-09T11:24:00.000-08:00",
  "updated": "2018-12-09T13:15:23.672-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiWEHmt1qdMgGzAhAUl9RZiceZbOkaFnFG6399wZdhg0XZxaSIFwlLDoSbjSrVX8MuKufALSKs7XsVSSD3ENVKdQm82y80X3CYFEVex_4UKGDe2nIPiQxH3CXBYNz8rgndmqPfN/s1600/8006353506_3864822b72_z.jpg)\n\n\"First Person Physics\" was a meme I started using on some listserv of physics teachers. Dr. Bob Fuller saw what I was driving at, including and especially the so-called \"energy slave\" concept.  The idea here was not to get rid of slavery but to not enslave humans or even mammals, but machines.  Don't make a horse lift the stone, let a diesel engine do it.  You enslave things like toasters and microwave ovens, which working humans in tandem with robots need to make in the first place.\n\nBucky Fuller was asking humans to pause and look around and see how many calories were being expended by machines every moment on their behalf.  But instead of reckoning in horsepower, lets take this opportunity to convert into work units humans could more easily relate to (< horses).  Some positive conversion constant might apply, and there you'd have it:  a small army of robots (non-animal energy slaves) all working on your behalf.\n\nYou may need some assistance, at least at first, seeing where the work is being done.  Photons don't weigh much, and wiggling fingers over a keyboard is not a fast way to spend calories.  Better get up and make coffee frequently if that's your gig.  Lift weights.  Stay in shape.  Yet the internet is a vast energy slave army that produces lots of heat.  You, the one sitting in that chair, burn at about the rate of a one to two hundred watt bulb, which is the figure we were trying to get at, in place of horsepower.\n\nThink about forklifts, warehouses, trucks on the freeway, stuff in your possession.  Non-slaves are allowed to possess (not be possessed), and humans typically think beyond their being 150 watt bulbs, to being this whole internet of things that burns, such as cars, trucks, trains and jets.  The internet of things comprises their lifestyle, which they value, whereas a \"daily bread\" of 150 watts burning 24/7 is no more sexy than enjoying a metabolism. \n\nYour body heat needs to stay at roughly some level, pretty warm but not too hot, and just breathing and maintaining body temperature spends energy, which is work.  That's right, in physics just staying alive one second to the next is considered work, and it's paid for.  You get about what you need to stay lit, or you don't, but in each case the requirement is in a bell curve between extremes. Getting enough calories to people is the bread game.  The truth is everyone requires about the same, even accounting the difference between babies and athletes.\n\nAside from measuring units of work in terms of humans (watt burners) replacing horses (also watt burners), First Person Physics is about being in the \"controller seat\" oneself (which doesn't connote omnipotence) as a \"first person\" (a viewpoint and presence) and experiencing acceleration.\n\nRiding roller coasters helps make acceleration real, but then many roller coasters in life are not in the XYZt dimensions.  Precession is omni-dimesional.  We experience those deltas, as we traverse a less literally topographical phase space (a primordial soup), in a mix of Eulerian (spatial-visual) and Gibbsian (tactile-visceral) dimensions (more on that later).\n\nIn lieu of demanding a steady supply of expendable slaves, we harness the big calorie spenders such as the wind and downhill flowing water.  The sun is what lifts the water up again, and keeps the gases roiling.   Humans tap in to big dynamos to keep their wheels turning.  They burn stuff.\n\nWindmills turn large radius rotation into smaller blade defined rotation of sufficient umph (power) to light a lot of bulbs.  Instead of ordering a servant to make an omelet, we switch on a stove and do the job of being a cook all by ourselves.  Humans have a wide repertoire.  They can type, talk, tinker.  Cooking is a fun pass time for some, an onerous duty for others.  Lets talk about Stoicism again.\n\nFinally, I was nudged by something Keith Devlin said, about taking film more seriously, as a way of getting at those deltas.  The \"lights, camera, action!\" call of Hollywood, with stress on \"action\" (as the content of each frame), got me thinking \"action per time interval\" which is mvd/t or mvv or E or hf, units measuring what I considered \"energy buckets\" (or quanta), frames of film.  When the film runs too fast (E/t = power), it starts looking surreal.  We know from experience at what pace time goes.\n\nIf you'll be the star (first person) in your own film of action packed frames, in a \"scenario\" then that brings us to another definition of Universe in the literature:  as a set of eternally regenerative yet simultaneously aconceptual partially overlapping scenarios.  This definition was embedded in the American literature feeding into what I was calling Martian Math, nothing conventional within physics, yet a bridge to some of the memes some of the liberal arts people were convergent with, if into reading said literature.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhdj0M1TcDI_FTvHU106J_Fv5Ia1uHV-eQM629eaKqJUFo8bQSJsPqTyEHMqkk5dTTXyu1cEoaDH0Bi08sxHlva6wK4DeEbozxuHRphynvXMdXmddZuJQaYtJCldwHUly1UouWN/s1600/9298448736_ba22357756_z.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}