{
  "id": "537815737387307662",
  "title": "Physics Chatter",
  "published": "2008-08-07T14:46:00.001-07:00",
  "updated": "2008-08-07T15:21:00.513-07:00",
  "content": "This abridged version is from the same Physics eGroup I [discussed Entropy with](http://worldgame.blogspot.com/2008/05/more-curriculum-writing.html) awhile back, added some hyperlinks...Re Rhode Island, maybe send some people to Portland, Oregon for a lesson in bicycle management and integration, as we have both an activist cycling community and high marks from urban planners on how it's done (though European cities like [Gothenberg](http://worldgame.blogspot.com/2005/07/more-on-gothenberg_25.html) are still way ahead in some ways).That being said, the newbie problem is real, saw some 50 year old guy, obviously inexperienced, making really stupid maneuvers, tempted to say something but was in a moving motor vehicle.Probably my lifestyle is more prototypical of what energy savings might mean, in that [my office](http://worldgame.blogspot.com/2007/01/ktu3.html) is equipped with VPN type equipment, even [coffee shops](http://mybizmo.blogspot.com/2007/09/coffee-shop-blogger.html) (some within walking distance) are fair game for secure access to work sites, though I tend to draw the line in only working with people I'm sure to meet in the flesh from time to time, though I've bent that rule on occasion (especially in open source work, you don't have the luxury).It's a bizarre aspect of the current lifestyle that we slosh this huge stream of metal back and forth between empty-at-night offices (good plumbing, suitable for condos in many cases [1]), and empty-during-the-day perfectly good homes (with both parents working that's been the trend, hence that Discovery Channel show about suburban thieving).Cities that get the telecommuting thing down are likely destined to prosper, and no, I'm not saying every job is amenable to such a pattern, nor do telecommuters only work from home (certainly I don't e.g. I teach [Python programming](http://mybizmo.blogspot.com/2007/05/class-notes-session-five.html) in university classrooms for example, for SaturdayAcademy.org, have a projector, [access to YouTube](http://controlroom.blogspot.com/2008/08/quaker-rant.html) etc.).[2]Kirby Urner[4dSolutions.net](http://www.4dsolutions.net/)[1] this inane sloshing of metal, otherwise [known as commuting](http://worldgame.blogspot.com/2008/05/squanderers.html), is an externalized cost most businesses don't make up for in anything they do i.e. the net cost to society would be less if we paid cube farmers to stay home and learn enough to get a more skilled job (merely \"using a computer\" doesn't count as \"skilled\" in this day and age, all is relative).  Also, in saying suitable for condos, I'm not saying this is a new mortgage game, more like college dorms in most cases, i.e. your company supplies room and meal tickets, for the time you're visiting Tokyo or whatever, few strings, more like timeshare in Orlando (fewer strings though).[2] For those curious about math education reform in the computer age, I recommend my [Chicago Talk on ShowMeDo](http://showmedo.com/videos/video?name=1010050&fromSeriesID=101), overlaps with what many in physics are doing, including in [First Person Physics](http://mybizmo.blogspot.com/2006/04/more-first-person-physics.html) (an approach I helped innovate, more in my journals).-----Original Message-----From: Education about physics-related social topicsSent: Thursday, August 07, 2008 11:51 AMSubject: Re: quick fix energy solutionsI had to laugh a little when I read this. I don't know how other areas are doing, but in Rhode Island the major commuting bus service, RIPTA, just closed many routes because of the increased cost of fuel. One would think that this would be the ideal time to expand routes.We also have a problem with all the newbies riding bicycles. The bike paths along the sides of existing streets require cyclists to stop at intersections to allow cars to make right hand turns. The cyclists refuse to do this - many have been quoted as saying that there are no stop signs at each intersection on the main streets so they are not obligated to stop. There is a proposal before our city council to erect 4 way or all way stop signs at every intersection involving streets having a bike path. That should really help traffic flow and reduce fuel consumption - not!:-(Bob",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}