{
  "id": "1651653310010451238",
  "title": "Pi (movie review)",
  "published": "2015-08-13T22:38:00.001-07:00",
  "updated": "2015-08-15T14:16:52.480-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/20363359540/in/dateposted-public/)\n\nThe title the movie uses is actually the Greek letter.  This is an [oldie but goodie](http://www.imdb.com/title/tt0138704/), a recent present from Glenn (he got two copies, each for a buck).  Best viewed as a comedy.\n\nI watched it 1.5 times actually, not counting the first time, years ago, as it's fun to see it from the beginning having seen the end -- circularity is a theme after all.\n\nThe hero seems overly paranoid in the beginning but that's because we're flies on the wall and don't know anything.  We join the story as it spirals out of control.\n\nCohen is on the brink of unlocking some mystery of the universe that will have far reaching consequences and two cabals, one from Wall Street and one of Orthodox Jews (into Kabbalah), want to get the secret from him.\n\nThat secret is apparently well protected by [Akashic Fields](http://www.scienceandnonduality.com/akashic-field-and-consciousness/) and the would-be knower is driven close to crazy in its pursuit.  Given it's a 216 digit number, it's also hard to memorize, shades of [Tom Cruise in Rogue Nation](http://controlroom.blogspot.com/2015/08/mission-impossible-rogue-nation-movie.html).  Fortunately, we have a pause button.  But wait, aren't the numbers different in the two shots?\n\nShades of a lot of movies actually.\n\nThe repetitive nature of the shots and actions give an Eternal Return flavor to Everyman's conundrum, a sense of being trapped or embedded in a puzzle palace of cosmic origins.  His cross to bear is this sense of an unsolved puzzle, tantalizingly close to resolution.\n\nBut the secret seems well protected.\n\nA film I'd compare this one to rather directly:  [The Zero Theorem](http://controlroom.blogspot.com/2014/10/the-zero-theorem-movie-review.html).\n\nI went to Thirsters immediately after watching the first half a second time, and appreciated the contrast, of a group looking for a more rational explanations of world events, even while acknowledging the irrational.\n\nThat everything from the stock market to the cyclic nature of diseases should be \"ruled by the numbers\" is Pythagoreanism at its radical root, and Cohen is definitely an adherent of the faith -- even though his computer is named Euclid.\n\nAs Cohen converges on the secret, with the best chips available (provided by the Wall Street cabal), his computer needs more and more power.  Something like ectoplasm drips from the circuit boards.  His mind likewise becomes more tortured.  The two, brain and rack, seem one and the same.\n\nHis Go-playing buddy, an elder and mentor who in his youth went down a similar path, offers sage advice which we may paraphrase as the Steve Holden 3-2-1 rule:  if you're at a conference and having a great time, still make sure you get at least three hours sleep every twenty-four, and two meals, and at least one shower.  If things get really hectic and you need to skimp on any of these, make sure it's not the shower (treat that as mandatory).\n\nLikewise his friend keeps telling him to take a bath, especially after expressively recounting the well-known story of Archimedes, in which bathing occurs.  Open up to others.  Listen.  Learn.\n\nCohen's dogged pursuit of some solution to his puzzle is actually setting him back.  There's such a thing as \"too dogged\" maybe?  He needs to learn to relax.  He needs the [Landmark Forum](http://controlroom.blogspot.com/2015/08/at-landmark-event.html) maybe.\n\nThe fun cliche though, which this movie captures, is how when converging to some zero point, some Faustian holy grail, one finds Wall Street and Jewish mystics both breathing down one's neck, and fighting with each other to get there first.\n\nWhat's powerful is to know or anticipate the future, and awareness of hidden patterns in events is just the ticket for doing that.  Beautiful Mind fits here too.  Reality is overwhelmingly full of patterns, but as the Go buddy reminds Cohen:  chaos and infinite complexity is what the simple Go grid anchors (no two games are the same).\n\nAnyway we already know these archetypes, these stereotypes regarding the close proximity of insanity and genius.  What's satisfying about this movie is how it distills them down to a black and white set of touchstones, a necklace of scenes, looped through over and over.\n\nIt's as if there's already a code...\n\nGreat scene:  he explains \"theta\" [sic] then it's spirals everywhere and he quits the scene, on to the next.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}