{
  "id": "7979903427896056505",
  "title": "Pizzagate Debate",
  "published": "2016-12-05T09:29:00.001-08:00",
  "updated": "2024-01-12T21:33:26.401-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/30621568523/in/dateposted-public/)\n\nI've been suggesting on Facebook that high school forensic (debate) teams pick up on Pizzagate as a topic to analyze for lessons in how to structure, or not structure, a case (argument).\n\nFor those unfamiliar, a conspiracy theory developed in social media, suggesting various politicos used a code language around setting up pizza parties to \"secretly\" plan for the molestation of the under-aged.\n\nThis code language had a double burden, as the double meanings apparently had to carry the full weight of both types of logistics, as actual pizza parties (of the innocent sort) did occur, wherein participants did eat pasta, in addition to pizza, and play dominoes while digesting lots of cheese.\n\nSo when were the orgies and other decadent practices planned?  Did the same emails serve to organize two vastly different types of event in parallel?  Exactly how did these parallel worlds arise from the same coded messages and wasn't there ever confusion about which type of \"party\" was meant?\n\nInvestigators into this conspiracy and/or those performing postmortem analysis have a splendid opportunity to dive into the underworld of pedophilia, sex trafficking, the sex industry, pornography and so on, with a noble purpose.  Lets sort out what our values are, our ethics.  That's not a waste of time.\n\nFor many new to the politics of Humans in Universe, this underworld is eye-opening, revelatory.  If you wish to fight some aspects of what you find, it pays to know the enemy's territory.  That's what any serious education must include, right — at least the opportunities?\n\nGoing back to Roman times (cite Cicero), schooling has focused on Rhetoric and the notion of a logical argument.  Many Buddhist cultures have evolved in similar fashion (cite Nagarjuna et al).\n\nIn the Wild West, when one runs out of arguments, one simply reaches for one's gun (e.g. the American War in Indochina): debate is over now, we win because of our weapons.  That's called winning the battle, but losing the war for hearts and minds.\n\nRomans were just as prone as their Anglo-Euro offspring, to use their battle-hardiness as an excuse to rape and plunder.  If one is strong, why not take advantage and seize the work of others?  Some find such logic hard to resist (they're strong in body, but short on brains maybe).\n\nHow else was an able-bodied man to earn a good enough salary, if not by serving a command structure that would absolve him from guilt while indulging in what civilians call \"crimes\"?\n\nFor purposes of building a sustainable empire however, Rome needed more reason, less brawn.  This is where Christianity came in, bringing with it a lot of the more mature Greek civilization.  Rape and pillage could now be justified as \"converting the heathen\" — that breathed new life into New World conquest (the Roman emperor had become Pope by then).\n[\nWe don't let minors vote](https://worldgame.blogspot.com/2024/01/looking-back.html) in 2016 in the USA.  They're expected to slave away, unpaid, on whatever XYZ homework (IVM math is firmly censored). Abuse by adults is rampant.  Not a pretty picture.\n\nSo even if the Pizzagate conspiracy is a lot of thin ice, tough to defend in the full light of day, it's a hot topic of conversation among the abused and semi-defenseless.\n\nSo why squelch it?  Why bully the kids into silence about topics that obviously concern them (e.g. pizza)? Vector the energy in a positive direction why not?\n\n[](https://www.flickr.com/photos/kirbyurner/31403272246/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}