{
  "id": "8902611799343695188",
  "title": "Plain Text Philosophy",
  "published": "2019-04-26T11:57:00.002-07:00",
  "updated": "2019-04-26T12:23:30.543-07:00",
  "content": "One of the dumber arguments some philosophers make, is that one should\nrefrain from using words with well-established meanings, when inventing new\nlanguage games.  \"Don't recycle pawn as that's spoken for.  How about fawn?\"  They presume to steer one away from the high inertia high value\nwords.  That's like saying to a little kid:  \"don't use gold in your\nfunny money game, as that's a real adult word, and you're just a little\nkid.  Until you have real gold someday, you should say shmold\".\n\nThat's all preamble to explaining how I see our subcultures, our dialects,\nour namespaces, as only partially overlapping, because we do, in fact,\nignore these obstreperous philosophers, and use the words we want,\nincluding gold, energy, vector, gravity, radiation and whatever\nelse we might get our paws on and hold on to (I'm not saying it's easy to\nhold on, given precession and all that).\n\nWe all want to build for the ages, and we know that using words like fawn\nor shmold (i.e. off-beat, never-heard-of) is going to put us at a\ndisadvantage.\n\nFuller gets a lot of notoriety for coining a couple words, such as tensegrity and in-stairs versus out-stairs (he doesn't even take full\ncredit for dymaxion) but really what he did most is take some high value\nhigh inertia \"physics words\" (as if any one discipline owns them) and bend\nthem into his own basket-weaving language of Synergetics.\n\nTension is \"that which holds together\" (over very long distances sometimes)\nwhereas islands of compression (shorter range) keep stuff apart or keep\nseparate. Synergetics inspires lots of mental cartoons, mental imagery,\nalong with tactile experiences, to show us what gravity and radiation\nmean in that namespace.\n\nThree rods of a tripod press down and want to splay apart (radiational) on\nthe slippery ice, but a triangular tension band around the base\n(gravitational) keeps them from so doing.  Nothing moves, yet we appreciate\nthe dynamism in this equilibrium.\n\nDid he need Newton's permission to invent this new gravity & precession\nsuite?  Einstein was bending space-time in new ways.  Isn't \"bending space\"\njust what we do, as science minded?  We make bubbles, we subtract 720\ndegrees, we systematize.\n\nHadron collision accounting (CERN stuff) and Synergetics are not \"at odds\"\nso much as they co-develop as different language games (or sets thereof);\ndifferent tools, different engines.  Synergetics has a section on its\nvocabulary's remoteness, which is intentional, and designed not to\ninterfere with others pursuing their own disciplines.  But, per my\npreamble, he's not about to deny himself access to the gravity well of\nhigh value words, when inking his own thinking.\n\nThis idea that language boils down to names, and names point at the thing\nthey mean (which is how they mean) is not an idea I hold on to.  I let go\nof that way of thinking long ago.\n\nMy universe therefore has room for many partially overlapping discourses\nthat flow downhill, like mountain streams, without needing to \"point\" to\nanything.\n\nTo take another example:  I cast General Systems Theory as *versus*\nEconomics, i.e. have GST on your resume and you're more likely to play an\nintelligent role in my company.  Economics is too superstitious.  But from\nanother angle, we're talking about two ways of thinking that cover a lot of\nthe same bread and butter topics, regarding ecosystem management and so\non.\n\nSpaceship maintenance.  Janitorial services, Global U.\n\nRegarding 2D, 1D and so on: if you see a circle (flat) or rectangle (tennis\ncourt) in your head, where is your viewpoint?  Every line could be a\npencil, every plane a sheet of paper.  Have you ever experienced\n\"infinitely thin\"?  Philosophers claim to picture it on private TV\nsomewhere.  Chalkboards don't help.\n\nBesides, I always have an angle on any 2D shape.  Even an infinite plane\nhas a position relative to mine.  I cannot myself be a 2D being, Abbott's\nFlatland notwithstanding, not even mentally.  I occupy volume.  Volume is\nenclosed by four walls, a tetrahedron.  My Kantian idea of space, even res cogitans, not just res extensa, is 4D.  Four walls.  Four windows.\n\nBut ya'll steeped in Cartesianism and its 3-axis octahedron of six vectors,\nthree basis, three not, are stuck in the a specific 3D talk.  I empathize\nabout the stuckness part, but readily admit to the utility of the\napparatus.  I use it too, all the time.\n\nBut when I'm wanting to communicate Synergetics, I'm all about the four\nwindows and how anything you see on brain-TV is in a 4D studio.  I can hold\nup pieces of paper and pencils and talk about all these shapes, but I have\nno need of either infinite extension nor infinite thinness.  It's easier to\njust see everything topological as a morphed tetrahedron, rolled flat,\nrolled thin, made into a ball, whatever.  It's 4D all the way down.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}