{
  "id": "279821084733879024",
  "title": "Planet of the Humans",
  "published": "2020-04-23T15:56:00.000-07:00",
  "updated": "2020-05-26T14:33:19.211-07:00",
  "content": "I started watching this right about the end of Earth Day 2020, near midnight in my Asylum District zip code.\n\nThe thesis is sort of:\n\nWe the innocents, the sheeple, the dupes, have been led by our corporate masters to bow down before faux green-washed altars to our own virtue, as planet saviors, while behind behind the curtain, they're using a diesel generator.   \nLike picture an Earth Day sound stage, that they tell you is all solar and wind powered, all brought to you by renewables, but then actually they're burning wood chips, because forests are green aren't they?  And renewable (they grow back).  Either wood chips or natural gas, the latest craze (cleaner than coal if you don't mind fracking).\n\nMeanwhile, solar and wind are hardly a panacea, as we don't have enough storage capacity to level off peak demand.\n\nWe don't talk about any smart house solutions with the battery on the client side (if you've got wind, charge your own batteries).\n\nEither way, the battery making process is ugly and takes lots of fossil fuel. \n\nThe imagery is designed to frighten and dismay its audience with evidence of its huge carbon footprint, as it's called, and we go back to something between overpopulation as the problem, and people living in gross, ostentatious ways, people that look pretty much like us.\n\n[Nothing new there](https://controlroom.blogspot.com/2020/02/the-climate-change-hoax.html), the rhetoric since the 1970s at least.  A lot of the doomsayers didn't expect us to reach 2020 in fact.\n\nWe're really going to have to stop driving so much as commuters, and take a hard look at where the energy is going to come from.  Even an electric car is not a soul saver.\n\nAs someone who enjoys mega-projects and large scale engineering, I'm not especially dismayed by all that dismaying footage, but of course the highest technology in the picture is always nature's.  We humans are hers, after all.\n\nDestroying nature's technology to make way for more technology doesn't always look that smart if we're serious about investment banking (science fiction, screenwriting).  We know how it is with  those humans: you can't trust 'em to do what's right, because they're greedy little buggers who like to dress up and drive fancy cars. \n\nEven Al Gore, and that 350 guy, got greedy and sold us out.  They all sell out.\n\nDamn them.  Damn us.\n\nThe Planet of the Apes ending, where we regret our stupid ways, is likewise sadly tragic.  We've really made monkeys of ourselves. \n\nI look at that Planet of the Apes imagery myself [in School of Tomorrow](https://nbviewer.jupyter.org/github/4dsolutions/School_of_Tomorrow/blob/master/isotope_decay.ipynb), and think \"we are devo\" in a lot of ways (overspecialized and so on). As Bucky liked to say:  Darwin got it backwards.\n\n[via GIPHY](https://giphy.com/gifs/planet-of-the-apes-bSdkuLDnrYheE)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}