{
  "id": "1617824327211979181",
  "title": "Play for Pay",
  "published": "2023-06-15T15:45:00.010-07:00",
  "updated": "2023-06-15T15:53:59.842-07:00",
  "content": "Work ethic Yanks and other Americans, many of Protestant extraction, want there to be an \"earning a living\" game, such that the undeserving losers might be deprived of their livelihoods, there being some fatal insufficiency as it is.  It's only fair.  Work hard if you want a place in heaven.\n\nThe Yang Gang had an uphill battle championing a UBI (universal basic income), paving the way for limited testing over the sars2-covid years. \n\nPeople question \"income for what?\" implying not enough work is or was getting done, in exchange for the channeled and forwarded stellar energy.\n\nOur research on the importance of play, and not just in childhood, suggests the UBI is about sponsoring your play, which again, in Protestant eyes, many turn into some Pinocchian nightmare, on Donkey Island, whereon people make irredeemable asses of themselves. \n\nMany stuffy adults equate \"play\" with \"profligate depravity\" and/or \"irresponsible frivolity\" i.e. what they themselves would indulge in if given more paid time off.  They're into policing themselves, and by extension, fallen humanity.\n\nA lot more anthropology attaches here than I have time to think through, let alone scribble down.  \n\nWe have the memes of \"hard fun\" and \"professional sports\".  What a lot of people might do with their UBI scholarships is learn another language, or more of their own.\n\nPlayers with talent get to make a living in their program, with the consent of their clients and customers.  Professionals get paid to fool around with all manner of equipment, and many love their jobs doing so.\n\nA UBI would speak to the professional inside of one, yearning to attain mastery, through play, for some additional skills.  People do get motivated by images of a future self, a possible upgrade, especially if they sense progress right away, and if their ideal self also looks like a net positive for others as well.  Players want to be assets on whatever teams.\n\nEven the Yanks will understand that, maybe.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}