{
  "id": "114159960324471109",
  "title": "Politics @ Princeton",
  "published": "2006-03-05T17:11:00.000-08:00",
  "updated": "2023-04-16T08:32:28.693-07:00",
  "content": "[](http://photos1.blogger.com/blogger/1134/545/1600/tank01.png)\"think tank\"Matt and Mike plan to tease me over beers this evening, about my alma mater, thanks to the cover story in the most recent issue of The Nation:  Princeton Tilts Right by Max Blumenthal (March 13, 2006).The article is about some well-funded conservative think tank based at the university, but getting no direct funding therefrom.  If you're reading from overseas, don't confuse \"conservative\" with \"conservationist\" -- two separate memes.Geeky aside:  if looking back from the magazine cover i.e. from inside the depicted Ivory Tower (not really ivory), the tilt is actually to my  left.As the movie [Why We Fight](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html) points out:  think tanks have become pretty important of late, as government out-sources more of its brains, as well as its brawn, to become a pale ghost of its former self  (like a ring wraith?).Well, I guess that's participatory democracy in action.  Plus thinking really doesn't cost that much (brains are quite energy efficient), so having a ton of money doesn't necessarily mean that much.  Like, I've got my blogs, and they're world readable at no cost to me.  So what if I'm not a billionaire like Bill?But hey, what if Google gets taken over by Chinese ideologues and my blogs get deleted by busybody censors?  There's always room for angst.  Old Europe used to have an even more drastic remedy for talking heads it didn't agree with:  it'd cut 'em off or strangle 'em (or just burn the whole body alive, at the stake).The USA's founding fathers tried to curb those Old Europe reflexes (didn't succeed entirely), by enshrining freedom of speech in the U.S. Constitution.  But did our founders forecast \"artificial persons\" having the same rights as the real ones, under the [14th Amendment](http://www.thomhartmann.com/unequalprotection.shtml)?  Obviously not.  But then, they didn't foresee the Internet either, which makes [my websites](http://www.grunch.net/) \"but a mouse click away,\" on a par with ExxonMobil's.I interviewed two candidates for Princeton this year, like I did last year.  Impressive achievers, per usual.  I didn't hear a lot about community service though.  When do high school kids ever have the time to work with the less fortunate, the impoverished?  Why doesn't our public school system provide these opportunities?  Because there's no more poverty to worry about?  [Someday maybe](http://worldgame.blogspot.com/2006/01/dignity-village.html).  In the meantime, the wall around the privileged seems higher than ever these days, gated communities more the norm (like we had in the Philippines -- I lived in the somewhat ironically named Magellanes Village).Anyway, as a [radical middle](http://worldgame.blogspot.com/2004/10/mark-satin-at-powells-books.html) guy, I know people will probably cull through my many postings looking for words to use against me, if and when those [A & B modules](http://worldgame.blogspot.com/2005/12/incomprehensible.html) ever start appearing in our nation's [geometry classes](http://mybizmo.blogspot.com/2006/02/sixth-grade-geometry.html).  Showing synergetic geometry on television (like in a [Global Data](http://worldgame.blogspot.com/2005/12/commercial-break.html) commercial):  that'd be like a match to the fuse of Bucky Fuller's long-running Mission Impossible thread.Well, my would-be critics'll find plenty of [Urner](http://worldgame.blogspot.com/2005/12/whats-urner.html)-authored rants and diatribes, stuff to get angry about.  Like just today, look what I posted to Quaker-P (more context in the full version):There is leverage in having someone owe me a debt.  There's also the hypocrisy of the USA pushing the IMF to force other governments to repay debts, at great cost to social programs, while it simply sinks deeper and deeper into debt itself, never really forcing the same dynamics internally.Yes, social programs get cut (FDR era programming has been gutted), but just enough is meted out to forestall a massive popular uprising or backlash -- a day-to-day calculation, requiring close collusion with the corporate media.  In the Third World, it's easier to use brute force intimidation, to make activists \"disappear.\" ....I have this portfolio of investments.  It doesn't have to have the USA in it for my operations to be profitable.  There's nothing the USA has that I couldn't get elsewhere.  Or that's how it might come to seem, if present trends continue.Besides, there's a sense of poetic justice in watching those USAers join the rest of \"the developing world\".  I'm tired of watching this self-righteous \"superpower\" strut about on the world stage, arrogant and stupid.  I would love to have it go down, but in a controlled and intelligently managed way, such that it doesn't set off its nukes, the way Americans do whenever they feel threatened (sniveling cowards that they are).Wow!  I sound like a dangerous dissident or something.  But keeping to the middle way means hanging ornaments in a balanced fashion over time.I veer left and right, but it's [design science](http://mathforum.org/kb/message.jspa?messageID=4508580), more than politics, which supplies [the gyroscope I steer by](http://www.grunch.net/synergetics/politics.html).  [I Engineer](https://genius.com/Animotion-i-engineer-lyrics) (downloading it now, from iTunes -- a song Matt turned me on to a long time ago).Other developments:Mom just called, about to fly off to the New Europe.  Sunanda is back in town, from Costa Rica, Panama and Nicaragua, with lots of stories to share with Wanderers.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}