{
  "id": "3485453546898991302",
  "title": "Polling Places",
  "published": "2008-12-15T11:43:00.000-08:00",
  "updated": "2008-12-16T19:12:10.602-08:00",
  "content": "Engineers talk about polling the same way they talk about busing, in an unfamiliar (quasi-alien) namespace.  A bus takes signal between devices.  Polling means listening to instruments, likely through ports, using some kind of looping mechanism (buses involved?).The [CSN](http://mybizmo.blogspot.com/2008/12/voluntary-associations.html) \"polling place\" is likewise a coffee shop, virtual office.  You, a taxpayer, want your money's worth, so log in [as a citizen](http://worldgame.blogspot.com/2008/12/wanderers-2008123.html) of this or that nation, and archive your views, knowing auditing happens, buzz crawling, scoring.  These aren't games monopolized by nations of course; companies want to play too.  How and where you spend your time and creativity will be largely up to you.  The Coffee Shop Network is there to show you some options.One language game I've mentioned occurs at the point of sale.  Don't leave it up to the proprietor what causes you support, select from a menu and have that go on your record, back to [your Identity 2.0 server](http://controlroom.blogspot.com/2006/03/identity-20.html).  Other players want to see your track record, just as you'd like to see theirs.  Point of sale tracking is already part of everyday shopping, thanks to supermarket rewards cards.  This is bumping it up a notch, putting your money where your mouth is when buying a donut, bagel or beverage.Although an open source project, [CSN software](http://mybizmo.blogspot.com/2008/12/voluntary-associations.html) will come optionally customized with vendor listings using a lineage system, meaning previous proprietors will contribute listings from experience.  Encoding \"word of mouth\" value-added is leveraging network effects, which is why I'm expecting a centralizing back office to provide economies of scale.  Stats from just one shop will be interesting, but scattered by zip code, against time lines, will be downright fascinating, and vendors will feel amply rewarded for the privilege of their sponsorship.I just got a call [from US Bank](http://www.usbank.com/) while I was writing this (Milwaukie Branch), a follow-up to an earlier call, not because of this blog post, but I did blab on a little about what we're doing here.  She'd like to lower my interest rate some, if I qualify as a long term investment.  Having started in 1990, according to their own records (as DWA / 4D), I sound like a pretty safe bet in some ways, but then I'm not the whole picture, have a cast of characters I work with, plus there's the larger economy to consider...[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjcO6WGPQY-VlAV3eei5dcKFMCuQ5xIkodSHal6YwPho3Ci_cwApV5YKd11I_EsZy7sx5U_RAothDzhRKUvdXs3Mn6n5Po_ONF8XwrKy-J7hmKtHeLFmFYlo6syWcCssac_p9nh/s1600-h/csn_flickr.png)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}