{
  "id": "50267924059678139",
  "title": "Poly Families",
  "published": "2013-09-25T09:12:00.002-07:00",
  "updated": "2013-09-25T21:28:59.502-07:00",
  "content": "You'll find the Xtian Right looking askance at gay marriage, and saying, \"now that they've won their gay rights battle, the Xtian Left will be bringing back polygamy\" (the idea being the Left is the source of all corruption, as backed by villainous atheist communists etc.).\n\nYou'll find more mixed feelings here as polygamy is a norm in the Bible and some Xtian sects have already practiced it, in [its patriarchal mode](http://worldgame.blogspot.com/2012/08/adventures-in-teaching-and-driving.html) at least, where one guy is responsible for a herd of women (he husbands them).\n\nThere's nostalgia for \"Biblical marriage\" and some Righties are torn, feeling it's actually their side that should now push \"one guy, many women\" as a form of revenge.  \"If gays can get married then I should be able to marry both Connie and Cheryl\" goes the reasoning.\n\nMany Mormons are still resentful that a nation touting itself as a \"land of the free, home of the brave\" is still too religiously bigoted and cowardly, still too controlled by mainstream Xtians, to allow Mormonism its full spectrum of expression (like the Saudi version of Islam, which still disallows women their Quranic right to rule as equals).  Some still get away with it (Biblical marriage), but are subject to continual harassment, sexual and otherwise.\n\nBuddhist subcultures that still practice polygamy are sometimes apologetic and think they have something to \"get over\" while being ashamed, like cannibalism.  Again, not the first time a traditional culture has \"miss-underestimated\" (to quote a president) their immanent \"sexiness\" as lifestyle role models.  Just when they're about to be \"in\" (in vogue, fashionable), they're trying to go \"out\" (as in \"off the world stage\").\n\nIn these Buddhist marriages, you don't necessarily have a head of household in one specific male or female figure.  Imagine the self help bookshelves on family dynamics wherein multiple partners work to get along and thrive as a family unit.  Sounds like a law firm.\n\nIndeed I have long advocated that those seeking \"nontraditional\" partnerships of more than two, define themselves [in business law](http://controlroom.blogspot.com/2012/11/election-night-2012.html) and forsake \"dom rel\" (domestic relations), an area of the law wherein the concept of multiple partners is still shriveled and immature -- thanks a lot to Xtian influence (a \"dumbing down\" religion in many of its non-gnostic branches).\n\nWhat the Right Wingers apparently haven't done yet is put 2 and 2 together and realized that \"gay marriage + polygamy = same sex triples and quadruples\" etc.  That hadn't occurred to them.  \"Three gay guys walk into a bar, a family...\".\n\nBut aren't we just talking about rock bands now?  Any combination of boy-girl gloms together and has succulent family time together, what's the problem?  Well, as you know, divorce is a problem, dividing up profits and property when a partnership separates.  Sometimes the whole group disperses.  More commonly, a new person joins and a veteran moves away.  There's turnover.\n\nIn industrial post-modern societies, each individual has the wherewithal, in theory, to take care of her or himself.  In reality, we're still quite a ways from fulfilling this prophecy, but the point is you might come into a relationship with a lot of stuff marked as yours, and not transfer it to the group.  People keep track of their stuff and keep their own credit ratings.\n\nSelling things is also easier these days, on eBay and Craig's List and so on.   You don't need the group for personal survival.  There's no \"dowry\".  Households are simply less complicated in this future, as the individual humans are themselves more self contained and secure as economic units, as worker-scholars in the Global U.\n\nSo we may be getting to a point where those with enough social skills will be able to negotiate their arrangements without much expert assistance, except from bookshelves and websites.  unmarried.org is a good one to visit.  Many templates abound.  As for the rituals, marriage ceremonies have often been inventive.  The choice to call it \"a marriage\" will be up to the group.  If a couple from a larger family of five travels together, they may call themselves \"married\" without going into more detail.\n\nKeeping it simple is a good idea.  The less complicated your relationship to property, the better, when it comes to keeping one's affairs in order.   That doesn't mean you can't own stuff.   You just need to run your life more like a business maybe.  Quakers might help with that.  Our \"love makes a family\" testimony is strongly rooted and our reputation for conducting our business with clearness is not without cause.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}