{
  "id": "3919479672726676082",
  "title": "Portland Python User Group Meetup",
  "published": "2023-04-20T08:07:00.004-07:00",
  "updated": "2023-04-20T13:35:44.111-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52832512725/in/datetaken/)\n\nI used my Trimet phone app to buy a fare on the new FX2 \"bendy bus\" (articulated) to the US Bank Tower.  \n\nSince I was running early (4:20), I got off along the mall, thinking to replace my dilapidated library card, forgetting the main Multnomah County library is again closed for remodeling.  So I wandered around taking pictures, ending up at New Relic at the appointed time (5:30).\n\nI'd not been to a PPUG gathering in many moons, as even before covid I'd been frequenting the PDX Code Guild.  \n\nHowever a couple people recognized me as an old timer and my status as a co-organizer still pops up on Meetup dot com.  I reconnected with a guy who'd been at Dark Horse Comics before moving to Europe for several years.  He reported that Portland still gets respect in Europe, as a capital of open source and as a tech savvy little city.\n\nErnest Bonat PhD recently stepped forward as our main organizer.  He's also carrying the torch for the Hillsboro meetup.  Really, it's greater Portland that's tech savvy, and the Silicon Forest more regionally.\n\nNew Relic not only provided space, but bought us pizza.  We got to listen to a draft of their talk for the upcoming Pycon, about how they harness the Python import mechanism (complex by design) to inject their proprietary introspective monitoring software.  \n\nNew Relic monitors the health and safety of company websites that use industry standard Python web server frameworks, such as WSGI, ASGI, Starlette (including FastAPI) and Sanic.  They serve data dashboards relevant to many in the C-suite (CEO, CRO... CTO).\n\nThen we had lightning talks.  The one about Jupyter Notebooks included some tips I'm planning to try. \n\nDr. D. (PhD) was able to join us, coming from his presentation at Terwilliger Plaza (a retirement campus) regarding Humanists and Humanism.  He's president of the local chapter, and also a computer science guy, if not specifically into Python.  He has his own research project, revolving around a language for mapping out and implementing parallel processing schemas.  He drove me home.\n\nHow PPUG goes forward from here is unknown.  Will we get to meet at New Relic again?  Who will buy the pizza?  The usual rule is whoever buys pizza is welcome to promote and present about their company, including in recruit mode.  New Relic was operating well within the rules.  We expressed our collective gratitude.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}