{
  "id": "1416885707355006403",
  "title": "Portlandia Skits",
  "published": "2012-10-01T19:56:00.002-07:00",
  "updated": "2012-10-01T21:36:01.753-07:00",
  "content": "I'm thinking how Junior Friends (young Quakers) often stage little plays, sometimes with morals to teach, like parables.  The Bible is of course full of these, as are many traditions.\n\nAt the Food Not Bombs meeting last night, I conjured this image of a consummate jerk, tattooed with \"Food Not Bombs\" and downtown egging cars, yelling at \"meat loaf eaters\".  \"The rest of us might not be too enthusiastic about this guy\" I dead panned.  People laughed.  Kirby's funny.  Especially at the egg part as what's up with a militant vegan protesting by throwing meat and dairy at people.  That's not the kind of food fight this is.\n\nThere's a kind of role playing that goes on.  Where do you intercept a healthy food supply on its way to some disposal route?  Is it begging?  Is a favor being asked?  To the extent a society is agreed that minimizing waste is a good thing, and that teaching logistics, urban survival skills, cooperative cooking is a good thing, it's easier to get the wheels turning.\n\nI've been looking at municipal converted warehouse and school zones where the vocational jobs of food prep and cooking, food handling, might be practiced.  Yes, that means knives.  So much of school is about filing junior away in a proto-cubicle, a \"desk\", where nothing can happen.\n\nVocational studies, home economics, peeling potatoes, that's too blue collar for white collar junior here -- according to concepts and categories that crush with their nonsense.  What insanely dumb ideas.\n\nAnyway, SE chapter should not be required to change its character, just because FNB commercials are popular in Polish and Lithuanian.  Some of the exchanges going on are intra-Europe.\n\nTo what extent they're doing this in Turkey I don't know.  My impression is less gets wasted in the first place.   Food gets processed and prepped, a lot of times by women living indoors, while the males ply the streets, foraging in various ways.  How do bicycles fit in?  The answers are cultural.\n\nI told Rick at meeting that I wanted some historical record showing our awareness of the tensions among cultures, and ways to help resolve them short of war (neural breakdown, [wigging out](http://www.urbandictionary.com/define.php?term=wigging%20out)).  Hawo's Dinner Party was screened at AFSC during the last major meeting, where Yearly Meeting reps come from all over.  I was there for the North Pacific Yearly Meeting.\n\nHawo's Dinner Party is about Somalis, being transplanted from Africa to North America, and working to make a go of it.  Some of the marriages aren't taken under the care of the USG or the states, because too many people are involved.\n\nAs Friends, we understand that cultural divide from the Native American experience.  The Warm Springs tribe well documents in its museum the heart breaking chapter in its history, when the children were programmed with Christian dogmas (in boarding schools), over the objections of grandparents, and made to feel only \"nuclear families\" made any sense.\n\n\"Nuclear families\" in an \"Atomic Age\" -- that was what was being offered as the American Dream at one time.  A kind of \"White Christmas\".\n\nI think we're over that, a lot of us, whether we have atomic power or not.\n\nWe no longer lionize or deify the nuclear waste makers.  Plutonium cookers are caught in a cruel web, like [the meth lab cookers](http://mybizmo.blogspot.com/2012/09/building-bombs-movie-review.html), ensnared in a crooked, monied gangland, a wilderness of mirrors and marginal governments, deeply into eco-crimes while insisting Congress keep the people looking another way.  However, a congress, any congress, has limited powers to persuade, even if Cicero himself is one of its orators.\n\nSisters of the Road might be a kind of role model institution, when it comes to helping with rehab for prison industrial complex engineers.  A first step is to discover a better life.  Too bad that Rajneesh Puram thing turned into such a circus.\n\nThe idea of boarding school type operations, better than prisons, not institutions for punishment, could replace the grim facades we have now.\n\n\"Human warehousing\" (prisons) need not be this profitable.  Competition would be a godsend to many, including to those forced to imprison others for money.\n\nA civilian service with options for lifetime careerists, like the scouts, with some big toys, might succeed in pulling its weight as a morale booster.  I'm not talking mindless nationalism here.  This is a mingling, an exchange.  We trade around.\n\nVisit Portland, experience working on some of our projects, then move on.  Relay what you've learned.  Help us stay up to date.  Teach, show videos.  Lightning Talks.  Occupy & Ignite.  Burning Man.  Stage some skits.  Act it out.  Help us to understand the story.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}