{
  "id": "5137376402380003803",
  "title": "Portland AFSC Support Committee",
  "published": "2013-04-30T11:39:00.000-07:00",
  "updated": "2013-04-30T13:44:35.148-07:00",
  "content": "[](http://www.flickr.com/photos/kirbyurner/8641058228/)\n\nOur conference call yesterday was a telephonic nightmare, though everyone was in a good humor about it, and we found workarounds on the fly.  The non-office group that started the [Star Cafe](http://www.starcafe.org/) conference call, including our clerk, patching in from Greater LA, could hear one another, but we in the office could not be heard on speaker, and if anyone picked up the receiver, the phone's speaker would die.\n\nThe old phone system, potentially high end, fashionable at Victoria's Secret, had become unusable.  Discontinuities in management left old passwords inaccessible.  Factory resets?  The work fell to Mireaya.\n\nThese glitches, and those with the leased photocopier, have nothing to do with landlord relations.\n\nSharing the building with [the IWW](http://portlandiww.org/) is a plus for a number of reasons.  On the whole, it's not a bad situation.  There's wheel chair access and East Burnside is a happening place.  [The Catholic Archdiocese](http://www.archdpdx.org/) and [AlbertinaKerr](http://albertinakerr.org/) are both in the same neighborhood.\n\nOur agenda was packed as usual.  Pedro and I talked earlier, about some of my correspondence.  I'd been endeavoring [to connect Navajo and Wabanaki efforts](http://wirelesshogan.blogspot.com/2013/04/a-prayer-of-indigenous-peoples.html), or at least raise awareness of parallel / convergent narratives.\n\nNative peoples of North / Central / South America feel they have an automatic right to not have their movements (immigration status) controlled by immigrant populations from other continents.  They're not the immigrants in this picture -- they've been here much longer.  Some of this sentiment will be expressed in the [upcoming May 1 festivities](http://mybizmo.blogspot.com/2013/04/may-1-pr.html).\n\nLinks between Hanford and [the bombing of Nagasaki](http://worldgame.blogspot.com/2007/08/remembering.html) in particular were discussed.  Apparently there's some [new research](http://toxipedia.org/display/wanmec/Particles%20on%20the%20Wall) available, in the form of an award-winning student project.\n\nThese are not official minutes by the way, and I'm not the recording clerk.  My role is to help mind the relationship between our Yearly Meeting (NPYM) and the AFSC.  This is distinct from the MMM - AFSC liaison role, which is linked to Multnomah Meeting's Peace and Social Concerns Committee, currently experiencing turnover as its clerk prepares for a Friends Peace Teams adventure.\n\nThe community service interns were generous in letting me photograph [some of the squares](http://www.flickr.com/photos/afscportland/sets/72157633202755039/) for the Drone Quilt that's being coordinated at a more national level.  AFSC is just one of many participants in that project.\n\nThe Door Project is also benefiting from intern support.  Some Portland Public Schools have a community service requirement, more like scouting (our newest committee member, welcomed last night, is an Eagle Scout).\n\nSpeaking of PPS, Cleveland High parents are up in arms over the budget cuts.  As I put it in my written report to our committee:\n\nRegarding the May Day theme of fighting back against oppressors who\nare dismantling social services in order to feed their fevered dreams\nof imperial domination, parents at Cleveland High School are up in\narms (see below)....\n\nThose who preach austerity and cutting the budget while squandering on\nmilitary jobs (because it's easier and lazier to kill for what you\nwant than to negotiate a peace) have no business representing\nthemselves as \"the USA\", a nation that went bankrupt (morally as well\nas financially) sometime in the mid-1980s according to Medal of\nFreedom winner R. Buckminster Fuller.  Of course some hope for a\nreawakening of her democratic principles. \n\n[](http://www.flickr.com/photos/afscportland/8634544187/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}