{
  "id": "1409182456512770558",
  "title": "Post Game",
  "published": "2010-02-08T07:41:00.000-08:00",
  "updated": "2010-02-09T03:03:42.001-08:00",
  "content": "I'm not planning to analyze the Superbowl, which I saw quite a lot of, not even [the commercials](http://worldgame.blogspot.com/2010/02/more-from-97214.html).  LW was too busy working on her community garden to catch the game, but did confidently predict a Saints win, based on early season previews she'd seen at one of her [sports bar music venues](http://www.flickr.com/photos/lindseywalkermusic/4286740713/).  I announced her prediction before the game, injecting a plot element.Speaking of work, I missed most of the half time show, instead went off to a secure area to pace back and forth and call another attender in our Multnomah Friends directory, seeking more feedback on [AFSC matters](http://controlroom.blogspot.com/2010/02/notes-from-lunch.html), given all these emails going around.  I have some official duties to look after.  Did The Who sing [Won't Get Fooled Again](http://en.wikipedia.org/wiki/Won%27t_Get_Fooled_Again)?  Apropos if so.Earlier this afternoon I joined Overseers in slogging through a long agenda.  Quakers work hard in their various jobs, take them seriously.  These are stressful times for all of us, as we seek to find our way forward.We met in one of the classrooms, the one with the Fuller Projection.  The maps on either side have some features in common (a family resemblance):  the National Geographic one to the left has no nations, while the older Mercator on the right is more drastically distorted.The Fuller-Sadao projection is North Pole centric, which suits no one's political agenda all that much.  This has always been an esoteric map; cool to have Quakers using it some, part of our shared heritage.I encourage [high school teachers](http://www.flickr.com/photos/17157315@N00/3292180674/) to use it too.  Tell some of the stories behind it why not?   What's a projection?  Which world maps are the most commonly used?  What are their properties?  Basic stuff, hard to justify bleeping over, if one takes geography at all seriously.Google Earth and the various map engines get some focus here too, if the school has an Internet connection.The practical matter of getting directions between points A and B, finding one's way about in one's own terrain, is legitimate geographic content and of immediate relevance to teenagers.  We call this a \"place based\" curriculum.  Around here, that means studying the Columbia Gorge, it's geological history, the dams, the grid they feed.Yesterday morning I wrote another essay on this phi/sqrt(2) business, bussed it out to some influential contacts.  I'm thinking we've got a discovery here, one that's accessible, doesn't take a fancy degree to appreciate.  There's an audience for this kind of thing.Yes, a little setup is required, like the shift into tetra-volumes, but then that's easy enough to grok, something we wanted to share about anyway.  Then shift back to hexa-volumes, the well explored option, not about to fade out.[Should we compare](http://mathforum.org/kb/thread.jspa?threadID=2036171&tstart=0) shifting between 60-degree tetrahedra and 90-degree hexahedra to shifting between decimal and hexadecimal bases?  Ten is a triangular number (60-degree), sixteen a square one (90-degree).I also put in some positive words for WikiEducator, encouraging its use, given the discussion [on edu-sig](http://www.python.org/community/sigs/current/edu-sig/) (Python community) has returned to [open source curriculum writing](http://mail.python.org/pipermail/edu-sig/2010-February/009787.html).  That's what Wikieducator is all about.  The new WYSIWYG editor makes it even more accessible.  Getting started is a piece of cake.  Master the intricacies as your schedule permits.Does anyone disagree there's a trend here?  Academic culture is updating its code of ethics to accommodate self-correcting copying and transmission (tcp/ip).   We've been hearing this at conferences for years, so it's not like I'm reporting breaking news.  Withholding vital information from needy students simply goes against the grain of a university, religious and/or secularist.[Over on math-teach](http://mathforum.org/kb/thread.jspa?threadID=2035612&tstart=0), I've been enthusing about Dr. Chuck's contribution (University of Michigan).  He's adapted an open source textbook that's already been through a number of changes.  This is how teachers may expect to keep pace.  Find some freely available raw materials and add value, engage with your peers.I often tell people I communicate by blogging, but hey, what are cell phones for, if not to make calls during half time?  Blogs have limited appeal, as do computers in general.This was not at my place, the private residence where we congregated around an HDTV.  Three of us piled into a car to get there.I enjoyed meeting some older guys I'd not met before, including a taxi driver on break in 3rd to 4th quarters, grabbing some coffee and pie, heading back out.On screen now:  Metropolis (original version, 1927, Tower of Babel part -- I came in late).  Yes, moving imagery has come a long way since those times, but in another sense not so much (the special effects are pretty impressive and intense in this black and white classic, the musical soundtrack just adding to the eeriness).Speaking of tetra-volumes, David Koski has been busily dissecting the four hexahedra that make up the rhombic dodecahedron.  The vZomes are pretty clear, although I abet with my cube of magnetic Mites.Three half-couplers do the job, giving each a volume of 3/2.  He's getting into the different permutations of As and Bs, a topic at the heart of Synergetics.  Maybe I'll follow up on that soon.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg0cq8Uz-MnJjs7xcXSmbVxuSh-8Nln0nNbZx3lni8kGAHqTY2W2lmog7gExu8A6pK9K3SA6eulNq2ZTVydEa3JeGr7y6En0Lnm_7newRS4LzDXMF68KZIzbYfhI6EOe3DIOqx1/s1600-h/octcenterrhdodecAB.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}