{
  "id": "6729005602079139645",
  "title": "Postmortem FNB",
  "published": "2010-12-10T10:19:00.000-08:00",
  "updated": "2011-06-12T13:26:33.014-07:00",
  "content": "By \"postmortem\" I mean \"going meta w/r to the last chapter\" as FNB will continue on its merry way. I'm still hosting the trailer, planning a next pickup.There's a trade off between excess and waste.  One brings an abundance of food to the market so as not to run out, and paying customers come to get what they need.  After closing, you have the problem of what to do with unsold produce.  Trading with your neighbors is not always feasible as you may all have an excess of the same thing.Enter these various alternative recycling systems, engineered by geeks, drawing from the gleaner tradition.  Yes, the material has already been picked over by paying customers, or in some cases selected and delivered.  That doesn't make it all substandard though.  Excess may mean \"more of the same\" i.e. there's no detectable step down in quality.A geek cook or chef is someone to value.  If there's a doable menu with lots of essential nutrients, both hygienic and flavorful in a rustic vegan kind of way, then your chefs will come up with it. There's not always much lead time.  Here's what we have, start the meter running.  You may have seen similar talent shows on The Food Channel.Fruit that's too ripe for further storage might be perfect for a pie.  Not being an expert chef, I'll spare you a long list of examples.  Whitney brought cinnamon yesterday, and that made a real and positive difference to the fresh squash Aaron cooked.  We also had scads of mushrooms.  I proposed we make that a soup, to which beets, potatoes and some other stuff was added.  As part of the janitorial staff, I'm allowed to make proposals.What many would have to do with their excess is drive it back to its rural origins for composting, as the city waste collection system isn't open to excessive dumping.  A farmer's market can't just abandon a pile of wasting produce and expect to be invited back week after week.  So it's an expense to the farmers to haul a lot of it back.  Earning the good will of the townsfolk by feeding one of its recycling architectures, makes a lot of sense.In my own case, I model the \"radical house terminus\".  I know you're probably thinking \"radical\" means something \"bad\" politically, but as a math teacher let me assure you it simply means \"root\", as does \"terminus\" in some lexicons, as in \"tapping point\".  We provide time and energy to the recycling grid, which means accepting some compost and doing our own gardening and food provisioning.  We contribute to the kitty.On the other hand, we don't want FNB to become a composting service for surrounding neighborhoods, or, if we do, we'll need to work with the city on a truly intelligent plan for that. Maybe bulk storage and delivery around town [on CSA routes](http://worldgame.blogspot.com/2010/10/willamette-quarterly-2010.html), using lots of bamboo bike trailers, a job for academic credit in some programs, becomes fashionable, if not in Portland then maybe [in Brooklyn](http://challenge.bfi.org/2010Finalist_CalltoFarm).  However if neighbors start lugging bags of compost they can't use to the FNB fooding events (\"fooding\" is a colloquialism in Bhutan), expecting free haul away service, then \"termini\" such as mine would be quickly overwhelmed.Now Lindsey is a composting genius and when she takes up residence on a property, it's \"with intent to farm\" -- and that means compost.  She'll get off her bike to check out a compost pile, strike up conversations, build her whole social network around the art and science of composting.  This isn't me though, and when Lindsey leads a girl scout math training in Oregon's hinterlands, I'm immediately over my head with this composting business, unable to route and organize effectively.  I go under, as neighbors use my terminus for a landfill (we haven't gotten to that yet, thanks to city codes).So that gives a sense of the workflow.  If Portland wanted, it could probably scale up these types of operation and pretty soon be teaching gourmet ethnic cooking to legions of young people, taking advantage of healthful local produce, some bought and some vectored through experimental math curricula like FNB and girl scout math.  In a TV literate culture, you'd expect to build public acceptance and understanding through sharing video and audio (so-called \"reality television\"), and indeed we're well along in that process.  FNB chapters have been feeding media to public repositories from all over the world, each providing a local spin.  Our chapter was recently the subject of [a PSU student study](http://controlroom.blogspot.com/2010/11/made-for-tv.html).When Lindsey came to town from her [engineering company background](http://mathforum.org/kb/thread.jspa?threadID=2214399&tstart=0), the bicycle equations were front and center, all about joules and calories, and skills, intelligence.  The [bamboo bike trailer](http://www.flickr.com/photos/17157315@N00/5171272920/in/set-72157624742571845/) phenomenon was getting going, thanks to a civil engineer we later met at a FNB event. [Aaron's metal version](http://www.flickr.com/photos/17157315@N00/5249569227/in/set-72157624742571845/) is like eight feet long and easily took everything from [the meetinghouse yesterday](http://worldgame.blogspot.com/2010/12/lunch-business.html) (including a soup server I need to return, along with Aaron's plastic ware).However, we're well aware at the Blue House that this is a lot about trucking as well.  Food conveyed to the warehouses, on a big enough scale to stock supermarkets, does not happen without trucks.  Fortunately, our insights into that world are growing, owing to geek activities in transportation engineering.  The same routing games played with bicycles are played with trucks on another scale.Portland has been working on being bicycle friendly, so the idea of \"feed me\" cafeterias staffed by people in training, with a lot of bicycles going and coming, is not going to overwhelm the infrastructure right away. The lanes have been painted and are intended for use in all weather conditions (except ice and snow for most cyclists -- for most motorists too, in these parts).  An electrified fleet might be coming, if not here then in a sister city, but it's still a different mix on the road, more vulnerable and fragile.  Oregonians make fun of themselves for not knowing how to drive in the snow, but they do know how to accommodate bicyclers hauling trailers or just hauling ass.  That might be a university geek you know, does Ruby on Rails.  Or maybe she's a nun of some variety (we have those too), cross-enrolled on several campuses around town.  These aren't people you wanna hit with your gas guzzler. Foreign exchange students (many from Africa).  [Ambassadors' kids](http://worldgame.blogspot.com/2010/12/schools-for-diplomats.html).  Lets keep Portland tourist-friendly.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhS_UOK9PgkSpUrGnJMfafi7pcUqxNjpxDEukEtRBDjri2HOxIsfKzyMAZMEtoHGl4fkGgT5UChmPjAkx3vaDH1XZrNPmcOKRCogjvwB0A_Xl3w0jBIxTpFTsaDsz6Kq0nJIMK7/s1600/Food_Not_Bombs_logo.png)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}