{
  "id": "4684461678636093122",
  "title": "POW Camps",
  "published": "2011-12-11T11:18:00.000-08:00",
  "updated": "2011-12-12T11:42:58.056-08:00",
  "content": "A re-gearing may occur when [a camp](http://mybizmo.blogspot.com/2008/10/bureaucratic-delays.html) changes status.  The [Business Plot camps](http://worldgame.blogspot.com/2011/10/esozone-talk.html) in the [Occupy Iraq and Occupy Afghanistan](http://controlroom.blogspot.com/2011/10/workaday-world.html) movement have a POW flavor about them.  [Those caught](http://www.flickr.com/photos/17157315@N00/3554456237/) in these so-called \"[face saving maneuvers](http://controlroom.blogspot.com/2009/06/recruiting-commercial.html)\" have become the cosmetology kit for Washington, DC.  As pawns of [the privatized security industrial complex](http://worldgame.blogspot.com/2004/11/pentagon-public-or-private.html), active duty conscripts are prisoners of war-making institutions such as NATO.  They are kept in a kind of limbo, akin to refugee status, with a minimum of human rights.  The North Americans have developed [a prison-minded culture](http://controlroom.blogspot.com/2011/04/roller-coaster-at-reed.html), so spreading [this non-democracy](http://groups.google.com/group/mathfuture/msg/043aa8f39b6ef74c?hl=en) to overseas bases is actually just a matter of following the same playbill.[I ranted](http://secondat.blogspot.com/2010/12/ranting-quakers.html) on the power of prayer in our Quaker [adult discussion group](http://controlroom.blogspot.com/2011/11/adult-discussion.html) this morning, talking about the integrity of a moral vision.  This was somewhat in response to the neuroscientific jargon which some Quakers have picked up, part of a meme virus I'd trace to a murky liberalism, by some twisted path.  I also shared about David Koski finally getting to [screen cast his work](http://coffeeshopsnet.blogspot.com/2011/12/screen-test.html) in a way that lets him stay in the environment he's most productive in, a home office setting.  That's how my prayers are being answered of late too:  in the comfort of the indoors, even though it's the great outdoors that I scheme about (in terms of bringing [more interesting work](http://worldgame.blogspot.com/2009/02/shovel-ready.html) to our state).Tara came in second overall in the LD category, in [the debate tournament](http://worldgame.blogspot.com/2011/12/foray-to-washington.html) just concluded.  I've been sharing about [these events](http://www.flickr.com/photos/17157315@N00/6429065659/in/photostream) on Facebook as well.I do agree with George Lakoff that people seem easy to program, a two edged sword.  The jingo-jihadists who want more war strut out \"Republican Guard\" as a meme, and the two-stroke thinkers (lawn mower brains) get all fired up, perhaps because \"Republican\" is \"our word\" (makes 'em mad just reading about someone else using it).  Stoking hatred for the Pakistanis hasn't been working fast enough either, although [WDC's professional hate-mongers](http://worldgame.blogspot.com/2011/11/double-feature.html) have been at it 24/7.  As more of this transparent saber-rattling goes on, it becomes easier to isolate the meme viruses to their sources, often tycoon types with out-of-control egos and no use for \"checks and balances\" -- lots of senile geezers who use their bank accounts to inspire awe among the sycophantic politicos.[OPDX](http://controlroom.blogspot.com/2011/11/virtual-opdx.html) is \"bad for business\" in the sense of serving with the non-aligned against the self-aggrandizing uber-powers.  The camps we're story boarding are not for prisoners so much as for those willing to freely [express their conscience](http://mybizmo.blogspot.com/2007/11/starvation-torture.html) by acting on behalf of [the Global U](http://mybizmo.blogspot.com/2011/10/opdx-pdv.html), providing food services, sanitation, shelter.  How these camps contribute to the betterment of humanity's condition is relatively easy to see.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}