{
  "id": "7366764452297075543",
  "title": "PPUG 2009.11.10",
  "published": "2009-11-10T18:35:00.000-08:00",
  "updated": "2009-11-11T11:37:43.413-08:00",
  "content": "I'm rejoining [my tribe](http://mail.python.org/pipermail/portland/2009-November/000853.html), tip of the iceberg in a 16th floor big room with round tables, coffee robot (fixed position), Jason miked.  He's been using his \"all you can fly\" JetBlue pass, ever since DjangoConf just about.  He's announcing about us.pycon in Atlanta, for those not [eskeered o' Georgia](http://mail.python.org/pipermail/edu-sig/2009-November/009661.html).  Then there's always [apac.pycon](http://apac.pycon.org/) for those of us on the Pacific Rim.Gotta check into Nedspace more?  There's one above Back Space, and another downtown. Co-working zones.Robin Dunn is here next to me, popped over from Vancouver, got caught in the sudden downpour twixt the garage and here.News: Guido's [PEP 3003 Language Moratorium](http://python.org/dev/peps/pep-3003/) has been accepted.  Pretty soon, the language will enter a kind of ice age where the focus is on something other than changing the language.  Make it run faster, create new virtual machines, add libraries, APIs to modeling engines, while accepting the language itself as a constant, a fait accompli.Lecture on the subprocess module, another on Pyflakes & Pep8.py.  Pyflakes in svn trunk is abreast 2.6.  Pep8 is under new management and lots of bugs have been fixed rather recently.  Jason showed us [flymake mode for emacs](http://www.emacswiki.org/emacs/FlyMake), which will let the coder run both of these checkers in real time and apply highlighting.  Better than Intellisense?  I'm an emacs virgin almost (just a little bit pregnant).The longest talk is on Mercurial Queues, however my daughter and her friend were locked out and I needed to duck out to make some calls, missed some details on this one.  Thanks Bret.  About 22 of us: 21 xy, 1 xx.  Rowley out ill, Pelletier just plain skipping.Jason on Mercurial pbranches.  Lots to know.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}