{
  "id": "2378355765572914465",
  "title": "PPUG 2008.6.10",
  "published": "2008-06-10T20:10:00.000-07:00",
  "updated": "2008-11-15T02:36:00.004-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhFi61XFB60o39ZumEZpBebB41JzfuCJTkOP5_J9myEzPMBPiNpA-1bd8akWl09Cqdh3pG8csQe1Iwb0kOhWuyAiTgoLHTrMuMGfYK0Ants7COcgkrkj93Aldo0wyx245oVOfwB/s1600-h/testing_app_engine.png)I had to jump ship, skipping Wanderers this time, given job-related demands.I need to [get up to speed](http://mail.python.org/pipermail/portland/2008-June/000401.html) on various matters Pythonic, specifically Django, [walking my own talk](http://mybizmo.blogspot.com/2008/06/scholars-in-summer.html) in some ways.[Curse.com](http://www.curse.com/) is one of the largest deployed Django sites on the Internet: We do roughly 60-90 million page views in an average month, and we have peaked at over 130 million page views [in a month] using Django. We are a very dynamic and user-centric Web site for online gamers, specifically massively multiplayer games, and are one of the largest Web sites globally for World of Warcraft. Our Web site was established in early 2005, and since late 2006 we have been expanding our reach into games beyond World of Warcraft.More discussions with those [brainy bees](http://www.sciam.com/article.cfm?id=brainy-bees-think-abstrac) on Synergeo (lots about Wittgenstein) plus managed to hook up with [Stallings](http://mybizmo.blogspot.com/2007/05/coffee-shop.html), thanks to [Consoletti's](http://mybizmo.blogspot.com/2006/12/another-day-in-rose-city.html) initiative.Mom visiting offices in DC, Philadelphia.Speaking of Wanderers, today I extended [wwwanderers.org](http://www.wwwanderers.org/) with ICANN for another two years, plus offered to relinquish my position as ISEPP technical contact per whois, give someone else a turn (twas fun while it lasted).Terry's new server at PSU is waiting in the wings.  I'm mostly focused on extra-Portland initiatives, connecting Quakers with Wanderers sometimes (Qs with Ws), just like at Pauling House HQS.We're also taking up TurboGears this evening, wish [Barton](http://worldgame.blogspot.com/2008/03/pycon-2008.html) was here.  Hey, maybe there's still time to crash Wanderers......I made it in time for Lynne's birthday cake, but missed David's robot vacuum cleaner demo (he bought it at [Costco](http://controlroom.blogspot.com/2005/12/presents-for-iraq.html)).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}