{
  "id": "2484316976471259187",
  "title": "PPUG 2013.9.10",
  "published": "2013-09-10T18:36:00.000-07:00",
  "updated": "2013-09-11T08:53:04.548-07:00",
  "content": "One could stay I'm still on the job, what with Python on the big screen in front of me.  Sam phoned, \"a poster child for the 'underwater' economy\".  He and Judy designed and built that dream home but it's not agricultural land and carpentry does not mix with arthritis.  People do not have the usual means and fantasize [about Agenda 21](http://mybizmo.blogspot.com/2013/09/ghost-cities.html), wishing something even better would happen.\n\nMy idea for high desert secluded schools, boarding schools, but with plenty of bandwidth, has been baking in these blogs for a long time.  Search on Project Earthala.  But that's in Alternative Universe (Other Tomorrow) wherein we're doing science fiction things, not that we aren't now.  You know what I mean.  Sam and Judy would be faculty, manage the radio station (students need experience as broadcasters).\n\nI really enjoyed my tour of WEFT in Champaign, a cultural headquarters.  I can listen on-line through i-Tunes like the boss does (one of 'em).  Actually a couple of our mentors host radio shows, I think I've mentioned over the years.\n\nWhat has any of this to do with Python User Group meetup of September 10, 2013?  Not much so far.  I'm enjoying the air conditioning in what used to be the Meier & Frank warehouse building, where they had the sales.  Now it's about wind power and Urban Airship.  I sure saw a lot of wind power fans (\"windmills\") across the prairies of Illinois.  Not everywhere, but in patches.  Perhaps there's a zoning map I could call up in ArcGIS or Google Earth or something.\n\nMaureen phoned about some amazing film at the Hollywood tonight, Walking the Camino.  She'd sold me on going (by myself) but the whole time I was thinking it was Monday.  I've been thinking that all day.  No, doh!  It's a Tuesday, Python User Group, and/or Wanderers.  Not a movie night.  But I've got it blogged.  I'll be back.\n\nAs a Subgenius I'm supposed to be good at cutting myself slack, but what does that look like really?  If you talk yourself into thinking your work is what you might do in your spare time, then it can look like slack, but are you fooled?  Some of the selves, some of the time.  OK, I'll shut up now:  Python's starting.\n\nSquawkathon, that looks interesting.  Software nerds collaborating with sea birds to help them stay alive.  Lots get caught in big nets.  Hard to believe the deadline for Pycon talks (2014) is this Sunday.  I should go more backwater, to the high desert schools, giving pep talks to the most committed.  Would there be an AFSC angle?  Quakers have a history of founding schools.  I'll let them database me as \"Dr.\" through Earlham.  I'm getting lots of snailmail for Applewhites Visit Oregon from Comcast and such, don't ask me how that happened (they did visit Oregon). \n\nMiguel Grinberg's presentation on Flask was stellar.  Very intelligible and cruft free, like Flask itself.  Students come in with their Immersive backpacks and upload the hike recordings to school servers.  A simple Flask application, student / faculty maintained, serves out the files.  Design Science.  More with less.  Read Miguel's tutorial -- many nods.  He's a great teacher.  He made a joke about his accent, which I found charming.\n\nSteve was passing out though, still recovering from Chicago.  We trundled off for food and beverage before the Selenium talk.  This was a taxi night.  Parking is rough and who wants to be driving around then, if not professionally.  Sometimes the chauffeur gets driven, just as someone else cuts (and styles) the barber's hair. \n\nMichelle did the lion's share of the work on this one, as usual.  Steve and I did our part by wandering around the meetup room looking for how to shut off the ambient music, over which our speakers would have been talking.  Steve found the control panel.  This is a fine meeting room by the way.  Other groups use it too, which is why the upcoming hackathon will be somewhere else, perhaps in close quarters with the Ruby people.  At work we're talking about cross-training more.  The term \"full stack engineer\" is like new code for \"Renaissance person\".",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}