{
  "id": "2079089251237834964",
  "title": "PPUG 2009.2.10",
  "published": "2009-02-10T19:58:00.000-08:00",
  "updated": "2009-02-11T04:23:02.544-08:00",
  "content": "Our Portland Python Users Group is well attended tonight.  We went around introducing ourselves.  A lot of us are between jobs or underemployed, but a few of us are doing OK, working for the State or whatever.  We seem to be collectively into Django a lot, web frameworks being the currency of the realm in some ways.Robin Dunn of wxPython fame has joined us, good seeing him again.I said something about fighting a MUMPS dragon in some unspecified context, not getting into details.  Nobody knew what that was.Michel gave a really quick talk on the Python turtle module (like in Logo).I went to some key slides in my Chicago talk, like the one showing Python Nation as a neighbor to the Programming Republic of Perl, wondering if that made sense, talking about lore, storytelling, it's importance as cultural glue.  We need to tell our own history.  Every age has its epics and sagas.  Technical content embeds against that backdrop.These thoughts connect with my power walk with the CSO this morning, to the top of Mt. Tabor.  Glenn is into a strong [mnemonic matrix](http://www.flickr.com/photos/17157315@N00/sets/72157612202599023/) relating geography, navigation and geometry.  Generating the key edge lengths needed to construct the polyhedra is a part of it. [ Our raps](http://coffeeshopsnet.blogspot.com/2009/02/glass-bead-game.html) dovetail quite a bit.Back to the meeting: I mainly focussed on VPython, showing the kind of stuff I use to teach geometry, animation.  I didn't mention anything about Bucky this time.  I opened with my little [xtranormal cartoon](http://worldgame.blogspot.com/2009/02/regarding-objectifying.html), which people enjoyed, shared that with Gordon Riggs as well.I was somewhat scattered, as is my style, but entertaining and not incoherent.  People expressed appreciation afterwards.  I built up [Saturday Academy](http://controlroom.blogspot.com/2008/04/sa-classnotes-2008419.html) as a headquarters for showcasing novel curriculum ideas, true enough given [I teach there](http://controlroom.blogspot.com/2008/04/sa-classnotes-2008419.html) (ahem ahem), but it's not just about me obviously.  [Gordon Hofmann](http://mybizmo.blogspot.com/2008/06/open-house.html) comes to mind, an SA: mainstay over the years.Jason did a fine presentation on [Zine](http://dev.pocoo.org/projects/zine/), which I'd never heard of.  I always come away from these meetings feeling twice as ignorant as before they start.  So much I don't know.[Pocoo Development Center](http://dev.pocoo.org/):  check it out!  Very young people are behind this high quality code.Werkzeug isn't a full web framework.  You call it, it doesn't call you.  It's more a toolkit with some glue, for doing webby things.  Adam Lowry is showing us his little demos.This looks like a good framework for getting a handle on the newish MVT paradigm for web frameworks, which seems to have fallen into place.  He's using [Jinja2](http://jinja.pocoo.org/2/) for a template language (T), a lot like the Django's but a superset, allows more Python in the tags.  He's using SQL Alchemy for an ORM (object relational mapper (M)). There's a really cool debugger.  Total control, best of breed tools.  But direction is often better than freedom.Over beers I struck up a conversation about PHP, which I'd [been cramming on](http://mybizmo.blogspot.com/2009/02/scratchpad.html) in case my destiny demanded it (it didn't).  Michelle, employed as a Django programmer, considers it like an ugly old pair of pants she keeps around because they're comfortable.A lot of web programmers cut their teeth on PHP, a sprawling infrastructure that grew without much of a plan, a hodgepodge in many ways.  Python is cleaner, a better design, but hasn't been in the web world as long, unless you count Zope (we had a couple of Zope developers tonight, including Maria).Michelle's idea to do more outreach to newbies, maybe new to Python but not programming, or maybe new to programming, is a good one.  Maybe the City of Portland needs an open source avatar (some appropriately named office)?  The Chamber of Commerce?[Our Coffee Shops Network](http://coffeeshopsnet.blogspot.com/2009/02/launch.html) needs imaginative coders, whereas vendors need more ways to position themselves and their products as a part of the solution, as public supporters of worthy programming, including a more productive kind of Reality TV.   These are ongoing themes in my blog posts.We all agreed that universities lag the private sector 3-5 years or more, high schools even further behind.  In \"theory courses\" it maybe doesn't matter as much, but when it comes to teaching skills... we could be doing a lot more.I need to wake up pretty early and fetch [Anna Roys](http://controlroom.blogspot.com/2009/01/more-school-business.html) from the airport, am on duty as a Wanderers escort again, plus am wearing my Quaker futurist hat.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}