{
  "id": "637907799134773730",
  "title": "PPUG 2013.8.13",
  "published": "2013-08-13T19:07:00.003-07:00",
  "updated": "2013-08-15T13:44:18.054-07:00",
  "content": "[\n](http://www.blogger.com/=)\n\nWell, here we are 6:38 PM, with a room full of geeks facing expectantly forward.  This will be the first PPUG in a long while not led by Michelle Rowley.  Already, we're late.\n\nI'm on the organizing committee but bowed out of any room-facing role.  Will we see one of our other fearless leaders step up to the plate?  I brought Steve in the car, he's good in a pinch.\n\nOK, we've kick started the ordeal.  This room needs to be miked but UA shouldn't have to shoulder all this stuff, Michelle either.  PDX Python Hack Night is in two weeks, in this very place.\n\nWhere are we?  One of the heaviest-looking stone buildings in NW houses two of the most ephemerally named:  Vestas and Urban Airship, the former being [a wind energy company](http://www.sustainablebusinessoregon.com/articles/2010/08/vestas_moving_headquarters_to_the_pearl_adding_100_jobs.html?page=all).  I love it when it works out that way.\n\nTechFestNW is another sponsor this evening.  Applause.  Now the first speaker.\n\nSteve Holden just announced a 15% promo for DjangoCon, told us the code.  I hope he lists that somewhere, like on the discussion list.  I posted about a job opening there just today.  [Splinter](https://docs.google.com/presentation/d/16BDDelt2Pd8Jid-tlElAChJk5cdztspJOpvJgT5YCQc/edit#slide=id.p).  Andrew Lorente is our speaker.\n\nThe giant room is packed.  People are taking chairs down off the stacks.  LOL cat to end the talk.  Splinter sits atop Selenium.  Steve asked a technical question about using mutexes as context managers.\n\nPPUG and Wanderers happen on the same Tuesday every so often.\n\nEric Holscher is doing [the second talk](https://speakerdeck.com/ericholscher/writing-docs-a-beginners-guide-to-writing-documentation).  There is a mike, which he started with, but now it has cut out. He has a fairly loud voice.  He's delivering a good plug for really writing the documentation.  The half-life of your project depends on it.  \"Documentation builds a better community.\"\n\nEric's tool uses \"markdown\" (.md files).  See [markdowntutorial](http://markdowntutorial.com/). \n\nI should go back to [my CP4E pages](http://www.4dsolutions.net/ocn/cp4e.html) and document stuff more.  I think I did pretty well at the time, like with [the Numeracy Series](http://www.4dsolutions.net/ocn/numeracy0.html).\n\nGood documentation covers:\n(a) installation\n(b) provides a tutorial, maybe a cookbook (recipes)\n(c) links to code and issues, for providing feedback\n(d) any other ways to get support, community info\n(e) a license e.g. (BSD, GPL, MIT)\n(f) contributor information (if there's a way to get involved) \n\nNo license defaults to closed source, copyleft is explicit.  This same message was drummed home at OSCON XV.  At this rate we'll be done within a single hour.  That's a fast PPUG meeting.\n\nNo wait, we'll have a Lightning Talk or two.  That's a good idea.\n\nBy the time I got to Rogue, seats looked all taken so I let Steve have some fun while I went around the block for some food.  I invited about twenty new people to my LinkedIn network to pass the time.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}