{
  "id": "906963725489670129",
  "title": "PPUG 2010.10.12",
  "published": "2010-10-12T19:38:00.000-07:00",
  "updated": "2010-10-14T16:47:49.342-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/5078665842/)Michelle Rowley is introducing \"Thunderdome\" -- Pythonistas are coming forward with lightning talks on various modules. At least the name sounds exciting. Abstract Syntax Trees... (ast).Jim is here, one of my clients. I'm counting 30 men here with Michelle, whom I identified to Jim as our fearless leader.ast is highly esoteric. It builds a syntax tree from Python expressions. We're looking at a module that parses PHP yet converts it to Python. Next we're learning about dis, also abstruse, from Chris McDonald. dis spits out the assembly language like byte codes for functions 'n stuff.Earlier today I did some light exercise by climbing Mt. Tabor (that might sound like a big deal, but Mt. Tabor is a local park surrounding a dormant volcano, like a butte). The next exercise was somewhat heavier: I pulled the Food Not Bombs bike trailer from a pickup siteAdam Lowry is lecturing on the operator module, tying it back to dis.The select module is \"used for I/O multiplexing\". Yikes.Regarding our 30:1 male:female ratio, I invited a gender specialist to join me (she was at the Mercy Corps meeting), maybe give me a read just for fun. One can't learn everything from just the one meeting of course. We could use more anthropologists and documentary movie makers in our midst ([what I came to at Djangocon](http://worldgame.blogspot.com/2010/09/djangocon-day-two.html), surrounded by so many \"pink ponies\").I'm having a lot of deja vu today, about a lot of things. We're also looking at __main__ and __builtin__.We adjourned for beers at Bailey's, where I enjoyed Hopworks ESB quite a bit (was on the bus, so didn't mind the extra pint).  I was honored the maintainer of [python-gmpy](http://code.google.com/p/gmpy/) was with us.[](http://www.flickr.com/photos/17157315@N00/5078666074/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}