{
  "id": "9025174734545062394",
  "title": "PPUG 2011.02.08",
  "published": "2011-02-09T11:59:00.000-08:00",
  "updated": "2011-04-11T16:21:54.432-07:00",
  "content": "Twas my distinct pleasure to introduce the chairman, Steve Holden, to a packed house at Urban Airship, PPUG's new meeting venue.  Adam Lowry was acting in the role of host, with Eric Holscher, another UA MVP, delivering the majority of the evening's content with a truly excellent presentation (more below).Steve is temporarily my house guest, like Lindsey but shorter term.  He's already found [a property to value](http://worldgame.blogspot.com/2011/02/wanderers-20110209.html) in 97214, making his new business (The Open Bastion) bi-coastal.  His other zip code is 11105.Other news:  upcoming conferences:  OSCON, Pycon, OS Bridge.  Talk proposals for this last one are still being accepted.Dan Colish gave a talk on [the ABC module](http://www.python.org/dev/peps/pep-3119/), containing Abstract Base Classes.  The name of this module may be construed as homage or at least a pun.  [Guido](http://en.wikipedia.org/wiki/Guido_van_Rossum) greatly appreciates his intellectual progenitors [at CWI](http://en.wikipedia.org/wiki/Centrum_Wiskunde_%26_Informatica), as I learned at [the EuroPython](http://worldgame.blogspot.com/2005/06/europython-2005.html) in [Gothenberg](http://worldgame.blogspot.com/2005/07/more-on-gothenberg_25.html).  Python-the-language [inherits from an older language](http://oreilly.com/news/languageposter_0504.html) named ABC.[Readthedocs](http://readthedocs.org/) is a free and open source community service, implemented in Django.  The project got started during a 48 hour dash (dart?), a longer version of the sprint. As a lightning talk is to a thunder talk, so is a sprint to a dash (\"thunder talk\" is not commonly so-defined as of this posting).Eric was a veritable font of information about what's cool and hard at work in web services:  [Gunicorn](http://davidpoblador.com/run-django-apps-using-gunicorn-and-nginx/), [Nginx](http://nginx.org/ru/), [Solr](http://lucene.apache.org/solr/), [Celery](http://celery.readthedocs.org/en/latest/index.html), [Haystack](http://haystacksearch.org/) and of course [Sphinx](http://sphinx.pocoo.org/), around which this django project is built.[Readthedocs](http://readthedocs.org/) can host your materials through a docs prefix in your existing registered domains, while also providing subdomain access within their rtfd namespace.  It supports themes, including an in-house theme that gives you a consistent user experience (ux).  \"Use a designer\" counseled Eric, sharing important insights he'd gleaned.I spent much of the pre-meeting chatting with Luke, following up on our conversation about computing in academia.  Back then, I'd been pondering PSU's situation ([Banner etc.](http://controlroom.blogspot.com/2010/08/more-musings.html)), before diving head first [into trucking](http://worldgame.blogspot.com/2010/08/pycon-tehran.html) for a spell.We adjourned to Bailey's Taproom ([see slides](http://www.flickr.com/photos/17157315@N00/5432321866/)) where much chatter occurred.  Jolly Michelle ran a tight meeting as usual, getting most of us to wear name tags (me included:  Kirby Urner it said).Fond greetings to all of you.  Yes, I said [Chipy](http://chipy.org/) was cooler, [in terms of e-lists](http://mail.python.org/pipermail/chicago/2011-January/007437.html), but that was more just to galvanize (goose, elicit) more self improvement activities.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}