{
  "id": "8951546936689284151",
  "title": "PPUG 2015.8.27",
  "published": "2015-08-27T15:42:00.000-07:00",
  "updated": "2015-09-02T16:54:59.813-07:00",
  "content": "Almost September of 2015.  I've not attended a Portland Python User's Group in awhile.  True, I show up on Meetup as a co-organizer, and I am on that listserv, but others have been far more active than I, who am more just a figurehead presence.\n\nI do have a lot of memories, of where we've met, where Urban Airship used to be.  The Fox Tower chapter, [Cubespace](http://coffeeshopsnet.blogspot.com/2009/03/serving-buzz.html)...  Portland has been friendly to Python for a long time.  We used to be \"[Poor Piggies](http://www.onlamp.com/pub/a/python/2001/11/15/pythonnews.html)\" as in \"Portland Python Interest Group\" but then rebranded to \"P-PUG\" which is more dog-like.\n\nIf a sponsor buys us pizza, they get to make a pitch or something like that.  We give companies a way to show their support in a public manner and to recruit and/or offer services at the same time, right when people are feeling good about how you're feeding the Python ecosystem.  Thanks to Rentrak in this case.  Great Hot Lips pizza, hard to beat.  I stopped at two slices [sic], knowing my proclivity to eat an infinite amount, especially when it's gratis.  I hoard calories, as if that made any sense.\n\nSpeaking of hoarding, I was enjoying my faster fiber optic connection today, downloading a large number of [OSCON 2015 videos](http://controlroom.blogspot.com/2015/08/oscon-followup.html).  Once on OB (OpenBastion) I can archive the media to one of the USB drives I have floating around.\n\nOf course coming here on a Thursday means I'm missing Thirsters.  That's a conversation I've been enjoying but I need to offset political chatter with software engineering, as a matter of diet.\n\nPaul is here with me, a co-worker.  We'll probably grab a couple brews after.  We're not serving any alcohol at the meetup, which is fine with me.  Those enjoying such beverages have plenty of options after it's over.\n\nWalking here from Stark and SW Sixth, about a half a mile, was a joy, as it took me through interesting intersections.  I found myself snapping those pictures.  At Pioneer Courthouse Square:  an Italian Cultural Festival.  Wow, to take over the downtown square:  that proves Italy has mega-clout in our CBD.\n\nHey, Patrick just showed up.  Party!\n\nRentrak is shifting from Perl to other dynamic languages.  They aggregate data from TV remotes through cable companies, giving more insights than the old way of doing it.  They're looking for engineers.\n\nRobert Dordier has been working on a computer algebra system named Maxima for Jupyter, the language-independent part of I-Python.  It's browser-embedded.  Maxima was started in 1968 as a LISP project.  The standard UI is ASCII-art console.  How might Jupyter make this better?\n\nZeroMQ provides the sockets from front and back ends in Dordier's solution.  The I-Python Kernel on the server talks to several front ends at once.  We're talking about a REPL based on LaTeX and SVG for output.  Pretty typeset math.   Main takeaway:  Jupyter may be customized.\n\nAmy Boyle presented a talk entitled Data Transformation Super Powers with Digital Signal Processing.  OSCON wanted the \"super powers\" to fit with this year's theme, where she originally gave this talk.\n\nShe took us through what it looks like to use NumPy to do Fast Fourier Analysis on audio through time, and then how to doctor images with PIL.  The Mathematica demos cover a lot of this same territory.  Both of these talks echo patterns in the Mathematica ecosystem.\n\nAs a grand finale she dove into JPEG, an algorithm not a format, created by the Joint Photographic Experts Group. I didn't know RGB was converted to YCbCr.  Amy's 'splainings were enlightening.\n\nI think we'll jump into Paul's rig and hit Lucky Lab on Hawthorne.  Perl Mongers meet there.  Paul, like Rentrak, is rooted in Perl, newer to Python.  These two subcultures like to cross-fertilize.  I often joke the Republic of Perl is so close to Pythonia that you can see \"Guido's house\" in the background (a windmill; he's Dutch; get it?).\n\n[](https://www.flickr.com/photos/kirbyurner/20753636219/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}