{
  "id": "5621113522375136050",
  "title": "PPUG 2014.9.24 / Ongoing Threads",
  "published": "2014-09-24T19:03:00.000-07:00",
  "updated": "2017-06-04T08:58:36.380-07:00",
  "content": "We're learning about how to use Django + Postgres to handle unstructured / schemaless data.  Clearly Postgres is an SQL engine, so this talk was about a kind of hybrid.  The searchable JSON field type is key, with binary JSON coming in version 9.4.  JSON is the de facto standard for web APIs.\n\nI was in a somewhat grumpy mood on the bus, as I knew we'd be having pizza, courtesy of Energy Builders, our job-seeking sponsor of the evening, along with Urban Airship.  The Division bus 4 was running a bit behind schedule, not unusual during rush hour.  Contributing to my grumpiness was my ongoing thread with GS Chandy on math-teach.  The discussion is moderated and sometimes I'll spend a lot of time on a post only to see it vanish into oblivion, or at least not make it to the official archives.\n\nWith django-pgjson added, you can query JSON fields, impose orders and filters and so forth.  Basically you're doing the kind of thing SQL does but within JSON fields inside Postgres.  Don't imagine Postgres is necessarily slower than Mongo.  This seems like a cutting edge talk.\n\nFrom my posting [to GSC](http://mathforum.org/kb/message.jspa?messageID=9604314):\n\nNational governments generally use schools to \ninstill nationalism, a form of patriotism.  This may mean familiarizing \nstudents with the roles and institutions available to them in civic \ngovernment, or perhaps it means exerting peer pressure to enlist in a \nmilitary service, provided that's a voluntary choice to begin with.  \n\nIn\n this model, schools are seen as extensions of recruiting offices by the\n military services.  That's another reason a Quaker family might \nhomeschool in a given zip code:  the programming at the local public \nschool comes across as too militaristic (e.g. mandatory ROTC for boys).\n\nLets start with a list of roles and then start looking at workflows.  \n\nRoles\n + Workflows is how to analyze a Quaker meeting as well (where \"Role\" \nmight be \"on a committee\" i.e. other objects need to be defined to give \nroles their sense -- but lets keep thinking in terms of theater and \nscripts).\n\n\"Role playing games\" tend to be \npopular among young people yet how much time do we spend on the \nmathematics of \"game theory\" (closely related or perhaps a part of GST, \nas you know).\n\nAlso:\n\nAs you may know, in our geographic region, school has been used as a tool of cultural genocide in that native populations were forced to surrender their young to boarding schools / indoctrination centers the purpose of which was to expunge the region of local cultures and replace them with a uniform Anglo-Euro veneer.  These boarding schools no longer exist as such, but their after-effects are still part of everyday experience in our region.\n\nOne purpose of these indoctrination camps or prisons was to make the \"nuclear family\" the only acceptable norm and to recast family relationships according to the \"white man\" model.  The imposition of alien marriage customs was part and parcel of this genocidal program, as memorialized at the cultural museum on the Warm Springs reservation.\n\n A nation such as India will go into a region such as Ladakh and apply western concepts of \"living standards\" e.g. cash income per annum, to determine the indigenous lifestyle \"poor\" as in \"under-developed\".  We're talking about a lifestyle that has evolved over millennia that includes a lot of hard manual labor, but then many adults with privileges and freedoms actively choose manual labor as a voluntary activity, so that in itself is not a sign of \"poverty\".\n\nWhat are the criteria of \"poverty\" anyway?  I'd say malnourishment is a sign of poverty and by that criterion the US population, in suffering from increasing obesity rates, is becoming increasingly impoverished over time.  It's not really about money as in some economies that commodity is not so much needed.  And yet the \"dollars per annum per household\" measure is still often quite mindlessly applied, as if money were the measure of all things.\n\n Some in my circle have been to Ladakh and we have actively discussed and been to events about whether \"schooling\" and \"westernization\" in general is helping improve living standards there, or whether it is actually having an overall negative impact in disrupting a 1000s-of-years old lifestyle by penning children into the \"Free and Compulsory\" new schools that India sees fit to provide.\n\nHere's [a blog post](http://worldgame.blogspot.com/2011/01/economics-of-happiness-movie-review.html) with Youtube on the topic.\nI managed to get plenty of pizza and am glad to have salvaged at least some of my prose. We talked some about [the ShellShock exploit / vulnerability](http://www.theregister.co.uk/2014/09/24/bash_shell_vuln/).  This was during our \"ask the audience\" session wherein people poll the audience.  Who's using Python 3.x?  Who's using Flask?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}