{
  "id": "3775890325820396762",
  "title": "PPUG 2008.11.11",
  "published": "2008-11-11T23:11:00.000-08:00",
  "updated": "2008-11-12T10:51:52.339-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjrutfB7Ivzm9wYq9limfWLkjkgGT2GiWnOkCRizfaoZ9WrhKjoAGPtgkzWi6wyIXPkWNC3LlVRjglsNirWqrd2B9i1M7Keljginnypny6ws3-4SUkj9bTMFQVQnHNwFsN5bvqb/s1600-h/Screenshot--home-kirby-tecc-hodgepodge.vZome.png):: this just in (from dk) ::Our first talk tonight is about coroutines in Python, which in our shoptalk involves using a generator's send method.A generator cycles around to a yield expression and waits, with a next or send triggering a next cycle.  Use send if you want to pass in some data.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgDYRd_IVPjeV-8zS9az1mYKUCIpKs2lMZ6TqYv7v4fTCFOjcTRByo9SVsyt5EO3Join67Slf0UnMRf2dPXxFOONdO3Lh7OZ_SZyHxhCmBElsjQMYRkPUymb6dc6PHMw1NyitWN/s1600-h/coroutine.png)So why is next, a builtin, [calling __next__](http://www.python.org/dev/peps/pep-3114/), but yet there's no send calling __send__?  I should Google up some discussions on that, as no doubt there are some.  What I'm thinking:  I don't think we'd want people overloading send, since it's so conceptually wired to yield, whereas __next__ (triggered by next) might be any useful idea of an iteration.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiVzgbrjJk4Tfd5FM5cxVAXU-_Mj7Xt_iqfiYSISWrnP80dt7Xs8alHPauHEyQ2PC4bdmpmpgDa8Bmrtr9GesTt-KPRoZjHLMLL27HhtkgxZQd6CjeEBUQuQqwDRS2ktasqDOOQ/s1600-h/duh.png)Next, a web form templating library, wtforms, allows macros, validators.  But there's something changed in the design since three weeks ago that leaves this geek thinking maybe stay away for now.Jason kicked off with some apologies for our lame swag, Argentina kicking our butts in the cool T-shirts department.  I asked about just importing theirs, which are open source anyhoo, really like their look.This other geek brought chantrelles, made some offers to share, got 'em on my radar, love those doodads. Others might beat me to 'em though, not that aggressive (or selfish, as the case may be -- got Buxton's already this year).Speaking of Jim Buxton, I'm missing Wanderers tonight, this monthly Python meeting helping with professional development in a very niche area, a kind of workout I don't get at Pauling House, no offense.Jason:  robocop and unicorn is \"a thing\" right now, what the hell?[Flatland](http://discorporate.us/projects/flatland/).  Looks pretty cool, Jason's invention.  Very schema-based, flexible, [works with JSON](http://www.json.org/) somehow.  Validation is agnostic as to where the data came from, maybe not a web form (maybe a database?).The presentation on [FormEncode](http://formencode.org/) (based on [CherryPy](http://www.cherrypy.org/)) is by a geek who just moved to Portland from Peoria.  We gave him a round of applause for stepping up to the plate on such short notice.Two types of form libraries (looking at a slide):  lightweight and heavyweight.  Validation will never be as sexy as [CouchDB](http://incubator.apache.org/couchdb/) or [JQuery-UI](http://ui.jquery.com/).  Hey, good to know what's sexy, eh?  Thanks guy.It's \"beer o'clock\"!  Produce Row.  I hung out with some Intel geeks, including [Matt McCredie](http://worldgame.blogspot.com/2007/10/ppug-cubespace.html), talking about how to make Windows screen savers as a classroom activity, also marketing e.g. for the Core i7 (formerly Nehelam), the new CPU chip, officially releasing in about five days.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjQgEtSPrqihfa9WbwzLXXlKWxodOG71h-GVxy5NAnI3fts1cfhA3z7YbHCTb6g17CNi15bYoZ4j_FXwORZIOFlzxlsD83Y4D6rmszs_4phIW-u656PtneHItSajz7Etstp1jIb/s1600-h/robo8.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}