{
  "id": "1401575913103078853",
  "title": "Presidential Circus (aka District Soap)",
  "published": "2023-03-05T10:40:00.005-08:00",
  "updated": "2023-03-05T11:06:02.111-08:00",
  "content": "I thought Marianne gave a fine performance in her \"grilling\" by Krystal and Kyle (they were open and friendly).  She reported having a thicker skin, which makes sense (this isn't her first rodeo), and radiated confidence regarding her ability to beat Biden.  \n\nI know, you're thinking \"who couldn't?\" but the barriers to entry are pretty secure.  Few of us get a pathway to \"post Camelot\" or whatever we're calling it (West Wing or like that).\n\nHowever, as I pointed out to another supporter, Oregonians registered as Independent are not invited to participate in DNC primaries.  Assuming she's in a contest with other Dems, I'm another guy in the bleachers, an NPC.  \n\nVoting is another spectator sport in this country, by design in many cases (computers get involved, in purging the registered-to-vote rolls especially, where too many people seem to have the same names).\n\nI was never allowed to vote for Bernie.  He never got that far in the contest.  The parties (those despicable parties) have it all sewn up.  So good luck anyone with talent (I think Marianne has some).\n\nMy thanks to Michael Goldberg (no, not the same MG for which the Goldbergs are named, another math teacher though), for pointing out the typo (Neolitic) in the M4W Digital Math poster (see previous blog post).  I'd included it in a Medium story that he'd read.\n\nThat got me to thinking of a \"mythic past\" i.e. we could occasionally fade out in our latest thinking about history, and switch to something Xnu (that's a pun on Gnu) i.e. something more obviously science fictional.  I'm leaving the door open.\n\nWe could call this made up past our Neolitic Era (an invented word).  In game land, we call these \"worlds\" as we do in fiction (J.R.R. Tolkien, Dickens) and in movie-making (Coen Brothers, Herzog), wherein even minor characters may be \"world building\".\n\nMartian Math could become \"Architectronics\" in some versions (I've always invited substitutions); a word I somewhat derived from the Ekistics crowd, back in the day.  I probably wrote it \"Ekistyx\" just to add a tad of Dark City spin (haven't seen it yet) -- you know how teenagers are sometimes: attracted by a Gothic aesthetic (although the river Styx is actually Greek).\n\nYou may wonder why I mix \"Made for TV\" language (\"District Soap\" in the title) with presidential politics (as produced by DC).  DC for District of Columbia, not DC Comix, rival of Marvel.  \n\nBecause presidential politics is a lot about television, obviously, but for other reasons too.\n\nYes, I am permitted by law to surrender my Independent status and re-register with the DNC if I want to play in their sandbox.  I get it.  But I don't want to make such a Faustian bargain with any of these war parties that run the District.  That's kind of the point.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}