{
  "id": "8418314248592448388",
  "title": "Prison State",
  "published": "2013-03-01T14:24:00.001-08:00",
  "updated": "2013-03-04T10:54:37.987-08:00",
  "content": "During the breakout session at the AFSC meeting, people dispersed to various rooms to learn about programs.  I went to the presentation on some of the prison work that goes on.\n\nThe US has an immature understanding of humans and likes to make everything a morality play with goodies and baddies.  A lot of this thinking was inherited from England, a likewise under-developed civilization of mediocre collective IQ.  Organized religion has a lot to do with it.\n\nThe US incarcerates a huge number of people, a growing profit center for many public and private organizations. \n\nPrisoners = free or almost free labor, and compared to the boredom of doing nothing much, many prisoners would prefer to be doing something skillful.  Making furniture is a chief activity.  The government itself thrives on slave labor in this way.\n\nCalling it \"slave labor\" is of course loaded.  The double standards involved warrant the term, some would say.\n\nIdentifying products suitable for boycott because made by prison labor was not a strategy suggested by staff.  Prisoners often prefer work to idleness and would be disappointed to lose their manufacturing jobs.  Not that they necessarily would, as the USG and state governments are a reliable customer.\n\nChinese consumers should educate themselves on what products for sale in China might be made by US prisoners.  Whether to boycott or not is an individual choice.\n\nI think school children, if sitting in desks made by prisoners, should be made aware of that fact.  The study of prisons and prison systems is a great 8th grade topic.  At Overseas School of Rome, we had Sociology as a subject in middle school.  Fred Craden was my teacher.  I don't think most US based schools offer sociology am I right?\n\nOur staff presenters were from New York and Michigan respectively.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}