{
  "id": "4220785685789329446",
  "title": "Programming for Everybody (P4E)",
  "published": "2007-07-26T20:40:00.000-07:00",
  "updated": "2010-10-11T19:59:51.851-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjQPM2sOyOlx7n9JmGrdWfoNS-ZYrDqmHzajTVVslMeKMgwzGGg4UYHZokAo9ooOzq7QCZK1MBHztEuE81gZiz5y19UXUfmBOy5eisq2IzvJox9cYxaaC39mKBBZHpF1gRNSGn4/s1600-h/church.jpg)I'm in this very high ceilinged venue, the [Oregon Convention Center](http://www.oregoncc.org/), listening to Guido outline his plan for transitioning to Python 3.0 via Python 2.6, a bridge version.  I like that he offers a strategy, not just the changes themselves.  He gives himself a responsible role, not too heavy, not too light.In that vein, I don't want to saddle him with a lot of Python in Education content he never signed his name to.  CP4E was his original abbreviation, used to secure some funding for IDLE.  Although I want to acknowledge the heritage, the influence, I'm not wanting to get him in trouble if I take a dead end path.  So I've doctored [the slides](http://www.4dsolutions.net/presentations/connectingthedots.pdf) to say P4E more frequently, dropping the C.  Plus I have [HP4E](http://worldgame.blogspot.com/2005/04/castaway-movie-allusion.html) to play with (these days, everyone thinks \"HP\" means \"Harry Potter\").That may not sound like much of a difference, but legalistic types don't need much of a difference, to see the difference, so I'm feeling good about this change.So I'm up next.  I published some notes just a couple hours ago, [to edu-sig](http://mail.python.org/pipermail/edu-sig/2007-July/008143.html), to help focus my mind, keep me on track.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhOf_gIrTHA1CSQLdugAeXlcilf419Vp5h2yVCROznU93gm1BniOA5pAVBxb6-MRcv5s1DLdAs0j6BCiyT1yy8XbYc-dkyRlH7SKLAKHuqBuGpWbk6l4DKmflHzBC-NfEaAeFvP/s1600-h/P7260188.JPG)Technical note:  [digitalspace.net](http://www.digitalspace.net/), the ISP behind [4dsolutions.net](http://www.4dsolutions.net/), was acquired by some new company.  The process of website conversion has apparently partly broken access to my site.  I've opened a trouble ticket.  If you can't access \"the slides\" (above), please be patient and try again soon.  [Embarrassing](http://mail.python.org/pipermail/edu-sig/2007-July/008144.html) to develop this glitch right when I'm making my work more public.I stayed late to hear Larry Wall's State of the Onion, right after a great auction (Perl people are so cute).He confirmed my impression that Ruby really owes more to Perl than Python.Most of his talk was about the different dimensions along which scripting languages vary, netting a big phase space.  And let's own \"scripting\" was his advice (Perl has no hope of shaking the label).  Don't fight it, just change its meaning if that's what you need to do.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgobHOjYL20HsVGxq0Vywy-Php86uQCvnm7mo9Pbfl9vn1nOdRrWfTK7Teu-AjzP6A8h-sQQAe_QuMKVOOVMREl2pN3PHTS3g_Rw5ZmaJ9HAP-fPr-J06pKR9AgQ-lWJv8eByed/s1600-h/perlbooks.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}