{
  "id": "746036333717908180",
  "title": "Projects and Complications",
  "published": "2017-04-05T21:53:00.001-07:00",
  "updated": "2017-04-06T09:21:06.724-07:00",
  "content": "The [Portland Peace Program](https://www.facebook.com/groups/831952306896128/) is ramping up around developments in Syria. Youtube is predictably skeptical that 2017 is super different from 2013. They showed Trump the DC version and he's rightly pissed. Hollywood is maybe not finished with its version. I know DC has dismissed Russia's take, of an exploded Jihadist munitions factory, but then here in Portland we routinely [dismiss DC](http://controlroom.blogspot.com/2013/08/city-of-morons.html).  So it's complicated.\n\nWhen at Princeton, I had Firestone library and world newspapers coming in every day, but hardly in real time. My access to information has improved considerably since the 1970s, as I hoped it would. As the idea of hypertext gained traction, thanks to Ted Nelson and his Computer Lib / Dream Machines (hearkening back to the MEMEX, which Ted knew about), and as CERN put real muscle behind the dream, the shape of things to come became clear.\n\n[In GM's heyday](http://controlroom.blogspot.com/2008/05/american-look-movie-review.html), they were introducing the Freeways of Tomorrow at World Expos. The age of the motor car, internal combustion, of abundant oil, was upon us.  In my generation, the \"information superhighway\" was the dream, freeways (the \"I-system\") now taken for granted.  Actually, with more roads than we can really afford to repave, \"taken for granted\" is by now an overstatement; those days are gone too.\n\nOn Facebook, I'm looking at China's plans for the Silk Road, an ancient set of overland routes connecting the Far East to points west, on into Europe.  Istanbul has been a gateway city in that regard.  I'm glad to see the [Trucker Exchange Program](http://controlroom.blogspot.com/2017/04/spring-appears.html) taking shape.  The [Chinese Peace Corps](http://controlroom.blogspot.com/2006/05/making-coffee.html) (akin to Capitalism's Invisible Army in serving to tell a story) is getting the job done.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}