{
  "id": "2954634781803179380",
  "title": "Public Assembly",
  "published": "2013-06-18T23:55:00.005-07:00",
  "updated": "2013-06-22T00:30:11.894-07:00",
  "content": "I was emphasizing in come recent AFSC communique, intra-committee, about [the importance of public restrooms](http://www.flickr.com/photos/afscportland/9096632775/):  \"I think the City of Portland spends irresponsibly little on maintaining park bathrooms.  This was my standard [at Occupy](http://mybizmo.blogspot.com/2011/11/endgame.html) also.\"\n\nI was also reminiscing about [Teresina Havens](http://mybizmo.blogspot.com/2008/07/together-friends.html) and her service in Tokyo or one of those as a latrine cleaner.  She was in training as a high level Buddhist and later came to Portland with her partner Joe Havens to start a study group.  My wife Dawn and I joined.  Her husband later started a group as well, dubbed \"Quaker Economics\" though it may have had a more formal name.\n\nWhen lots of people meet outdoors for a General Assembly that may take hours, there need to be facilities present.  Sometimes that means [Kybos](http://ragbrai.com/forums/topic/the-real-kybo/), for those familiar with an obscure reference.  Mobile units may be hauled away or deposited by truck.  However other solutions exist.  A museum exhibit specifically relating to municipal toilet facilities developed in the depression years, under FDR and Eleanor, would attract my attention, and I suggest the attention of many critics.\n\nIf your city has public parks with closed, run down, unmaintained public restroom facilities, then ask yourself where the money goes.  Don't your property taxes buy you public parks with facilities we might have pride in?  Perhaps an attendant or two needs to be present, rotating through other duties?  Park regulations should be respected, with all night campers only in the zones designated, with lit pathways to toilets, with sometimes subtle low-glow lighting.\n\nWhen I say rotating through other duties I'm talking maybe duty aboard a commercial jet liner, hosting hundreds in small quarters as honored guests of an airline.  Park duty in rotation, at cities visited, would further establish the customer service reputation of these hospitable elites.\n\nJoin a Food Not Bombs crew and see the inside of a new temple, meet religious people.  These friendships may endure.  Or perhaps your crew is home-bound from disaster relief service in the Caribbean, a big storm having left a path of destruction.  Some people specialize in being there when needed and we honor their service.  At Rose Parade, and Gay Pride too.\n\nI had dinner with a social worker this evening.  A lot of scared youth come to Portland because they feel rejected in their own neighborhoods.  The stigma of \"being gay\" or \"trans\" is enough to push people out of homes and into the streets, where social services have to pioneer a humane response.\n\nMy social worker friend is proudly and openly gay and suffers no loss of respect as a consequence.  But that such role models exist, though encouraging, does not provide any immediate solution for those drowning in the overwhelmingness of it all.  Some are pregnant.  Some are just being released from institutionalized care, perhaps because the insurance has run out and it is no longer profitable to test tomorrow's banned drugs on them.\n\nNot that all drugs should be banned.  Military units dispense all manner of psycho-actives per this Time magazine [cover story](http://worldgame.blogspot.com/2008/06/random-zine-covers.html).  In some lines of work, you're expected to be \"on\" something, usually coffee which is both legal and unregulated.  Sometimes something stronger.  Athena's oracles at Delphi had [their python vapors](http://www.theoi.com/Ther/DrakainaPython.html).  Some narratives say Apollo slew this \"dragon\" (a recurring meme), but I say the python escaped [to Nashville](http://coffeeshopsnet.blogspot.com/2009/06/greek-mythology.html) (TN).\n\nThe relative sanity of coffee shop world gives me some hope.  There's precedent for sharing controlled substances responsibly, taken to higher levels in some capitals.\n\nTrue, hippies flocked to Kathmandu and maybe made a negative impression in some cases. Drug abuse did occur.  They came from a culture of under-privileged, under-served by their cities (e.g. check the public restroom scene) and oppressed by their schools.\n\nThe social worker and I coincidentally wore matching jackets, somewhat business oriented but also causally \"night out\" in flavor (I wore a dark blue buttonless shirt with no tie or collar, subdued compared to her colorful and tasteful tattoos).\n\n Our venue was upscale Ethiopian, yet homey, not overly institutional.  Ethiopian restaurants tend to be like that, clearly family affairs, with you their guests.  I liked the sort of Southwest Airlines swagger, a joking informality, within a framework that's all business, in the sense of keeping things running smoothly. I paid with [Alaskan Airlines visa](http://worldgame.blogspot.com/2013/04/division-growth.html).\n\nSpeaking of keeping things running smoothly, I salute Saburo's Sushi House, where I went for the first time on a Father's Day, with Tara.  We dutifully waited in line like they say you usually have to, and lucked out getting in on a first serving.  We felt well served and privileged, plus the fare was fantastic, right down to the tea and miso.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}