{
  "id": "5481184964333942267",
  "title": "Pycon 2016",
  "published": "2016-05-30T14:12:00.002-07:00",
  "updated": "2024-12-21T13:34:03.787-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157669197221096)\n\nI'm feeling somewhat dense today, as in slow, relative to the various speakers I've been listening to.\n\nThe talk on the [basics of Git](http://rogerdudler.github.io/git-guide/) (which I use) went by too fast.  Writing an interpreter for PHP in RPython... amazing that any solitary Joe could take that on and get real results.  RPython is a reduced version of Python that's designed to run a lot faster.  PyPy is implemented in RPython, which latter has become more of it's own project than it used to be.\n\n[The morning keynote](https://youtu.be/ckW1xuGVpug?t=1752), presented by Dr. Lorena Barba, was philosophical in tone and felt more like a home base.  She was highly focused on the work of Fernando Flores and Terry Winograd as a context for how the Python community might carry the torch forward, in the education space especially.\n\nBring the language of open source, which includes workflows (like on Github), into the wider culture, which of course would include the business world.  Players make requests, commit, confirm delivery, register satisfaction -- or not, the flowchart varies.  Sometimes players renegotiate the terms of the agreement.\n\nThe [language-action perspective](https://en.wikipedia.org/wiki/Language/action_perspective) (LAP) would graph as an influence on [the Forum](http://controlroom.blogspot.com/2015/08/at-landmark-event.html) as well.  One of my house guests went through that program recently.  As an est grad, I was welcome to the Sunday wrap-up. \n\nErhard, the creator of est, worked [with Fernando Flores](http://www.fastcompany.com/36313/power-words) back in the early 1980s.  The Hermenet chapter.  I was following from a distance, from Jersey City.\n\nThe Forum is highly language-oriented.  What gets in the way of achieving desired results may well be a \"buggy grammar\", using \"grammar\" in the Wittgensteinian language-games sense.  Participants are challenged to be more reflective about their operating system.\n\nFernando was imprisoned for a period, after serving as Finance Minister of Chile when [a military coup](http://abcnews.go.com/International/story?id=82588) happened.  Barba is one of his long time students and fans.  I was glad to see these dots being connected, betwixt open source and an idealistic regime.\n\n[Ian Benson](http://tizard.stanford.edu/users/ianbenson/) was certainly into some of this same philosophy, with his Sociality initiative.  His project was not focused on any particular device, challenging the PSF to find a specifically Pythonic angle.  I see he's made progress with the Cuisenaire rods.\n\nFollowup:\n[Pycon 2016 Concludes](http://worldgame.blogspot.com/2016/06/pycon-2016-concludes.html)\n[EduSummit / Pycon 2016](http://worldgame.blogspot.com/2016/05/edusummit-pycon-2016.html)\n[Ergonomics](http://mybizmo.blogspot.com/2016/06/ergonomics.html)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}