{
  "id": "2252868522449898414",
  "title": "Pycon Lightning Talks",
  "published": "2009-03-27T07:39:00.001-07:00",
  "updated": "2009-04-06T18:14:08.008-07:00",
  "content": "Hbase vs. Voldemort vs. CouchDB.  But now:  Cassandra -- out of the Facebook community.  Another entry in the non-relational database world.  Must follow-up.How to give a Lightning Talk is a lightning talk.  We take the 5 minute limit pretty seriously, although you're free to use less time.  Have the next speaker setting up if you're lucky enough to have switchable podia.Git is out as Python.org's version control manager.  So Bazaar or Mercurial?[John Hawyard](http://jonathanscorner.com/) is talking up science.  \"That's funny\", not \"Eureka!\" is the epiphany in science.  The discovery of X-rays is the story he told.  He's talking about bugs, the really hard ones, reminds me of [The Bug](http://www.amazon.com/Bug-Ellen-Ullman/dp/1400032350/ref=sr_1_1?ie=UTF8&s=books&qid=1239066783&sr=8-1) by Ellen Ullman.  Science and debugging have a lot in common (is that why it's called \"computer science\").  This is a talk on chance and serendipity.  Knowing what you're talking about and stopping when you trip on something, is the way to find the bug you were not looking for (surprise).  Interesting humanities-tradition talk.  This is one those deep thinkers he myPsycopgwrapper:  Sean Reifscheider polishing the DB API (for PosgreSQL).[Ian Benson](http://en.wikipedia.org/wiki/Churchill_College_Junior_Common_Room) is now up in front,  [waving The Guardian](http://www.flickr.com/photos/17157315@N00/3389564389/) (\"twitters and blogs\"), thanking everyone who has helped with the rapid progress of AlgebraFirst since this same conference last year.  He only took 2.5 minutes, well demonstrating his Python cultural savvy (another deep thinker in my workshop).We [leafleted all the chairs](http://www.flickr.com/photos/17157315@N00/3390370674/in/photostream/) last night, like a thousand, shades of [CN logistics](http://worldgame.blogspot.com/2008/12/coffee-shops-network.html) (I used to be a super).Later lightning talks:  Brazil is a hotbed of Pythoneers, with the government running several Plone sites.  Alexander Limi and Alan Runyan, also Bruce Eckel, have been among the invited international speakers.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}