{
  "id": "7202297361393669735",
  "title": "Pycon 2013",
  "published": "2013-03-14T14:27:00.001-07:00",
  "updated": "2023-07-04T04:51:45.355-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157632999873623)\n\n:: from Portland to Pycon ::\n\nI dipped into basket case status getting here, having sent the Razr M through the wash (insured, a $99 deductible / slap).  On top of that, I miscalculated the [Max time](http://www.flickr.com/photos/kirbyurner/3952888578/) and stood in the wrong line at Alaska.\n\nIf I'd gone to a kiosk (no line) and paid for one bag, then I could have jumped to the front in pre-paid bag.  Not knowing that, or figuring it out, I queued behind the languid folks for Hawaii, getting my hit of adrenaline (clock ticking).\n\nDo I live longer for these steroidal moments, brought on by attacks of stupidity?  We shall see.\n\nWhat to do with the extra time?  Beaches.  Happy Hour.  Just snacks, beers.\n\nThe day before I ate a lot, both literally and metaphorically, in a busy engaging day.  Sam is cutting ties with Flextegrity, setting it more adrift, so Trevor and I descended, like vultures.  Sam was liberally sharing, letting go of a certain bicycle parked for three years.\n\nWe visited his storage unit.\n\nThe exercise felt Food Not Bombs like, rescuing soon-to-be compost.  Apropos of that, Adam phoned mid-exercise, needing [the meetinghouse key](http://worldgame.blogspot.com/2011/09/quaker-doings.html) for FNB work.\n\nSpeaking of storage units, Trevor showed Sam and I to a \nsecret location (cinematic) where he's stashed more tons of \nFuller-related material, with many thanks to [Joe Moore](http://www.buckminster.info/).\n\nSome of Dawn's closest friends and I walked the labyrinth at Unity, joining [in her memory](http://worldgame.blogspot.com/2008/03/celebrating-dawn.html).  Alexia is house sitting in a neighboring state.\n\nThen came a meetup and catching up with an FNB friend, followed by Wanderers.\n\nThe next day was my flight on Alaska.  Getting some last minute Alpo for Sarah contributed to my lateness.\n\nThe consequences of missing my plane were not that great in this case.  Having WiFi at PDX let me keep working pretty much the whole time.\n\n[Holden](http://holdenweb.com/) had flown down the day before.  I found him with Brian Curtin, [Jack Diederich](http://jackdied.blogspot.com/), other luminaries, having beers in the lobby.\n\nWe hobnobbed for awhile.  Brian has been working with our Code of Conduct, applicable at Pycons.  Did the [Ukraine PyCon](http://ua.pycon.org/) of 2012 really attract 4K attenders?  Some of us were skeptical.\n\nThe talk on abolishing the traditional 9-12 high school structure, didn't make the cut unfortunately.  [My lightning talk](http://worldgame.blogspot.com/2013/03/pycon-2013-begins.html) did make the cut:  Python for Adults.  [Maria Litvin](http://www.skylit.com/mathandpython.html) is here, has participated on one of the panels.  This was our first [Education Summit](http://mail.python.org/pipermail/edu-sig/2013-March/010799.html).\n\nLots of interesting people.  I finally got to meet Michel Paul (picture below), with whom I've been conversing [on edu-sig](http://mail.python.org/pipermail/edu-sig/2013-March/010803.html) for quite awhile.\n\nOur keynote speaker was Walter Bender, founder of [SugarLabs](http://sugarlabs.org/), which produces [free software](http://wiki.sugarlabs.org/go/Activities/Turtle_Art) for the One Laptop per Child program's flagship computer, the XO.  Walter knows [Ed Cherlin](http://www.mail-archive.com/fourthgrademath@lists.sugarlabs.org/msg00116.html) obviously.\n\n[Henrique](http://mybizmo.blogspot.com/2011/07/oscon-2011-continues.html) was here with at least seven others from Brazil (Steve thinks more like fifteen, which he's happy about, his trip to Brazil a career capper as PSF chairman in some ways -- Van is doing that job now).\n\nPython is gathering momentum in South America, as evidenced by the increasing number of Pycons.  Argentina, Paraguay, Uruguay, Ecuador, Brazil and Venezuela all have active Python users.\n\n[](https://www.flickr.com/photos/kirbyurner/8557419293/in/album-72157632999873623/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}