{
  "id": "8965557458922023121",
  "title": "Pyramid in the Sky",
  "published": "2021-01-03T18:12:00.004-08:00",
  "updated": "2021-01-03T18:13:06.397-08:00",
  "content": "Constructing a health care infrastructure that's based on single payer (for what, citizens?) is going to be a huge undertaking, requiring algorithms and computer science beyond the knowledge of current legislators. If they felt they had the money, they might opt for experiments. Expand the care given to veterans for example. Start there? It's like asking people who've never built a pyramid to suddenly build one. We do private insurance. We barely do public health. We haven't solved the citizenship puzzle.If Congress waved a magic wand and allocated a trillion for M4All what would happen? Everyone would scurry to build the pyramid they don't know how to build? No, the illusion would be broken. The idea that money combined with laws actually drive outcomes (like magic!) would pop like a soap bubble on a warm day. Congress needs to preserve the illusion of power. Approving pipe dreams no one knows how to put into practice is not the way to fool most of the people most of the time. Wars on the other hand... Congress knows it can fund nightmares and make those happen. It's the good happy stuff people don't know how to do. No one taught them.\"Well.... I mean no offense... but the Italians managed it.\"Yes, but they started decades ago. Italians are Social Democrats and like that. Like in that Michael Moore film about who to invade next: a lot of Euro countries thought they were imitating the American Dream, only to find out later the Americans weren't really serious about it. Americans chose to be Team America World Police (South Park Studios). We could have been a health care destination place, or a theme park capital, or... so many choices. But we had the war machine and knew how to crank the handle. So now we're decades behind even China, when it comes to caring for our own people. It's humiliating. We hope they notice our fancy weapons instead, as that's where the ego is. Others may have healthcare, but we have more nukes than all of them combined. So there.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}