{
  "id": "3093664738370151",
  "title": "Python Versus Python",
  "published": "2016-02-23T20:16:00.003-08:00",
  "updated": "2020-12-04T21:07:04.958-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157664995388486)\n\nPatrick's family is the proud owner of a python, named Maya (ours is named Barry), which on occasion has escaped, sometimes thanks to owner carelessness (it happens).\n\nFinding a missing python in one's house is no easy proposition, and Patrick was on the Internet in a hurry, the first time it happened, seeking advice.\n\nHis search terms dredged up some savvy answers, like place tin foil strategically, sit quietly in an easy chair, and listen intently.\n\nHis search terms also took him to pages about the scene in the Florida Everglades, where raccoon, opossum, bobcat and deer populations have plunged dramatically, whereas [the python population](https://www.quora.com/Snakes/Does-the-Burmese-Python-have-any-natural-predators-anywhere) has been exploding.  Is there a correlation?\n\nHow did pythons come to invade Florida? The pet industry moves [exotic animals](http://www.bornfreeusa.org/facts.php?p=187&more=1) around the world, and these tend to escape, and find each other  If the surrounding ecosystem is congenial, the species becomes established.\n\nPatrick used to work at a national lab (Sandia) and is a trained problem solver.  When BP accidentally uncorked an oil well in the Gulf, Patrick was right away building [prototype solutions](http://controlroom.blogspot.com/2010/05/empirical-studies.html) in his backyard, ready to jump in and help if he could.\n\nPythons are difficult to find.  They're camouflaged and excellent hiders  They're cold blooded, so drones using infrared are not likely to pick them up.\n\nEmpirical experiments, which Patrick shared, suggest people do not find pythons in the wild efficiently.  They're not a great food given the mercury levels.   There's not much motivation to slog through the Everglades looking for hard-to-find snakes.\n\nFlorida's wild life managers have been [casting about](http://worldgame.blogspot.com/2008/03/ban-constrictors.html) for more ideas about how to manage the python population.  Patrick has been developing a solution:  a new model of snake trap.  He's studied the existing 12 patents for snake traps, which are mostly indiscriminate in what they trap.\n\nJohn Humphrey's large reptile trap ([US8407931](http://www.google.com/patents/US8407931)) is discriminant for large, heavy animals.  I have something similar (not as long) that I got at a garage sale, thinking to \"have a heart\" vis-a-vis the attic squirrels.\n\nPatrick wants to bring affordable AI into the equations, building a better snake trap that could provide (1) unattended mode for months (b) discriminate to catch only pythons (c) allow remote human intervention (d) provide a means of doing population research in the wild.\n\nThe trap is both tubular and modular, with a catcher up front and an attractant at the back, i.e. bait.  Patrick is looking at various urine scents, dispensed freshly.\n\nThe Python computer language is a strong player when it comes to image \nanalysis tools and Patrick's algorithms figure out, from a snapshot in \nthe \"boudoir\" module, whether the trapped animal is indeed a python or not.\n\nThose administering the trap will decide if it's a death trap.  Rather than have the python stuck in the trap, decaying, a poison that doesn't have aftereffects, [such as Warfarin](https://en.wikipedia.org/wiki/Warfarin) (used on rats), might do the job.  After a quick injection, the python is free to leave.\n\nKeeping the apparatus powered is a challenge in itself.  The Raspberry Pi, an off the shelf computer, is too power hungry to keep on around the clock.  An Arduino board, far lower in power consumption, is triggered by the capturing module to boot the Pi, so the photo-identification phase may occur.\n\nA communications grid is contemplated:  the traps relay information back to headquarters by means of an ad hoc mesh network, [using B.A.T.M.A.N](https://www.open-mesh.org/projects/open-mesh/wiki) for example.\n\nPatrick's research continues.  He has a provisional patent and prototyped components.  He's hoping to test and refine his device in Gainsville, Florida.  He's in communication with the wild life managers.\n\nWe had a lively Q&A session.  Glenn wondered about the applicability to [CRISPR technology](https://en.wikipedia.org/wiki/CRISPR) to the python problem, a genetic engineering approach that was the focus of the most recent ISEPP lecture, which I missed. Or how about [a TNR program](http://www.alleycat.org/casefortnr) for pythons?\n\n[](https://www.flickr.com/photos/kirbyurner/3441042342/in/photolist-JotGm-88zTxe-7YZyV9-7VL8Jp-7jmdc3-74eYBc-6YjmKA-6WN5vV-6VMULj-6RHvR1-6RDrSn-6MSrNZ-6BzqRn-6zsuZG-6vrBGY-6oqhZw-6kGm92-6ihQkk-6huZxk-6f5f1f-6f158x-6bjahs-6bf4dP-6aGArY-6aAzP1-6aAA4L-6aaRf8-69nhsX-68MkUJ-67azJt-673oPb-66Y9EF-66H4XY-5Y4G7S-5Y5tMo-5UUxHh-5TXt6p-5SoDdA-5QZrB2-5JqPnB-5JqvgV-5GV92q-5z8xTe-5zcNW5-54jxvj-2ypu4p-2ypGPB-Joy8X-JotCu-9rQ3QP)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}