{
  "id": "6184456992992796164",
  "title": "Quadrays as API to XYZ Vectors",
  "published": "2021-10-08T19:18:00.003-07:00",
  "updated": "2021-10-10T13:27:35.625-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/51566814541/in/dateposted-public/)\n\nWe learned the language game of XYZ vectors from Hermann Grassmann, William Rowan Hamilton, Josiah Willard Gibbs and Oliver Heaviside. \n\nClifford Algebra branches from Grassmann's Universal Algebra, steers around Quaternions (Hamilton), seeking a bigger slice of the physics pie (Hestenes) perhaps deservedly, because it does more with less.\n\nQuadrays were not my invention. I thought I was getting them from one David Chako (who favored \"tet-rays\") and I was happy to call them Chakovian Coordinates as a synonym, as that sounds like something Borges might uncover, in one of his scholarly detective-like deep-dives into glass bead game arcana.  \n\nNot that Magister Ludi (Hesse) was by Borges, just they have much in common.  Wikipedia traces the lineage yet further back, to other great minds, thinking alike.\n\nQuadrays may or may not come with an overlay wherein the tetrahedron they define has an unconventional -- from an XYZ standpoint -- unit volume. To have this feature is to sync the Quadrays home base tetrahedron with the IVM of Buckminster Fuller, or \"octet-truss\" to pick a patented architectural version thereof, or \"kite\" to go with A.G. Bell.  \n\nFour of them (1, 0, 0, 0), (0, 1, 0, 0), (0, 0, 1, 0) and (0, 0, 0, 1) serve as basis rays to the four corners of a regular tetrahedron (of edges one?) from the origin at (0, 0, 0, 0).\n\nI use quadrays to develop a CCP (close cubic packing), as {2, 1, 1, 0}, meaning all 12 unique permutations of those quadray coordinates, point to the 12-around-1 ball centers surrounding a unit-radius ball center.\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiwQTDk4ZIB76twiq9mo3r8XB59jdP7ekRvSXUp5DB-KLRLyH-kjqKsXvrq980TXL3aZPqe4uzAP1l8VlpyxOn32f2nAUi478cdoqXuiK-oVBZv2kYoIcdLzqRDdZD2CRhIAdsR/s400/Quadray.gif)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}