{
  "id": "8819106773552547288",
  "title": "Quadrays Again",
  "published": "2018-04-27T09:17:00.001-07:00",
  "updated": "2018-04-27T19:05:26.881-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/23235498531/in/photolist-EhaxK2-Bpf1cD-JotMo)\n\nA vector field has group properties in that every vector has an inverse vector, the sum of which gives the zero vector, the identity element of the set.  The XYZ basis vector (1,0,0) has inverse (-1,0,0) and their sum is (0,0,0).\n\nIndeed, without the inverse operation, or multiplication by -1, the original three basis vectors, i, j, k, would be helpless to reach 7/8ths of space.  Remember i,j,k define the edges of what looks to be the corner of a cube, or perhaps 1/8th of an octahedron.\n\nIf you are not allowed to rotate or invert these vectors, only scale them in the direction they're already pointing, then vector addition is confined to the positive octant, 1/8th of the total space.\n\nIn the quadray coordinate system, the four basis vectors, as we call them, are sufficient to span space without recourse to negation.  The concept of \"linear independence\" is recast.\n\nIn XYZ, inverting a vector is not considered a separate operation from scaling it.  Growing or shrinking a vector in the direction it's already pointing is no different from making it point in the opposite direction.  However, vector reversal, synonymous with vector negation, might be considered a form of rotation, a different operation from positive scaling.\n\nQuadray basis vectors may be inverted, but only positive scaling is required to map all points (to span the space).\n\nFor example, in canonical form, the inverse of (1,0,0,0) is (0,1,1,1), the sum of (0,1,0,0), (0,0,1,0) and (0,0,0,1).  These point oppositely, and the group property still pertains in that (1,0,0,0) + (0,1,1,1) = (1,1,1,1) which in canonical form is (0,0,0,0).\n\nIt's not that quadrays are devoid of inverse vectors, only that \"inverting\" is unnecessary to reach 7/8ths of space.  The four basis vectors define four quadrants.  Any point is in one of those quadrants, or in a plane bordering any two.  At most, three basis vectors need to be positively scaled to reach any point through addition. \n\n{0, a, b, c} -- where { } means \"any permutation of\" -- with a, b, c also greater or equal to zero, is the canonical address of any point.  For example {2, 1, 1, 0} form the twelve corners of the cuboctahedron.\n\nIf the i,j,k basis vectors of XYZ were supplemented with one additional vector pointing into the void opposite the first octant, the resulting apparatus would look a lot like quadrays, sometimes known as IVM coordinates.  Adjusting the central angles for symmetry, making them all the same, would complete the transformation.\n\nWhat is the practical value of quadrays?  Clearly there's a one-to-one mapping from the canonical representation (unique to each point) to the corresponding XYZ vector.  As with spherical coordinates (r, alpha, theta), we have a redundant addressing notation.  How could this be useful?\n\nAt this juncture, I'm thinking \"comparing and contrasting\" helps highlight core concepts.  In setting \"caltrop coordinates\" next to \"jack coordinates\" (XYZ), we're setting the stage to talk turkey, to develop fluency with the concepts, such as \"space spanning\" and \"inverting\".  Quadrays contribute to student understanding of the shoptalk.\n\nSince the concepts of vector addition and vector negation are essentially the same in both systems, we have as much to compare as to contrast.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}