{
  "id": "8881702722277975953",
  "title": "Quaker Alchemy",
  "published": "2019-09-16T19:22:00.003-07:00",
  "updated": "2019-09-16T20:44:20.046-07:00",
  "content": "Yes, of course I'm watching to see if humans escalate the direness of their situation, by continuing to attack themselves.  In the Gnostic tradition, a lesser god makes a boo boo, and we're it.\n\nMore seriously, there's a chaos factor in play, wherein everyone tries to spin things their way, regardless of what might eventually emerge as the facts of the matter.  Extended forensic analysis is supposedly underway, regarding the origins of these latest attacks on Aramco.\n\nThe oil wars have been going on a long time, back burner for some, life destroying for many others.\n\nThe only weapons that matter are psychological, and the best ones of all have a healing purpose.\n\nSo how are they weapons then, if their intent is to heal?\n\nAnything that presents itself as an obstacle to the will or agenda of some agent or actor in an altercation, is likely to be considered a weapon and/or \"weaponized\" (as we say today), even if it's rhetorical in nature.\n\nPut another way, if the agenda is outward war (hot), then those aiming to keep it inward (cold) might be considered weapons-wielding, even if their instruments are metaphysical (psychological).\n\nWomen healers were accused of witchcraft, for undermining the authority of those with \"authorized\" status (high priests, church-ordained).  The old folkways would be stamped out, if at all possible.\n\nPhysical weapons matter in their physical plane, of blood and guts, bones and muscle.  Human bodies may die in this space, but not so much ideologies.  \"You can't kill the devil with a gun or a sword\" say the Quakers, paraphrasing their founder George Fox.\n\nHowever that's not a level at which the most sense gets made. War that holds meaning -- if that's not an oxymoron -- has a psychological side.\n\nTransmuting war from the meaningless physical to a more meaningful level, might be considered both a calling and a skill.  Quaker alchemy?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}