{
  "id": "826997667790717900",
  "title": "Quakers in Business",
  "published": "2013-10-27T08:41:00.001-07:00",
  "updated": "2013-10-27T20:30:41.899-07:00",
  "content": "[](http://www.flickr.com/photos/kirbyurner/10519870923/)\n\n:: mongo DB ::\n\nQuakers started out as a highly persecuted minority but, once they had passed various integrity tests, they became a valuable asset to England's business community.  Their reputation for honesty and plain speech made them [the logical ones](http://mybizmo.blogspot.com/2008/07/some-quaker-pr.html) to have talks with the \"Indians\" (English had Indians on both sides) and then, once trust was established, violate it, an old pattern.\n\nQuakers began to feel used in this arrangement, as good will builders, only to see their investments go up in smoke.  They [had their turn](http://worldgame.blogspot.com/2009/09/catholic-analysis.html) to run a utopia in Pennsylvania but that soon gave ways to Indian Wars, Ethnic Cleansing, Forced Migrations and so on and on, not fun at all.  They'd seen slavery up close in Barbados, and unlike King George III or was it IV, did not see much future in it.  Philadelphia was to be a bastion of freedom.  DC got the swamp.\n\nFast forward and you have a global network of Friends, not unlike other denominations and sects for their networks, with little campuses here and there.  It's corporation-like. Quakers helped pioneer a lot of the business practices we take for granted today and you'll find them still practiced in Quaker business meetings today.  Agendas go out ahead of time, minutes are taken and taken up at next meeting, where amendments may be made.  There's a constant effort towards leaving a clear written record of every meeting.\n\nHow do such practices carry into the future?  To some extent the written word forms a happy medium, in that we're able to have our Skype sessions and hang out on Google, but not bother with a recording, as minute-taking is still the succinct brief we will take with us, along with augmented memories for ourselves.\n\nPractices need not change all that much, in other words.  The need to have every meeting video recorded and archived is not usually felt to be pressing.  On the other hand, living simply does have its advantages when everyone is potentially carrying a recording device and all phone conversations are retrievable.  If you have too many non-matching stories or \"sets of books\" then the pressure to implode is somewhat exponential in the digital age.\n\nMy expectation is that people will keep the Quaker ways alive in a sandbox or virtual space (called \"religion\"), there to continue fine tuning a kind of utopian business community that self administers and self heals.\n\nSkills acquired practicing Quakerism will inform one's own private businesses thereby.  For example today I plan to reach meeting in time to transact business [around coffee](http://coffeeshopsnet.blogspot.com/2013/10/october-club-feature.html).  We have a supplier in Central America, as have we Friends.  The global network keeps talking to itself, including to its Beanites (that's a pun on our propensity to consume coffee, and the name of [a founding family](http://worldgame.blogspot.com/2013/09/quoting-from-facebook.html) in our branches).\n\nSpeaking of Quakers and caffeine, on learning of \"[Mormon Tea](http://en.wikipedia.org/wiki/Ephedra)\" I was suggesting the Mormon authorities approach such a brand and allow its merchandizing.  Typical of a Quaker to think in that way.  Have little teabags and everything, some semi-fictive [Santa Claus background](http://mybizmo.blogspot.com/2009/08/before-prohibition.html) (not my place to make it up).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}