{
  "id": "113761453974154582",
  "title": "Quality Time with Wanderers",
  "published": "2006-01-18T12:33:00.000-08:00",
  "updated": "2006-11-15T11:44:12.247-08:00",
  "content": "Allen Taylor addressed Wanderers today, on the topic of large scale networks, the Internet in particular, about which he is writing a dissertation.  His offer to write another edition of SQL for Dummies was recently accepted, other deals are in the offing.  The guy stays busy, as does the rest of his talented family.One upshot of this meeting:  academics writing about the Internet and its networks should be clear about the distinction between the hyperlink topology and the physical topology.  These are somewhat unrelated.  Having a popular web page that a lot of people go to, seemingly more every day, is a more fluid kind of happening than swapping in a new switch, or having to set out in some [fancy satellite-monitored ship](http://www.lr.org/news/press_releases/2001/pr0801_at_guardian.htm), to fix a break in some cable (which sharks have been known to chew through). Allen is of course completely clear about this difference.I was happy [Julian](http://mitpress2.mit.edu/e-journals/Leonardo/rolodex/voss-andreae.julian.html) could come by.  We decided to take the Xmas lights off his statue outside, which prompted a couple [Celilo Group](http://www.celilo.net/) staffers to come out and inquire about our doings:  they own the lights, the sculpture is in their patch.We reassured them we were just trying to make things easier for Terry, reducing the tackiness factor (Xmas lights are long out of season by now, and all that wiring spoils a [handsome red molecule](http://www.julianvossandreae.com/Work/SlideShowGallery/Seiten/01-pauling.htm) in daylight) -- I said this while leaning on a railing, which started to give way (\"please accept my apologies for destroying your building -- I love the Chinook Book\").Then Julian came by my place to look at geometry puzzles and my Barrel Tower again (a gift from the sculptor).  Julian was privileged to meet with [Ken](http://kennethsnelson.net/) in his SoHo studio in 2005.[Dave Fabik](http://worldgame.blogspot.com/2005/01/national-treasure-movie-review.html) also joined us this morning, our token Quaker with helicopter gunship experience.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}