{
  "id": "581583845666670508",
  "title": "Quarterly Meeting (WQM Fall 2007)",
  "published": "2007-10-07T15:43:00.000-07:00",
  "updated": "2008-11-15T02:36:26.052-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjXeyhqHvyIPQvzMgFawhlifega-g4eDAn1k6LuNtbeU0bMQsdYX1r-g4XvdKQZWpjdDZu1GlMD3yivcJiQxrihqAvi6Iqjy1hI4t4bFUMLw0_SbRfKqLY6wjxjOFN1-WJ4L1QO/s1600-h/PA060011.JPG)I found this to be an unusually productive session.[MMM](http://worldgame.blogspot.com/2005/10/wqm-fall-2005.html) purchased a new computer projector, and shared it with Junior Friends, who were still high from their recent trip to Mexico, an eye opening growth experience for all concerned.Jim Flory was approved to oversee the new web site.Best of all was the discussion outside of Fanning, among some experienced nurses and attorneys, plus myself, regarding patient right of access to personal medical records i.e. to one's own about one's self.I took the position of having automatic right of access, even if the medical language were quasi-indecipherable to a geek like me.Even today, in some hospitals, employees just have to sign a form to gain unrestricted access to their own charts and files.Others countered that patient exposure to unintelligible verbiage might encourage god playing (i.e. playing doctor), leading to bad decisions and a deteriorating medical condition, with the hospital made liable as a consequence.The compromise seemed to be:  feel free to access your own medical records, but don't think that entitles you to hold others accountable for what you do (or don't do) with that information (click here to accept and gain access).On the winter camping front (I'd set up in a tent to practice my own spiritual discipline), I learned there's a reason they call it a mummy bag, and no, using it as a blanket is not guaranteed to produce a similar degree of cozy warmness.  As it was, both nights were pretty cold, but with the second a lot warmer than the first.Aimée said she has just the fire-starting system for winter campers, describing both the artifact and its manufacture (something about egg cartons and candle wax).  She, Aimée of Multnomah, and Pan of Wolf Creek were then more formally introduced by me, Kirby of Bridge City, and a long time friend of both stellar women.And speaking of stellar women, Bonnie Tinker and I spent quite a bit of time together, in spirited conversation and worship.  Whereas we may not share strategies or see eye to eye on every issue, we have a lot of the same deeply held Quaker values.The queries used to guide worship traced to [FWCC's](http://worldgame.blogspot.com/2006/04/london-knowledge-lab.html) recent work to bring Quakers into sharper focus around the world.  I was happy to see Doreen O'Dowd's name in the literature, our flying doctor friend in Lesotho and member of Ireland Yearly Meeting.Tara, in Central Friends, enjoyed hiking again with Chris and Luci, plus doing the Adventure Course, an old favorite at this Mt. Hood area Kiwanis Camp.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi31ZOt_kiinI2PA9GvHW5YH2qDkj_LjWNcCAmRxMQNzjNIOrpHE9V-PO_zXWuYbtfYPCWPWMK5In-xnOiqXHowCqzTh3XpoDVSVjtMHGkp9ymia12aummggzUZd9un2lPQwMtO/s1600-h/ropescourse2.jpg)[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiNe_Z-1HoKBuYDeA8-ulq6SLt7w_uSR7aY8ZxXo_-u6Qo0rdo5JPAeCCJ-lenBxqvx7gF77BH8NygjBgsPMdYzWgvlpfKFmQeWVYHOIHPlWlgD1uDDWJIM2r4ZUXxFWZ0EgphN/s1600-h/ropescourse.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}