{
  "id": "6047966194106668977",
  "title": "Question Authority (School of Tomorrow)",
  "published": "2023-04-28T04:04:00.010-07:00",
  "updated": "2023-04-29T07:05:06.592-07:00",
  "content": "Speaking of stereotypes, by the early to mid 1900s, if you wanted acceptance regarding matters STEM (Science Technology Engineering and Mathematics), it really helped to have Einstein's blessing. \n\nFrom that time onward, some kids felt parental pressure to \"be the next Einstein\" (and make mommy proud) and that meant chipping away at quantum mechanics, even though QM was not Albert's forte.  QM was sexier than \"nuclear physics\" (same thing), which earned itself a reputation associated with WMDs or WMSs (weapons of mass suicide).  How The Hippies Saved Physics is the book to read, along with Alec's new bio of Bucky Fuller.\n\nFuller was writing Nine Chains to the Moon (prefiguring space elevators and better satellite service) in an effort to educate humanity about its prospects.  He was not one to make a big secret of pending innovations, especially if these were positive, as humans needed some cheering news.  Economics had been so dismal, so doomy-gloomy.  Why couldn't we have some more positive science fiction?  But the publishing industry was getting push back.  \"But Fuller is not the next Einstein\" the control freaks railed.\n\nFuller's solution was pretty brilliant; he made friends with Einstein and scored a personal interview, after which Einstein could be counted on to stay in Bucky's corner, defending his right to share STEM stuff.  \n\nThe latter kept a kind of particle physics going, along with a model for combinatorics, and even named the E module after the guy.  Synergetics comes with BEAST modules.  E is for Einstein.\n\nWhat I argue in the above video is that Fuller was a registered skeptic when it came to little stuff \"explaining\" big stuff, in the sense of \"determining\" or \"nailing down\".  \n\nThe chemical properties of the elements, in compounding, exceed the powers of QM to explain, just as biology outpaces chemistry i.e. we cannot predict (anticipate) based on chemistry, what all the biological attributes will be.  \n\nThat was Fuller's Pyramid of Generalizations:  the base does not hold up the apex so much as it's suspended therefrom.\n\nIn other words, Bucky's contribution as an American poet-engineer, was via the humanities (philosophy in particular), in the tradition of both New England Transcendentalism and later, Pragmatism, although he's not currently lumped with the latter.  Consider connecting No More Secondhand God to a William James type treatment.  I've added a lot of Wittgenstein to the mix.\n\nMy professor, the late Dr. Richard Rorty, in writing Achieving Our Country, was leaving the door open to continue with a brand of leftism that was not, thereby, derived from Marxism.  Marxism could be subsumed under Social Darwinism as a form of anti-capitalism.  However, as capitalism morphs, so do its dialectical competitors.  Mainstream Marxists may not be able to keep up (we shall see).\n\nA superstition popular in some circles is that Fuller was trying to sneak in some alternative to the Standard Model.  His 4D Feynman type diagram (six tetrahedron edges labeled with energy particles in a proton-neutron transformation) and speculations regarding muons, suggested he saw his A and B modules, his MITE (another wedge, their combo), as somehow opening the door to a Theory of Everything (TOE).  \n\nCertainly Fuller was free to speculate in this direction, but it's clear he didn't think a complete GUT (grand unified theory) was necessary for humans to achieve greater mastery in Universe.  The generalized principles inform all levels (frequencies) from micro to macro.  Humans were especially carved out to work in the medio range (between extremes of large and small).\n\nHowever Fuller's Universe was \"non-simultaneously conceptual\" meaning \"eternally aconceptual\" meaning he didn't expect a static noun to replace the verb.  Logic has to co-exist with Chaos.  Our thought processes continue to adapt.  In every age, we seem to have those believing we're at a terminus, which turns out in retrospect to be one more station stop along some perpetual journey.\n\nHumans were not tasked with finding the holy grail (some GUT or TOE) before they could manage to feed themselves, in Bucky's opinion.  More important was to overcome various forms of brainwashing that kept us in passive spectator mode, leaving decision making to others.  \n\nAbrogation of responsibility leads to dangerous results at many levels.  Waiting for CERN to map out our future, as if hadrons could be read like tea leaves, was the bankrupt strategy of many bozos.  And yet CERN came through, with the WWW (or W3), our ticket to curriculum integration and more synergy. \n\nUpgrades at the biological level (e.g. better dwelling units) did not await new developments regarding the Periodic Table, in terms of predicting the individual elements from quarks and gluons and so on.  \n\nWe could improve the shelter situation regardless of what we were learning about neutrinos.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}