{
  "id": "6261951005973634209",
  "title": "Queueing Theory",
  "published": "2019-06-03T13:01:00.004-07:00",
  "updated": "2019-06-03T13:26:53.798-07:00",
  "content": "Oh boring, boring, what will they think of next?  Yes, [it's a real thing](https://en.wikipedia.org/wiki/Queueing_theory), and here's a predictable link to Wikipedia. I got criticized in an academic context for being that mundane, however in my defense, I wrote the bulk of that encyclopedia entry ([Synergetics](https://en.wikipedia.org/wiki/Synergetics_(Fuller)), disambiguated to Fuller's version, as in Buckminster).\n\nMy aim though is to be motivational in the sense of offering content of relevance to your personal calendar and how you structure the time in your day.  Having unstructured time is a fine thing too. It's not like we all plan to the minute, and so on.  If you're planning on using a transportation system, sticking to their published schedule, after finding it, is a skill you might want.\n\nWith so many demands on your time, how should you juggle them?  For a moment, be that \"soccer mom\" even if you aren't one.  You'll have other people's kids under your supervision.  That's a heavy responsibility right there.  Not only commanding generals in a military theater have responsibility for their wards.  I'm just saying:  life gets stressful and if you're a soccer mom, you feel many demands on your time, and your vehicle (Subaru?  Volvo?).\n\nIn Uncle Sam Ville (USV), we're told the British are excellent queuers and in fact they're the primary architects of the queue.  In America, we \"wait in line\".  But think how it works:  sometimes the store has multiple checkers, or the bank has multiple tellers, but there's a single cue up to that point.  Have you ever checked in at a busy airport?  You'll be that person next in line waiting to hear any ticket counter up or down the line call \"next!\" (and you're it!).\n\nTo kick a task down the road, to schedule it some time from now, is not \"procrastination\" (a self punishing word) so much as \"orchestration\" (something Python does too).  You can't do everything at once, duh, and you have a sense of a story unfolding.  You're not the author by yourself, however you do have some choice when it comes to narrative.  What tense should you use?  Are we still together?  Did we really break up a year ago?  When do I make time for Y?\n\nWe could talk strategies, how much to write down, what to add to your calendar.  A lot of people use calendars quite habitually to get them through to a next week.  You have calls to return, bases to touch base with.  You're staying on the radar, filing flight plans.  In a busy airspace, people appreciate your being communicative.  They're into echo-location themselves and if everyone's in stealth mode, all you get is more bats colliding.\n\nIn a bigger drama, where the goal was to build a lot of seagoing vessels in a hurry, operations research stood to the task and of course people discovered \"multi-tasking\" in various forms, always a temptation to bleep over as a topic, given so much has been said about it.\n\nDon't begrudge the Brits their \"queues\" even if you call them \"lines\" is my advice.  More soon.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}