{
  "id": "2232346329087980887",
  "title": "Quick Loop (Infrastructure 101)",
  "published": "2015-03-19T13:03:00.001-07:00",
  "updated": "2015-03-31T14:32:32.995-07:00",
  "content": "Our viewpoint from mid-Columbia was impressive, of sea lions, of ships.  Not that many ships actually. \n\nOn the Washington side we saw the grain elevator working, or heard it at least, with Golden Cecilie, brand new, appearing to have a full belly. \n\nThe car-carrying Delphinus Leader appeared to have delivered its load. \n\nThe container shipping terminal we went by, however, was eerily quiet amidst talk of labor disputes up and down the western coastline.\n\nThe Columbia takes ocean-going vessels as far as the outlet of the Willamette and a little higher.\n\nWhat takes cargo on farther, or brings cargo from further inland, are barges, trucks, and trains. \n\nThe barges enjoy [a series of locks](http://controlroom.blogspot.com/2008/07/infrastructure-park.html), getting them past the big dams.  The train tracks go up both sides whereas the main east-to-west freeway along the gorge is I-84 (south edge), with I-5 north-to-south.\n\nContainers are lifted directly off or onto ships from both trains and trucks, with barges doing more bulk items. \n\nThe rail lines do less work busing people (done by Amtrak) than freight, with airlines and private cars moving most the people, or Bolt Bus or whatever. \n\nFreeways cater to [private car traffic](http://mybizmo.blogspot.com/2015/01/oregon-history-and-steam-power.html), shared with cargo-carrying semis (tractors with trailers, up to three).  The road and warehouse network brings goods closest to most cities. \n\nWarehouses get used to repack different loads quite a bit.  A shipload of teddy bears from Asia gets divvied out to the different retail outlets, both big box and boutique, though some may stay with Amazon, a new kind of retail shopping.\n\nA grain-carrying ocean-goer will park alongside an elevator and load up with grain that arriving by barge and by train. \n\nContainers go by truck but aren't for grain usually.  Grain doesn't get shipped in containers, not in bulk quantities.  Special train cars, [covered hoppers](http://en.wikipedia.org/wiki/Covered_hopper) (not box cars) are best for transporting grain, and barges.  Trucks are fine for baked bread.\n\nThese sorts of infrastructure tours may not be practical as bus tours (we were on a boat) i.e. field tripping school children are not seen in droves apprehending their ecosystem / biosphere.  They need this information though, to understand their ecosystem.\n\nWith Google Earth and immersive video, these important aspects of a child's or adult's exoskeleton, the civilizational shell, may be explored and communicated.\n\nNoticeable on the cargo ships were their bright orange escape pods, angled for rapidly shooting off and getting away from what might be a fire hazard.  The captain need not go down with the ship, as in storybooks.\n\nThe hazards of transport, the kinds of things that go wrong, are much on the minds of many who live here, as there's lots of talk of taking bigger health risks in terms of the volume and volatility of the cargo mix through the ports.\n\nI've said little about air freight so far.\n\nYou might be surprised how many tons of commercial carpet have been flown from Atlanta to Tokyo!\n\nThen we need to add the communications channels, which carry programs (e.g. [via TCP / IP](http://controlroom.blogspot.com/2006/06/tcpip-for-gnubees.html)) and the power distribution networks, which channel electrical power, natural gas.  Many networks to learn about.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}