{
  "id": "8064354898571250388",
  "title": "Quick Note",
  "published": "2010-11-11T00:39:00.000-08:00",
  "updated": "2010-11-11T01:15:32.983-08:00",
  "content": "I enjoyed getting some training to serve as a judge of debate teams, and of other speech events. This was at Cleveland High School.  As Nancy pointed out, it's a big poor public school with limited resources.  The state doesn't provide much funding for debate as a sport, even though this is such an obvious long term investment in cultivating democratic institutions.  Government is half-assed and lazy, is Tara's view.I'd been at Glenn's when she reminded me this was the 10th.  Somehow, I'd always pictured this training happening on a Saturday, so was somewhat discombobulated.Glenn and I had been discussing my [global exchange student fantasies](http://www.mathforum.org/kb/message.jspa?messageID=7250872&tstart=0), which he tended to regard as too expensive.  Why would taxpayers fund all that travel, over more local exchanges? I took my general systems theory view that it's not taxpayers we're crediting, but the sun itself. Yes, human labor is mixed in... (more in my science fiction linked below).The example debate, shortened for show, to give the new judges some exposure, was kind of interesting.  The national forensics league had picked the \"mosque at ground zero\" meme for Public Forum (pofo) and was taken aback by all the backlash.  For the first time, a resolution was retracted and replaced with:  resolved:  public forum resolutions should not be about sensitive religious topics.Tara and I discussed it later.  She sees debate as her sacred sanctuary, free from much of the crazy nonsense that infects the wider world.  Keep silly religious topics out of bounds, and the sport will stay more enjoyable.  My view was the debate format is pretty wimpy if not robust enough to handle run of the mill controversies, religious or otherwise.  Wearing my judge's cap, she probably won.  Keep the sport from getting too ugly by picking resolutions wisely.On that particular issue, my view is religious installations, including temples, synagogues, mosques etc., maybe smallish ones, should be a feature in many an \"office\" building.  Zoning should be for mixed use, including residential in more cases, so we have less mindless commuting.  Why not work, sleep and worship in the same skyscraper?I scribbled some more [science fiction](http://groups.yahoo.com/group/synergeo/message/63563) before I went to be, trying to be a good capitalist (means \"using one's head\").  I was also [sparring with Brawley](http://groups.yahoo.com/group/synergeo/message/63560) some more (he's [a vet](http://groups.yahoo.com/group/synergeo/message/63553) -- another topic), on whether it's a lost cause to try overcoming cubism.  I think the Martian Math approach is being productive, as it lets me speak of Earthlings from a more external perspective (ETPV).  I've been [doing this on mathfuture](http://groups.google.com/group/mathfuture/msg/9817e288b62f58ce?hl=en) as well.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}