{
  "id": "3329385074136373950",
  "title": "Rajneeshpuram (movie review)",
  "published": "2017-07-01T13:02:00.003-07:00",
  "updated": "2017-07-01T19:29:39.213-07:00",
  "content": "Rajneeshpuram was an attempt to found a new town in Oregon, in land zoned for farming.  Oregon has some strictly enforced land use laws.  That said township was so religious, and not Christian, didn't help.  Not that Rajneesh professed a religion exactly.  For years he wisely kept his mouth shut, went for a ride, then he gradually took control back, wresting more steering power to a point where Madam Sheila felt obliged to get away.\n\nThe folks of Antelope went to heroic lengths to not lose their cool, and played with Oregon State by the only rule book they could think to follow:  Oregon's.  That starting a Puram in the heart of Oregon by aggressive tactics ends up backfiring is hardly a surprise in retrospect.\n\nI borrowed this OPB Oregon Experience episode from the Multnomah County Library system and today will return it, along with some books on CSS (Cascading Style Sheets), and another on SVG (Scalable Vector Graphics, another front end Web technology).\n\nA man who fascinates me even more than the Baghwan here, is/was Father Divine, the short African American king of His jungle, as a God in his own way.  Lavish feasts were provided by the disciples, the fans, and the gatherings were by many accounts convivial and of \"melting pot\" ethnicity (an all-kinds stew), and all back when MLK was still a young man.\n\nMy overlap with the Father Divine community was when I scored a job teaching high school at St. Dom's (Catholic), exactly what I'd been looking for, within walking distance. The circumstances of my hiring were tragic in that Sisters had died in a car crash.  My willingness to dive in under those circumstances was appreciated.\n\nAn old Father Divine hotel was just kitty corner and offered a good breakfast served by Sister Grace.  I studied the literature and grew intrigued.  Other faculty would join me from time to time, or go there on their own.  Why not?  Great place.\n\nMaureen ([Methodist](http://worldgame.blogspot.com/2005/02/methodist-morning.html)) and I got to talking on the phone through some of this film, which I screened while folding laundry, pacing about.  But then I've been through the story before, in other media.  I never got to visit said Puram myself, even though I'd returned to Oregon in 1985, having left in the 1960s at the end of 2nd grade (my 3rd grade would be first forum in the Junior English School of Rome).\n\nAs someone with a long term interest in student exchange programs, organizing opportunities for faraway urban kids to experience some ranch living, I'm sensitive to locals not wanting to feel invaded.  Our placements will have advance training in sensitivity to community values.\n\nIn terms of setting up campuses, the ecovillages (picture boarding schools), I'm interested in what Props has to offer, thinking lower barriers to entry (to year around camping and village building) has everything to do with technology, from transportation networks to radio stations and runways (landing pads or whatever).\n\nI'd like to see more train re-development, for the express purpose of bringing students in to their remote bases, which may not stay put for long in some cases.  Exploring ecosystems means leaving them as they were by default.  However, where railways are concerned, we're talking about a longer term commitment.  Railway work is maybe for college credit, trucking too. That's how it works in the Global U.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}