{
  "id": "1626781238065732813",
  "title": "Random Post to Social Media",
  "published": "2019-07-15T20:13:00.002-07:00",
  "updated": "2019-07-15T21:54:57.802-07:00",
  "content": "If\n we want serious change, we might want to revisit how the most positive \nfuturist the USA once offered, through world’s fairs for starters \n(Afghanistan, Montreal…), commemorated by the Buckyball at EPCOT \n(“Spaceship Earth”), and for whom buckminsterfullerene was named, got \nwritten off as a kook and/or crackpot and/or failure by those with far \nfewer accomplishments or fans. How many other philosophers had that many\n patents to their name?\n\nMight it have something to do with his declaring “the USA we have known” to be “bankrupt and extinct” way back in the 1980s (Grunch of Giants,\n St. Martins Press), and getting a Medal of Freedom around the same time\n (from Ronald Reagan)? He cited income inequality and the ascendancy of \ncorporate power, talking about corporate personhood before that became \npopular. Covert ops and dirty wars were already replacing the \nconstitutional authorities. What we call “the deep state” today is but \nthe tip of the Grunch iceberg.\n\nDoes\n it matter he came up with new pedagogy around polyhedrons accessible to\n any 6th grader (and above)? No public or private school that I’m aware \nof deigns to share his primitive volumes table. So was he wrong then? Or\n was he a source of too many inconvenient truths? How about his focus on\n the global electrical grid, long before “we” made that be a Chinese \nidea (and therefore scary)? Former president Johnson was so popular in \nTexas precisely because he helped extend the electrical grid to rural \nareas.\n\nFrom\n my point of view, we’ve let the soulless corporations he wrote so \neloquently about write him out of history, or portray him as quaintly \nretro (e.g. The House of Tomorrow). Why was using \nour highest technology to mass produce something yurt-like and \naffordable (not talking about domes now, see Henry Ford Museum) \nconsidered less interesting than what we got instead: so-called mobile \nhomes?\n\nIs\n it too late to build cities from scratch, such as Old Man River? Was \n“lack of funds” ever the real problem? Doesn’t the Earth plug into the \nSun?\n\nAs\n someone who studied philosophy at Princeton under Walter Kaufmann, who \nwarned us of times to come (we’re in them now), I think the choice to \nexpunge and/or besmirch one of America’s all time greatest philosophers \nwas a huge mistake. Not a mistake; a willful desire to nip something in \nthe bud. And “we the people” march ahead blindly, not questioning the \ntheft of our heritage.\n\nHis\n message that we don’t have to make politicians be the ones in charge \n(check “design science revolution” in Wikipedia) is one you’re never \ngoing to hear from those who channel our frustration through all the \nusual circuits. When will independent journalists finally decide it’s \ntime to connect the dots?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}