{
  "id": "6603829714550421217",
  "title": "Rat Story",
  "published": "2014-06-13T07:50:00.002-07:00",
  "updated": "2014-06-13T07:53:08.973-07:00",
  "content": "Like most of my rainforest neighbors experience from time to time, we have live-in rodentia, some squirrels, some rats.  They frequent the attic and spaces between the lath and plaster and wooden exterior (I know, Cascadia quaint, with somewhat creaky floors but not nearly as squeaky as Pauling House).\n\nIn the attic, an infra-red motion sensor has been firing off pix by email via the Internet (it has access to my router).  A have-a-heart trap of feral cat / raccoon trapping size sits in my living room, a $10 purchase at a nearby estate sale (thanks for the tip neighbor!).  However, the real property damage, to shared stores (Food Not Bombs) and personal stuff (the dog's food bag) has come from a rat or rats not in the attic.  I have less of a heart in some areas.\n\nSpeaking of slaughtering innocent furry animals, I also buy mice at the pet store for $1.98 apiece and let them \"go free\" in a confined volume with a predatory hungry animal, which kills them quickly by suffocation / constriction.  If one believes in moving on, a next life, roll of the dice, should be better than that of a clueless mouse in the pet food business.  But how about being a snake, what's that like?  Philosophers wonder about such things, what it's like to be a bat for example (famous essay).\n\nThe rabid consumer in me is pissed off the local grocery has gone with an off brand knock off of the V trap that's always worked well, lets call it Z.  I kept the receipt somehow knowing this could be problem, and sure enough, one night cheese, the next night peanut butter, and both times this super smart rat got a meal without paying the ultimate price.  My respect for the rat has gone up a lot, while my respect for the Z has plummeted.  I'm going to try another store for a V, and if it works then return my two Zs with scientific evidence to back my claim that Vs are better.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}