{
  "id": "52444030663815692",
  "title": "Ready Player One (movie review)",
  "published": "2018-03-30T21:48:00.001-07:00",
  "updated": "2018-03-31T01:09:17.373-07:00",
  "content": "I'd been looking forward to this, however reality was not supportive of my taking time out.  I did anyway, in addition to getting new rear tires for the long drive, a hair cut, and my taxes done by H & R Block.\n\nThe fact that I'm self employed and work hard for the public good (Global U, Trucker Exchange, Coffee Shops Network, better thinking in schools) means I'm someone the government would like to take out, financially if not in other ways.\n\nI understand why Descartes tried to avoid the Inquisition.\n\nOr so it feels.  What did I get for my money as a taxpayer?\n\nIn 1967 the State Department was at least close to authorizing a Macroscope pavilion.  Since then, the USG has been hijacked by Wall Street.\n\nThe Business Plot, warned against by Smedley Butler, then Eisenhower, finally succeeded. Miltary personnel, sworn to uphold the Constitution, have been reduced to mercenaries, whom I'm supposed to help pay for as they shill for business interests owned by shareholders around the world.\n\nSpeaking of sieges, which Descartes liked to study (he'd tour Europe, visiting them), a lot of people in Gaza were marching today, in protest of their ongoing imprisonment.  USSA media, very controlled by a six-headed corporate person and its loyalists, hasn't been very focused on that conflict.   We're fed a steady diet of vapid propaganda.\n\nMedia moguls can't resist exercising their power to self marginalize.  They go down with their ships.\n\nWith all that going on outside, in the so-called real world, why am I hunkered down towards the front of the Bagdad taking in a Spielberg movie?  Why am I so self indulgent? Duh, because I'm escaping, I guess.  Unfortunately, my mind wandered, especially during the big battles.\n\nDoes that dystopian future shown in the film makes me happier with my lot?  That's a purpose of theater, of tragedy especially.\n\nThe dark future portrayed in this film is about a species that has given up on itself and retreated into its collective unconscious.  They've substituted cyberspace for reality.  How different is that from our world today, right?  Media World is is continuous with Cyberia.\n\nCoincidentally, I saw this movie as a double feature with The Man in the Machine, about Steve Jobs.  Glenn had me over for lunch and had this DVD from the library.\n\nI'll review that documentary separately, but note the allusions to his demi-god status in Ready Player One.\n\nDon't they know there's an off switch on those haptic suits?  I guess there isn't in most cases, which is why they cost so much.\n\nIn a way this world, dominated by Oasis and electronic toys, is another step towards civilization, as the only ones brandishing real guns are the obvious losers.  That point of view I understand.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}