{
  "id": "5429045461067041257",
  "title": "Reading Dynamics",
  "published": "2013-08-30T12:01:00.000-07:00",
  "updated": "2016-10-20T10:39:08.274-07:00",
  "content": "Some classrooms tell you not to doodle.  That may be damaging as right brains think in doodles (a shorthand more than insider neuroscience).  As a privileged teen in the Philippines, I was afforded the opportunity to take an Evelyn Wood Reading Dynamics workshop.  We were encouraged to \"doodle\" by which I mean, to \"organize a structured recall\".  Chances are, in a lecture, you'll fall behind if you try to write stuff verbatim.  Take a tape recorder?  Serial access is slow.  Rather:  draw semantic networks, connect nodes with edges.  Doodle in other words.\n\nThe mathematics teacher on Youtube who has done the most for doodling lately [is Vi Hart](https://www.youtube.com/playlist?list=PLF7CBA45AEBAD18B8).  She mocks a situation all too familiar, a boring background math class with a foreground active mind, one that doodles, muses, connects the dots.  At Evelyn Wood, we just called it a \"recall\" for short.  After any reading, close the book, close your eyes, then \"do a recall\".  These and other techniques I learned were well worth my parents' money.  Princeton was a lot easier to keep up with.\n\nAn aspect of doodling is \"drawing monsters\".  [Per Monsters University](http://worldgame.blogspot.com/2013/08/monster-university-movie-review.html), I'm not saying monsters can't be endearing.  It's just that most of us can't draw very well without really committing to learning, but simple stick figure drawings, or silly-looking stuff, may work out anyway, if you just need comics or cartoons.\n\nI'm not saying political cartoonists are necessarily bad drawers, or pro cartoonists of any type.  I'm saying the criteria are such that South Park cartoons are considered effective and appropriate because they to some extent imitate kid drawings and this cartoon features kids.  The Beavis and Butthead flavor of edgy cartoons also owes a lot to [Mike Judge](http://mybizmo.blogspot.com/2013/07/of-mind-and-body.html). Mad Magazine is not far in the background, with demented cartoons (ala Ren & Stimpy) in the foreground.\n\nPolitical cartoons tend to feature \"caricatures\" which are exaggerated / monstrous renderings designed to communicate more ephemeral attributes of a character's role.  These memorable exaggerations get taken up by Francis Yates in her masterful The Art of Memory.  Especially in a pre-literate era with no television, large canvases with stunning action are the way to go.  Hieronymus Bosch makes an impression.  The Mandala is likewise designed to be remembered and carried about in your head.  The image is more like a map or a model.  It's there to remind you of the \"karmic wheel or wheels\".\n\nAll of which art history should serve as a warning to classroom teachers that instructions to \"close your doodle books\" during a history or literature or math session may be about as counter-productive as it gets.  One may call it \"day dreaming\" but that's sometimes just projecting, a fear of not being attended to resulting in a standard classroom practice that actually causes brain damage (or call it \"damage to the learning process\" -- sounds a lot softer).  You want day dreaming or reverie sometimes.  Knowledge \"seeps in\", requires \"osmosis\".\n\nAt my upcoming workshop, Leveraging Python, I'm going to recommend having doodle books handy; I hope to have some piled up for quick access.  They may use their laptops too of course, this being a geek conference where laptops may be open at all times.  But I want to transmit some of that Evelyn Wood goodness, even if these are adults.  I'm not one of those teachers who thinks it's too late if you're an old dog of some kind.  Lets see what kind.  Old dogs come in many varieties.\n\nIn freeing more engineers to think in a right brained sense, maybe we'll reap some benefits, such as [better visualizations](http://controlroom.blogspot.com/2006/02/boosting-bandwidth.html), stronger metaphors, more efficient learning techniques.  Cyberia (cyberspace) is cram-packed with various \"creatures\".  We acknowledge \"viruses\" but then what should we call software running normally?  \"Daemons, processes...\" we have a few words, a few images.  But the cartoons are still gruel-thin at the moment.  What Cyberia needs are more doodlers.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}