{
  "id": "7897359387183173619",
  "title": "Reality TV",
  "published": "2015-09-12T09:21:00.001-07:00",
  "updated": "2015-09-15T09:58:36.199-07:00",
  "content": "Time to review some old themes and writings, with lotsa links to the \"business mobile\" (smartvan) concept.  The idea is we fan out in smartvans, not willy-nilly but as part of concerted World Game maneuvers and missions to assist refugees, [other victims](http://www.quakerquaker.org/forum/topics/friends-ideas-about-poverty?commentId=2360685%3AComment%3A137026).  We're \"dispatched\" in other words, which implies a \"control room\" (any number) and \"planning\" in some scenes.  If you've watched a lot of movies, you have the innate ability to extrapolate and imagine a few episodes, at least in rough outline.\n\nThe TV angles are many, but lets talk about fundraising.  Our fans patch in to our web portal or we may even have a DVD show, like with seasons.  Broadcasters pick us up maybe.  We're like this weekly adventure series of brave / attractive people in a smartvan, part of a larger fleet, out there being helpful to our fellow humans in various dramatic ways that home viewers want a piece of.\n\nNot only do the fans donate and get credit for so doing, they apply and train to jump in, to join us in the \"MercyCorps style\" swimming pool, this \"model UN\", this \"scouting trip\" or whatever.  A \"terraforming corps\"?  It's Planet Earth that I'm talking about.  We terraform more or less consciously, as a species, but either way, we make a big difference to the biosphere, that's obvious.\n\nSo yes, I'm turning Peace Corps / Americorps type work, jazzed up with smartvans and more high tech, into Reality TV that's self funding, with product placement another big part of it.  Who made the smartvans and just how smart are they?  I'm bringing it down to earth while projecting role models.\n\nCrowning me a king of this genre (a producer) and paying me royally (not that much really -- I'm middle to business class) just adds momentum (inertia) to all this happening (helps make it real).\n\nSo what are the critics saying, and why haven't we done this already if it's such a good idea?  I've certainly been vocal enough about the possibilities.  Is it that \"do gooder\" programming is too \"bleeding heart\"?  Maybe only Catholics will watch our shows?  \"If it bleeds it leads\".  But then we're going to trouble spots and disasters in some shows, so if it's blood they're looking for...\n\nI'd say we've been evolving the infrastructure.  The problem of dealing with micro-amount donations, nevertheless tracked (giving credit to donors who gave -- with anonymous mode options), is still not fully solved.  More banks may need to lend their expertise.\n\nPeople aren't used to viewing a screen while contributing a few cents here, a few cents there (or call 'em bitcoins), optionally building their own record or profile, not to prove that they're rich so much as to show off their values and ability to \"pick 'em\" over time.  You're leaving a record of your intelligence, but in a way that's not yet habitual given insufficient infrastructure.\n\nThat's what a lot of philanthropy is a lot about (leaving a record of one's intelligence).  These Foundations have their own version of horse races.  But if you're a working stiff, you've not had time or leisure to invest in that \"rich tycoon with zeal\" mentality.  You don't get to look out over the world thinking \"what shall I fund\"?  Junk mail isn't working so well either, lets say.\n\nThat's where Coffee Shops Network comes in.  You buy your scone from Green Mountain and already get a sliver of GM's profit to toss in some bucket, like a chit or chad, say ten cents just to trivialize (in charitable casinos the amounts may be much higher).  Sipping your latte, you pop in your ten cents and flip up a game, say a Sudoku.\n\nGiven how fast and deft you are, you've won a whole dollar before it's over, and GM empowers you to be a \"for the moment\" shareholder / stakeholder (you bought their scone didn't you?) and to commit that dollar, your heroic skill having amplified value ten fold, to some worthy cause that these game machines know how to connect with.\n\nSome favorite charity in Nepal just got another dollar.  Both you and GM have netted some good karma.  You feel accomplished.  You get a kick (energy boost) out of the experience.\n\nThat's a somewhat [simplified and idealized](http://coffeeshopsnet.blogspot.com/2014/09/more-marketing.html) rendering of the standard CSN transaction:  profit slice towards good will shared by company and procuring customer.\n\nAccounting for \"good will\" on the books, as a way of building company reputation, is not at all a new idea.  What's new is the micro-management of donated amounts and the cutting in of customers as momentary shareholders, almost board members (in committing micro amounts of profit).\n\nSome supermarkets do this at checkout, with coin jars for charities, but usually with no pledge to match, and with no way to give name credit to the donor.\n\nBut what if company X is ideologically opposed to funding Y or Z as \"bad for the company's image\"?  No problemo.  The range of options, the charities that might benefit, is known in advance and if the customer is truly hell bent on supporting Y or Z, just procure from a different outfit, free country.\n\nSome of our shops host games that support some controversial causes, what can I say?  You may disapprove of your children's choices.  I'm not here to dictate who gets what.  I'm talking about wiring, an infrastructure, and a pleasant environment in which to help steer planetary affairs, with [interesting reveries on the LCDs](http://coffeeshopsnet.blogspot.com/2010/04/smart-bar-lcds.html).\n\nThe CSN business model helps pave the way for doing the same things at home i.e in PWSs (personal workspaces), procuring investment credits, playing games, adding value.\n\nPeople in their smartvans, getting support from others, in turn give support.  Channeling funds to the right places is a game we should all be in on, starting young.  We develop that ethic of paying attention to world problems.\n\nOur cultivating a philanthropic mentality is not just for altruistic churchy \"get me to heaven\" reasons.  One simply acts more logically as a part of some solution when thinking globally.  We're less awkward, less wasteful, more attractive (including to ourselves) in proportion to our ability to solve problems as an intelligent life form, both individually and collectively (as team players).\n\n\"Doing good for real\" makes for better television in other words, and better sex (I had to say that).   Hollywood stars learned these lessons long ago.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}