{
  "id": "7334946877930147528",
  "title": "Rebooting Mathematics",
  "published": "2007-04-14T15:38:00.000-07:00",
  "updated": "2012-07-08T11:20:34.136-07:00",
  "content": "[Originally posted](http://mathforum.org/kb/thread.jspa?threadID=1559274&tstart=0) to Math Forum @ Drexel, hyperlinks added.\n\nBack in the 1980s/90s I was suggesting a \"[makeover](http://www.grunch.net/synergetics/makeover0.html)\", then as now a popular genre on TV (plastic surgery channel, or just playing dress up). But the downside of such a meme is its \"purely cosmetic\" spin, inapplicable as that connotation may well be in specialcase.\n\nSo the new campaign uses words like \"reboot\" more often, while keeping \"makeover\" as a runner up.\n\nCentral to the reboot is this new focus on energy. We have Sol (our sun) like 92 million miles distant, as a primary source, and the relative vacuum of space (out past the orbiting junk heap) as our energy source. In between is what [Dorion Sagan](http://www.amazon.com/Into-Cool-Energy-Flow-Thermodynamics/dp/0226739376/) and others call the \"solar gradient\", which humanity rides kind of like a beach bum rides a surf board, piggy-backing on this vast tsunami of [energy income](http://www.grunch.net/synergetics/gst3.html) courtesy of what Pharoh Akhenaten recognized as our biggest physical energy sponsor in these parts, to the tune of many terawatts per capita over an average lifetime.\n\nWhat we then do is break this energy down into cycles, mainly the shorter swing weather cycles within the longer swing climate cycles, and our ability to tap in to those with \"water wheel\" technology, meaning these turbine like things (or literal turbines), feeding into the various distribution grids to the offices and homes and such, where the voltage is stepped down to like 220/110 at 50/60 cycles (visit [geni.org](http://www.geni.org/) for more info).\n\nThe mathematics comes in early, as we attach precise and engineeringly significant numbers to this picture, using spreadsheets, computer simulations or whatever you school curriculum experts have signed up for (as a parent, you may be downloading or purchasing at Fry's -- make sure you push for that homeschooler tax deduction as these supplies needn't be paid for twice). Solar gradient kwhs convert to grid kwhs which in turn convert to calories and kilocalories, joules and kilojoules. This is where we get to the food labels and the whole [Super Size Me](http://www.imdb.com/title/tt0390521/) discussion around malnutrition (over as well as under -- an important component of any serious-minded public spirited self health curriculum, and just as appropriate under the heading of math).\n\nOf course by now the purists are starting to object about all the french fries and milk shakes we're discussing, taking seriously as solar gradient income (hydrocarbons cycle). This sounds more like science class. But your counter, as one of the \"[gnu math](http://mybizmo.blogspot.com/search?q=%22gnu+math%22)\" trained, is to remind parents that \"geometry\" is really \"earth measure\" and said earth is an actual planet, ours, Earth or Spaceship Earth as your text may call it.\n\nWe're not using K-12 as a platform to promote some psychological \"disconnect\" from the \"real world\" ala some of the negative press about Ivory Tower PhD level math (much of it undeserved). That's not a goal. Pursue that brand of necromancy in college or in private scholarship if you like, but don't take it as a sign of weakness that we're anchored in the astronomical and geological data bases, when it comes to getting our most primitive concepts across. We're not about turning our back on Animal Planet. The object oriented paradigm (OOP), intrinsic to our self-executing math notations, is especially vested in animals and animation, per the various geek-architected pipelines already well described in this Math Forum archive.\n\nThat being said, don't therefore misassume we don't have proofs. Our grounding in real world open source energy planning type curricula does not mean we're unable to justify and/or prove the logical consistency of our approach, by a lot of the same means used by the competition i.e. by those otherworldly philosopher types, steeped in their continuum metaphysics ala the calculus. Discrete math engineering, at the higher levels, is well typified by such texts as [Concrete Mathematics](http://worldgame.blogspot.com/2005/01/brainstorming-about-pedagogy.html) (sometimes used at Stanford) and Donald Knuth's [The Art of Computer Programming](http://www-cs-faculty.stanford.edu/%7Eknuth/taocp.html). We're not apologetic for our more digital spin, think it flies, carries water, plus leads to interesting careers for our grads. Your mileage may vary.\n\nRelated Reading:\n[Brainstorming About an Early 21st Century Technology Curriculum](http://www.4dsolutions.net/presentations/urnermindstorm.pdf) (Shuttleworth Summit)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}