{
  "id": "3113134352851203958",
  "title": "Rebuilding Ukraine",
  "published": "2022-07-05T14:21:00.013-07:00",
  "updated": "2023-07-07T13:57:44.608-07:00",
  "content": "The billions allocated to Ukraine could be spent on civilian reparations (repairs) in case Ukraine is still a sovereignty.  The choice to not spend that money on a military spectacular is probably not theirs to make however.  Those billions would not even rebuild the army, navy and air force already lost.  But do they need to be?\n\nThe number of civilian jobs open to EU, UK and US types would be proportionally higher in a neutral, vs a NATO, Ukraine. In terms of employment, insisting on narrow specialization in weapons training is an anathema, the opposite of diversified growth, more of what brought the USA to the brink of extinction (some would say that brink has been crossed).\n\nSyria is a good example.  After years of civil war, there's been some chance to rebuild in Aleppo.  Not every apartment building has to be restored.  Sometimes the better plan is to finish the demolition, level, and build atop the rubble of what came before.  That's if the new building techniques are any better.  Perhaps people would prefer a Nomadland, featuring semi-mobile vehicles they could live in.\n\nOregonians have connections to Ukraine and have no reason to withhold from speculation, when it comes to plans to rebuild.  A demilitarized Ukraine could be just as prosperous, with tourism permitted from all corners.  Ecotourists especially.\n\nOf course the big money showcased as passing through Congress, a choreographed maneuver, presupposes this funding is spoken for, and is designed to enter the coffers of NATO's vendors, to pay for new inventory, under the command of their socialized military personnel.  \n\nUkraine does not have a say in NATO currently, but as the recipient of so much largess, is cast as forever grateful.  Without NATO, where would Ukraine be today?\n\nThe Russian side is already starting to rebuild, as winning over a new citizenry implies a trajectory back to civilian normalcy. The best PR is to begin repairs.\n\nRussia does not need the EU to crumble, as basket case neighbors are prone to poor judgement.  Their \"nothing to lose\" mentality gets the better of them.  Extremists exploit extreme conditions.  Who wants to deal with freezing Germans?  NS2 could be turned on tomorrow.  Of course DC would object.\n\nThe challenge has been the challenge of brain surgery:  how to address the issue without killing the patient.  In being a huge part of Europe, Russia has been operating on itself.\n\nRebuilding Ukraine might not be a high priority for every developer though.  Many on the sidelines, in a cheerleading capacity, are convinced they're in a position to extract their pound of flesh.  Their desire for vengeance is high.  Civilians getting on with their lives takes a back seat.  Perhaps the plan is to keep them as displaced refugees and stoke their resentment?\n\nAllowing Ukraine to carry on without being remotely controllable from Washington DC, goes against what many a control freak requires, to feel secure.  If they don't feel secure, then it's their business to make sure none of us do.  \n\nStopping the rebuilding of a civilian Ukraine, in favor of more combat and degradation, could be what some of the limited liability boards have in store for us.  They're maybe not in the rebuilding business.\n\nThe question is whether the large bureaucracies will follow them, or expel them, as no longer representing the more profitable way forward.  Helping refugees, while rebuilding a humane habitat is potentially one of the biggest businesses of all time.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}