{
  "id": "8799817831704980539",
  "title": "Recap:  Data Science",
  "published": "2023-04-13T17:55:00.000-07:00",
  "updated": "2023-04-15T12:35:32.610-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52632494223/in/album-72177720296706479/)\n\nSo what low-down bottom line do I share with my students along this Data Analysis track? \n\n- That the Python ecosystem is but one of many and many of the tools we're learning (LaTeX, regexes...) bridge our respective communities e.g. Jupyter celebrates computer languages Julia, Python, and R, all early adopters of this common browser based interface to a running kernel\n- That interactive dashboard type data displays are not necessarily tracking anything in real time, but many of them are, and real time tracking is an expectation many will have; so best to bone up on the relevant tools.\n\nI focus a lot on GIS type displays as integral with data visualization i.e. displays driven by latitude / longitude.  \n\nI'm not off topic, therefore, sharing about the various projections, and especially the demented Mercator, with Alaska and Greenland so grossly distorted.  \n\nThere's a time and a place for it, but we're not bound by it, would be the obvious message. \n\nWe're beginners and so establish our chops using well-known favorites: \n\n- seaborn\n- pandas\n- matplotlib\n- numpy\n\nbut then we jump into pyplot and dash for a day, to confirm the heuristics we've been learning are largely transferable.  Pyplot is a lot like seaborn and dash depends on Flash, which we also tour, including via my own Flask-teaching website.\n\nIn some ways I'm in Coding with Kids mode in that I'm not in upper management.  I punch in and punch out and uphold my end of the bargain.  \n\nMeanwhile, I bring whatever curriculum development skills to bear, adding to what's already a substantive and well-organized tour of an emerging terrain. \n\n[](https://www.flickr.com/photos/kirbyurner/52564715298/in/album-72177720296706479/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}