{
  "id": "1858215840302524427",
  "title": "Recap:  The Modules of Synergetics",
  "published": "2021-06-29T12:35:00.003-07:00",
  "updated": "2022-01-13T16:13:06.887-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEje5Ze_wyCVvkNlq92peVdB38ZpB3TXmZJRsX4bSTHm3kYpNYxx6MWy0tL0G11XEYrk8HGV4SkL4D0plpvjkXYQNWlvCWnQMkdbQ8FjBbJMruJw42ZhlSXz-EMoBg44-WVmlE1_/s320/abmod.gif)A & B Modules by Richard HawkinsIt would be great to have someone go over the modules with us, and Kirby has agreed to give us a short presentation.                      Curt[http://www.rwgrayprojects.com/synergetics/plates/figs/plate03z.html](http://www.rwgrayprojects.com/synergetics/plates/figs/plate03z.html)That's one of my favorite posters (Curt's link above).  So clear.  So \"elementary school\" in flavor.  Yet so not shared with many kids. And I don't think because of any invisible committee or meritocracy coming to a conscious conclusion. Inertia and reflex-conditioning (robotic thinking, AI) explains most of what we're up against, in my own sociological model of the global university student-faculty. We are the hollow menWe are the stuffed menLeaning togetherHeadpiece filled with straw. Alas!For those not on the call, here's a brief synopsis of my talk on the modules, with a few grace notes added, for this archived version.  Curt let me screen share so that some of the web pages cited below were displayed in the course of my \"lightning talk\" as we call short Show & Tells in Python world (< 5 mins). ====On pg. 52 of Cosmography, Fuller mentions A, B, T, E and S \"modules\".  These are names he gives to tetrahedral wedge shapes that may be: (A) used in the assembly of other shapes (e.g. 24 A modules, 12 left and 12 right, build a regular tetrahedron of volume 1) and/or (B) treated solely as volume measures (like cups and spoons used for liquids) For example 24 x 3 = 72 A-modular thimble-fulls of water, would precisely fill a volume 3 cube with edges sqrt(2) and 2-R face diagonals inscribing our unit volume tetrahedron (where R = IVM ball radius; 4 such balls defining the tetrahedron). [0]To actually assemble said cube from the modules (like a 3D jigsaw puzzle vs. just pouring grain or liquid) you'd need some B modules as well (same volume, different shape).As & Bs together brick in the cube, rhombic dodecahedron and the Coupler. Both A & B have a tetra-volume of 1/24. Two As (left and right) plus one B (left or right) make the Mite (minimum tetrahedron), a space-filler of no outward handedness (yet left and right may be distinguished in dissection).I pointed out this chart (Inchbald, Steel Pillow [1]) and table (by Michael Goldberg [2]) showing how the shapes Fuller defines and describes in Synergetics in terms of A & B modules (e.g. Mite, Rite, Coupler...) already appear elsewhere in the mathematical literature, sometimes in the context of answering the question \"what tetrahedra fill space, and with no need of left and right versions?\" That's a question Bucky took up as well.Fuller's focus on space-filling tetrahedrons connects him to Sommerville, Hall, Goldberg etc. however Synergetics is not the type of book that footnotes / cites all the previous lit on a given topic.  Nor do mathematicians usually see any pressing reason to cite outsider Fuller on these topics and/or use his vocabulary, or think in terms of tetra volumes.  What peer group would reward such behavior?  An anthropological question.In terms of outreach, these points of contact suggest possibilities for the interdisciplinary diplomats among us. Michael Goldberg intersects Fuller's research in other areas as well, around geodesic sphere classification and hexapents (another name for which are \"Goldberg polyhedrons\" [3]). E.J. Applewhite got to meet him and liked him (\"not a mean bone in his body\" I recall him saying), even though citations to Goldberg seem to eclipse and occlude links to Bucky e.g. when Scientific American got around to narrating the discovery of the virus structure, and left Fuller out of its account, much to Bucky's chagrin (I had some access to EJA's archives).Regarding the T & E modules, that's where I fit the \"mind the gap\" meme (a meme CJ has been using in a related context).  Fuller had been seeking a volume 5 to join his family of volumes 1, 3, 4, 6 and 20, for tetrahedron, cube, octahedron, rhombic dodecahedron (RD) and cuboctahedron (VE) respectively (as \"flower-arranged\" i.e. \"nested\" in his \"concentric hierarchy of polyhedra\").  At first he was attracted to some high frequency idealized sphere as his candidate volume 5.  But in retrospect, and after a battle with his \"subconscious demon\" [4] he glommed on to the rhombic triacontahedron (RT).  It would have a volume of precisely 5 if its radius were set at 0.9994... i.e. just shy of 1; the exact number may be expressed in closed form involving surds, notation which Fuller did not eschew, even though he did not subscribe to current axiomatic dogmas regarding the so-called Real Numbers.120 T-mods assemble such an RT5 (30 diamond faces, volume 5), whereas 120 E mods assemble an RT5+ of radius 1 precisely i.e. the RT5+ \"shrink wraps\" (is precisely tangent to) the uni-radius ball of  the IVM (= CCP ball packing). [5]  We need them both.  The RT5, scaled up by 3/2 to volume 7.5, aligns with RD6 in terms of sharing vertices. T-mods have volume 1/24, just like A & B modules.The concentric hierarchy is tight.  Compact.  Pregnant with so many relationships.  Worth sharing, even as a purely Platonic construct (pre-frequency, pre-time, pre-size, i.e. \"eternal\" in parochial-local synergetics nomenclature).Finally, the S module bricks in the empty space between the octahedron of volume 4, and an inscribed, faces-flush icosahedron.[6]  I took us to a Koski Identities page.[7]  Curt said David is enqueued to given a presentation sometime (he's vacationing in the upper peninsula these days) and had sent a bunch of materials -- including about phi pi (a close approximation of pi based on phi) which, of all David's research foci, I myself am not really into (I also tend to snub the snubs e.g. snub cube etc.).I emphasized to the group that whereas Fuller endows his modules with energy-conserving and dispersing properties, and envisions cellular automata type studies that could somehow link his modules to CERN style particle physics, my own focus is on such low budget Platonic stuff, meaning I just stick to the pure geometry of it all and don't myself claim to be doing any high energy physics around the synergetics modules (I'm no Nassim).  I'm just a double-A battery low powered operation, like a wind-up toy bunny.Should we have some breakthroughs in this area (where Synergetics meets CERN), that'd be another advance for modelability for sure.  For me, Tensegrity = Hypertext = WWW is already a CERN connection, i.e. the computerization of synergetics. [8]Both Snelson and Fuller had high hopes their respective models would prove relevant to atomic studies.  Snelson focused on electrons, whereas Fuller hoped the atomic nucleus of transformable protons and neutrons could be modeled as closest packed spheres in some way with rhombic dodecahedra and his Coupler (8 Mites assembled in many different ways -- Chapter 2 discusses the permutations) in play.====ENDNOTES:[0]  How could a cube of edges sqrt(2) have anything other than \"sqrt(2) cubed\" for its volume?  My slideshow on Fuller's meaning of \"4D\" begins there, by answering that question. Just as he challenges us on saying \"up\" and \"down\" instead of \"in\" and \"out\", he would have us question our most dogmatic (reflexive) use of \"squared\" and \"cubed\".[1]  [http://www.steelpillow.com/polyhedra/AHD/AHD_Chart.pdf](http://www.steelpillow.com/polyhedra/AHD/AHD_Chart.pdf) (Archimedean honeycomb duals -- starting at its root with a handed half-Mite, what David Koski dubbed a \"smite\").[2]  [https://controlroom.blogspot.com/2021/02/early-bird-special.html](https://controlroom.blogspot.com/2021/02/early-bird-special.html)Table is from a 1972 paper i.e. pre the publishing of Synergetics.  [https://www.sciencedirect.com/science/article/pii/0097316574900582](https://www.sciencedirect.com/science/article/pii/0097316574900582)[3]  [https://youtu.be/g0RTmVSCsiI](https://youtu.be/g0RTmVSCsiI)[4]  986.208  \"My hindsight wisdom tells me that my subconscious  demon latched tightly onto this 5 and fended off all subconsciously challenging intuitions.\" (cite Mistake Mystique -- something CJ harps on).More about T & E modules:[https://coffeeshopsnet.blogspot.com/2011/01/storyboarding-lcds.html](https://coffeeshopsnet.blogspot.com/2011/01/storyboarding-lcds.html)[5]  That's another point of contact by the way: IVM = CCP = FCC but for minor nuances and connotations. Dr. Arthur Loeb was the interdisciplinary diplomat in this connection, in both what he taught, and in his prelude to Synergetics.[6]  [https://nbviewer.jupyter.org/github/4dsolutions/Python5/blob/master/S_Train.ipynb](https://nbviewer.jupyter.org/github/4dsolutions/Python5/blob/master/S_Train.ipynb)Some of the latest research on the S module.  E.g. not in Synergetics 1 & 2:  S:E == VE:Icosa (same ratio) where VE and Icoas are related by Jitterbug i.e. same edge lengths. S/E as a factor (about 1.08...) takes us to explorations of a Jitterbug-like transformation, also in Synergetics, wherein the icosa inscribed in the octa (faces flush) turns into a *smaller* VE, faces flush to the same octa. Multiply that VE by (S/E)(S/E) to get the corresponding larger icosa's volume.  Whereas Icosa * (S/E) --> larger VE by Jitterbug.[7]  [https://replit.com/@kurner/SandE-Modules#main.py](https://replit.com/@kurner/SandE-Modules#main.py)(hit green arrow to run the Python, eyeball the source code to see the groovy volume expressions for S and E modules:φ     = (rt2(5)+1)/2     # golden ratioSmod  = (φ **-5)/2       # home base SmodEmod  = (rt2(2)/8) * (φ ** -3) # home base Emod[8]  [http://www.4dsolutions.net/synergetica/synergetica6.html](http://www.4dsolutions.net/synergetica/synergetica6.html)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}