{
  "id": "8913595091166584009",
  "title": "Recent Projects",
  "published": "2025-02-15T13:22:00.000-08:00",
  "updated": "2025-02-17T14:39:02.801-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiN8BmbyqfC6j3qc0_em4GjG2T8c_2caygHYnqmDNYqwR-n0hZv1GV5nsTFiG_2epQzpazWgg6QQ7jN5fh26faKWu48tq6AhO-u9Nuldhz2cKpavBhKxjt23zL-fD22zcISJZyIvjA8pxLnsMN4Y7zIp4QXbkonxPhzcnYnJiRuPxu8KOaCmJKZ/s548/Screen%20Shot%202025-02-15%20at%201.16.00%20PM.png)[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgCpzZy56yTckHY4FNTPRB-kupMD8oa2aFzQTL2o7HEw9nsXIH9n05mxJ8MgVFWq0JA7x4qv6vUGK6JcVVUM60cofZf9rTrdl_m8XiTw8dvt_QE13HGA15hf_55fbec4qP3YpUgOJBglrNeymrSUEOzBhBQ8uIG_zXETEsTfCMWWSmOaHW_Y7bu/s548/Screen%20Shot%202025-02-15%20at%201.16.24%20PM.png)\nConsequent to cutting way back on calories for an interval, and not actually going to zero, I've sparked some dormant energies and managed to power through some pending projects.\n\nPer the still above, I was able to get that animated GIF showing a cuboctahedron unfurling inside an octahedron, riding its rails as it were, with wheels starting at mid edges. The edges of the eight embedded triangles are allowed to stretch, as each rotates inside an octahedron face, staying equilateral. At one station, early along the journey, an icosahedron is reached, named IcosaWithin in some memeographies.\n\nMy achievement was not out of the blue, as I was using a simple framework I've been hacking on for quite awhile, wherein I have a vocabulary of named vectors and already-defined polyhedrons made from pairs of those Vectors (so-called Edges, from any point to any point, vector tip to tip), which stay origin originating. \n\nDidn't Wayne Bishop adopt this convention in his Linear Algebra textbook? I used to debate with the guy in Math Forum. I didn't quarrel about his vectors though. I did yak a lot about Quadrays, the Qvectors of which I define in Python, as a subclass of the Vector types.\n\nA next project was to read more of those two library books I checked out from the downtown library. They were part of a display on a topical issue, much in the news these days: borders and immigration, also emigration if you think about it. White Borders by Reece Jones (Beacon Press, Boston, 2021) is one of the two and I got about half way through in a sitting. \n\nThen I checked the index for either Ashley Montagu or Buckminster Fuller. I wasn't really expecting to find either. His focus is mainstream journals, cults, and Congress. The debates around \"race\" have been expansive and my blogs continue stirring the pot in that respect.\n\nAll that reading prompted me to query Perplexity for some answers regarding Bucky's essay No Race, No Class. I found it listed in a table of contents in a World Game document (a PDF) that proved interesting in itself, open source at the BFI Wordpress site. That site links to my stuff too, see bfi dot org slash synergetics and scroll down for a Jupyter Notebook on Synergetics.\n\nLast on this list (of projects powered through), I became aware of some recent advances around Magic Squares, a favorite topic of recreational mathematicians, such as Martin Gardner. Numberphile on YouTube. I learned late in life (at 66) of that famous 128-by-128 magic square by Tarry in the 1800s and turned it into a modern day exercise using pandas and numpy (just to verify it's correct) with a little help from AI. This square is trimagical, a whole new idea to me. I wouldn't have thought such a thing possible. Live and learn.\n\nOne more thing: I'm only just tuning in Steve Keen over there with the economists and note his emphasis on thermodynamics. Perplexity was again of some help just now. I probably first learned of him thanks to a Lex Friedman interview.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}