{
  "id": "4703746730843033469",
  "title": "Recessionology",
  "published": "2009-06-22T20:15:00.001-07:00",
  "updated": "2009-06-24T16:34:40.544-07:00",
  "content": "As I was mentioning to my [OS Bridge group](http://worldgame.blogspot.com/2009/06/show-time.html), if you're politically against something, talk about how expensive it is, whereas if you're for it, talk up the jobs it'll create.For example, a serious commitment to [pair teaching](http://controlroom.blogspot.com/2009/05/pair-teaching.html), even if only along a trailblazing digital math track in test zip code areas, would create lots of new opportunities, including for vets in some cases.True, we'd probably import some of our talent [from overseas](http://controlroom.blogspot.com/2009/03/shipping-jobs-overseas.html), maybe from schools [already doing it](http://mybizmo.blogspot.com/2008/08/new-kind-of-charter.html) (FOSS culture is everywhere), given the local schools aren't that [well focused](http://mybizmo.blogspot.com/2006/09/focal-points.html) (yet). However, the gap could narrow with time and with a certain amount of revamping i.e. [curriculum overhaul](http://worldgame.blogspot.com/2009/03/pps-has-friends-in-silicon-forest.html), especially at the teacher training level.So is doubling the need for math teachers a good thing or a bad thing?If you're thinking how damn expensive it'll be, you probably don't like, and maybe don't understand, your mathematics, a big part of your American heritage (president Garfield had a cool [visual proof](http://controlroom.blogspot.com/2009/06/visual-proofs.html) for the Pythagorean Theorem involving trapezoids -- another geek president we should learn more about).Some idiocrats are thinking:  \"if there's no money for promising civilian initiatives, then maybe pent up frustration will build us a head of steam and we can get on with some war\", which is of course the \"el cheapo\" way to think i.e. it's easy-sleazy to imagine war profiteering scenarios, once a sufficient level of mayhem and mob psychology is dialed in with mass media complicity.Stoking the flames of war is what [fear-based politics](http://controlroom.blogspot.com/2006/01/power-of-nightmares-movie-review.html) is all about (aka the so-called \"War on Terror\"), as typified by the various millennial apocalyptic and/or neocon pathologies, usually tinged with religious lunacy ala that [Opus Dei nutcase](http://www.opusdei.us/art.php?p=6437) in [Da Vinci Code](http://controlroom.blogspot.com/2006/02/welcome-to-reality.html) (Ollie North is another example, although maybe it's autism in his case).After a whole generation had grown sick of war in the 1940s, at least in the European theater, a vastly [transformative futurism](http://controlroom.blogspot.com/2008/05/american-look-movie-review.html) took hold of this nation's imagination, centered around the [I-net](http://worldgame.blogspot.com/2008/02/salem-and-eugene.html) or [Interstate Freeway System](http://worldgame.blogspot.com/2008/01/buckaneer-lore.html), and the commuter-based lifestyles this system might support.People would watch movie trailers about how these things called \"on ramps\" and \"merging\" would soon be in their future.  World's Fairs were devoted to this topic, with those favoring urban rail considered killjoys by the grand visionaries.  What happened next is [the world of Cars](http://mybizmo.blogspot.com/2006/06/cars-movie-review.html).We could scrape together a promising futurism even today, given how far our technologies have advanced since the 1940s.  However, Americans have grown fat and docile, [like Eloi](http://controlroom.blogspot.com/2005/01/why-civilizations-fail.html), and herd together like lemmings in \"fear clutches\", many of them based on a tradition of protest (aka \"[protestant](http://controlroom.blogspot.com/2005/07/more-on-usa-os.html)\").According to \"protest\" mentalities, somebody must be vilified and blamed, fingers must be pointed, and revenge against the wicked must be sought.Although one may well drive big businesses with these motives, especially if trafficking in highly charged symbols, our geniuses Albert Einstein and Bucky Fuller have both suggested that longing, even more than vindictive small-mindedness, is a primary motivator of great human achievements.Which brings us back to [that Peace Dividend](http://worldgame.blogspot.com/2009/02/retooling.html) we keep expecting, now that a cynical, low-IQ response to everything is going out of style.We're not in the mood to sucker for another big war right now, even if we're [living like slumdogs](http://worldgame.blogspot.com/2009/03/spring-cleaning.html).We're ready for something better, right?If that's true, then we shouldn't be shy about sketching bold visions of the future, [the more the merrier](http://controlroom.blogspot.com/2006/07/smart-cars-2.html), with an eye towards ramping up around some of the more attainable and desirable outcomes.How's [the global grid](http://controlroom.blogspot.com/2008/12/global-grid-info.html) coming along?The Department of Energy should give us those updates, not make the CIA's World Factbook do all the work.  Why not make it a wiki?Let's get those public service asses in gear shall we?And let's insist on open sourcing digital assets whenever taxpayers are footing the bill.  Give us stuff we can freely build with, [like geodesic domes](http://controlroom.blogspot.com/2006/07/civilian-technology.html), like what's in those other expired patents ([RSA](http://mathforum.org/kb/thread.jspa?threadID=1906781&tstart=0) etc.).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}