{
  "id": "1356323486406041142",
  "title": "Recruiting Commercial",
  "published": "2009-06-11T08:00:00.000-07:00",
  "updated": "2011-12-17T23:32:08.552-08:00",
  "content": "USA diplomats are getting creamed overseas, with the argument \"if you Americans had any brains, you'd be out of Iraq by now\".  Yes, that's hard to counter, especially after the Prime Minister's remark, that if we got to see [those pictures](http://controlroom.blogspot.com/2009/04/future-of-image.html) that we all know are out there (on memory sticks a lot of 'em), then the fun in the sun would be over, and \"[the army we've got](http://mybizmo.blogspot.com/2009/05/summer-marketing-campaign.html)\" would have to [vector home](http://www.aljazeera.com/news/middleeast/2011/12/20111218513415803.html) to the bone yard pronto, no ifs ands or buts.\n\nHowever, the thesis of [Why We Fight (movie)](http://mybizmo.blogspot.com/2006/03/why-we-fight-movie-review.html) is that brainwashed Americans are unintelligible, have come to a point in their civilization where they no longer talk sense of any kind.  They talk about \"the economy\" a lot, as if their own militarism were on some other planet, long ago and far away.  \"Suffocatingly stupid\" would be my rejoinder, \"but we do have pockets...\" and then I trail off, looking hopeful (nod nod, nudge nudge ([Monty Python skit](http://www.youtube.com/watch?v=ona-RhLfRfc&feature=related))).\n\nBut then we don't exactly come across as \"deep pockets\" over here.  Uncle Sam is broke, but spends what few dimes he has left continuing to lose reputation overseas, through repeated acts of public self humiliation.  I'm not blaming the White House.  I've always looked at radio and TV pundits as the source of our problems (asking questions was OK, but once journalists started [having opinions](http://worldgame.blogspot.com/2007/05/live-from-baghdad-movie-review.html), it was time to crank up the stereo and look elsewhere for mind control).\n\nAnyway, this is hardly the future I was prepared for in school, so it takes some getting used to.  I've noticed youth feel the same way I do, amazed and agog at what \"[old people](http://mybizmo.blogspot.com/2009/05/summer-marketing-campaign.html)\" are doing -- nothing sensible, that's for sure, unless you posit a death wish (which of course we do [in Jungian psychology](http://worldgame.blogspot.com/2009/05/with-friends-of-jung.html), so yeah it's called \"denial\").\n\nIf Americans really wanted more and better life extension services, we'd have those oncology cruise ships by now, like the Russians are building.  But you can't have adequate health care and commit to an ideology of \"kill at will\" whenever you don't understand the action.  \"Having it both ways\" (i.e. a healthy economy and a seriously diseased political climate, with no conservatism that's sane, no liberalism that's not spineless) is just too much the oxymoron.\n\nMedical science requires a civilization to sustain itself and we just don't seem to have all the food groups around here, though I'm more hopeful about [some zip code areas](http://worldgame.blogspot.com/2009/09/forced-march.html) (nudge nudge, wink wink).\n\nNote that I'm not blaming the war dead for this mess.  I've been [wailing on Bourbaki](http://mathforum.org/kb/thread.jspa?threadID=1953263&tstart=0) at the Math Forum again, haunted by that notion of \"looking busy\".  Just remember:  if you're studying geometry and they say nothing [about tetrahedra](http://mybizmo.blogspot.com/search?q=tetrahedron), that's called \"Rome burning\", and what your teacher is doing we call \"just fiddling around\" (looking busy, not really working, not employed in any useful capacity, \"checks for free\" [as Dire Straits put it](http://www.guntheranderson.com/v/data/moneyfor.htm) (OK, it's \"chicks for free\" I knew that)).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}