{
  "id": "7430481027655269174",
  "title": "Recruiting Drive",
  "published": "2021-07-11T23:47:00.004-07:00",
  "updated": "2021-07-16T14:40:09.683-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgDotMKPKD-M8__Jvw3Vv2DKCnBGcs-01g1ik4pXBdYMHAB1Mr6ZmjUezwBHgcvMBQyFhLAc5grqMjlegRNwQBWGZZoum0eMMDOtneM0OZfEgSxao1mW6ajjNmpSCSbDNskTJnV/s400/4073009388_e924a4091c_o.gif)\nWhereas my curriculum writing might be interesting and suggestive, it doesn't tackle all the issues regarding workflow.  \n\nHow do the students encounter the material?  How do they demonstrate growing competence?\n\nAt this point, when I look for competence on my own terms, I look for teachers willing to tackle the main topic in my slide show, namely the concept of \"dimension\" in Synergetics.  \n\nA willingness to take that on, shows a willingness to acknowledge the importance of semantics in this post Linguistic Turn world (namespace).\n\nIn addition, I'm putting my documents in a Github repo for a reason:  I'm encouraging forking, if not pull requests.  \n\nMy inclination is to keep my repos under my exclusive control while encouraging other teachers to use them as raw material for their own original works.\n\nSo yes, I'm at the beginning of my own recruiting drive, even though I've been recruiting for decades.  \n\nI'm still looking for teachers willing to actually tackle a topic as exotic and esoteric as Quadrays.  \n\nI think calling them \"syntactic sugar\", another \"API\" to the XYZ coordinate system, removes any sense that they're a significant threat.  \n\nSure, Caltrop Coordinates comprise a door into the Synergetics meaning of \"4D\" but that's a topic more in art and architecture than in Establishment Mathematics (EM). \n\nUnless you're into investigating the philosophical foundations of mathematics, Quadrays might remain an idle curiosity, a trinket, or a harmless gimmick.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}