{
  "id": "2457390976697491459",
  "title": "Refugees / Camping",
  "published": "2016-08-21T15:22:00.001-07:00",
  "updated": "2016-09-09T14:19:29.656-07:00",
  "content": "I've been [writing on QuakerQuaker](http://www.quakerquaker.org/profiles/blogs/offering-refuge-to-the-world-s-weary) about the \"camping\" meme, more.\n\nBack on the infamous [Forum 206](http://mathforum.org/kb/forum.jspa?forumID=206&start=0), since tied off, but still publicly archived, I wrote a lot about \"scouting\".  They go together.\n\nLifestyles involving \"camping\" and \"scouting\" would seem in the cards for much of humanity, and has been normative for millennia.\n\n\"Outdoor lifestyles\" are marketed as voluntary activities to a privileged few.  Most campers are not in their refugee camps by choice.  Many were born there (like [Kiyoshi](http://www.grunch.net/synergetics/kiyoshi.html) on Heart Mountain).\n\nGiven advances in technology, \"living outdoors\" doesn't need to always invoke the same mental pictures, drawn from centuries gone by.\n\nI'm finding Twitter rather impoverished when it comes to [projecting positive lifestyles](http://worldgame.blogspot.com/2015/09/developments.html) that seem more like camping than city living.  Is this perception a consequence of whom I follow?  I don't think so.\n\nThe culture is fixated on driverless cars, drones, and AI-everything. Dreams from Silicon Valley.\n\nAs I express on QuakerQuaker, I'm not sure if we're still able to take on geodesic domes and spheres like we saw in Montreal in 1967.\n\nWe've not moved ahead in architecture that much?  We had a golden age, now passed?\n\nHowever, I'm thinking we could bring those back and do more experiments ala the Garden of Eden domes in Cornwall.\n\nThe gardening tenters work within, in [a climatron](http://mybizmo.blogspot.com/2015/04/climatron.html).  Maybe they have other shelters as well.  Living conditions are improving.\n\nUnless we show ourselves [these projections](http://mybizmo.blogspot.com/2009/01/about-habitats.html), they won't gel.  Showing ourselves only war scenarios prepares us for those, hardens our hearts.\n\nAs the Paul Allen Museum of Science Fiction in Seattle exhibits:  our fantasies about the future are more than idle entertainment.\n\nMy essay explores the notion of transplanting colonies en masse, but with a game plan.\n\nI'm not some pyramid schemer selling the notion of getting individually rich and retiring in Beverly Hills somewhere.\n\nA large camp of refugees in Costa Rica is determined to try its luck further north, and what I gather through WILPF in Ojai, and through my mom, that this camp is collectively projecting such a future.\n\nWould more movies help?  Who makes documentaries for refugees, showing them what the realities are.  Letting the world understand we're all in the same boat, not rich versus poor, might spark more of that spirit of innovation.\n\nAmerica is a nation of refugees already.\n\nHow might refugee camps be upgraded?  That's addressing the root causes of war and so is waging the war.\n\nIn suggesting we make camp life less miserable I'm not being altruistic or selfless, so much as strategic and tactical.  War talk is too moralizing though, as it preys on \"extreme criminals\".\n\nI focus on bases as well, a kind of \"camp\" though more about \"campaigning\".  We have refugees here as well.  The para-military encampments have their refugees also.\n\nRather than \"divide and conquer\" pitting \"vets\" against \"refugees\" or \"homeless\", we need to tune in the homeless vet refugee.\n\nSilicon Valley is seeing the writing on the wall.  We wanted a lot of automation to save ourselves from drudgery.  Semi-autonomous communities that do more of their own farming would do well with high tech.  So how do we get there from here? \n\n[](https://www.flickr.com/photos/kirbyurner/28502730574/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}