{
  "id": "7788465833979952009",
  "title": "Reignition",
  "published": "2018-12-12T19:51:00.002-08:00",
  "updated": "2018-12-12T20:13:08.632-08:00",
  "content": "In the process of dropping out of the middle class, upon dissolution of the partnership, owing to the death of the partner, I gave up heating the whole house.  I had a hole in the roof, and that took priority, as well as other bills.\n\nHowever, with a lot of company expected and Carol (mom) incapacitated, I was able to dedicate earmarked funds to a worthy line item:  resurrect the old Honeywell in the basement with a tune up ($229), a new master control board ($242.25 including labor) and of course fuel (200 gallons for a start).\n\nFortunately, this winter is being very mild, with dips into the 30s.  We've gotten this far with only a few rooms heated, two downstairs and one upstairs.  The kitchen and (usually) main living area stayed in the 40s at least.\n\nPortland, Oregon is close to snowy peaks, but is not itself at high altitude.  Our surrounding bedroom communities get more snow than the CBD (CBD = central business district, in case you didn't grow up in a planner family).\n\nThe First Call company inherited my account from Montag, which came with the house, as did the Honeywell, when we put money down on this place in 1995.  We had been renting just around the corner and despaired of again finding affordable digs we could invest in, as we knew then this was a trendy neighborhood. \n\nLaurie, Dawn's first friend in Portland, showed us a property just going on the market.  We lucked out.  I've lived here ever since.  Dawn (partner, DWA) died in 2007.  We still celebrate Hanukkah at Laurie's place.\n\nI tried to keep DWA (the partnership) alive, not realizing a partnership with one partner was totally an oxymoron.  IRS was seeing double.\n\nThe H&R Block down the street helped me back out of my mistake and fly solo as a sole proprietorship.  I continued with the DWA sourced DBA:  4D Solutions.  That part stayed by the book.  DWA held the business checking account.\n\nAround then I met LW who was looking to anchor a career as a Portland-based musician, having given up a whole lifestyle in Savannah, Georgia working in high tech as a manager.\n\nShe had a lot of good ideas for dropping below the poverty line and still surviving, having been saving all her money herself.  She was working at living on next to nothing when we met, and had a car she would no longer drive, because of her evolving ethics around Peak Oil.\n\nRazz had been totaled. I was driving a loaner at that point.\n\nFast forward, I got used to eating for free at Food Not Bombs servings, and also provided kitchen space, storage space, even freezer space, for the network, which meant having some inventory at home.  I'd fully entered the barter economy and started cutting back on any use of the furnace.\n\nHowever, somewhere in there, Steve Holden came to my rescue in putting my name in the hat as highly qualified to teach his Python 3 course, then in the making for the O'Reilly School.  I was hired, and for the first time since the 1980s I had a salary with benefits.\n\nI'd been winging it as an independent contractor, then partner, ever since.  Given Dawn was a skilled bookkeeper, that wasn't as hard as it sounds.  I could focus on programming for my many clients, and fine tuning my skills as a skills trainer.  My resume is online.\n\nBy the O'Reilly School (OST) closed its doors, some years later, I had paid to have my roof fixed and had helped a strong student through college (with help from her Quaker institution).\n\nI was looking at once again waving good bye to such middle class benefits as furnace oil heat.  Space heaters would have to do, and did.\n\nI don't know that I'll be able to sustain this highfalutin lifestyle.  Will Earthlings want to learn Martian Math the way I teach it?\n\nWill my productivity stay high?\n\nLast year at this time, unbeknownst to me in December, I was just weeks away from an emergency room visit and lots of concern about my longevity.\n\nA year later, my vitals are looking like those of an overweight sixty year old, mas o meno.  My next doc appointment is six months out, which says something I hope.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}