{
  "id": "8014437846503773367",
  "title": "Reminiscing About Conferencing / Software",
  "published": "2014-10-15T13:31:00.004-07:00",
  "updated": "2020-06-10T12:43:09.401-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157625315757940)\n\n:: Steve Holden, GOSCON 10 ::\n\nSpeaking of Quakers, a long term low priority topic (in the sense of non-urgent), is do we want to open source any of our PHP + MySQL [LAMP stack stuff](http://en.wikipedia.org/wiki/LAMP_%28software_bundle%29) through NPYM (where these are most used).  I'm suggesting moving slowly, in light of how specialized and esoteric our needs in the first place.  An adequate needs assessment has not been done.  Open sourcing is not the first step but a much later step in a longer process, as I have been underlining in committee / subcommittee threads.\n\nI was NPYM Registrar at least one year, passing the baton to Dave Fabik as I recall.  That was in my FoxPro chapter, a language since discontinued, though still popular in Prague they tell me.  Actually the USA is full of FoxPro adherents and I don't mock it in any way.  Serious applications that do heavy lifting were my bread and butter, from camp registration to food banking to hospital data collection work (in tandem with other products -- the camp stuff was in dBase not VFP (they're all called xBase in the lingo)).\n\nAnyway, that was before watching over [Steve's shoulder](http://worldgame.blogspot.com/2011/02/open-secrets.html) in the Open Bastion chapter, which saw several conferences produced, only some of which I got to be at and observe first hand.  [GOSCON](http://mybizmo.blogspot.com/2010/11/goscon-2010.html) was maybe my favorite because so esoteric.  I don't think I'll ever see one quite like that again.  That's where I first ran into Rami Kassab.  Then the DjangoCons were good, [ApacheCon](https://www.flickr.com/photos/kirbyurner/sets/72157632938572458/)... nothing less than top notch, though I'm not a judge of speaker quality, not being a web framework geek (FoxPro was thick client LAN-based, pre-[TCP/IP](http://controlroom.blogspot.com/2006/06/tcpip-for-gnubees.html) even).\n\nI'm a somewhat peripheral player given IT Committee has a rather narrow mandate at the moment and grand schemes to use Github for anything are far from front burner.  That's fine with me.  I'm more here to grease the wheels for conversation among the principal players than to press for any new agenda.  The wheels were already turning when I got here.  I'm just adding some lubricant and telling campfire stories from my software developer past (now I teach a language, a little different, yet related).\n\n[](http://imgs.xkcd.com/comics/python.png)\n\n:: from [xkcd](http://xkcd.com/) ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}