{
  "id": "1139849157868975915",
  "title": "Reposting from Newsgroups",
  "published": "2008-04-17T16:42:00.000-07:00",
  "updated": "2008-11-15T02:36:04.593-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgbx2dN3pPPJb7gntHPB6TK8jfK354TVKMIpkVB43bbQkcFsWLVsKLfU6U4NImVMf6xzbar-JF9J7DRaY4J4VPXwfLVryEekM5qkmHdSP1YZQfFagzpIRf6lPeVL5DOMWIj1MW3/s1600-h/crackdown.jpg)I'm watching the crackdown on Mormonism (old style) with interest as this has repercussions in diplomatic circles where the common accusation is North Americans moralize excessively outside their purview, but hey Utah is within DC's jurisdiction, as is Arizona and so on, so yes, an internal affair (China hasn't said much, officially, trying to set an example of holding one's tongue -- but then many tribal nations have officially seceded already, so it gets messy... basically a loose federation is all we've had to begin with, kinda fragile).Anyway, abuse of a minor by a predatory adult is definitely in need of a community response and the idea behind the police action was apparent lax enforcement in the face of an all too common domestic relations situation (not saying this sect was a major urban area, just that polygamy is an orthogonal crime i.e. isn't synonymous with child abuse in many cultures any intelligence community deals with daily, given the varied anthropological patterns humans have cultivated over the centuries and millennia, a real zoo I can tell you).Anyway, I think it's unfortunate in terms of timing that this became a full scale cultural battle against a well established North American lifestyle for some people, rather than a domestic relations case involving just a few bad apples, as now we're taking attention off human rights problems the USA had sought to capitalize on elsewhere, in order to regain some traction as a champion (vs. a hypocritical imperialist, a prevalent view today).Also, there seemed some real advances against prejudice against Mormonism in the recent presidential campaign. We knew this had always been a tension, so why make it a public spectacle now of all times? Wasn't there a smarter way to handle this? Maybe there'll be less of a hero attitude in future interventions of this kind?Hard to know, not my department.  I bet the FBI is abuzz with water cooler chatter about it all, given echoes of Waco (so far this is way way less ugly, but still ugly enough).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}