{
  "id": "5762089260293016745",
  "title": "Rescuing the Concentric Hierarchy",
  "published": "2020-03-25T21:17:00.000-07:00",
  "updated": "2020-04-06T12:30:43.031-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhyrErAIFg9KRSocO_PScURU1IEk8pEZta4oo1gIWCZKAK7K7AU_AkoKXwI1rOu1aA79WfWH9BmYqdf6Gje8Rgj7jpgVASUjyEwtAgBXmsFq4JFea_AJlFgRK6p9ILiysbyfkwi/s1600/anim2.gif)\n\nbeacon\n\nA question from a reader was \"what good is the concentric hierarchy beyond being like a pretty picture?\" referring of course to the Bucky Fuller geometry I yak about a lot.\n\nWhat if it is just a \"pretty picture\" meaning a sub-language featuring Platonics, their combinations and duals, with translated \"volume\" and \"area\" concepts to equivalents computed slightly differently?\n\nBy \"sub-language\" I mean a subclass of language semi-intelligible to other non-native speakers. Mathematics would be a set of many such sub-languages, but so would be various shoptalks and philosophies that may contain maths, but aren't themselves purely maths.\n\nSynergetics is one such sub-class language, one of those philosophies that contains a geometric framework, namely said concentric hierarchy with a rhombic dodecahedron of volume six and so forth.  The pretty picture.\n\nShould we teach a philosophy containing a pretty picture?  Is that a question about moral imperatives?  Is this an \"ought\" question?\n\nPerhaps it's more like a question to tour guides.  We discover this abandoned old section of the museum and wonder if we should open it to the public.\n\nThe incentive to open might be to bring in more foot traffic, but what if that's not really a goal?  One assumes a museum has a sense of self preservation, but \"museum\" might not be the right model.\n\nI suppose the counter-question is:  what have we got to lose in teaching it, given it goes down smoothly for the most part and needn't take a huge amount of time?  Why not swallow the pill, if it does no harm?\n\nThat's probably the question then.  We're still trying to judge harm.  Or is it that we've swallowed the pill already, and now are finding some of our practices coming under a different kind of scrutiny?  The ordeal of morphing to adapt to the cosmos is not one Synergetics begets, so much as anticipates.\n\nI think if we'd swallowed the pill already, we'd see more symptoms, such as more Youtube clips featuring said concentric hierarchy.  The evidence is more that a tiny subculture keeps the sub-language alive, like one of those native or indigenous languages on the verge of extinction.\n\nBe that as it may, the question remains:  should the anthropology or sociology museum allow or encourage tourism in this area?  Or maybe it's an art museum?  Does the concentric hierarchy constitute art?  We asked the same questions around Flextegrity.  That Tensegrity is art, and widely excepted as such, is encouraging.\n\nI'm thinking Synergetics, and the pretty picture it contains, \"hangs by a thread\" and that thread is Tensegrity.\n\nGiven the art world has accepted the latter, there's a good chance it will accept the former, in due time.  In fact we've seen signs of that already, in exhibits subsequent to the publication of Synergetics, including notably Lattice Gallery in Portland, Oregon, October - December on SE Broadway.\n\nBut also at the Whitney in New York, and the [Chicago Museum of Contemporary Art](https://flic.kr/p/6bm8SW) (2009).\n\n[](https://www.flickr.com/photos/kirbyurner/albums/72157616066135225)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}