{
  "id": "7079800305501009571",
  "title": "Resurgence",
  "published": "2016-02-04T22:35:00.002-08:00",
  "updated": "2016-02-04T22:55:25.672-08:00",
  "content": "I think a lot of us are putting down our soup spoons to listen to NPR hype the future of [women in combat](http://worldgame.blogspot.com/2015/10/women-in-combat.html) roles, a new freedom and liberty they've long been begging to have.\n\nNow that women have equal rights, is the premise, it's time for them to start paying the ultimate price more often.\n\nThe Selective Service must be feeling the pinch of only half the should-be-eligible population getting registered and this media campaign was long in the making.\n\nPatriotism, common code words (they kept saying \"existential\"), and stellar examples of that  unquestioning attitude that makes a good soldier, get strutted out on what sometimes gets called \"liberal radio\", and we pause to listen, noticing this new voice of a next Pepsi generation (perhaps coached by some oldsters).\n\nOf course the US is composed of diverse ethnic groups, not all of whom celebrate combat roles as the higher service.  Diplomacy takes a lot more skill and isn't for everyone either.\n\nWhen it comes to \"special operations\" the military has no monopoly and what's more, never will, as thinking and acting in that unquestioning way exacts a price.  But we have real talent at the top, that's true too, so best of both worlds then?  Too pollyanna?\n\nAnyway, those women who've been chomping at the bit to prove themselves in this all American way (since before the Revolution at least) now have reason to celebrate.  I advocated years ago we give them their own submarine (fleet?).\n\nWhether some possible future world will have the smarts to not always be holding a gun to its own head (\"weapons of mass suicide\") is debatable, but we may still hope.  Submarines without WMDs are not unthinkable.  Women might prove braver in that sense, less self-destructively trigger-happy?\n\nThe spin is this is a victory for feminism.  The real question is are we seeing equal pay for equal work in a statistically meaningful way?\n\nIf women are still getting the short end of the stick [in civilian society](http://controlroom.blogspot.com/2006/07/war-story.html), yet are being rushed to the front lines, that bespeaks of human rights violations.  I look forward to the analysis.  Women and minorities have a long history of abuse in America.  I recommend Kindred by Octavia Butler on that score.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}