{
  "id": "8475566185507305836",
  "title": "ReThink911 @ HGP",
  "published": "2015-03-22T12:06:00.003-07:00",
  "updated": "2023-11-11T10:19:47.430-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157651439137916)\n\nI learned from Dr. DiNucci that David Fura would be presenting on 911 at Friendly House, addressing [Greater Humanists of Portland](http://www.portlandhumanists.org/content/world-trade-center-911-cover).  Given local Quakers have been recently joined [by David Chandler](http://controlroom.blogspot.com/2014/11/wanderers-2014114.html), scheduled to speak at the meetinghouse on April 12, as a part of our Peace and Social Concerns program, my scoping out this talk seemed apropos.  Fura cites Chandler in his slides and plays the video of David, identified as [with AAPT](http://worldgame.blogspot.com/2010/07/physics-conference.html), asking the NIST guy a question.\n\nThe National Geographic and Popular Mechanics efforts at debunking get tackled in Fura's talk.  If thermite is not useful in demolition, as NGS alleges in its own attempt at debunking the Truthers, then how does one explain the patents for using it that way?  I forget what the Popular Mechanics thing was about, however these debates are all on-line so feel free to tune in.  A lot of people are participating in these discussions, not just the Humanists and Quakers.\n\nThe ReThink911 agenda is all about casting doubt on the official NIST reports, especially around WTC7, the building that (even officially) went into free fall, officially because of fires weakening its structural members, but unofficially and off the record thanks to preset charges i.e. because of controlled demolition.\n\nIf NIST is right -- but it won't release its computer model -- then it has discovered a new way for skyscrapers to fail due to carbon-based fires never before contemplated and never before or since seen.  The Truthers remain highly skeptical of the NIST theory, wherein the numbers keep changing.  Both sides appear to use science to support their claims.\n\nMy question, as a matter of logic, is how one gets from the apparent fact of \"controlled\" demolition to the \"uncontrolled\" events of 911.  Buildings of that size and stature should be designed with demolition in mind right from the start, [as Paul Laffoley asserts](http://911blogger.com/news/2007-12-01/wtc-architect-reveals-integral-demolition-charges) was the case with these 1970s monsters (which I admired), losing money and ready to be replaced by the 21st century.  With what we don't know.  [Laffoley's own design](http://controlroom.blogspot.com/2007/08/esozone.html), conceived after 911, was for a Gaudi-like building, part memorial, more [conceptual art](http://paullaffoley.net/writings-2/homage-to-gaudi/) than a blueprint at that stage.\n\nCould these buildings have been scheduled to come down anyway, just not as a result of terrorism?  Was someone \"pushing the button\" a part of the terrorist plot all along?\n\nIf demolition were integral to the design, then the question becomes at what point in the timeline were charges added.  Might there have been a schedule driven by financial concerns unrelated to troop movements in the Middle East?\n\nAs expected, once off the official narrative, it's somewhat of an inkblot test as to whom we think is really responsible.  People who don't read a lot often think of Neocons and the CIA as the same bunch, whereas [from other angles](http://controlroom.blogspot.com/2006/01/power-of-nightmares-movie-review.html) one sees open hostility, or at best rivalry between these two camps.  Just saying \"bad guys did it\" doesn't really get us anywhere.  The devil is in the details.\n\nThat the CIA is trying to use the Truther Movement to make Bin Laden look like a patsy is consistent with [past cover up](http://mybizmo.blogspot.com/2006/08/blaming-castro.html) failures.  Iraq would be more like Cuba by this analogy, Oswald being cast as pro Castro and by extension a Soviet spy.  Hadn't Saddam plotted against Bush Sr.?\n\nHowever analogies with [the JFK chapter](http://controlroom.blogspot.com/2013/05/murder-mystery.html) only go so far as in this case there's really no doubt about the jet airplanes hitting the two buildings, WTC1 and WTC2 (not WTC7) -- except amongst odd-ball extremophiles.  In Oswald's case, it's rather doubtful he ever fired that rifle, or killed [Officer Tippit](http://en.wikipedia.org/wiki/J._D._Tippit) or any of that.  He was just following instructions, up to where he tried to escape his fate as the fall guy, by explaining his innocence to the police.  Jack Ruby had to silence him.\n\nWhat do the ReThink911 people imagine would have happened if only the jets had hit?  What would have been the scenario, absent any controlled demolition?\n\nThe jets hitting was enough to get people jumping off buildings.  Hundreds if not thousands [had died already](http://mybizmo.blogspot.com/2014/11/out-of-clear-blue-sky-movie-review.html).  Clearly these were nightmare situations, with firefighters bravely walking into them.  If the goal were to provoke a war with Iraq, per the Neocon agenda, wouldn't this terrorist act have been sufficient?  Why would anything potentially even more risky be required?  At least one of the Humanists asked about this during the Q&A.\n\nWith no demolition system in place, would the towers still be standing today in 2015, or would they by now have been demolished, WTC7 included?  After that day, they were totaled, unsalvageable no?  So we'd have demolished them by now at least, maybe even without the planes hitting.  The Twin Towers were close to worthless by 2000, were white elephants, according to many accounts.  As soon as we had finished rescuing all the people, they would have needed to be destroyed, no question.  Repair would have been infeasible.\n\nHowever Fura thinks the WTC towers may have been [too full of asbestos](http://www.asbestos.com/world-trade-center/) to make their demolition practical at any point.  This would point to a major design flaw as how does one [replace buildings](http://mybizmo.blogspot.com/2015/03/insurgent-movie-review.html) of that size once they've outlasted their lifespan?  How would one remove towers of that stature except by controlled demolition?  Or is the theory that anything that big has to last forever?\n\nDo we suppose architects are off the hook in needing to think about a building's full life cycle, including its eventual destruction?  I expect the buildings would have needed to come down later, actually quite soon, WTC7 included.  In fact, once the Twin Towers where down, why keep WTC7 around even a day longer?  Everyone was out by the time it imploded.  Why not?  It was worthless by then.  Just more rubble to clean up at that point.  Civilians had cleared the area.\n\nWhat I don't know is how many additional lives might have been saved had the firefighters been given more time with their hook and ladder trucks etc.  People were already jumping to their deaths.  The additional numbers that might have been saved is a difficult calculation once you factor in the number of firefighters who might have died as a result of heroism, trying to rescue people from the two towering infernos.  Lots to think about there.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}