{
  "id": "7175939480954309877",
  "title": "Revisiting Intelligent Design",
  "published": "2020-11-28T17:54:00.008-08:00",
  "updated": "2020-11-28T18:29:43.603-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/27963484878/in/photolist-2i8FX68-JB3aPC-eetAus-eetBnf-dMABAZ-cMa4yG-cMa3FE-bCubBD-9KDZDq-9f5APy-939SLk-7bwVGG-6eHu8q-68oWDe-651h16-651i3F-6CyKVZ)\n\nA researcher on one of these Facebook groups I'm monitoring, brought up Intelligent Design (ID) innocently enough, only to be reminded of the religious wars this shield, or logo, was a part of.  \n\nHowever, far from being a conversation stopper, that's where my interest picks up, as I'm looking for a graph (in the sense of nodes and edges), a map, explaining the battlefield.  What other shields or logos played a part, and as friends or foes?  \n\n\"Intelligent Design\" was friendly to whom and shunned by whom and so on?  I'm interested in that stuff. \n\nNot that \"shunning\" is the only way to counter a devious foe.  Perhaps we belittle or dismiss with a show of force.  Sometimes in battle, we run full on, like those crazy braveheart guys in the movies, swords drawn. Not intelligent at all apparently.\n\nDitto for the 911 debacle. Just show me the forks and branches. I'm not looking for the truth, not at first. Did the \"no planes\" branch fizzle, or merge?  It's like on Github.  I'm looking for the Git history.  Schisms. Regroupings.\n\nWe the Wanderers, a group in Portland, had our paths crossing ID's through Terry's interest in widening the platform. Terry helped us keep the Pauling House a center of intellectual activity in our Asylum District here in Portland (Odonarotoop)\n\nI'd categorize Terry, president of ISEPP, as anti-scientism, which is not at all the same as anti-science.  However Terry is also anti-science, but from a relatively undefended angle: engineering > science.\n\nThe engineering mindset doubles back on the intelligent design mindset.  Then we look around and admit, our best science and engineering is not yet up to either explaining or recreating the technology around us. Nature's tech is higher than ours.  And in saying \"ours\" just who are we talking about exactly.  Programs?\n\nBucky Fuller [link]:\n\nIn its complexities of design integrity, the Universe is technology. The technology evolved by man is thus far amateurish compared to the elegance of nonhumanly contrived regeneration. Man does not spontaneously recognize technology other than his own, so he speaks of the rest as something he ignorantly calls nature.\nLet's agree if there's a vector towards a kinder, gentler humanity, with higher intelligence to boot, then there's an extrapolation of that vector, along which we'd like to move. Saying God wills us to keep moving along that vector is another way of saying we acknowledge a gradient.  \n\nWe feel under some time pressure to finish the work, might be another way of putting it.  \n\nA scientist might easily argue such a \"teleological sense\" is purely glandular (hormonal) and has its analogs in other nonhuman limbic systems.  Another \"god gland\" bites the dust.  Is that what just happened?\n\nFrom an intelligent design point of view, the association of a vector gradient with a molecular processes is not considered some reductionistic objection to an empirical claim, but more as reinforcement for our thinking: that even lizards feel it too, the need to better their lot in life, if not to achieve management level responsibilities, as some say the angels have, and to which some humans may aspire.\n[](https://en.wikipedia.org/wiki/Design_science_revolution#cite_note-5)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}