{
  "id": "6875777807830068816",
  "title": "Revisiting Landmark",
  "published": "2015-08-28T18:43:00.001-07:00",
  "updated": "2015-08-31T19:06:11.438-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/20777325778/in/dateposted-public/)\n\nI went a step deeper with my re-engaging with est as we called it, creating a corporate subculture around \"what is\" somehow.  That subculture had momentum and is [branded as Landmark](http://controlroom.blogspot.com/2015/08/at-landmark-event.html) today, with [landmarkworldwide.com](http://landmarkworldwide.com/) for a website.\n\nDuring my conversation with Adam before our event, we talked about Landmark Forum being offered for free in Detroit for a period.  I'll dig into that a little.  I mentioned [being in Detroit](http://mybizmo.blogspot.com/2014/08/visiting-downtown-detroit.html) not so long ago, and got into my rap about skyscrapers having a natural lifespan.\n\nAnyone building a skyscraper today needs to consider its life cycle and plan ahead for its eventual demise.  Those who simply \"build for the ages\" and leave it entirely [to future generations](http://mybizmo.blogspot.com/2015/03/insurgent-movie-review.html) the problem of retiring and recycling the monster, are not conceptualizing their responsibility as architects.\n\nThe office is just off Barbur and in miss-dialing the address, let maps.google.com take me to the parking lot of St. Clair, where my friend Matt went to elementary school.  This had been my neighborhood.  Even with heavy traffic, and that misinformation, I managed to reach the venue on time, which had been a core concern.  As it was, I beat the party from Eugene by about 15 minutes, but then Eugene has no Landmark office.\n\nI was treated like an equal by these democratic and egalitarian Americans, though it helped I was an est vet, which means I was already somewhat on the same wavelength, at least in their minds.  Sara gave me a tour of the suite.  The 3 PM event she came for was cancelled so we filled the time rehearsing an Introduction to the Landmark Forum session, Sara leading it, with the room captain insisting Sara repeat a few segments, taking advantage of our time to practice together.\n\nI had my exercise routine in the not working section of the workbook, then created for myself the possibility of already being quite wealthy, in terms of access to copious learning materials with which to stock [my Coolpad](http://worldgame.blogspot.com/2015/04/olpc-oppa.html) before hitting the gym.  In no way should [the Elliptical](http://worldgame.blogspot.com/2015/08/hsf-2015.html) be a doldrums or boring in any way.  I realized my being wealthy could be a satisfying solution to several not-working areas before the evening was done, so yes, I got some value, just how much remains to be seen.  \n\nAlthough I stayed through Part 2 (after the mock break), I had already chatted with Nathan and the others about maybe reviewing the Forum in Japan or some other faraway place.  The anthropologist in me wants to study inter-cultural events more.  Like are there Forums not in English, with English only in translation?  I see that there are.  Given [my focus on i18n](http://worldgame.blogspot.com/2014/07/i18n.html), such questions come up for me a lot.\n\nUpon leaving the Landmark office, I went straight to [Humdinger](http://portlandhamburgers.blogspot.com/2007/09/humdinger.html), a milkshake place from my youth.  He had butterscotch this time!  Also, since I'd parked in the lot of an adjacent store, a [Tobacco Town](http://tobaccotown.com/), I felt duty bound, plus curious, to check it out and ended up with the above depicted cigar.  The cigar meme goes with the wealth meme, as a part of the stereotype / memeplex. \n\n[](https://www.flickr.com/photos/kirbyurner/20925759002/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}