{
  "id": "8375833014628732365",
  "title": "Revisiting the Heartland",
  "published": "2016-05-06T21:18:00.000-07:00",
  "updated": "2016-05-11T11:30:15.868-07:00",
  "content": "A year ago at this time, I was still with the O'Reilly School, and was lucky to get sent to the US Distance Learning Association (USDLA) [annual conference](http://controlroom.blogspot.com/2015/04/usdla-keynote.html) in St. Louis.  Before the conference started, I rented a car and drove to Richmond, Indiana, via Champaign, Illinois, to visit my daughter.\n\nThis year, I'm following much the same script, minus the conference, to be at Earlham College for Tara's graduation.  I rented a car at the St. Louis airport, visited with greyhound and cat-owning friends (Afghan restaurant!), then headed to Champaign, where our code school used to have an office.\n\nThe original school was started by fans of [the late Jerry Uhl](http://www.math.illinois.edu/People/memoriam_uhl.html), a professor at the University of Illinois, based in Champaign-Urbana, and was then purchased by O'Reilly Media and repurposed to be a code school.  I joined the faculty after this purchase, as a Python teacher, when the founding principals had already moved to Sepastopol.\n\nMany memories came flooding back once I was back in the mid-west, reminders about the cultural currents, the geography.\n\nI imagined being on assignment for National Geographic, visiting [a master upholsterer](http://www.news-gazette.com/news/local/2003-04-20/ui-furniture-shops-foreman-recently-retired-still-upholstering.html) (and his apprentice Lorri, my former supervisor), a new microbrewery ([Triptych](http://triptychbrewing.com/)), a food cart ([Dragon Fire](http://dragonfirepizza.net/)) serving oven-baked pizza.  I've been greedily snapping pictures.  St. Louis has its special Provel cheese and Fleur d'Elise, in addition to [the Arch](https://flic.kr/p/GtwCeS) and [Climatron](http://mybizmo.blogspot.com/2015/04/climatron.html).\n\nA most important technique, when it comes to cultural immersion, is to surf through radio stations, listening especially to Country and Christian genres, in addition to talk radio.  The freeway miles fly by faster with the radio on.\n\n\"The Donald\" had just won the Indiana primary a few days before I arrived, with Cruz and Kasich pulling out of the race to become the Republican Party nominee.   Tonight, he's in Eugene, Oregon and [Lindsey](http://controlroom.blogspot.com/2015/08/wanderers-201685.html) left me a garbled voicemail (lots of crowd noises in the background), reporting from the anti-rally, as she's in Eugene as well, freshly returned from Florida, in route to Nepal.\n\nA year ago, when I was attending the conference, those big earthquakes hit Nepal.  Lindsey was in Kathmandu at the time, staying in a fifth floor guest room.  She's heading back.  When her voicemail came in from the anti-rally, I was in the process of meeting my mom's plane from DC.  Tara and I drove to the Dayton International Airport, in Ohio, to meet her.\n\nCarol has been on the road for many more miles than I, earlier this year going from LA to Seattle by van, and more recently from Atlanta to Cape Code, Boston, New York and DC.  Doing all the driving is Ellen Thomas, a long time activist very focused on the obscure [House Bill 1976](https://www.congress.gov/bill/114th-congress/house-bill/1976), introduced in 2015 by Rep. Eleanor Holmes Norton [D-DC-At Large].\n\nThe newspaper I read over breakfast in Decatur was not buying into \"Islamophobia\" and was encouraging more of a live and let live attitude. Refreshing.\n\nTara had been looking forward to a sushi extravaganza, in celebration of her graduation with honors in Physics and Philosophy, with a minor in Computer Science.  We enjoyed Yamato, with her friend Kristin (not a seafood fan, but other dishes available).  What a feast!  Congratulations Tara!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}