{
  "id": "1043823555731688238",
  "title": "Reviewing a Review",
  "published": "2008-08-15T08:32:00.000-07:00",
  "updated": "2011-01-17T20:15:51.148-08:00",
  "content": "[ originally Message #42826 in Synergeo, dated yesterday, typos fixed, links added ]So I'm looking back at an American Scientist, Vol 76 #1, Jan / Feb 1988, where this guy [Branko Grünbaum](http://www.math.washington.edu/~grunbaum/), University of Washington, excoriates (disses) Amy Edmondson's A Fuller Explanation.First, he doesn't like that she uses his \"multi-digit designations of chapter and verse\", a cheap shot at his and Applewhite's bothering to provide a [convenient referencing system](http://www.rwgrayprojects.com/synergetics/toc/toc.html), common in philosophy since Wittgenstein's [Tractatus](http://www.gutenberg.org/ebooks/5740) and before.But mainly he regurgitates the conventional chatter that Fuller, although \"an original... inventor\" (token butt kissing) is devoting the later part of his life to \"pretentious pop philosophy devoid of any basis or merit\". Ahhh, a verdict so soon...So of course he can't abide Amy's attempt to use the currency of his inner circle, the Birkhäuser name, the academic claptrap of his smug professoriate. He takes the publisher to task, and the editor. Tsk.The logical fallacy here is begging the question -- of whether Fuller was doing legitimate philosophy with this particular anti-Bucky team rushing to premature judgment, quickly closing the door on further study in academia once he was safely dead and gone.That plan hasn't worked out though, as Fuller had some real and lasting contributions to make (duh). In retrospect, one might conclude Amy stretched too heroically to make a bridge to a dying culture, but one can't blame her for at least giving it a college try. I admire her gumption.Grünbaum is right about the triakis icosahedron though, better surface to volume ratio than icosa, because closer to spherical. And yes, we keep doing everything we were doing around spheres, just note that we're happy enough with the physical ones, don't need the \"perfect\" abstractions really i.e. \"approximate\" is more our style (copying nature's perfection, not imaginary perfection -- JB and I debated this for quite awhile I recall (the meaning of \"perfection\", not required we all agree)).Kirby",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}