{
  "id": "4615018409402568159",
  "title": "Rising Living Standards",
  "published": "2018-02-28T22:35:00.001-08:00",
  "updated": "2018-03-01T00:03:21.024-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjxiiQ4xTe_2y7gHSVHzSJTYYIkH-oBNVrjVkxt9PphRTnH1wTG4zUAE4jbagHaqWP4NixPE4Ea8r5tFCiFWgF5-ZK4Ff7IwORIgWJUc0j2i4w4yrjQsugMXHBXSkktdDOslB-3/s1600/hoping2.jpg)\n\nI'm talking selfishly about mine (my living standards) during some of this post.  Earlier though, at Wanderers, Linus Pauling House on Hawthorne, I spoke with a former World Game player about Ho-ping (\"Hoping\"), a book by Medard Gabel regarding [feeding the world's refugees](https://www.huffingtonpost.com/eric-holt-gimenez/world-hunger_b_1463429.html) (a term that's all embracing for tonight's purposes).\n\nMy lifestyle has been abetted by Youtube and other services, such that I'm able to engage in scholarship to a degree even Princeton could not provide in the film strips dimension.  Firestone and other libraries, had way more books.  I spent time in the Math Library as well.  But Youtube is a brilliant collection, getting better every day.\n\nI'm wondering why anyone would waste time in a high school library if they could stay home and take advantage of the comforts of a home with internet access, a maker space... many privileged kids seem eager to herd into schools when the best resources sit unused.  That's a lot of driving, a lot of gas.\n\nAnyway, I won't angst about it.  Schools are important for a lot of reasons and a healthy combination of homework and schoolwork is what we're all after, where work is a kind of schooling, where we continue learning, lifelong.\n\nEd Lansdale and Averell Harriman were two of the interview subjects I was spending time with recently.  General Lansdale, like me, lived in the Philippines during a difficult transition (I was there under martial law).  He had two tours of duty in Vietnam, at a time when imperialists like Winston Churchill were eager to return to the status quo ante.  The US did not yet think of itself as a colonial power, but was learning to move in that direction under the tutelage of former imperialists.\n\nAverill Harriman likewise had responsibilities in Indochina, and the Youtube I watched focused on his views following World War Two.  He wasn't eager to see his government assume imperial responsibilities. Lansdale didn't lean that way either.\n\nThe Wanderers guy and I talked about the Fuller Centennial in San Diego, organized by GENI.  We don't hear a lot about GENI these days, the Global Energy Network lobby.  This set of engineers wants to continue with the global electrification program, and not just in the sense of One Belt One Road.  These blogs talk about it some:  the Bridge to Nowhere project, all about rural electrification along the shores of the arctic rim.  Alaska would be investing in HVDC by now had GENI not been derailed by neo-somethings.  Well, maybe not, who knows.  I'm not the electrical engineer in this picture.\n\nWorld Game was a way of reframing the global predicament in such a way as to reward syntropic strategies over entropic ones.  The thermodynamics of thermonuclear war are such that game theorists with a more evolved understanding moved towards deescalating while fomenting global business, a competitive game with collaborative elements.\n\nHowever the left behind nationalists did not necessarily see where this logic was taking us and reacted by demanding elective wars.  Which they got.  The reframing was not 100% effective in other words.  We may debate whether it was effective enough.\n\nJust a few minutes ago, I was sucking stock market stats through a free API, the better to plot them using open source tools.  If you've managed to hop on board the bandwagon, you have the ability to harness machine learning to your own ends, which may be quite benign.  I've used the LinkedIn platform to cue venture capitalists to their opportunities, when it comes to making philanthropic giving into an arcade style sport.  We already have Video Poker and such attractions.  Gambling is legal if the beneficiary is a sovereign state.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}