{
  "id": "1893396981236027524",
  "title": "Russiagate Recap",
  "published": "2020-08-18T11:30:00.004-07:00",
  "updated": "2020-08-18T16:11:49.500-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/32858717248/in/album-72157705694241705/)\n\nMe on Facebook (today), hyperlinks added.The CrowdStrike narrative included in the Mueller Report is cleverly crafted, regarding timelines, such that Trump's public speech, calling on Russians to find those missing Hillary emails, actually came to GRU's attention in real time, and there and then they got to work on the phishing expedition that led to Podesta's emails appearing on Wikileaks.\n\nHow did CrowdStrike know all this, and more? What forensic evidence was presented to the grand jury? We were never made privy to any of this, and the story sounds rather far fetched without evidence. Putin offered to let the FBI do some recorded interviews of any GRU agents named in the report, if, in return, the Kremlin could do some taped interviews of Browder, the UK oligarch behind the Magnitsky Act, the guy who touts himself as Putin's greatest enemy.\n\nTrump thought that sounded like a good idea, as he saw a path to exoneration (this was before the Dems went for impeachment, only to be stopped in the GOP Senate). He was excoriated of course, because it sounded like he trusted Russian intel to get to the bottom of the story more than he trusted the purveyors of the Steele dossier (British meddling and collusion was never far from the surface).\n\nCrowdStrike, for its part, has not done anything impressive to substantiate its case. On the contrary, the word on the street is they don't really have the evidence to substantiate their version of the Guccifer 2 chapter. That's why the common wisdom, as I sense it, is that Russiagate fell apart and re-stoking it with new fuel has become an important priority of the anti-Trump movement. I'm thinking Trump has done enough and should go play golf in Mar-a-lago, but I don't buy that the GRU played an integral role in the Wikileaks chapter. Not until we see some proof, then I'd be willing to reconsider.\n\nI support the repeal of the Magnitsky Act. I know Biden and his cronies are all about pushing Ukraine into NATO and trying to \"win the cold war\" all over again, but in my book, the USSA lost Cold War 2. That's over already.https://www.axios.com/senate-intelligence-russia-interference-971619a8-a806-470a-9de6-1416220ab35b.htmlI've been reading the report. Mostly it seems to trace to the same indictments found in the Mueller Report. It repeats the allegation that GRU officers took their cues from Trump when he said in a public speech that the Russians should find Hillary's emails. The Russians then set about spear phishing in response, got Podesta's emails among others, and turned everything over to Wikileaks? Proof?How exactly this story is proved is not discussed. Rather, it's sufficient in the legal sphere to make allegations, make any evidence secret from the reading public, and then later quote these allegations as further proof. If one is skeptical, as I am, including based on counter-evidence and alternative narratives, then there's a nagging feeling of illusionists at work. This doesn't seem like forensic science.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}