{
  "id": "8956443420174369818",
  "title": "SA: ClassNotes 2008.5.3",
  "published": "2008-05-03T14:43:00.000-07:00",
  "updated": "2011-06-26T22:21:52.931-07:00",
  "content": "Per usual for this class, I showed [Warriors of the Net](http://worldgame.blogspot.com/2006/11/more-pythonic-mathematics.html), in which our warriors are these intrepid little IP packets, like trucks inside of tubes, our Internet.We went over some elementary trigonometry so these students could better appreciate how a Pythonic expression like \"[(cos(radians(n)), sin(radians(n))) for n in range(0, 360)]\" is actually making a list of points in a circle when plotted.Most of our time was spent tweaking [vfun.py](http://www.4dsolutions.net/ocn/python/vfun.py), some beginner examples of using VPython for fun (and [for learning](http://mathforum.org/kb/thread.jspa?threadID=1737367&tstart=0)).Having hit some high notes around a Biotum class on [day 1](http://controlroom.blogspot.com/2008/04/sa-classnotes-2008419.html), we're mostly settling for function level syntax on day 3, practicing basic flow:  if and loop statements.Named arguments may be passed in any order, or dropped entirely given defaults, which is what keeps our VPython functions (for cylinder, for sphere... for pyramid) so simple and sane.We played with my [jungle.py](http://www.4dsolutions.net/ocn/python/jungle.py) some though, just to keep the flavor of more object oriented code (foxes eating bunnies in this case -- no visuals).I downloaded and installed [wxPython](http://www.wxpython.org/) with demos while students worked on their projects, for an impromptu segment on widgets programming, having gotten some GUI-related questions.  We also looked at [Pygame](http://www.pygame.org/) a little, but both have a steep learning curve, so best to already know Python.We also toured Sourceforge a little, talking about how geeks collaborate on new code, share projects.  That's not really the focus of this course however.  Perhaps one day soon, Saturday Academy will offer classes on CVS, Mercurial, Bazaar... on Apache.So many topics, so few Saturdays.[IronPython](http://www.codeplex.com/IronPython) 2.0 beta 2 is out today.  I'm downloading for testing.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhmzsGujbyfR4LMSHrHVy_037yOWAdYMcPrDxw49-pvWlKKz03mH2ind1sVB3S3kdSlB-7IgtLXilFBIWvKiIz4TZB9YQyzHJMRvMp2By6XoOxxxGj-27RC8VaMILL3Q-EOIOU7/s1600-h/ironpython2b2.jpg)IronPython 2 on .NETfree with source codeper Microsoft Public License",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}