{
  "id": "8046647918303335172",
  "title": "Salons Dot Net",
  "published": "2009-01-23T07:03:00.000-08:00",
  "updated": "2009-03-06T23:46:42.498-08:00",
  "content": "Some holdouts still think the printed page is the best investment, and I do enjoy my glossy magazines, bought [the new Vanity Fair](http://www.flickr.com/photos/17157315@N00/3227167877/) at Powell's yesterday, Tara getting something in metaphysics.However the scribes were doing illuminated manuscripts while dreaming of [Prospero's Books](http://mybizmo.blogspot.com/2005/12/prosperos-books.html), much as Leibniz was dreaming of machine executable languages.  They were enjoying a thriving economy while prefiguring a future one, ours, based more around LCDs, with more economies to come.In the lore we study as geekoid Americanos, [Romany Marie figures in](http://en.wikipedia.org/wiki/Romany_Marie) as one of our early CSN queens.  She helped [Bucky and Isamu](http://mybizmo.blogspot.com/search?q=Noguchi) find one another, making history.  Philosophy and coffee shops have an old relationship anyway, some saying those were the beans Pythagoras raved about, in terms of boosting his IQ.  I don't believe it.The printed page stays important of course, nor is there a line between those, and the illuminated screen versions.  We're talking a kind of isomorphism here, with digital storage actually more secure, assuming a high tech civilization able to perpetuate itself (a lot to assume, but it's what the book people were aiming for, so it's not like we're abandoning their dream of literate descendants).I'm awake early again, chipping away on my [slides for Chicago](http://www.flickr.com/photos/17157315@N00/3219641913/sizes/o/), fixing those typos.  We're gonna slog through a pre-college \"curriculum of tomorrow\" (or visit an \"other tomorrow\" as Esozone put it) but not by treating ourselves as if we're on some remedial track.  No, we're busy professionials, here to have fun. Experience counts for something.  We'll share lotsa lore.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgqH-7N8PZMSHtYVuHJKHbqviE3lgpnaabCY9Cj-gw9gFZAQUxaT8z_ylmqbiRDScR-CjY9EeQNuRb6B8aXnqUmAd0pNplezMeAE2AcNS2BC_cnQNCldjO13-woBx5Qkz84Gc6Q/s1600-h/other_tomorrow.png)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}