{
  "id": "9111547561004586753",
  "title": "Samsara (movie review)",
  "published": "2012-09-16T01:00:00.000-07:00",
  "updated": "2014-03-29T00:12:31.470-07:00",
  "content": "Samsara is the right title for this film and it is worthy of its ancestors, Baraka being the immediate parent.\n\nIn some ways a guided meditation, a mood inducer, but without direct preaching.  One might say \"a God's eye view\", but a God with a penchant for close-ups.\n\nSome viewers will see the movie being more judgmental than others will.\n\nThe factories and places of worship were willing to share their interiors.\n\nThis is not a trivial hand-held tourist camera, one gets permission and talks to those whom one wishes to film.\n\nThe direct stares into the camera do not bespeak shame, regardless of surroundings or occupation.\n\nWe move from temples, to cities, to factories, to supermarkets, to a prison, to a casket store, to a funeral.  We look at the desert, a lush waterfall, glaciers.\n\nWe stare back at our own image, as viewers, at our life and our death.\n\nI could see the very temples depicted showing this very film on their newly installed hi-def LCDs.\n\nThe film has several themes.\n\nOne them is the exquisite precision of nature, its repetitiveness.  Humans fit right in, and synchronize precisely, so much a part of the mechanism.\n\nAre we but mechanical dolls in a vast machine?  The movie hints at this question but then metaphors fail as nature has no real counterpart.\n\nThe Buddha's gaze frames Samsara in some ways, his eyes etched with red to show not ferocity so much as compassion, though these are not unrelated.\n\nI'd been hungering for views of Mecca, I later told Melody and Kelly who was visiting, fresh from working gate crew at Burning Man.  I'd watched a few Youtubes.  This movie really fed me, with clear moving images.\n\nIn general, I was grateful for all the updates.  I used to get around more, but now I mostly stay in Portland.  Seeing these views of Planet Earth, carefully crafted, state of the art, is a privilege.  Glenn's Easy Like Water was a joy in that way too.\n\nHumans have been at this game for quite a long time and seem eminetely capable and adaptable.\n\nI'm all for more movies in this genre.  I've always circled them as \"[required viewing](http://controlroom.blogspot.com/2009/05/flash-back.html)\" (in the sense of a syllabus, course material) for General Systems Theory savvy.\n\nYou get a better more realistic handle on our institutions when you get to meditate in this way, with mood and music.\n\nThose dolls can sure dance, in all they do.  Talk about intricate choreography.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}