{
  "id": "711531105482512961",
  "title": "Scattered Recollections",
  "published": "2011-06-30T22:47:00.000-07:00",
  "updated": "2011-08-27T23:09:20.648-07:00",
  "content": "Early meeting with a new (to me) engineer, lots of stellar ideas.  Much talk of [the Tesla pump](http://www.youtube.com/watch?v=9PdzaYwgQBE). Better sand blaster, better paint mixer.  Economies will shelve a good invention, because more money is made with more breakable solutions.  People coast on fragility quite a lot. More news from the Gulf, where only now are some events from Katrina starting to wend their way through the courts.  It all takes too long.  Resistance to electronics?   Effective education allows people to synchronize more successfully, moving events ahead more smoothly.  What might have taken lifetimes only takes a few years.  The karma doesn't spread and fester as much, if justice is swift, or at least that's a Tantric theory (anyone wanna back me up on that?). You'll have an ancient estuary go bad with a leak at 18 feet only, with just one contractor on tap to clean up.  Why hurry?  The pay is for time.  Let the ecosystem die then, if it's profitable to let it. That's our reflex-conditioned society in a nutshell:  programmed to externalize. The problem with engineering today:  they can't seem to design an economy that makes any sense.  Rewards are for what everyone agrees are idiotic results.  We so often pay ourselves, reward ourselves, to stay incompetent.  A sorry truth.  Real solutions would threaten the status quo, and that's what people protect, because what's known feels somewhat secure, even if it's clearly sub-optimal (to put it mildly). FNB went smoothly today, just Blue House on duty this evening.  LW is working on a new song.  Many of our party have headed to Rainbow Gathering.  I sliced mushrooms, cut up kale, spinach, lettuce, onions, garlic... plenty of work for two people. The meeting with Anna went well.  We wound up at Common Ground just before closing, Steve Holden joining us.  That was last night. Just now:  over to Holden's for a G&T.  Reported on the shuffling in DC-based positions.  I reaffirmed my sense that [edu-sig](http://mail.python.org/pipermail/edu-sig/2011-July/010381.html) is an important list in Python World. Tara watched Contact again.  Don has re-anchored closer to [Blues Festival](http://mybizmo.blogspot.com/2005/07/jetblues-bizmo.html), as it's that time of year.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}