{
  "id": "2310949446697284752",
  "title": "Schools That Pay",
  "published": "2018-07-05T22:35:00.002-07:00",
  "updated": "2018-07-07T18:38:26.569-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/33968448774/in/album-72157681886616111/)\n\nSome code schools will [offer free training](https://www.theatlantic.com/education/archive/2018/06/an-alternative-to-student-loan-debt/563093/) and job search coaching in exchange for a percent of a student's income if and when they get employed.  That's a step in the right direction.\n\nIn [Education Automation](https://mybizmo.blogspot.com/2010/01/repatriation-facilities.html), published in the 1960s, Bucky Fuller suggested scholarships go to create a learning environment, out of which would emerge the geniuses such as himself who more than paid for the whole setup, in terms of making contributions as faculty.\n\nThe school gets the scholarship endowment and helps you learn in exchange for access to room and board, or however the campus is designed.  Is this a refugee camp?  Do students live in tents?\n\nYou're getting what acts like a cross between a gift card, such as we buy in the supermarket, and a debit card, such as we get from a bank.\n\nThe gift card restricts what inventory you're drawing from, perhaps a bookstore or clothing store.  The debit card restricts it to the authenticated cardholder to make the payment.  Your rewards card might give you access to more classes.  Prove you can do X and get a chance to do Y.\n\nProgrammable money (cryptocurrencies) could make the bookkeeping easy and verifiable.  Everyone talks about blockchains these days.\n\nI'm in a refugee camp and I study biology several hours a day.  I'm passing various tests, plus learning a new language, and my account gets me access to more time in the microscope lab, which some refugee camps feature.  There's a short cut to becoming a lab technician and studying water specimens.\n\nMy hard work as a student is what entitles me to access this or that inventory.  Not every reward is transferable.  I may given the clothes I get to my younger brother, but it's still my account that gets debited.\n\nSome of this circuitry was spelled and under the heading of NetDispenser and showcased at Pycon 2017.  I was an assistant to the main guy, C. Cossé .  However, the FSF has not seen fit to give its endorsement.  They may have a problem with Github.\n\nSo I've exchanged more than 50 emails with the FSF over the past year, imploring them to help make this project better, or publicly endorse it, or something.  Anything.  After all, a solid 50% of my goal with the project has been to make FS4E development appealing and viable by creating incentive.  (FS4E = Free Software For Education).  Last month Richard Stallman told me that FSF could support the project IF we found an alternative to the Raspberry Pi and didn't use Debian.  Uhh.  Of course that side of the project is not the part that encourages FS4E, exactly, so that feels like overstepping their position just a little.  However, why not keep trying? I asked myself, and so I offered to oblige them on those points as best I could.  Yesterday I got a new transmission from FSF and it turns out that the promotional video I put up last month cannot be on YouTube in order for FSF to support the project.  But that's not all!  They also object to having the project on GitHub!  They advised me to fix all these things and then get back to them and \"convince them to support the project\".  \n\nI believe this puts the project back on \"hold\" until further notice.  \nNetDispenser is not exactly the same model as described above.  It's about students earning more discretionary time on the internet in exchange for passing various tests, running various obstacle courses, designed to be fun and educational by game developers.\n\nThe router actually restricts access to only a few websites once the student's account has been depleted.  Visit a dispenser site for more credits.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}