{
  "id": "6396184070110616511",
  "title": "School Spirit",
  "published": "2009-04-17T21:12:00.000-07:00",
  "updated": "2009-04-17T21:30:32.735-07:00",
  "content": "Schools develop their own internal lore, as evidenced by those sometimes dusty trophy cabinets, posted research, other wall art.  These exhibits betoken the life experiences of the scholars within, proud classes gone by.Since the invention of the intranet, interconnected by the Internet (some of them), more of this lore might assume digital format.  Last year's performances, edited, remixed, go into the hall of fame, perhaps retaining raw footage.  Editors treat that issue differently.  Version control systems (cvs, svn, bzr, hg) make sense.  Python.org is in the process of switching.Teachers are often known by their students i.e. several stars will pop out of the woodwork in various places, like Doug Strain, a student of Linus Pauling's at Cal Tech.  We've met some other students of his, of Feynman's also.  As more of a Princeton type guy, I'm somewhat the interloper, but we synergize well, in a kind of east meets west operation.Take the PSF's interest in fostering outreach to educators for example.  If your students start sending their work to our coaches, Vern Ceder for example, then we'll become aware of you as well, as their mentor.  That might be OK with you, to have your students discovered.  Perhaps you would like to brand yourself even more overtly as a teacher of Python.  What might that look like?  Perhaps we could help steer you to the right stuff, to our figurative Vaults of Parnassus?As I was posting to Synergeo recently (#51525), we're fortunate in ToonTown, to be able to source high definition video clips suitable for sharing out through exclusive outlets, such as certain classrooms and/or coffee shops.  You didn't see it on the Internet first, you saw it because your teacher has excellent access to some engaging material.  The teacher is also trained in taking good advantage of said material, helping maximize the value you get from it.  That's what real teaching is all about.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}