{
  "id": "198285200011326879",
  "title": "Scoop and Syndicate",
  "published": "2009-05-04T14:09:00.000-07:00",
  "updated": "2024-12-10T08:21:53.099-08:00",
  "content": "[ discontinued technology ]\nThe word \"scoop\" has mixed connotations, usually good in the news business as it means \"an exclusive\", plus Ben and Jerry's serves \"scoops\".  But then there's \"pooper scooper\" and so \"scoop\" in a more negative sense, as in nasty tabloids, obnoxious hissy fits.Above, I'm scooping with Picassa and syndicating through Google.  It only took a few seconds.  Blogs all over the world have little embedded LCDs, channeling Bucky geometry, potentially speaking.  We were [checking billboard prices](http://www.billboardsource.com/products.php), thinking about Iceland maybe (for algebra, not just geometry).  Yes, they cost a lot (side of a bus, airport concourse... taxi teepee).In any case, the idea of a \"one man newsroom\", so ridiculous to contemplate much above the level of \"pamphleteer\" until recently (or some nun with a mimeograph machine, trying to get us to care [about homeless](http://worldgame.blogspot.com/2006/01/dignity-village.html)), is by now the reality, with lots of \"one man show\" blogonauts having followings (circulations) that rival small rags, certainly compete with major columnists.You don't need your Time or your Newsweek to be a George Will anymore.The same is coming for television if it's not already here, and who can deny this is that \"democratization within the media\" we've long espoused in the name of equity, at least at the lip service level.Who woulda thunk it that tireless engineers took our requests seriously, and now we've got what we wished for.Plus the great thing about the Internet is it's more a pull than a push, so you can't so easily blow a gasket when you see the wrong stuff.  There's an implied \"you asked for it\" in the very concept of httpRequest.  Of course if it's assigned reading or homework, maybe you'll need to drop the class?  Talk to your professor?This is not to excuse abusive Javascripts however, or scam sites that prey on the defenseless in ways that excite our justice system to action, so yeah, the FBI loves to play cybersleuth, has better tools than most noobs.Sites get shut down every day, especially if making false health claims that're dangerous to believe.  Interpol looks for that too, as the international trade in placebos or worse is a booming business.  So if you're claiming science is on your side, better have some ducks in a row when your peers come a-knocking.Speaking of which, that [opening episode of Mad Men](http://mybizmo.blogspot.com/2009/05/first-day.html) is hilarious: \"We can't claim cigarettes are good for you anymore, we've hit a dead end\"; \"How about telling people they have a death wish so live it up?\" (psychology still new kid on the block); so better:  \"lets just tell 'em some nonsense that makes 'em feel better and they'll buy\".  And the rest is history.Anyway, I'm bullish about editing and filtering (e.g. mathcasts) as I think that's where the action is, especially in curriculum writing (one of [my specialties](http://worldgame.blogspot.com/2008/07/more-curriculum-writing.html) -- I do a kick ass kind of math movie, sometimes just [storyboards](http://worldgame.blogspot.com/2009/04/mapping-gnu-math.html)).There's no shortage of content; people are being generous, and the infrastructure is just getting more and more reliable.  Derek has the latest Ubuntu Studio (based on Jackalope), phoned me from Fine Grind to let me know.We have any number of Pentiums to reconfigure (even some Duo Core), should we choose to go that route.  I haven't talked to Free Geek lately.  Toaster farms:  every school needs an Intranet, for [storing school plays](http://mybizmo.blogspot.com/2009/03/high-school-melodrama.html) (MPEGs).Yes, [that trusty school intranet](http://controlroom.blogspot.com/2009/04/school-spirit.html): a growing repository of place-based information, [GIS resources](http://worldgame.blogspot.com/2009/04/gis-2009.html), student blogs, archived threads.  This is what those \"gnu math teachers\" will help you set up and administer (could be your same teachers, on a learning curve with the rest of us).Just because you acquire some sysop skills in high school doesn't mean you're committing to a nerdy existence in some windowless cubicle.  Even small villages in France with plenty of fresh air could use a sysop or two, plus you'll have other day jobs as well (thinking of the new face of IB).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}