{
  "id": "6754762796642629386",
  "title": "Screen Time",
  "published": "2017-05-01T23:29:00.004-07:00",
  "updated": "2017-05-02T09:04:22.711-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/33582839565/in/album-72157683231441636/)\n\nWe spend a lot of time with our screens don't we?  Internet or TV, consuming and/or creating.  Our level of media output has been rising exponentially I'd hazard, along with our ability to store it all.\n\nWill the collective nervous system get too nervous?  We balance on a tightrope, afraid of falling, with so many clamoring for the more violent alternatives.  They want to see it in their lifetimes, whatever it is.\n\nDuring our meetup tonight, over the wire, like a closed circuit TV show with chat window, I explained more about my own workflows, rendering out graphics that start out with Python code. A lot of my friends will use C and/or C++.\n\nI wasn't a software engineer so much as a philosopher by training, and as a consequence I was on the lookout for patterns we could affordably capture with technology of that day, including data from heart procedures, feeding the medical research.  Statistics matter.\n\nShifting gears, I've been archiving \"Gnome\" Chomsky Youtubes to my Facebook profile.  Not a lot of them all at once, just a few. [[1](https://youtu.be/3i9ra-i6Knc)][[2](https://youtu.be/ZrEDo9ChSdQ)][[3](https://youtu.be/UqFnnoM-ttU)]\n\nNot news: Gnome doesn't think 43 was in the loop on Nine Eleven. Not \nsomething I've ever claimed either and in fact I don't think continuing \nto read the Goat Book was a bad reaction. Stay calm, don't rush around \nlike an idiot, which is what they seem good at in DC, lots of \npin-balling betwixt one office and another in some panic. Caveat: this \nwas awhile ago; I have no idea what Gnome's saying today exactly.\nI was working through Pan's Labyrinth, on DVD, while taking a break from teacher prep.  That's a dark tale that got me catching up on the Spanish Civil War again.  One thing led to another and it was the Chechen Wars that got my attention.  We didn't start the fire, but nor have we succeeded in putting it out.\n\nA theme in these blogs is the Bucky stuff could make a difference, but probably in back office philosophy and management at this point, the more outward forms coming from more recent generations, sometimes motivated by the American enlightenment, if we want to call it that.\n\nImperialism long ago alienated Samuel Clemens and William James.  These repeated wars against Asians were avoidable it seems, but for that sense of manifest destiny that drives many ethnicities.  Everyone seems to consider themselves chosen.\n\nOn a micro speck of a planet, ethnic differences seem somewhat trivial, to say the least. But upon zooming in, that tale told by an idiot gets taller and taller, becoming a giant soap opera at the other extreme. People need to be heroes. The vanity of the Captain in Pan's Labyrinth only makes him seem more of a monster.\n\nThe animations in that movie are pretty good, the faun, the fairies. I've not been able to directly produce anything of that quality. I was reminded of eXistenZ.\n\nSynergetics could be an influence in some future animations.  I laid some groundwork with the \"hypertoons\" concept.  Check my [Synergetics 101 playlist](https://www.youtube.com/watch?v=vk-cpknOz9E&list=PLeBIlkJm4xglicSifacG4eewD9CQaWvU0) in my Youtube channel maybe?  They link to each other, gradually building up a memeplex worth sharing.\n\n[](https://www.flickr.com/photos/kirbyurner/33527630460/in/album-72157683231441636/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}