{
  "id": "115393414832388736",
  "title": "Screen Credits",
  "published": "2006-07-26T11:21:00.000-07:00",
  "updated": "2006-11-15T11:44:21.738-08:00",
  "content": "In mixing programming with telecasting, we're able to code up objects that display themselves on television, by scrolling names and job titles for example, such as at the end, or even beginning, of a segment.We'd like to go further in this direction, as the game people already have, so that our library of reusable video objects (dynamic, not static screen widgets, and with many of them read only, in terms of final output) naturally grows within the context of various shows (like the reusable movie sets building up in Morocco).I'm pondering the problem of internationalizing screen credits.  A local credits object might pull from the Irish spelling of the names, while displaying unicode alternatives in parentheses (Arabic, Farsi, Japanese, Hebrew, Greek...).Then, in each of those locales, the primary language spelling (usually phonetic, as in Arabic), followed by the Chinese ideographs or whatever.  This would look better than trying to caption credits, which often move by rather quickly.We could also leave it more up to the actor or grip:  which spelling would you favor, in this Middle Eastern locale?  Some have a high profile mark or glyph they'd like shown (like a company logo).My name in [Cyrillic](http://en.wikipedia.org/wiki/Cyrillic_alphabet)?  I'd rather see the whole of [Synergetics](http://www.rwgrayprojects.com/synergetics/synergetics.html) in that alphabet, something fun for my bookshelf -- I could get an in-cyrillic credit for one of the on-line mirrors (job title).These dynamic spelling conventions for job titles, crew members, would require a player to have a more finely ground idea of locale than most DVD players currently.My model also included over-the-net lookup, of some of the info, but only because the video itself was coming by that vehicle.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}