{
  "id": "3087639146258141233",
  "title": "Second City",
  "published": "2013-09-03T07:30:00.000-07:00",
  "updated": "2014-03-14T10:04:59.016-07:00",
  "content": "Chicago / Djangocon / 2013\n\nIf you don't know your Chicago history, you may wonder at this name, but of course it refers to the great fire that burned down a lot of the city.  No one knows how the fire started, though a journalist for the Chicago Tribune did invent an urban legend about some Irish woman and her cow.  Blaming the Irish was the fashion those days.\n\nOur architecture boat lady had it nicely broken down for us:  modern / international style buildings are the somewhat unimaginative rectilinear prisms that look like ice cubes, whereas post-modern buildings tend to be one-offs that reference their environment i.e. play off what's already there.  International style buildings fit in anywhere, as \"standard skyscrapers\".  Then were the older styles, such as Gothic and of course Art Deco.\n\nThe Hyatt seems somewhat postmodern in referencing the Art Deco buildings around it, but only vaguely.  As master of ceremonies, Steve is expected to host small gatherings.  Companies come to these conferences to have intimate talks that might lead to collaboration.  The Presidential Suite is an appropriate venue.  One takes this suite for the purpose of entertaining guests, not holing up in seclusion with one's computer.  Fortunately, Steve is a gregarious guy, or he wouldn't be in the conference producing business.\n\nThe NBC Building definitely looks Art Deco but was built long enough after that era to be categorized as post modern.  It alludes to Art Deco, and to Radio City Music Hall, in New York, in particular.\n\nI took a workshop slot that had suffered a cancelation and filled the void with my usual brand of \"crazy talk\" (somewhat non-linear) featuring Tractor Art (an allusion to Turtle Art), Andragogy and Synergetics, with a somewhat tour guide approach.  You could say the architecture boat was an inspiration.  I had my pictures from that tour, from the previous night, fading in and out on screen as people awaited the talk.  I encouraged them all to join the conferences architecture boat tour on Thursday.  Patrick will have left by then and I'm now vectoring away from Chicago, so for Patrick and I, Sunday night was the best time for a boat tour.\n\nTall buildings are a way Egos communicate, but then there's a lot of discussion these days about what or who has an Ego.  The idea that a corporation is an Ego, or has one, is popular in some circles, whereas others are skeptical that something so institutional as a corporation could have an interior life, affections, emotions. \n\nOr is it that human beings become the vehicle for Corporate Personhood?  The mystique of tall heavy buildings is that they outlast little humans, so if your identity manages to glom on to a tall building, then you're closer to immortality.  These identifications bring comfort to those with no other religion to fall back on.\n\nDuring the workshop, a couple attendees worked on [improving the installation options](http://blog.maestropublishing.com/2013/09/03/installing-vpython-visual-python-on-linux/) for Visual Python (which now includes wxPython) on Linux.  I was talking about what a great project that was, and they were giving me feedback:  if you want to be popular (1) installation needs to be easy and (2) the web site should not look ancient (even frequently updated web sites can look ancient).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}