{
  "id": "361359885430672824",
  "title": "Segue",
  "published": "2012-05-08T17:27:00.000-07:00",
  "updated": "2012-05-08T18:30:27.085-07:00",
  "content": "I continued with the theme below on [the Wittgenstein list](http://groups.yahoo.com/group/WittrsEX/message/4807) (Sean's).  The Yahoo! archives is as valuable as what's in any bank vault, from some points of view.  Where the word \"securities\" comes from in some degree: scraps may be treasure, a phone number, a key name.\n\nThe distance education world is one I've frequented in several roles:  current and former high school teacher (back then it was current); contributing editorial consultant with McGraw-Hill; and then more as a lobbyist / reformer / geek about town. \n\nOregon Curriculum Network grew out of the latter efforts, subsequent to five or so years with CUE (Center for Urban Education).\n\nThese days, I provide instruction via distance education circuits, to a faceless crowd.  Having everyone veiled, not just the women, and because of technology, not garments, makes this a somewhat different experience. \n\nThe narrow bandwidth is nevertheless right where it needs to be, in terms of advancing learners towards their goals.  The annual staff meeting is underway.  Last night some of us stayed up to watch The Birds (Hitchcock) which mentions Sebastopol. \n\nRussian River is also nearby (check Google Earth).\n\nThe school has its origins in the University of Illinois and Ohio State.  Lots of thinking about andragogy and what helps students get real results, led the school's founders, a core team, to implement a \"useractive\" approach which emphasizes active (versus passive) engagement. \n\n\"Active\" might just mean typing and mousing around, versus watching videos or taking in text. \n\nOnly some disciplines are narrowly focused to this set of skills. \n\nNo, this is not appropriate circuitry for all kinds of learning, obviously.  That's why the teachers themselves need to get together in person, in clumps or as an almost complete crew.  We did something like this a year ago, and so on going back, though I only joined in the winter of 2010.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}