{
  "id": "2216604425591166724",
  "title": "Service Calls",
  "published": "2009-04-08T20:46:00.001-07:00",
  "updated": "2009-04-09T14:42:34.754-07:00",
  "content": "I'm busy slamming Lie to Me, Tara defending.  I'm thinking \"there's no reality like this\" but she insists this is cool.  These people with intrusive abilities to just tell us who is lying... what gives them that right?  Police power fascism.  Not new on TV.  Yawn.  [I diss NUMB3RS as well](http://mybizmo.blogspot.com/2008/11/yakking-about-tv.html), as my loyal readers might know.Earlier, Tara'd had it with our busted remote, meaning no DirecTV in the downstairs.  \"Let's repurpose the upstairs remote\" I said, patching in, \"that way the one you're mailing can be for the TV we use less\" (in my bedroom).The guy ends up reading me like 30 codes for any kind of SONY.  But we also had it on Video 3 instead of Line 1 -- and the remote is busted (stupid slidey thing, $15 to replace).  Tara was also watching Jeopardy earlier.Mom's cell was presumably lost, so I initiated the temporary suspension feature, but then she found it (way cool!).  Again, more secret codes to reactivate, last four digits of my SSN.[A demented videogame](http://controlroom.blogspot.com/2005/01/total-information-awareness.html) for elementary school kids, complete with headphones, sort of stresses the \"service call\" skill:  be polite and friendly, enjoy the experience, and be focused and detail minded, not spacey and diffused.  Technical problems take presence of mind.[The PPUG list is buzzing](http://mail.python.org/pipermail/portland/2009-April/date.html) with high level Django jargon, reminding me Leslie phoned, having heard about the electronic medical record initiative.  Saving billions of your tax dollars.Django (an MVC web framework) might be more for PostgreSQL however, a clinical research application.  LMRs (legal medical records) might need a more schemaless environment, lots of pilot studies underway don't ya think?  Could be good for Javascript too, [CouchDB](http://controlroom.blogspot.com/2009/03/pycon-lightning-talks.html) an attractive Apache project.The ability to go against large test databases of scrambled information, no real PHI in the mix, is the kind of sandbox (testing environment) needed.  We faced this at Free Geek on [the MMT contract](http://worldgame.blogspot.com/2007/09/open-source-within-health-care.html).  I've written about [the pseudonymizer](http://mybizmo.blogspot.com/2008/07/pseudonymizer.html) in the same vein -- creates reams of \"false identities\" for simulation and/or identity masking purposes.At Oasis today, it was all about RFID in the gurneys, playing air traffic control with lots of flatscreens, keeping patients from waiting, bottlenecking.  Yes, you'll [think of Wall*e](http://worldgame.blogspot.com/2008/06/wall-e-movie-review.html) maybe, can't be helped.  Patient transport in hospitals is often on a bed or wheelchair, controlled by an orderly, other health care worker.  Should the bracelet contain RFID as well?  We're getting into hospital design and architecture here.  As a Python guy, I'm more into the data streams than the data harvesting hardware, always pray for a simple enough API.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}