{
  "id": "114500117444162701",
  "title": "Shuttleworth Summit (day two)",
  "published": "2006-04-14T15:25:00.000-07:00",
  "updated": "2008-07-25T16:52:05.378-07:00",
  "content": "Checking [edu-sig](http://www.python.org/community/sigs/current/edu-sig/) this morning, from the hotel lobby (Guido is in the chair next to me); [André is proposing rur-ple](http://aroberge.blogspot.com/2006/04/thoughts-on-shuttleworth-summit.html) as an alternative to Logo while [Ian blogged about his PyLogo](http://blog.ianbicking.org/python-education-logo.html).We had a fantastic dinner at [E&O](http://www.london-eating.co.uk/1620.htm) last night.  [Gunner](http://www.aspirationtech.org/about/people) turns out to be a bigger country music fan than I'd realized.Today's planning looked at timeline, tools, and content.A first pass: develop in a fish bowl, in showcase settings, with others invited to adopt and adapt (within three years?). Second pass: package the \"final product\" for wider dissemination (within five?).On the tools front, a key question is whether we're tying this project to any major specific software development effort.Loosely coupled tools, with a bottom-up, open source curriculum writing process, will leave the question of tools somewhat open-ended. The lesson plans will specify the software needed, with multiple paths possible.Will we eventually have some sort of Python-based hypercard-like browser plug-in, facilitating easy publishing by students and incorporating what's already worked well in Squeak? If yes, then so much the better. Peers i.e. teachers (including the more advanced students) will write lessons around it.The content will translate a mind map of the whole ten year topics network to a repository of lesson plans, with lessons sortable by how technology intensive they need to be. The content will mostly assume some minimal level of infrastructure: a computer lab with or without the Internet for example. At the topical level, this curriculum should tie to the national standards, to facilitate widespread adoption.We blitzed through a few five minute lightning talks, featuring South Africa's performance stats in TIMMS, primitive Logo in Javascript, Squeak, a book on Squeak, the Scheme approach to designing programs, a [2D dynamic geometry project](http://www.ofset.org/drgeo) not unlike [PyGeo in 3D](http://pygeo.sourceforge.net/), and me on Python, doing a very abbreviated version of [what I showed the London Knowledge Lab](http://worldgame.blogspot.com/2006/04/london-knowledge-lab.html) on Wednesday.Robyn encourged me to look at what a [contemporary Logo](http://www.logo.com/imagine/project_gallery/index.html) looks like.  The slickest stuff is neither free nor cross-platform, even if it runs in a web browser.Momentum seems to be building for a stronger graphics engine, either 2D or 3D, with Python bindings, that'll run interactively from within a browser. The Squeak folks may be willing to contribute to this effort. Guido feels we'll need to recruit new talent for this, as the Python community is currently pretty maxed out on projects. Should such an engine be developed, turtle stuff would be incorporated therein.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}