{
  "id": "114492243157132113",
  "title": "Shuttleworth Summit (day one)",
  "published": "2006-04-13T14:15:00.000-07:00",
  "updated": "2006-11-15T11:44:17.517-08:00",
  "content": "Our plan is to write the next generation curriculum for the Shuttleworth Foundation's vision, and a process for doing so. [Nineteen](http://wiki.tsf.org.za/shuttleworthfoundationwiki/Project_20Summit) of us are sitting around the table, one is taking the [official notes](http://wiki.tsf.org.za/shuttleworthfoundationwiki/Day_20one) (mine are not official). The essentials have been provided: coffee and tea, wireless.[Mark](http://en.wikipedia.org/wiki/Mark_Shuttleworth): How do students develop communications and analytical skills and how might technology catalyze the aquisition of these skills?Problem: mathematics is increasingly failing to hook kids' attention, with new math teachers ever harder to recruit. Yet technology is invading the education sector, plus students are spontaneously attracted to technology. How can we capitalize on both trends? How might we continue to deliver analytical capacity in this climate of declining interest in traditional mathematics learning and teaching?There's no time to retrain the teachers, so the model should implement a peer-based system, wherein students are expected to mentor other students.Mark's current vision is to start kids with Logo, then maybe move on to Squeak, then Python. That's a rough first take. We have the Scheme community represented at the table as well.My comment: if there's a lot of broadband in this picture, access to technologically literate teachers shouldn't be the bottleneck. We can project video clips at will, including of talking heads, and about any topic. So it's not like there won't be a variety of adult role models presented. Even live interviews are possible. Guido: assuming the presence of broadband or a projector may not be realistic. Mark: pervasively only in the long term. May we at least assume an ability to play DVDs, and to burn them? Yes.Other comments: we're talking about acquiring identity, not just skills, which relates to language and a cultural context. What is my role in the community, what are my community's values? The concept of \"literacy\" covers this, in that becoming literate involves creating one's life story. And this doesn't just happen in schools, especially given the Internet.Let's focus on the analytical component, the mathematics. Computers enable kinds of mathematics that's difficult to do in other ways. And let's enlarge the analytic to embrace the sciences, which adds the modeling dimension, makes the math stories be about reality. Purely analytical capability may be perverse and/or shallow if not grounded.[Alan Kay](http://en.wikipedia.org/wiki/Alan_Kay) pointed out that a curriculum needs to include powerful ideas, not just turn students loose, expecting them to reinvent the calculus. Developing problem solving skills must include exposure to powerful cultural inventions. Cultural memory is important.Alan sure talks about the 1960s a lot.  [Guido](http://en.wikipedia.org/wiki/Guido_van_Rossum) expressed some frustration with that.My suggestion: set up test beds, modeling existing and expected conditions, and develop curriculum segments in the field (the test driven development model). Implement a prototype branded curriculum in a pure form and let others copy what works. I'm hoping to avoid this pitfall: something imposed top-down on unwilling participants results in backlash and sabotage, or simply a diluted or distorted version, giving ammo to the curriculum's enemies and making outcomes hard to measure.Alan thinks being able to script without having to type is super important, plus he wants a media rich experience, not just a turtle. He also advocates the one wireless laptop per child model, meaning you get to take them home. His emphasis is consistently constructing a \"world\" for children, some customized multimedia GUI ala Squeak, although he thinks this could just as well be done in Python. Alan is a big hypercard fan and is aware of the [PythonCard project](http://pythoncard.sourceforge.net/).I'm especially skeptical on this last point. Let's focus on a distro perhaps (like edubuntu) but not over-integrate the environment to make something more seamless then necessary. Leave the environment heterogenous, more like the real world. I'm also finding that IM (instant messaging) motivates somewhat older kids to improve their typing skills.I sense a tension between inspiring teachers versus bypassing them. Probably what we're doing is pioneering an open source culture devoted to curriculum development (not just software development) which includes and inspires some teachers, but leaves others feeling bypassed -- a typical outcome, not really a problem.What Alan and I most agree on is the need for Wikipedia type content to mix with an interactive component. He showed me his recent Javascript implementation of Logo. I'm reminded of our ability to create interactive \"labs\" in the [J language](http://www.jsoftware.com/). Python needs a more developed interactive teaching module: show some stuff, give students a command line, show more stuff, and so on.Lunch activity:  demo of [LAMS](http://www.lamsinternational.com/) by its author, James Dalziel.  Good use of chat rooms to facilitate peer to peer communications.The breakout sessions were on the following topics: landscape 2010 (what will the ecology be like?); implementation of innovation (how will these new memes spread?); the role of the teacher in this new technology-based curriculum.The landscape group expects at least a computer lab in most schools. We can't assume students will have access to a computer at home.The implementation group is faced with a somewhat monolithic set of scored national tests, and debated what balance of collaborative vs. subversive tactics would work best. Recruiting teachers would involve empowering them as peer contributors to a lessons repository.The teacher's role group assumed universities would help with teacher trainings and managing the courseware repositories. Shall we hold on to the notion that teachers must \"know more\" than their students, in order to be effective?Coffee break.  Warding off jet lag.A branded distro, like edubuntu, with built-in links to further resources (LAMS workflows, moodles...), would give users access to a shared open source culture of curriculum development, not just software development. As a peer, I'd be patched into an ecology, a network, as I am now, but with more people self-consciously contributing. The ecology will feature many competing brands, not one monolithic sequence. Some curricula will be more tailored to specific national, regional and/or company standards.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}