{
  "id": "110865689727291362",
  "title": "Simulators in World Game",
  "published": "2005-02-17T11:47:00.000-08:00",
  "updated": "2006-11-15T11:44:08.503-08:00",
  "content": "Monitoring global data is one thing. Mandating interventions or corrective maneuvers is quite another. Yet on the bridge of the Enterprise (a federation starship), the captain must do both. It's not enough just to stand and stare, as everything goes to hell, freezing in a panic or whatever. Fortunately for the Enterprise, Spock is always happy to relieve Kirk of duty, if that's what it takes (or maybe the Klingons will step in).So how shall we develop our captain's reflexes and conceptual understanding, such that she's well prepared to respond quickly (or slowly, patiently) as the situation demands? Answer: simulations, dry runs, mock ups, rehearsals. This is what every discipline tends to come up with: some way to allow an apprentice to learn from her mistakes without paying too high a cost.NASA learned the importance of simulations long ago. Mission Control would go through the final stages of landing on the moon with the astronauts, and maybe crash the LEM a few times.Of special interest along a critical path are those points of no return. Up to some point, you have abort capability, after which point, you've committed. The LEM crew might find itself stuck on the moon, if it chose to commit, then discovered a problem -- hence the importance of check lists.In the press of the moment, check lists developed in times of cool, calm clarity often prove a valuable counter to the grip of fear or, potentially as dangerous, the eager thrill to rush onward. Plus there's just a heck of a lot to remember. Pilots use check lists as a matter of course. On contemporary aircraft, they're built right into the cockpit display.Another form of simulation is field testing. Robotic rovers, designed to explore remote planets, first get a workout on Earth, perhaps in some desert. These tests disclose the limitations of the equipment, plus give remote controllers some all important experience. Sometimes the feedback loop is artifically slowed, given the lag times associated with what will eventually be the real time distances between pilots and robots. The speed of light is finite, after all.[World Game](http://www.grunch.net/synergetics/geni3.html) has always featured simulations. A gymnasium-sized world map would be unrolled, and participants assigned roles, as diplomats, journalists, heads of state, corporate executives. The clock would start, and players would swing into action, trying to self-organize human affairs on a global scale.Typically, the scenario would end in disaster, and one of the trainers, e.g. Chuck Dingée, would come out with the buckets of red poker chips, each symbolizing the blast and/or fallout radius of a nuclear explosive. There'd be enough chips to effectively cover most of the map's landmasses.Players would survey the damage and feel relieved that this was only a test. As they walked out the door into the bright sunlight, the trainers would remind them: now world game begins for real.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}