{
  "id": "4553241607915011264",
  "title": "Sky Camp",
  "published": "2007-05-08T08:14:00.000-07:00",
  "updated": "2008-11-15T02:36:48.104-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiRVgvAv_zBL8byVta8UZbrys_QO8v9e5crl7INuM-GthUIlbSC2h1-j-vHiBrIKVqlXcz9la5Eg6AaAaz-5QOjmE6ZNbmgkeIYtc2jLV9_0yF-8rdVIwzEqmP-mv4J16HQ0xps/s1600-h/skycampfield.jpg) I used this occasion to share my dream, of a helicopter lowered prototype in the wide open field, just there for the duration of the event, for Junior Friends to monkey in and around, then gone.How we get there in just a year (with earlier prototypes showing up [elsewhere](http://worldgame.blogspot.com/2006/01/location-scouting.html) in the meantime) is not by me joining the tiny planetary clique of billionaires, but by me exercising my skills as a director, collecting raw footage for the editors, using my connections, my chief forms of embeddedness, e.g. with the Quakers here. I only had a tent this time, and that might be it for me next time as well. No smorgasbord, no yacht parked in the lake.The difference between my kind of movie-making and Hollywood's is the props are corporate sponsored as future real world, in some cases mainstreamed candidates. It's product placement of a kind, similar to what the military does for its theater-ready killingry. Livingry is cutting edge, ready for soap operas, and the backgrounds now compete more with the talent for audience attention, something for actors' guilds to get over (this is a genre, akin to the documentary, not a hostile takeover and/or ban on our favorite fictionalizing techniques).We use fewer mock ups, more of an improv script, because this is \"real time\" (like ordinary life), not always with opportunities for \"take two\" type redoings. Not every director is trained to work in this way. Nor do I forbid myself the luxury of slow frame rendering, when such R&R type movie-making gigs get offered.But this is a surge to Darfur and such places, a FEMA type scenario, with real lives at stake on the ground. So these languid pauses in Quaker boot camps nestled in the Pacific Northwest has this \"save the children\" urgency about it. The corporations sponsoring us don't take it all too lightly either. We're free to insert our Glad bag commercials, our SuperBowl XX..VI. But that doesn't mean we're not serious-minded about our responsibilities, such as these may be, to our fellow beings aboard Spaceship Earth, nonhumans included.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}