{
  "id": "7591448123922546020",
  "title": "Slings and Arrows",
  "published": "2009-12-09T09:42:00.000-08:00",
  "updated": "2009-12-10T19:38:07.871-08:00",
  "content": "State of Oregon is hunting me down on a parking (?) ticket, but the computer couldn't tell me more than my license plate on the totaled Razz (this was back in April, so yes, they had a date, but the court system was down so they didn't have details).  She agreed to wait for the system to come back up so she could hack in and see what was on the record, as I have no recollection of this ticket.  Indeed I was paranoid about transacting anything over the phone, so got a call back number to pursue this tomorrow (because she'd asked for more time).Barry and Koski are both upgrading to hi-def, following Jon Bunce's lead.  My refurbished Dell is shot out, but then we don't even buy new eyeglasses around here, given the shabby state of our education system. [ ](http://en.wikipedia.org/wiki/Free_and_open_source_software)[FLOSS](http://en.wikipedia.org/wiki/Free_and_open_source_software) may be free, but you still need a lot of focus to use it and that takes practice and experience.  High school could be one of those times to develop these skills.  We're looking at [Martian Math](http://www.wikieducator.og/Martian_Math) through Reed College (as a part of a summer math camp), maybe [Neolithic Math](http://www.wikieducator.og/Neolithic_Math) too if enough kids sign up, but one gig does not a Flying Circus make.  [CSN LCDs ](http://coffeeshopsnet.blogspot.com/2009/05/more-about-lcds.html)were another option, a pipeline to self schoolers, and indeed when Koski phoned he had [some of our esoterica](http://controlroom.blogspot.com/2009/12/private-language.html) on his new big one.I need to tell Mike D. about this offer I have to hack on an APL for the XO.  People using the Red Hat internals are gonna have some of those skills.  APL is a truly nifty language, had 'em star struck at IBM, and with good reason.  J is a successor language in the same lineage and I often recommend it to students, as a part of my \"minimum two\" computer languages recommendation (if you bother to learn one, learn two).  I kinda suck at J by the way, or call me a \"tin man\" (kinda rusted).  But just having worked out in that gym gave me muscles I still use, if that makes any sense.[NCLB Polynomial](http://mybizmo.blogspot.com/2006/09/focal-points.html) and [NCLB Polyhedron](http://worldgame.blogspot.com/2006/10/nclb-polyhedron-memo.html):  those were tied together by Phi.  You basically can't say you \"work for the Pentagon\" if you know zero Pentagon Math.  Getting up to speed on that is a lot of what NCLB is about.  That sounds kinda right wing, but then Phi is truly fascinating (some call her Tau).  This is math you should be getting, by one route or another.  It's the kind we use in Rivendale for example.[Mythological thinking](http://www.grunch.net/synergetics/aphiloview2.html):  the fascist Apollonians sorta trashed the original Delphi, displacing the Athena School.  Some say Apollo whipped the Python's ass (the one under the mountain), but others say that Python simply [moved to Nashville](http://coffeeshopsnet.blogspot.com/2009/06/greek-mythology.html). Then I compare Portland to Nashville in the sense that laptops are a kind of [musical instrument](http://mybizmo.blogspot.com/2005/08/gibson-bizmo.html), with a keyboard and everything.I do plan to pay the ticket, even if I want to contest it in some way.  The police citation probably has a check box that will jog my memory as to the infraction we're talking about.  I'd just like to know what I'm charged with some days, call me Kafkaesque (I'm sure I'm not the only one).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}