{
  "id": "6218789965937965330",
  "title": "Slogging On",
  "published": "2009-08-14T20:39:00.000-07:00",
  "updated": "2012-10-06T16:42:32.828-07:00",
  "content": "[](http://photos1.blogger.com/blogger/1134/545/1600/pentagonmath.jpg)The PentagonGoogle Earth\n\nHey, my rant below is talk of the town in some circles, got a report from Thirsters that my name was in the wind, easy to [imagine Fred](http://mybizmo.blogspot.com/2006/12/thirsters.html) bellowing it, but I was not an eyewitness.  I tend to steer clear of that group these days, for reasons I was explaining to Dr. Tag.\n\nUp close and personal, I'm worried about Razz (8 year old Subaru Legacy AWD station wagon, stick shift), her \"[fender bender](http://www.flickr.com/photos/17157315@N00/3816210934/)\" pushing into \"totaled\" range according to the body shop doing the estimates, though I have a hard time accepting a car I bought used for over $13K [from Dick Hannah](http://worldgame.blogspot.com/2007/05/key-fob.html) would be worth only 4/3 of $5.7K already (i.e. $7.6K).  [Bluebook](http://autos.msn.com/research/vip/pricing.aspx?year=2001&make=Subaru&model=Legacy%20Wagon&trimid=-1) is $8-8.5K. I know if Farmer's cuts me a check for $7.6K (5.7 = 75% of 7.6) I'd not get a car nearly as cool.  No frame damage [update:  there was some frame damage, from boulders underneath on driver side], just fenders and shit, bet like $85 at the factory for some of those pieces, but capitalism is nothing if not about markup (but then show me a system without markup -- lets talk turkey somewhere (not here)).  Don't sharia-practicing camel dealers know the difference between retail and wholesale?\n\nI'm liking that some US Army guy (Colonel Timothy R. Reese) came out in NYT calling for [100% withdrawal from Iraq by 2010](http://www.tomdispatch.com/post/175106).  Takes guts, thanks dude.  Neoliberals wanna push it back to 2011 so they can [force a new verdict](http://mybizmo.blogspot.com/2009/08/yakking-with-old-timers.html) and maybe keep those \"mega-bases\" -- like maybe under John Kerry?  Sure, they'll \"feel guilty\" about that post-911 spazz attack, but it's worth feeling guilty if the price is right.  So I'm betting the so-called \"wimpy left\" (vs. the \"hard left\") will push to stay, by spinning our Army guy as \"out of touch with the mainstream at the Pentagon\" (neoliberals, [like truckers](http://controlroom.blogspot.com/2009/03/cubespace-anon.html), think they know all about what the Pentagon thinks, even if they don't know shit [about phi](http://mybizmo.blogspot.com/2006/08/mathcasting-about-phi.html)).\n\nI watched the spatter on MSNBC around health care on [Olbermann again](http://worldgame.blogspot.com/2009/08/wanderers-2009812.html), followed by that smart chyk show, maybe catch her name next time (reminds me of Rowley) -- Rachel Maddow.\n\nHey, great that Dick Cheney is refocusing on \"nuke tech as weaponry\" in the hands of terrorists (by definition!) as a topic.  That'll put some spine back into the debate maybe, though focusing on end of life care is a mature audiences topic ([R rated](http://worldgame.blogspot.com/2008/10/wanderers-2008108.html)).  The shows I'm watching give it (mortality) a slightly comical spin, feels like a pain med of some kind.  Thanks TV!  Sometimes a prefrontal lobotomy is more healthful than a bottle in front of me -- especially if it's [a Sony](http://www.youtube.com/watch?v=8AyVh1_vWYQ).\n\nTara is heading out of town again, though not to the high desert this time.  We're fortunate to have so many ecosystems within easy driving range.  Most kids in day care just get to sit in a boring classroom and read about the world in textbooks.  Real schools take 'em to the field, out to various \"mega-bases\" to appreciate life not in the big city.  Hang out with some overseas types, already self schooling with rancher families, learning to ride horses, far from a polluted homeland.\n\nI get a kick outta these knee-jerk something-or-others (I lose track of which mirror image) decrying the Americorps brainwashing camps, saying the government shouldn't be mind- controlling our children (leave that to big pharma).  A lot of these same families are all flag wavy around military bases, not seeing the connection.\n\nThat's why we need professionals sometimes:  because the average civilian is getting by on two cylinders and we sometimes need all six (like in some military or paramilitary capacity ala LL or P-W (or even me, like [in Santa Fe](http://mybizmo.blogspot.com/2006/12/action-figure.html))).  Without [my Princeton brainwashing](http://worldgame.blogspot.com/2008/01/war-college-philosophy.html), I wouldn't be pure of heart enough to do \"[the Lord's work](http://www.freelists.org/post/wittrs/On-the-Mechanism-of-Understanding,10)\" as [Mirsky](http://worldgame.blogspot.com/2006/02/moral-relativism.html) put it, perpetuating my guru's lineage (talking about Ludwig Wittgenstein again, one of my heros, also a war vet).\n\nOn the brighter side, I'm looking forward to eyeballing some great Python today, new curriculum materials, not by me this time.  Even I get tired of just talking to myself, or [arguing with Frank Zubek](http://www.youtube.com/watch?v=h1T_eDE84W0) about whether 24 Mites make a 1F or 2F cube.  Working with other professionals is what keeps me going.  Inspirational!\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgnVg4xfZCM0bV7hIZc2Vco-y0XbQBLBgtfdVTgKAnqjJZnjimbHk898OTnLADFp9tJXddwClzeEA19QcWkWh_xZT1Lay_tbQttprQifdxfb0g4YOVqGbxbS4AjEjyxkcFqPYGa/s1600-h/stella.gif)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}