{
  "id": "4639753168404968040",
  "title": "Social Engineering",
  "published": "2022-08-14T12:38:00.000-07:00",
  "updated": "2022-09-07T09:49:37.779-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52285665453)\n\nMiddle Americas  \n\nIn case you're curious what social engineering might look like, let me share some science fiction.  For one thing, I come from the viewpoint of the Americas all being delighted with one another.  \n\nThat North Americans have a Mexico to enjoy, and vice versa, is a double blessing.  So many North Americans I know, and not just the so-called Hispanic ones, are in love with Mexican culture, whereas others have retired in Costa Rica, Nicaragua, Belize, Panama and so on.\n\nI used to tell EJA I was bound for Costa Rica, just to get away from the oppressive MIC, which is AFSC jargon for \"military-industrial complex\" (to which I give a Jungian spin, i.e. \"complex\" is a psyche thing). My sister lived there for some years.\n\nSpeaking of teaching, I want to introduce high schoolers to Regexes, and not just inside the domain of \"computer science\".  We're always reminded that Regular Expressions were invented by a mathematician. Lets expand high school math to include them.  What's on my plate for the next couple days.\n\nSo the social engineering centers around weather reports, as broadcast over TV stations.  Some of the GPS / GIS maps in the background are fairly TexMex in their makeup, i.e. we're in some Middle America between Mexico City and Las Vegas.  \n\nThere's a road net, a set of mountain ranges, some valleys with rivers.  The Colorado, for example, no longer has much of a delta to speak of.  Humans have diverted 100% of that particular river.  I'm getting off topic w/r to TV weather, but not w/r to global climate.\n\nWhen TV viewer-voyeurs are as familiar with Middle Americas as with so-called New England, they'll be less prone to fuel the polarizing language factions.  \n\nAgain, the Americas are in love with themselves.  We have so much to treasure.  We are the real West after all (plenty wild), not the pseudo-west of the Atlantic-bounded EU East.\n\nWeather maps, as you've noticed, are used to promote a sense of cohesion, of us versus them. That's why you still see these ludicrous masking algorithms, wherein the \"weather of interest\" is miraculously masked out.  \n\nAs if political boundaries trumped nature.  Hilarious right?  \n\nWe get more serious around airports, acknowledging there's an ecosphere (aka a biosphere).  \n\nFor the most part, though, we're living (mentally) in a house divided, some us versus them.  \n\nThat's your model?  Question authority.\n\nPicture a weather map that strays from Oregon to Washington to Vancouver without a pause.  Bellingham is the belly button of this Cascadia place.  Do we need permission from the District to frame our weather reports as such?  Of course not.  \n\nWe might obey conventions out of reflex of course.  \"Lets do what we've always done!\" is the slogan of Darwin Award champions.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}