{
  "id": "1144710554111661998",
  "title": "Social Media",
  "published": "2023-04-17T08:56:00.004-07:00",
  "updated": "2023-04-17T14:49:33.548-07:00",
  "content": "For those wanting lots of analysis from experienced people, YouTube, Rumble and so forth represent a bonanza.  We never had it so good.  This makes journalism way more difficult I suppose, as we're able to get to our sources rather directly. \n\nWhat's left for the career journalists to scoop up is from a leftover (legacy) second tier infrastructure defined by bureaucracies of old.  They leak in the old ways, but their information has already been superseded.Although not journalists per se, we also have the travelogue people, a lot of them politically aware, and some of them willing to report in routine fashion on what's trending in the local news. \n\nThe upshot is, if you stick with legacy media, you're in a darker more insulated world than ever, the one concocted by self-interested bureaucracies, whereas if you pay attention to social media, you have a shot at piecing together a world.Over on TrimTab Book Club, I've been discussing the tiny tome est: A Steersman Handbook, which came out in 1970, by a TV-savvy media person, Leslie Stevens.\nBrett held up that obscure est: The Steersman Handbook, Charts of the Coming Decade of Conflict that he's acquired for his collection (me prompting). The book is published in 1970 celebrating Bucky as an \"est person\" even before Werner Erhard invents his \"est training\" in 1971 and starts interviewing Bucky closer to 1980.About the book:[https://en.wikipedia.org/wiki/Est:_The_Steersman_Handbook](https://en.wikipedia.org/wiki/Est:_The_Steersman_Handbook)About the author:[https://en.wikipedia.org/wiki/Leslie_Stevens](https://en.wikipedia.org/wiki/Leslie_Stevens)From Wikipedia: Individuals named as examples of \"est people\" in the book included [R. Buckminster Fuller](https://en.wikipedia.org/wiki/R._Buckminster_Fuller), [Jiddu Krishnamurti](https://en.wikipedia.org/wiki/Jiddu_Krishnamurti), [Ralph Nader](https://en.wikipedia.org/wiki/Ralph_Nader), [Marshall McLuhan](https://en.wikipedia.org/wiki/Marshall_McLuhan), [Malcolm X](https://en.wikipedia.org/wiki/Malcolm_X), [Albert Einstein](https://en.wikipedia.org/wiki/Albert_Einstein), [Lewis Mumford](https://en.wikipedia.org/wiki/Lewis_Mumford), and [Eric Hoffer](https://en.wikipedia.org/wiki/Eric_Hoffer). Looking back from over a half century later, I think we can say there's a lot that the author got right in his description of The Movement. \n\nThose who immerse themselves in new media empower their intuitions, but unless they cling to old fashioned powers of articulation, i.e. the ability to write in linear formats, the hive mind doesn't rewire. It takes a combo of new media and old media to make a difference.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}