{
  "id": "6348221786083861422",
  "title": "Some Quaker Overview",
  "published": "2013-10-01T10:04:00.004-07:00",
  "updated": "2013-10-01T10:36:58.563-07:00",
  "content": "[OVERVIEW](http://vimeo.com/55073825) from [Planetary Collective](http://vimeo.com/planetarycollective) on [Vimeo](https://vimeo.com/).\n\nEver since Walter Kaufmann translated Nietzsche's \"Übermensch\" to \"Overman\" \ninstead of \"[Superman](http://www.dccomics.com/superman)\", there's been discomfort among Quaker Overseers, \nwho are caught in the hard place of remaining vigilant against \nundermining / subverting influences (cosmetics, music...) that might \ndistract Friends from expectant waiting on the spirit.\n\nQuakers don't believe in titles or, more accurately, different ranks or classes\n of human. Fox was popular among infantry and officers for his direct \negalitarian manner and plainspokenness, direct speech, an asset in war \ntime.  Quakers  wouldn't treat some as uber-entitled and others as \ntrash, which got them in trouble (an understatement).\n\nHowever, Kaufmann's whole schtick (or a big part of it) was to put distance \nbetween \"Übermensch\" and any stupid Nazi ideas of Arayan supremacy, the \nultimate classism or sense of entitlement.\n\nFriends tried hard to put the brakes on WW2 (see [Human Smoke](http://www.amazon.com/Human-Smoke-Beginnings-World-Civilization/dp/1416572465)) by seeing \nGermans as humans too ([like Americans](http://mybizmo.blogspot.com/2008/02/philosophy-101.html), far from perfect); they resisted \nimposition of the food blockade, the siege Churchill had mounted and \nneeded FDR to support, and they pushed to open borders to fleeing / \ndesperate refugees from Nazi oppression, Jews chief among them.\n\nDC Comics might have had the better translation after all, in that \nordinary powers we have, as humans further along the timeline, are \n\"super\" compared to what they were until recently.  We fly places.  We \nGoogle stuff.  We see the Earth from space.\n\nCompared to humans just a short time ago, in terms of environmental impact at \nthe terraforming level, for better or for worse (or neither or both), \nwe're now \"super\" or \"uber\" or \"on steroids\" if you will (\"over the \ntop\", \"hyper\", \"amped up\").\n\nNietzsche\n was right:  humanity was about to go into overdrive and into orbit and \nnow we have \"overview\" (Über-view) from space.  We see the fragility of \nour situation.  That's what our new superpowers (powers of oversight) \nhelp us realize: that we're uber-vulnerable, as a ball-shaped ecosystem \nin the middle of nowhere.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}