{
  "id": "4729443456989845299",
  "title": "Songs from the North (movie review)",
  "published": "2016-06-19T16:54:00.002-07:00",
  "updated": "2018-06-22T10:40:40.501-07:00",
  "content": "I learned quite a bit from this documentary by a South Korean, doing a kind of anthropology that doesn't apply overbearing spin at every turn.  She takes very long camera shots, to the point where her subjects get uncomfortable, as may the viewer (the equivalent of staring, however she's getting permission, usually).  The opening shot, of some kind of circus act, prepares us for her style, which I'm not objecting to, only describing.\n\nShe's not without opinions or views, though when it comes to politics she turns it over to her dad to talk about his friends who went north out of idealism.  In her dad's view, whatever Communism means, mainly [a society among equals](http://mybizmo.blogspot.com/2016/01/the-berlin-file-movie-review.html), is not what's practiced by \"the Kims\" and the cult of personality developed around them by orphaned and existentially traumatized children, now adults with children of their own.\n\nThe filmmaker suggests North Korea's freakishness is due to a freakishness of another kind:  we all know [what Americans are like](http://worldgame.blogspot.com/2004/12/team-america-world-police-movie-review_04.html).  We hear an American talking about wartime supply lines, and a goofball general wondering, [like MacArthur](http://controlroom.blogspot.com/2011/11/fire-and-ice-korean-war-movie-review.html), why his troops were held back in any way.  \"We had the atomic weapons and could have done whatever we wanted to up there\" he says, leaving us to wonder what \"we\" wanted to do, and about what exactly. General Westmoreland's Vietnam was still ahead, as was the hit movie and then TV show, MASH.\n\nThe Japanese oppressed the Koreans terribly, and then the Americans came in and sliced the country into two, along a parallel that North Korea's Kim Il Sung never accepted.  His efforts at reunification brought nothing but more retaliation from the Americans who had meanwhile become friendly with both Japan and Germany (vanquished foes make good friends).  Following world affairs has never been easy.\n\nThe North Koreans eye East Germany as prototypical.  How East Germany got incorporated into the EU might serve as a model for their own reunification as a peninsula.  Yoo's dad encourages the North to build up its economy, which, as Communist, should be its first priority, but he sees them mostly doing political calculations instead.  The North Korean geeks are worried, that if a merger backfires, they'll be blamed and treated as internal threats, simply for being most like their counterparts (geek culture is cross-cultural because the Internet is uber-permeable).\n\nWe're left with Yoo's strongest impression:  this is the loneliest country on earth, in a twilight zone of only a short history shrouded in myth.  Neither the underground test nor the satellite launch looked all that believable but I'll leave it to the experts on Wikipedia to argue whether these have anything to do with real phenomena.  Why should the rest of the world tease and taunt a lonely child?  Why be so childish?  Yoo's eye is compassionate, neither apologetic nor angry. She [didn't start the fire](https://youtu.be/cDPnsTRAvIM).\n\n:: flash forward to 2018 ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}