{
  "id": "115152225446583649",
  "title": "Spaceship Earth 911",
  "published": "2006-06-28T19:20:00.000-07:00",
  "updated": "2006-11-15T11:44:20.581-08:00",
  "content": "Again, a control room needn't be a panic room, and although the medical situation for many is dire, we needn't wallow in hopelessness.  Taking command and control remains a live option, even if it's too late to save everyone now entented or wandering roadside, stomach empty, support nonexistent -- around [Darfur](http://www.cia.gov/cia/publications/factbook/geos/su.html) for example.So the reality TV backdrop we've got already (so no need to mock it up):   a scene of misery and devestation in many parts of the globe, with complementary skillsets and resource inventories likewise scattered about.  The plot, in broad outline, is:  improving our ability to coordinate as a species, to feed ourselves and develop a healthy body, the body of humanity.If that sounds like a Christian mission, that's probably not accidental.  We wish to heal from sin, where sin is our error-prone nature, our need for divine guidance per whatever governing gyroscopic theology, mythology or science fiction (we have [many namespaces](http://groups.yahoo.com/group/synergeo/message/28484) besides the Christian ones, also doing good work (we all learn from one another, i.e. our diversity works to our advantage over the long haul)).In the old days, the Charity Channel was mostly on backwater cable, not considered ready for prime time, because the storyline was more about \"fighting for a lost cause\" than about \"winning the war\".  Viewers got demoralized when all they saw were needy people to the horizon, with a couple overworked doctors in the foreground.Where are the logo-identified medevac helicopters and the lunar base like desert domes, complete with [Red Cross](http://www.redcross.org/news/ds/iraq/human_resp.html) rehydration clinics and HVAC utility pods?If we had some props of that caliber, we might start getting some real advertising revenue (a bootstrapping process -- self- amplifying), and a growing cast of star performers, sometimes those same overworked doctors (like that guy Jack in Lost), but now faced with a different set of challenges.  Or like [Lara Logan](http://en.wikipedia.org/wiki/Lara_Logan), chief foreign correspondent for CBS News, and a recent visitor to Darfur.And like in Lost, we'd take time out to do flash backs, except now we're filling in with real bio, like we do with soldiers sometimes, if their story is known.Our military got a foretaste of such action in the last South Asian tsunami, and found many ways to stay relevant, including with ships and helicopters.  Effectively safeguarding our desert domes from wandering marauders may require some serious ATV  training in Oregon.  Other sites may require perimeter checking by biodiesel motorcycle or snowmobile.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}