{
  "id": "1687226682123049940",
  "title": "Spectre (movie review)",
  "published": "2015-11-06T22:41:00.001-08:00",
  "updated": "2015-11-12T08:05:32.181-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/22853625641/in/dateposted-public/)\n\nI started watching Bond movies in middle school at the Teatro Archimede (no longer in business) in a high density suburb of downtown Rome, near Piazza Euclide (red balloon on image), our family apartment being near Piazza Ungeria, Viale Parioli Twenty-Five (closer to right edge, across from that roof-top swimming pool).\n\nYou may imagine I was nostalgic for Rome, a great city for a car chase.  Bond stuck behind that Cinque Cento... hilarious.\n\nI think we were all afraid the cars would blast into St. Peter's basilica itself, which would have been in poor taste most likely, and the franchise wisely steered clear, though does allude to the priesthood in passing.\n\nI remember taking my daughter to her first Bond film [in Santa Fe](http://mybizmo.blogspot.com/2006/12/action-figure.html).  Dawn was on oxygen and Apria helped us orchestrate some high tech logistics.  Santa Fe under snow is something else.  This new Bond guy was just getting going with [Casino Royale](http://worldgame.blogspot.com/2006/12/casino-royale-movie-review.html).\n\nI had a lurking suspicion I might have missed one and I did, Quantum of Solace, but this episode maintains continuity with the last, not breaking the storyline, and keeping with Daniel Craig.\n\nA lot of the \"intelligence lore\" is converging to the same plot lines anyway:  automation is putting even these pros out of business.  They plan to phase out all the \"double ohs\" with their too human judgements.  [Computers are taking over](https://flic.kr/p/ATxKtQ), along with [minions](http://controlroom.blogspot.com/2015/02/despicable-me-movie-review.html) and drones.\n\nLets cut to [the BBC radio interview](http://www.bbc.com/news/uk-34644273) (replayed in the US) of two disguised-voice MI6 types, having more fun around this movie, assuring the public that the real spies of the British intelligence apparatus are quite the opposite of Bond in so many ways, but especially in brashness.  Whatever happened to self-effacing?  Bond keeps making a spectacular spectacle of himself (luckily for movie-goers).\n\nHowever, this \"we're just goody-two-shoes government servants\" line plays into the poking and prodding these spy thrillers get away with.  The Marvel Comic style projection, with moments for uncomplicated self reflection by almost robotic characters (that's a compliment) is a good fit for the big screen and its hoodwinks and hi-jinx.  The more serious-minded derive their thrills in other ways, through [John le Carré](http://controlroom.blogspot.com/2014/01/more-espying.html) (a pen name) perhaps.  Different strokes for different folks.  Some read Tom Clancy (not me).\n\nThe suggestion that all this trashing of real estate and pouring through expensive merchandise, in addition to loss of life, has to do with sibling rivalry, family feuding, is a great statement on history.  I'm reminded of another spy novel of sorts, [The Jew of Linz](https://groups.yahoo.com/neo/groups/Wittrs/conversations/topics/7089), which makes all of WWII a closet brawl between two school boys (young Adolf and Ludwig, Hitler vs. Wittgenstein) who presumably couldn't stand each other (the record is open to interpretation) -- and the rest is history as they say.  Makes a good story, as many spy stories do.\n\nOur Portland audience at Cine Magic Theater was entertained, with a burst of laughter when the violence turns to sex per an abrupt and well worn formula.  That's the Bond brand, meant as light fare with some gorgeous photography and lots of beautiful people.\n\nBack to movie magic, the seemingly seamless blending of reality and imagination is pushed to the state of the art in Bond films.  The London landscape is as plastic as Narnia's, it sometimes seems.\n\n[](https://www.flickr.com/photos/kirbyurner/22424349617/in/dateposted-public/)\n\n:: former family digs, top floor right, with terraces ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}