{
  "id": "6601527735137263401",
  "title": "Spherical Trig",
  "published": "2015-04-21T17:37:00.005-07:00",
  "updated": "2015-04-21T18:11:23.099-07:00",
  "content": "I've been brainstorming with my peers [on math-teach](http://mathforum.org/kb/forum.jspa?forumID=206&start=0) about how to make spherical trig more accessible, starting with a set of tools and not staring at a lot of cryptic scripting language right off the bat.  [On a sphere](http://www.dividedspheres.com/), the Pythagorean Theorem has [a different form](https://www.math.hmc.edu/funfacts/ffiles/20006.2.shtml).\n\nImagine a curriculum that [used a code](http://mathforum.org/kb/message.jspa?messageID=9751074) such as:  sTem; STem; steM... to highlight which of the four domains (Science, Technology, Engineering, Mathematics) gets the most emphasis in a given Lesson Plan. Multiple letters might be highlighted.  Superimposed (stacked), the Lessons reinforce one another and build up a multi-layered surface (spherical) or system (global matrix).\n\n[The acronym STEM](http://controlroom.blogspot.com/2012/07/avatar-suits.html) is perhaps peculiar to English and need not be taken too seriously.  The pun on STEAM, [with A = Anthropology](http://mybizmo.blogspot.com/2015/02/thirsters-2015226.html), seems to be one of STEM's chief values as a marketing device.  We get another bridge to the Humanities through [Anthro / Animal](http://worldgame.blogspot.com/2009/03/more-on-quaker-animism.html), thereby unifying the Liberal Arts in true Trivium / Quadrivium fashion.\n\nIn Synergetics, the spherical triangle is emphatically a face of a tetrahedron with edges to the planetary center.  Saying \"planet\" for \"system\" has a somewhat [Little Prince flavor](http://www.generationterrorists.com/graphics/the_little_prince_011.gif).  But then we already use the word World for [a namespace](http://worldgame.blogspot.com/2006/04/another-wittgenstein-essay.html), as in Python World, or Python Planet (both references to the computer language, but of course Monty Python resonates as well).\n\nMy travels took me through Salt Lake City recently and I found myself reading [about Pink Floyd](http://www.hcn.org/wotr/14750), the pink flamingo that escaped from the zoo and lived in the wild with the other birds for a number of years.  Brine shrimp are plentiful in those lakes (a patchwork of shallow mini-lakes), though I'm not sure if that's what flamingos actually eat.  Tourists would spot [Pink Floyd](http://worldgame.blogspot.com/2015/04/olpc-oppa.html) from time to time, but he or she drifted off and was last seen in Idaho.\n\nAmong the tools a student might use:  Google Maps and/or Google Earth for finding locations and getting their lat / long coordinates.  These might be fed to a Web resource (URL) that spits back XYZ coordinates, taking Planet Earth to be centered as some origin.  Straight line distances through the Earth's crust would [correspond to chords](http://mathforum.org/kb/message.jspa?messageID=9751090), whereas on the surface we have geodesics or great circles.  Going from lat / long to XYZ to spherical coordinates helps us translate between data sets.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}