{
  "id": "3295813404975462957",
  "title": "Spring Retreat",
  "published": "2024-03-11T05:57:00.000-07:00",
  "updated": "2024-03-11T15:17:48.344-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52866258468/in/album-72177720307981496/)\n\nIf you've seen my Graph Theory slides, you might remember I toss my high school yearbook picture onto a slide next to Sam, likewise a younger man then, in the company of Bucky Fuller. They flew to the Philippines together, as guests of the Marcos family. I was living in Manila at the time, or perhaps was away for college. I was in Class of 1976 at International School Manila (ISM), which still exists but in newer digs.\n\nSam and I didn't know each other then. I learned of Sam Lanahan through Trevor Blake, who tracked him down as one of the owners of an original Tetrascroll, a very limited edition artifact. We set up an appointment to see it (but have yet to do so (it's still in its case)) and drove to Corvallis to meet the guy. We continued to hang out sporadically and undertake collaborations well into the future, especially during a chapter wherein Sam lived in Portland itself.\n\nSam's grandparents were pretty famous: F. Scott Fitzgerald and his wife Zelda, their daughter \"Scottie\" (Frances) being his mom and one time columnist for the New Yorker. Sam's dad, Jack Lanahan, had been a boxer in his Princeton years. After Frances died, he remarried. \n\nAfter moving from Corvallis to Portland, Sam moved a few more times, winding up in a well appointed farmstead in the Willamette Valley. Which is where I am right now, on retreat, working on projects, such as on Quadrays for M4W (math4wisdom).\n\nMy backyard in Portland is an outdoor museum for c6xty exhibits. The plastic sculptures become somewhat brittle after years in sunlight so we probably won't move them. \n\nThese prototypes were meant to provide lots of feedback, about stressability, durability, replicability, constructability and so on. Several test materials were employed: plastic, steel, copper, aluminum. \n\nThe farmstead is likewise decorated with specimens of each. C6XTY is a subtype of Flextegrity, which is adjacent to Tensegrity (ala Kenneth Snelson et al) but is more lattice-oriented.\n\nWhat I've done around Flextegrity is develop my Python code base to render computer graphical versions, sometimes in the form of animated GIFs. My graphics generating pipeline involves using Quadrays sometimes, a type of vector akin to XYZ but featuring \"basis vectors\" at 109.47 degrees to one another. They're designed to make lattice work easy, as in closest sphere packing arrangements (Conway: Barlow packings). All the CCP balls (that's a specific packing pattern) have whole number 4-tuple coordinates, such as (2,1,1,0).\n\nNowadays I'm collaborating on Quadrays via the M4W Coda. We're seeing to what level AI might get involved, among other experiments. I'm taking advantage of the high level of fluency around mathematics I'm encountering at math4wisdom, which is anchored by Andrius Kulikauskas, a math PhD. \n\nDoes a \"vector space\" have to have a dot product? Even if it doesn't, might it still include Euclidean Distance? \n\nMust basis vectors be unit length by definition? \n\nWhat if they span space without relying on negative mirrors of themselves, shouldn't that count for something?\n\nIn XYZ, we have three positive basis vectors that may be scaled by -1, which means reversed, which some might classify under rotation (i.e. to \"face the other way\" is to rotate by 180 degrees). \n\nThanks to negation, -X, -Y, -Z will also participate in space-spanning, but as secondary, non-basis vectors. They're second bananas.  (4, -1, 0) entails adding an X basis vector, stretched to 4 times its original length of 1, added to a negated Y (so a -Y), and no Z involvement, giving this point in space, now uniquely addressed.\n\nThanks to vector reversal, the three positive basis vectors (X, Y, Z), abetted by their second bananas (-X, -Y, -Z), span all of space by means of addition and further stretching or shrinking, but without further need for rotation. (4, -1, 0) = 4X + 1(-Y) + 0 where X and -Y are vectors (pointy arrows, directed rays of definite length (i.e. not rays \"to infinity\")).\nIn the IVM, [using Quadrays](https://worldgame.blogspot.com/2024/03/pattern-matching.html), we have four positive basis vectors that may optionally be scaled by -1 (reversed), but we don't need that \"rotational\" feature to have adding with scaling span our space. We never needed the help of a supplementary cast of negated basis vectors, to reach all the stars in our universe (points in our spatial volume). Just stretch or shrink at most three of these four Quadrays, without changing direction, add, and you're done. (4, -1, 0) is equivalently (4 sqrt(2), sqrt(2), 0, 5 sqrt(2)).\nIVM = Isotropic Vector Matrix, Fuller's coin, but not unrelated to the Matrix of science fiction, since aberrations of Fuller's IVM give it \"frequencies\" (think of wind chimes) which are like immersive radio channels or scenarios in those Matrix cubicles. \n\nThe IVM is like the Star Trek holodeck in other words, but with no exit or off switch. \n\nHowever, more prosaically, it's simply the skeletal scaffolding one gets from the aforementioned CCP (cubic close packing), a ball packing pattern of ball:space density of about 74%.\n\nSam's C6XTY (or c6xty) lattice places a compressive soccer-ball-looking element (same Adidas Telstar hexapent geometry) at every IVM hub, such that those most immersed all have twelve balls around one. But unlike in the CCP, these plastic balls do not touch one another. They're suspended in a network of connecting armatures, adding lots of flexibility, permeability and variability to the design. \n\nFlextegrities could be more like jellyfish, with thin yet stiff enough filaments holding sensors in a neutral buoyancy lattice submerged in water, perhaps in the open ocean. The sensors might be whole number addressed, as by Quadrays, and selectively illuminated or otherwise activated by Wi-Fi.\n\nMy dad and I took up scuba diving in the Philippines, so it's not unusual for my mind to drift to these undersea vistas. Sam had some experience in marine biology as well, as did my cousin Mary (who went on to get a medical degree). Therefore the posters Sam had made for Lattice Gallery (a West Broadway popup in that winter of 2019), showing off Flextegrity in its underwater context, did not seem as far-fetched to me as they might have for other visitors. Experiments with immersed flextegrity lattices could be undertaken today, and/or may already be underway without my knowledge.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}