{
  "id": "7194303223507824959",
  "title": "Spring Breakers (movie review)",
  "published": "2013-05-15T14:53:00.003-07:00",
  "updated": "2013-05-15T18:12:09.360-07:00",
  "content": "I've started on a plan to watch a lot of Harmony Korine films.  The Bagdad kicked it off [with Spring Breakers](http://www.imdb.com/title/tt2101441/), but Christine ([a film maker](http://worldgame.blogspot.com/2013/03/argo-movie-review.html)) showed me [Gummo](http://mybizmo.blogspot.com/2013/05/gummo-movie-review.html) first.\n\nThe film somewhat mocks the Spring Breaker as a type, a species, that never wants to break character.  Once in a swim suit, they stay in a swim suit, or partially out of them, as if clothes really had no protective value (and they don't, against bullets).\n\nThere's a Survival aspect in the way these girl survivors winnow down to the two we're warned are baddest at the beginning.  They're bad all right (as in \"bad ass\" thinks the Breaker), hard core.  One might segue to Thelma and Louise at the end, given no good may come of it.  They think as one unit, as Borg, or two Debbies from The Oblongs.\n\nOne might think of this as the R-rated sequel to that [It's Friday music video](https://www.youtube.com/watch?v=kfVsfOSbJY0).\n\nNow watch the first four minutes of [this Occupy film](http://worldgame.blogspot.com/2012/04/occupation-nation-movie-review.html).\n\nYou've just learned a lot about how hedonism and consumerism help contain the tribes.  \"What?  Contain?  They're out of control!\".\n\nThe Breakers proselytize, but aren't missionaries, and they have no standing army or sprawling priesthood.  They do not rape and pillage or set fire to small villages in Southeast Asia.  Yes, the girls enjoy the fundraising aspect, which is both thrilling and extortionist.  Girls with guns get awfully cocky.\n\nWith \"gangsta girls\" in charge, you go up a rung [from imperialist Patriarchy](http://mybizmo.blogspot.com/2008/05/defending-homeland.html).  Many will frown at that contention and say good Christians are more benign than this orgiastic frenzied devil-worshiping mob.  No, these were the good Christians, look how they call their mothers.  It's the men who seem more corralled and inhibited (not subdued, not unduly oppressed), and I'm saying that's [a step up](http://youtu.be/nET_ritoaNM).\n\nGirls are better at \"going wild\" in some ways, less Fascist-Apollonian, [more Athenian](http://worldgame.blogspot.com/2006/03/temple-to-athena.html).\n\nHow much like Burning Man (Burners) or the Country Fair near Eugene (Cascadians), or Rainbow Gathering? \n\nThe desert is less forgiving than sunny Florida, and hippies mix in their studies more, versus swinging to both extremes.  Protective clothing is likewise far more necessary in the forest.\n\nThose hippies and punks tend to geek out more (Tarot anyone?), are more DIY, plus maybe use a different mix of controlled substances.\n\nNone of these \"live forevers\" (like in Groundhog Day) seemed interested in learning scuba or marine science.  Their inability to get passed eternal frolicking marked them as still bambi-like in those bathing suits.  They'd get older, if not badder.\n\nNo review of this movie would be complete without some mention of the soundtrack and the \"loading gun\" swipe sound. What could so easily be an amateur's touch proves an effective suspense builder.  It also sounds something like a camera (lots of shutter action).  The camera itself is a weapon and or precision tool, a scalpel perhaps, for this skillful postmortem.\n\nThe editing style is also worthy of notice, with short repeat loops, a kind of \"going over a few times\" (like \"scratch\" in DJ world), mixed with flash backs to longer ago.  Events emerge in collages versus one strict chronology, a scrap book effect, jumbled-frenetic.  Blended memories.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}