{
  "id": "2505227686996543275",
  "title": "Spring Appears!",
  "published": "2017-04-02T17:44:00.000-07:00",
  "updated": "2017-04-06T12:18:35.253-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/32951240934/in/album-72157680386126360/)\n\nWe got this message in Meeting this morning, from someone usually reluctant to channel (we don't usually use that word, it's not a seance): spring has sprung, rejoice (paraphrase). I've certainly noticed a burst of activity, including in terms of my own megabytes per hour upload rate.  Meaning: in the last forty-eight hours or so, I've added about eight Youtubes comprising much of the new playlist: [Synergetics 101](https://www.youtube.com/playlist?list=PLeBIlkJm4xglicSifacG4eewD9CQaWvU0).\n\nGlenn and I took the maxi taxi to Silverton yesterday, April Fool's Day, \"maxi taxi\" being a nickname for [Razz's successor](http://controlroom.blogspot.com/2016/09/art-car.html) in my driveway, good story.\n\nGus Frederick was leading a workshop on digital scanning at Seven Brides Brewery, a place I'd gladly visit again.\n\nThe Norman Rockwell display of Four Freedoms, gigantic wall posters, was worth the price of admission, a figure of speech, as there was no admission charge, nor even a fee for Gus's fantastic workshop, a presentation by Northwest History Network (NHN).\n\nGus knows his stuff and makes it all look so easy. He was using Photoshop with an Epson scanner, high end enough for a from-above light source, for scanning slides or negatives, either color or monochrome.  He demonstrated using other technologies too.  That's a workshop worthy of [its own journal entry](http://mybizmo.blogspot.com/2017/04/digital-scanning.html).\n\nAt Quakers this morning, we celebrated April birthdays. I stood to wish my mother Happy Birthday, in keeping with what others were doing, celebrating birthdays of folks not actually in the room. Many people here know her.  She hopes to be in Portland by May.  Joe Snyder has a new grandchild, born on the March-April cusp.\n\nDiane Hollister was in Iran forty years ago, as a Lewis & Clark student. That's one of our local colleges, considered top notch. She stayed with a non-English-speaking family for nine months. When her Farsi failed, they'd resort to French.\n\nShe was just back from a second trip, with a lot of perspective, from having been away for a couple generations (lets say generation = twenty years). A large gathering of curious Friends assembled, after social hour.\n\nBob Barker, a meeting member, whom Diane knew from as long ago as the first trip, was a part of her group this time. The Barkers, like the Urners, have spent a lot of time outside the US.\n\nTowards the end, we talked a lot about traffic in Tehran and driving habits. Diane had a fun video, POV the front seat of a van in the downtown, with people walking every which way. That's a standard topic when cultures discuss one another.  Driving customs vary widely around the world.\n\nI wasn't expecting this presentation, having missed it in the bulletin, and didn't say anything from my back row position.  I'm sometimes quite talkative about the Trucker Exchange Program that would put Americans in the Stans on a civilian basis, earning credit from a (reconstructed?) university.\n\nSomething along those lines.  I want experienced truckers to see more of the world if they want to.  The program could take off within a global company perhaps, or several.  I'd think more universities might get involved.\n\nLong ago, as a teenager, I went through Tehran, Shiraz and Isfahan with my parents, on home leave from the Philippines (dad was with USAID and entitled to this family trip back home).  That was not the same year we went through Kabul in route to Tashkent.\n\nI was later in Cairo (my parents had moved) when the Shah was kicked out and taken in by Egyptian president Sadat as an asylum seeker.  I wandered the streets of Cairo freely.\n\nThe next time I visited, I'd make more friends, assuming I've got my timeline straight.\n\nI've been doing some Facebook messaging with David Koski through a lot of this (not during Meeting for Worship of course, I always silence my phone or turn it off). Given the volume of Synergetics-related Youtubes going out from my PWS (personal workspace, or studio), I sometimes need to do some quick fact checking.\n\nI did get up Mt. Tabor (a local hill, a butte) once or twice in the last week.  That's what I should do next.  Walking is a form of meditation after all, or can be. There's a flight of steps I go up and down, one with a non-zero second derivative, meaning the steps get steeper as one gets towards the top.\n\n[](https://www.flickr.com/photos/kirbyurner/33715434961/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}