{
  "id": "6273481904911839690",
  "title": "Spy (movie review)",
  "published": "2015-07-04T01:46:00.004-07:00",
  "updated": "2015-07-14T10:55:55.849-07:00",
  "content": "My angle into this movie was from too serious a springboard.  I've been reading the \"new\" JFK book (2008), [by Douglass](http://911blogger.com/news/2013-03-08/vancouver-bound-author-james-douglass-jfk-and-unspeakable-adrian-mack-mar-7-2013), who talks about Thomas Merton -- whom I also read as a younger man some, though had no idea about those Cold War letters.\n\nI was in second grade or so, when the Cuban Missile Crisis happened.\n\nThat new JFK book, recommended to me by Friends, refers to so many other such readings and plunges me back into [that whole morass](http://mybizmo.blogspot.com/2006/08/blaming-castro.html), wherein the CIA swirls in a more down-the-toilet sense.  I've actually not finished reading it yet.\n\nThose were not happy times, and they stayed unhappy.  I can relate to \"long strange trip\" ala the [Grateful Dead reunification](http://mybizmo.blogspot.com/2012/10/remembering-dead.html) (upcoming in Chicago).\n\nI'd say the gear shift to this comedy CIA, one [the movie's writer-director](http://www.imdb.com/name/nm0082450/) unabashedly embraces for a ready meme set of spoof-able cliches, built up by Hollywood, in complicity with the CIA's own storytellers, over the decades, was somewhat jarring.\n\nAt first people seemed to be having some fun here, but no, it was still horrific, and still quite crazy, with rats and bats and stuff in the basement.  In making the control room batty, and outfitting it with a Brit, we bridge to British humor, maybe?  Did this movie play well in the UK?\n\nI of course appreciate the retro references (e.g. the credits), the semi-knowing satire.  But I noticed the audience around me was laughing and I was more just sinking down in my chair, worried I wasn't getting it.\n\nAccents certainly played a role.  Spy World has always been about i18n.\n\nThere's this sense of ordinary people bashing through that wall of illusion (movie screen) behind which the phony world of 007 (one of the previews was for [Spectre](http://www.imdb.com/title/tt2379713/)), its Never Land, does not exist.\n\nSaid [faux world](http://controlroom.blogspot.com/2007/11/good-shepherd.html) is here reconstructed as [more female-friendly](http://controlroom.blogspot.com/2009/11/spook-who-sat-by-door-movie-review.html) in some way (think [Carmen Sandiego](https://en.wikipedia.org/wiki/Carmen_Sandiego_%28game_series%29)), and a source of edginess and getting lost in fashion.  Vanity and jealousy are heavy duty in this space, so what else is new?\n\nNever Land keeps a toe hold in reality e.g. appears to have money, a real building [in Langley](http://worldgame.blogspot.com/2006/08/drinking-liberally.html). \n\nBuying into horror as part of the genre and making that an object of spoof just reminds me that Spy World is [also Gothic](http://controlroom.blogspot.com/2015/07/out-of-mind-sight.html) in the Lovecraftian sense.  I keep forgetting that.\n\nKafkaesque too.  Lets not forget Byzantine...  \n\nSo yeah, maybe not quite in the mood.  Why blame others?\n\nSo then I ambled down to the Blues Festival, in progress.\n\nI found a patch of grass in the semi-dark and started reading Madness and Civilization by Michael Foucault.  A lot of people have read that already, the Powell's paperbacks had been around the block a few times.  Maybe I'd browsed it before?  It seemed fresh to me anyway.\n\nI wanted a copy for Kindle so I could read it on my devices while listening to blues in Portland.\n\nOne thing I've learned from the new JFK book (also on devices) is how directly the Kennedy brothers took on some of the special interests, steel in particular.  Steel speaks up in Grunch of Giants too.\n\nI like the idea of a president as \"one who presides\", which is a long way from what the executive branch had become.  But then a lot of people want to participate in government.\n\nAs all presidents know, everyone, OK at least a few, want to be, or think they're a president too.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}