{
  "id": "3345213333517490869",
  "title": "Standards and Ramparts",
  "published": "2007-02-21T20:34:00.000-08:00",
  "updated": "2007-03-03T21:32:05.980-08:00",
  "content": "So the typical scene is a wall (ramparts) with flags flying behind them. Or if behind, then presumably you're on the other side? Would that be outside or in? On a ball, a triangular walled city is really just an interface between two cities, both with three corners and three edges. Remember, Earth is a ball. Tale of two cities.Anyway, so on my flag is this MITE, for Minimum Tetrahedron, and some initials [RBF](http://mathforum.org/kb/thread.jspa?threadID=1537020&tstart=15). We say minimal because tetrahedral but also because not handed: the right handed and left handed, inside out versions of one another, look the same. Then they fill space with no gaps, in terms of Couplers we might cast it, in our model of the IVM (a kind of holodeck for Scenarios Universe, our \"show and tells,\" partially overlapping, eternally regenerative). Handed modules would be like the As and Bs, which comprise the MITEs but, like the left and right handed Ls in Tetris, can't just stand in for one another as substitutes (\"some inside-outing required\").I took Carla and Scott on a mostly driving tour while Dawn underwent alternative therapies today. We left the GPS in the other car (their rental), so driving by feel, I approached Council Crest, only to veer around behind to Scholls Ferry (a road I'd haunted the day before, in service of my alma mater), winding to Hwy 24, into town via Rose Garden (made two passes at Portlandia), back under the cable car on I-5 to Humdinger on Barbur (near Dawn) thence to Grand Central Bakery in Multnomah Village, by way of old haunts (this was [Matt's and my](http://www.4dsolutions.net/cgi-bin/blog) early boyhood neighborhood, pre Rome, my Markham Annex now a corporate campus, Piggly Wiggly gone too).Cool interlude: we parked Razz at the Oregon Zoo lot and rode the Max elevator down to the station, hundreds of feet below through layers of sediment. Set into stone in this station is one vertical core sample, laid horizontally in a tube, with engravings suggestive of the millions of years that have elapsed, over the time of this core deposit's aggregating. Two trains arrived while we inspected the exhibit, one bound for Gresham (to the east) the other for Hillsboro (to the west).Once Dawn rejoined us (chauffered by Peg), we proceeded to the Chinese Garden, which the three enjoyed, as I took Razz over the Steel for some gas. Scott and Carla fly home tomorrow. She works in an Italian restaurant. Her boy Steve wants to pit for NASCAR and like that (a worthy goal I'd hazard).Yesterday was OMSI, fruit smoothies.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}