{
  "id": "4689842412788582651",
  "title": "Steve Jobs The Lost Interview (movie review)",
  "published": "2015-11-16T15:43:00.000-08:00",
  "updated": "2015-11-16T15:50:11.197-08:00",
  "content": "Let me immediately disentangle this interview from the docudrama running in theaters now, which features a Steve Jobs character, interpreted by an actor.  I haven't seen that one yet, but expect to at some point.\n\nNo, I was milling about at Quakers, chauffeuring mom (packing for Whittier), and ducked into Movie Madness, per longstanding habit.  I've been looking for Going Clear by Alex Gibney, which I'll watch and review next.  Gibney has done [a documentary on Jobs](http://www.imdb.com/title/tt4425064/?ref_=nm_flmg_prd_7) also, which I hope to see soon.\n\nJobs is still with NeXT in this interview, having suffered the painful break with Apple.  He's anticipating Apple's demise, with the next big thing clearly not happening there.  Apple would bring him back as their chief after this interview, as interviewer Paul Sen reminds us.  The rest is history (I'm writing this on a Mac Air, great machine).\n\nJobs is very succinct in his telling.  He fell in love with computers early, giving a story not unlike Neal Stephenson's in [In the Beginning...,](http://www.cryptonomicon.com/beginning.html) then talks about the Three Things they showed him during his now legendary visit to Xerox-Parc, the Seat of Genius in this story. \n\nHe only saw and understood the first of the three things, at first:  the GUI.  Anyone seeing a graphical user interface for the first time knew that would be the future.  The Terminal would become one of the windows.\n\nThe two other things they showed him, which he didn't get at first:  object oriented programming, and networking.  He would grow into those visions later.  NeXT was all about developing and extending the former.  He's quite right about what we should expect from the Web, a decade ago.  A lot of us were.\n\nHe certainly seemed to me to have his ego under control or is that calling the kettle black?  He's quite happy to stand up for high quality and does the hip-hop thing of dissing his rivals, upholding his side in a rivalrous tale.  That's par for the course and translates to athletics.  But hey, this is just the one interview -- lots of jabber about Jobs in the background in November, 2015.\n\nWindows was maybe more plebian, but somewhat paved the way for Free and Open Source by prepping a generation to be unafraid of hardware guts in open cases. \n\nMacs were intentionally a lot harder to break into and mess with.  The IBM side of the business, with its PC clones, did a lot to make Linux happen, and Linux is still happening.  IBM was happy to provide source code as well (the case of SCO).\n\nI sometimes forget I'm not using Linux when in my Terminal window on the Mac Air.  How did it go again? Was Darwin a port of FreeBSD?  Time to [check Wikipedia](https://en.wikipedia.org/wiki/Darwin_(operating_system)).  I think of Windows versus POSIX as backward versus forward slash cultures (\\ versus / e.g. C:\\ vs. /bin).  We call that os.sep (separator) in Python and let the host operating system supply the value.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}