{
  "id": "8282192311358939939",
  "title": "Stewart Brand at Reed College",
  "published": "2011-03-10T11:22:00.001-08:00",
  "updated": "2021-08-26T18:43:04.007-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157626240927728)\n\n:: Stewart Brand at Reed College ::\n\nGlenn and I got there way early, as I was having paranoid fantasies of lines around the block and not being able to get in to the Kaul Auditorium.  Stewart Brand, co-founder of Co-Evolution Quarterly, Whole Earth Catalog, the WELL, Clock of the Long Now, with tons of other street cred, is like a superstar in my little fish pond.  I was expecting most of Portland to be there.\n\nAs it was, the auditorium was comfortably capacious for the many Reed students and faculty, with a smattering of Wanderers.  Don joined us closer to opening time.  Those who got there early got to see [this Youtube](http://www.youtube.com/watch?v=FcUi6UEQh00&feature=related) (or one very like it) which Stewart clearly found hilarious and ingenious because of the guy's inventing an English-sounding \"language\" (I'd just come from a Wittgenstein study group session where we discussed the \"private language argument\", so this seemed peculiarly apropos).\n\nStewart is a big picture thinker, taking a uniquely individual angle on stuff.  He thinks cyber-government needs to charge the externalities of coal burning back to the coal burners (that'd be most of us), so we'll have to pay a lot more for the privilege.  Cheap coal is both trashing the climate in ways that might kill us (the Venus Syndrome) while keeping competing solutions at bay.  \n\nHe's finding wind power to be something of a boondoggle and favors civilian nuclear plants, including [the kind that eats the nuclear weapons](http://www.youtube.com/watch?v=PF30dYey-w8) captured from those antediluvian criminal syndicates who still think about using them.  The smaller plant designs, well under a gigawatt, would bring the power sources closer to the villages or townships.\n\nHe's pro solar, but doesn't like the idea of bulldozing thousands of acres for these vast arrays of panels.  Wind farms are likewise land hungry.\n\nWill there be fusion in our future?  He's an older gray guy, so is quite aware of how long we've been hearing that hype, but he doesn't mind contributing, including by providing the voice-over for a rather elaborate cartoon about the latest ignition scheme.  \n\nOn the whole, his slides and videos were top notch.\n\nStewart has a lot of respect and admiration for humans [slogging in slums](http://www.youtube.com/watch?v=et7CmsdGktg&feature=related), building cities at a higher rate than ever in history.  He's not dismayed by poverty, but encouraged by trends.  We just need to keep harvesting that energy, without triggering a Venus Effect (ala Lovelock) and enjoy a bright future.\n\nEnergy includes biomass of course, and he's pro genetic engineering.  As an open source hacker type, he takes [the Freeman Dyson view](http://mybizmo.blogspot.com/2009/12/freeman-dyson-in-portland.html) that monopolistic control of biotechnology by corporations is already a thing of the past.  [Monsanto](http://worldgame.blogspot.com/2007/02/geek-lore.html) could go belly up tomorrow for all he cares, yet bio-engineering of new food stuffs, some with medicinal properties, is here to stay.  Which doesn't mean that all applications to date have been well managed or [sustainable](http://worldgame.blogspot.com/2006/05/trojan-implosion.html).  \n\nListen to those closest to the technology in question, such as farmers and foresters, he counsels -- a way of making friends and allies.  He'd been a logger in Oregon in a past chapter, as well as a rock music show producer.  \"Loggers love the woods\" he intoned.  He has the sensibilities of a politician, although he's happy to pick arguments with libertarians or anyone who thinks civil servants are to blame for the world's ills.\n\nThe central question of our age, he said, is whether democracies can self-organize to the extent needed to get their ecological house more in order.  The global climate conundrum is going to remain a scary source of inconvenient truths.\n\nHe likes that new variety of vitamin A rich rice (hitherto a missing ingredient), and sees anti-GMO sentimentalists as unwittingly condemning more children to blindness, as a result of the delays they'd imposed on the roll out of this genetically engineered product.\n\nDuring the Q&A, many questioners took different points of view.  Stewart was always happy to refer back to his sources and reading list, so we could delve more deeply and appreciate where he was coming from.\n\nStewart reminded me of [Duane Ray](http://mybizmo.blogspot.com/2008/09/wanderers-2008930.html), one of the Wanderers in attendance.  Duane asked me if I was pro or con nuke plants and I gave a somewhat count-intuitive, counter-cultural response, [practicing counter-intelligence on Americans](http://www.mathforum.org/kb/thread.jspa?messageID=7406105) to comical effect (Duane laughed). \n\nThe faculty member making the introduction (biology and environmental sciences department) mentioned Stewart's intelligence community connections, plus we'd heard talk of the CIA at[ the PPUG after-party](http://mybizmo.blogspot.com/2011/03/ppug-201138.html) from some guy in police work, relaying some CTO views.  Stewart didn't seem at all worried about those Persian nuke plants, which currently borrow their fuel from a Russian fuel bank (library). He mentioned Valarie Plame of [Countdown to Zero fame](http://worldgame.blogspot.com/2010/07/countdown-to-zero-movie-review.html).\n\nStewart also thinks there's a right way to do fish farming (as well as a wrong way) and humans should let more of the wild stay wild, far less interfered with.  Why eat any wild fish at all?  Grow your wood crops and leave natural forests alone too.  Bring back beavers.  Introduce more diversity.  This is his vision of how humans should live:  as catalysts for nature's abundance and propensity for innovation.  Accomplishing this goal requires keeping global temperature in check -- his highest priority.\n\nReed's campus is quite beautiful.  People who get to live there must feel ultra-privileged.  I don't know if its environmental sciences department has a \"weapons inspector\" major or course (something I've been pushing for OSU), but there is a nuclear reactor on campus.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}