{
  "id": "9039118898422897057",
  "title": "Storyboarding Tomorrow",
  "published": "2009-03-04T21:52:00.000-08:00",
  "updated": "2009-03-08T11:10:44.591-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgiCMaog0BZEZD8hUIHCGtJLr-gChgnT7wceoY7McPK_SiY8PyFbS5COlp6SBVYrU23Cypmul1dDZKv-cvQfyur4mZkllfaq_D2APxYfA2KuC-e-b_OyGrojSbt5wbamGkC4RW_/s1600-h/autonomous.jpg)Autonomous living unit, 1949 Buckminster Fuller © Buckminster Fuller InstituteI admit getting a little testy [with Sunanda](http://worldgame.blogspot.com/2009/02/hippie-dude.html) today, when he called me [at Fine Grind](http://worldgame.blogspot.com/2008/12/google-street-view.html), where I was manning a comm center with Andrew and Derek.Yes, I think Recode Oregon sounds like a fine idea:  decriminalize collecting rain water (like in Brazil right?), make it legally OK to engage in environmentally sound self preservation type practices, permaculture and whatever, all good.But I'm impatient with any solutions involving '[this old house](http://mybizmo.blogspot.com/2009/01/about-habitats.html)' so exclusively, much as I treasure having a roof over my head.Somewhere, somehow, we need to stop relying on \"[art colonies](http://www.bugbog.com/gallery/usa_pictures/burning_man_pictures/burning_man_1.html)\" to do all the hard work for us.  When do we transition from prototypes to civilian product lines not subject to waterboarding by the mortgage industry?  That's what our Medal of Freedom guy was after.The idea of an Experimental Prototype Community of Tomorrow ([EPCOT](http://controlroom.blogspot.com/2008/07/epcot-makeover.html)) was a good one.  But again, it's not all up to The Mouse in Orlando.  As FOSS capital, [we hope to contribute](http://worldgame.blogspot.com/2009/02/shovel-ready.html) in some way.Why [the Dymaxion House](http://www.thehenryford.org/exhibits/dymaxion/index.html) was so special, wasn't so much that it hung on a mast (although that was cool) but that it was built by engineers from Beech Aircraft.Once you have an enclosure of sufficient size, you're able to garden and get by with more \"movie set like\" structures, for privacy and compartmentalization, but not for primal defense against the elements (the job of the shell).That's one of many possible factory designs, check your catalog for more options (what catalog?).What TV channel was this again?  The taxpayers' channel?  Everything else is a rip-off maybe?Or let's just talk about money instead, how there isn't enough to go around (and never will be the way it's set up).Why focus on [engineering projects](http://controlroom.blogspot.com/2005/09/omr.html) in the midst of a credit freeze? Why indeed.Are FEMA trailers really the best we might do?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}