{
  "id": "6316026776220458710",
  "title": "Storyboarding Engineers",
  "published": "2010-12-22T23:58:00.001-08:00",
  "updated": "2010-12-24T21:13:32.317-08:00",
  "content": "We've enjoyed some passionate discussions on the Wanderers board, between actual meetings in the board room around the long table.  Those of us most active on-line may not be the ones who show up at the meetings and vice versa.The solstice party was fantastic.  [Gus](http://www.flickr.com/photos/17157315@N00/5275826668/) played some vintage radio from funnier times.I've been going over with Keith some of the [IAEA stuff](http://controlroom.blogspot.com/2010/12/countdown-to-zero-game.html) I've been looking at in connection with these [schools for diplomats](http://worldgame.blogspot.com/2010/12/schools-for-diplomats.html).  These are like [OMSI camps](http://worldgame.blogspot.com/2010/12/close-to-solstice.html) in some circumstances, complete with caring for horses (more important than riding them -- it's more about them in their welfare, not you in the movies pretending you're a cowboy).The cosmopolitan spin is about all getting along, even after we go back to our respective \"bubble villages\" in whatever grid sectors we monitor.  Maybe EMO should have a role.  Ecotrust definitely.  GIS/GPS is a big part of IAEA \"[geocaching](http://controlroom.blogspot.com/2005/12/we-win.html)\" (sometimes with assistance [from FBI people](http://controlroom.blogspot.com/2010/12/countdown-to-zero-game.html)).Although you may be picturing boarding schools for mostly young people, it's not always that way.  Picture a few thousand Camp Davids (maybe not easy, if you've never been there), and take the average.The reciprocity in training and verification techniques makes IAEA duty not unlike TSA duty, and indeed, there's overlap, and I'm not just talking about 12 Monkeys type stuff.  You might have a week's rotation in Colorado followed by a short stint in South Asia (many more states). All have their respective challenges.  Multi-tasking is less wearying (at least to some -- others like to stay focussed on the one situation).I've had to change my grading philosophy based on feedback from my boss.  Given the kinds of jobs I envision, I was being a stickler for details, but at this early stage keeping high morale is more important.  Many people lack the self confidence to jump in to this business.Here are some excerpts from my correspondence with Keith, archived to our group:What I write about are \"bubble villages\" that look something likethose DEW line encampments, or subsequent models.  The peopleliving there tend to have strong backgrounds in STEM.  They mightbe bioneers like John Todd, or developers of the Garden of Edendome concept, like J. Baldwin.  The latter wrote Bucky Works, an interesting book that has served as a basis for a lot of my screenwriting and science fiction planning for over a decade....Back to my original point, I see a lot of serious and immediate concerns about the health of the biosphere and ecosystem beingcorralled by this feckless discourse called \"global climate change\".Like, I'm fine with trying to figure out of the global temperatureis going up or down and whether the sea level is being affected.We need to monitor everything and have plenty of open data forpeople to analyze.  But I think it's mind-numbing to imagine that \"global warming\" is the only signature we need to look for, if the goal is to avert catastrophe and provide for the well being of future generations, of non-humans and humans alike.Yes to a focus on global climate change (one of many).No to any monopolistic hijacking of that debate by people who think \"climate\" does not include the presence or absence of nuclear weapons.  Their presence is warping everything about how humans behaveand that's affecting the climate.  Getting rid of them is what serious engineering is all about (unless maybe you live in the Lower48 where it's more like Planet of the Apes these days, monkey see monkey do etc.).Over on math-teach, [the topic is bandwidth again](http://www.mathforum.org/kb/message.jspa?messageID=7340689&tstart=0).  We watched [the RSA Animation](http://www.youtube.com/watch?v=zDZFcDGpL4U) about how adults are drugging their kids to keep them focused on too-boring-for-words presentations.  I'm hoping [the Ignite format](http://groups.yahoo.com/group/synergeo/message/63918) helps address the boredom issue, and that we can give students better self-management skills where \"brain meds\" are concerned.  [On Synergeo](http://groups.yahoo.com/group/synergeo/message/63926), Rybo is learning to say \"meds\" instead of \"medications\".  In my book, that's a positive.  Yes, idle banter, but among feuding factions, so an improvement in our internal affairs (buckaneer world).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}