{
  "id": "6786221177503851757",
  "title": "Stranger Than Fiction (movie review)",
  "published": "2016-02-28T15:57:00.002-08:00",
  "updated": "2016-03-03T09:19:20.655-08:00",
  "content": "This piece of fiction, a comedy, does what a lot of fiction does:  it sidesteps the implications of its twisted reality, or avoids letting us in all the way (another way of putting it).\n\nDustin Hoffman, the literature professor, and the novelist, hell bent on killing off her main characters, have a special relationship owing to their both understanding plot devices, common twists.   The novelist's assistant is also in on the scheme (another meaning of \"plot\").\n\nWill Farrell, playing the IRS agent, is relatively out of it (clueless) himself, but comes to understand it's up to him to make something of his narrative.  Just going \"by the numbers\" means leaving everything to fate.  He starts to take bolder action once the reality of his own mortality really gets under his skin.\n\nThe film was made in Chicago, as \"Any City\" (not specifically identified).  Although a very different movie, I had to remember Sacha Baron Cohen in [The Dictator](http://worldgame.blogspot.com/2012/06/our-week-in-indy.html), another case of opposites attracting.\n\nThe \"anarchist\" Farrell falls in love with has a bakery that gives off a Portland vibe, radiating its proud independence and rebellion from the fragile left brain number world.\n\nWill's is the weaker gender or \"hemisphere\" in this model.\n\nI stopped the DVD player to show the Food Not Bombs flyer prominently posted on the bakery bulletin board.  Some thought went into the decor.\n\nShades also of Trueman Show, maybe?  How is it that others are more in on the plotting than our hero?\n\nWhat's amazing is how seamlessly Will's evident psychosis meshes with the rest of reality.  As the audience of a fictional film, we get sucked in as the readers, i.e. the viewers, being initiated into an unfamiliar metaphysical setup.\n\nBut as viewers we're not omniscient (my earlier point), as we're left wondering how it all works.  But then \"they lived happily ever after\" is as problematic is \"little did he know\".  The former is more of a \"fade out\" convention i.e. \"here is where our story ends\" whereas the latter more often gets the ball rolling, plot-wise (as here).\n\nAnother reading is it all occurs in the mind of the novelist, obsessed with mortality herself, and suffering from writer's block, a threat to her identity as a writer.  She's exploring her on power to create the narrative, both her own and that of others.\n\nI've often wondered if the higher laws or patterns of occurrence we sense, the poetic part of life, might be as physical as Newton's laws.\n\n[At the quantum level](http://mybizmo.blogspot.com/2005/11/physics-emergent-isepp-lecture.html), we have a grammar, followed with no exceptions, yet might we say the principles at that level no more determine the plot than grammatical rules force the way a novel unfolds?\n\nTo commit to perfect grammar is not to surrender to fatalism or determinism, as a writer.\n\nHaving checked out this film on the recommendation of one of Lindsey's religious studies professors, we went on to review some of the camera work she had done around Occupy, and the Right to Sleep (perchance to Dream) too.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}