{
  "id": "4202433132259291991",
  "title": "Study Group",
  "published": "2009-12-09T08:43:00.000-08:00",
  "updated": "2009-12-09T08:44:12.934-08:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/4170171652/):: paper on mechanics ::I've formed a new triangle twixt [Phil Earnhardt](http://controlroom.blogspot.com/2009/11/ignite-portland.html), the Wanderers and myself (4D guy), for purposes of discussing \"chaos mathematics\" (in some ways an anagram for [Casino Math](http://www.wikieducator.org/Casino_Math)).Thanks to Phil's cue, we've been looking at The recently recognized failure of predictability in Newtonian dynamics by Sir James Lighthill F.R.S. of University College London (1986, The Royal Society).Chaos occurs with a phase change aspect, corresponding in some ways to the Synergetics distinction between Newtonian and non-Newtonian inter-relations between bodies, the latter termed \"precessional\" in his signature blend (vs. \"gravitational\" as a perfectly inverse square rule governed co-orbital affair).These unpredicted and sometimes synergetic behaviors, such as strange attractors, are not forbidden or in violation of the laws of Newtonian Mechanics, is what this paper is about (with an apology on behalf of anyone clueless who says otherwise).Terry chimed in from the coast, where he's working on a book, reciting much of his operating thesis.  He's a lot like Wittgenstein in the way he grinds through various presentation formats, same as me come to think of it.I'm alluding to a recent thread twixt Sean and SWM regarding LW's Blue and Brown Books and the role they played, not as drafts of something for publication, but as field manuals for his elite \"troops\" (first generation Wittgensteinians).The story of Chaos Mathematics is fascinating and has been developing since at least the 1960s.  It suggests that our seagoing crews may get a 10-15 day horizon for reliable weather prediction, with no way to effectively grow that bubble.One needn't reach into quantum mechanics or talk of some Copenhagen interpretation to get all the uncertainty one needs -- in a mathematical sense with real world consequences.  These are macroscopic realities involving suns and planets, not just subatomic particles, albeit the former come with longer predictability horizons w/r to their strangely attractive trajectories.  We have those lunar and solar eclipses mapped out for [quite a long time](http://eclipse.gsfc.nasa.gov/SEcatmax/SEcatmax.html) into the future, although with increasing delta T).[](http://www.flickr.com/photos/17157315@N00/4170187854/):: using gmail ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}