{
  "id": "6663814303506280599",
  "title": "Subconscious Demon",
  "published": "2017-12-27T14:30:00.004-08:00",
  "updated": "2017-12-27T15:42:34.210-08:00",
  "content": "Sometimes we externalize what holds us back. However, since the Vienna Circle days, a Renaissance in Austria before and to some extent between the World Wars, we've had [the alternative subconscious](http://controlroom.blogspot.com/2014/10/red-book-not-maos.html), or unconscious per Freud.  Universe, per Fuller, contained a subconscious demon, which kept his Synergetics enterprise from roaring ahead.\n\nNot that said demon was the only obstacle.  As Applewhite chronicles in his Cosmic Fishing, Macmillan was wondering what level of risk it was taking in putting its company name behind such an unusual and difficult to categorize work.\n\n\"Subconscious demon\" is the language Fuller used when explaining how he came to the T & E modules in Synergetics. He'd been seeking his elusive Volume Five and was somehow coming to the sphere as his missing puzzle piece, since it serves as an asymptotic extreme in some sense.  He'd tried all kinds of near-spherical approximations, including the enneacontahedron and the 120-triangles.\n\nThe Rhombic Triacontahedron cycled [back through his inbox](http://www.rwgrayprojects.com/synergetics/s09/figs/f86504.html), and this time what it shocked him with was how close to volume five, tetravolume-wise, it really was, if made tangent at the centers of its thirty diamond faces. Just a tad off.  The demon said \"trash it then\".\n\nThe same encasing strategy, in the case of the twelve diamond faces of the Rhombic Dodecahedron, yielded a volume of precisely six. So what were we doing, this close to five here?\n\nThis question led him to the celebrated difference between the T and the E, a difference not in shape, but in surface-to-volume ratio, never a constant with a change in frequency.  The E was a little less surface to contained space, yet the difference was so small, in proportion to the summary values involved.\n\n120 T modules, 60 left, 60 right, build the RT of precisely volume 5, and their radius (from encased sphere center to diamond face center) is ~0.9994 that of the E module radius of precisely 1.\n\nThese two almost-identical twin RTs define a \"median\" towards the middle of the Concentric Hierarchy, sandwiched between the small Cuboctahedron of 2.5, with one foot in Negative Universe, and the bigger Rhombic Dodecahedron of volume 6.\n\nThe scaled up T-mod RT of volume 7.5 actually shares vertexes with the A&B mod RD of volume 6.\n\nThen we have RT3, or SuperRT, the combination of the Icosa of edges 2R, and its dual Pentagonal Dodecahedron.  That's the \"phi-up\" of the 120 E-mods RT, with volume phi to the 3rd power greater.\n\nBy the time Synergetics 2 came out, he was free of his former sphere fixation, when it comes to Fiveness.  The new unit sphere formula still has π  (whether nature is using π  is a different question) as well as a root-of-2 (π √2   ).\n\nThat's useful for ratio-ing with six to get the space-to-ball density of the IVM FM (6:π √2).\n\n[](https://www.flickr.com/photos/kirbyurner/14887035886)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}