{
  "id": "9111238342020648926",
  "title": "Subgenius Devival",
  "published": "2009-10-11T11:06:00.001-07:00",
  "updated": "2022-10-28T15:39:30.563-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157622440758735)\n\n:: subgenius devival, pdx 2009 ::\n\nOur company forked into parallel tracks last night, though in retrospect I wish I'd been positioned to welcome another subgenius into the fold, as this was quite a good show. Reverend Stang was [in good form](http://www.flickr.com/photos/17157315@N00/4002751768/), as were these others from the inner circle.\n\nI was checking out this Ash Street Saloon as a possible venue for the Lindsey Walker Show and it met my criteria: room for dancing, a distinguishable stage area (preferably raised), and no problems with the neighborhood i.e. compliant with local zoning ordinances. This place definitely qualifies, as do Red Cap, Angelo's and Ladd's Inn. That's not to say she won't book elsewhere, just this is the groove or \"ground state\" as it were, to get more quantum mechanical about it.\n\nThe Subgenius Church imitates televangelical fire and brimestoney speech, encourages ranting. The clientèle tend to range to the geeky side, to the point of embracing weird as a badge of honor, like Portland does, or Austin. Bob Dobbs is the titular deity with uber-femme Connie a manifestation of his luckiness (more than smarts). Bob is modeled on the pipe-smoking 1950s salesman figure well-known to Americana lovers. You'll [find him everywhere](http://mybizmo.blogspot.com/2006/05/decoding-usa-culture.html) in the glossy commercial literature of [that era](http://controlroom.blogspot.com/2008/05/american-look-movie-review.html).\n\nThis morning I was more on the serious side, with other earnest Friends engaged in an overhaul of Faith and Practice, the privilege of any generation worth its salt (we're even somewhat inter-generational, though tend to be aging boomer-seniors for the most part -- \"geezers\" as Jane calls us). That was at Bridge City (hi Larry). Then it was back in the maxi taxi to blog and munch on some factory bread products. Now it's on to Multnomah Meeting wearing my Oversight hat (metaphorical -- the real deal is around the house someplace), going on foot, testing my iPod.\n\nThe reason my iPod needs testing is I went into the red for a Toblerone, to celebrate this first Portland Devival in like a decade. I consumed a lot of it, but stuffed the balance in [my Python fleece](http://www.flickr.com/photos/17157315@N00/3441042342/in/set-72157622440758735/) pocket when boarding the 14 bus, not bothering to wrap it in plastic or foil. This proved to have consequences: melted chocolate all over, meaning I spent much of the service licking my iPod, trying to cleanse it of the brown stuff. This was an appropriately kinky and bizarre activity to be engaged in, [given the venue](http://pdxdevival.com/). I was also [drinking Jack Daniels](http://worldgame.blogspot.com/2006/03/returning-to-pdx.html), grateful for a little R&R in a war crazy world.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}