{
  "id": "3962906479756957779",
  "title": "Subterrenean Maths",
  "published": "2019-03-27T18:29:00.003-07:00",
  "updated": "2019-03-27T21:04:07.393-07:00",
  "content": "Absent energy to keep Math Forum going, I suppose [the Math Wars went underground](https://medium.com/@kirbyurner/from-the-underground-railroad-93390c678891) to some extent. Visit [Forum 206](http://mathforum.org/kb/forum.jspa?forumID=206&start=0) and extrapolate somehow, if you wish to get a better sense of it.\n\nPart of the issue:  climate change active youth are less likely to stand for wasteful wood pulp textbook rackets if the PR doesn't find a way to offset the impression the dead tree ghettos are not privileged.\n\nI'd been decrying the heavy book bag culture for years, on similar environmental grounds, but I wasn't surrounded by activists back then.  This next generation is ready to fight.\n\nA lot of the currents were not of my making.  I didn't invent \"charter school\" as distinct from a \"school with no charter\" as two breeds of tax funded institution.  Portland's charters didn't get buildings.  They had to forage.\n\nNow that Franklin and soon Grant are rebuilt, better constructed to withstand earthquakes, there's a spreading sense we need to be more like Tokyo and rebuild lots of blocks.  Those hoping to hold on to Old Portland, at least in some areas, have the tourism industry on their side, or at least I would hope so.\n\nMy last couple Youtubes have been about not overselling the Oregon Curriculum Network product.  I don't have magic pills and I'm not advertising I will do any makeovers on the people.  The cast is whoever shows up.  I'm more into props and supplies, keeping options open.\n\nYou'll remember I was reaching out to Turkey here and there.  I tend to see Truckers for Peace as working in tandem with any truck stop ethos involving strong links to higher ed.  The Coffee Shops Network is about spreading the practice of philanthropy.  OCN is more about conventional learning.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}