{
  "id": "5620514003943617398",
  "title": "Suburbicon (movie review)",
  "published": "2018-03-04T20:07:00.001-08:00",
  "updated": "2018-03-04T20:12:40.688-08:00",
  "content": "Rather than watch the Academy Awards of 2018, I'm watching and reviewing movies, so don't call me disloyal to the industry.\n\nI don't remember Suburbicon showing up on marquees in nearby zip codes, including mine.  However I found it on the New Releases shelf and Movie Madness and thought it looked interesting.\n\nThe film is set in the stereotypical post-WW2 burbs, the new utopian paradise where white people fled to be with their own kind.  A black family moves in and at the same time, a crime occurs next door.  The neighborhood is already going downhill. \n\nThe neighbors, jerks that they be, start trash talking, building fences and otherwise wrecking the neighborhood, in an effort to reject this shared heritage as Americans.\n\nAgainst this background, of whites being jerks, the crime next door turns out to be the tip of some soap opera melodrama that only gets worse, turning wickedly ugly (more than daytime TV would usually show) and heightening the contrast, between a wholesome black family, and these ugly suburban Americans.\n\nI'd say the genre is dark comedy and satire, a send-up of a certain demographic. \n\nThanks to talk shows on daytime TV, audiences are a lot more savvy today (I'm thinking of Oprah and Donahue, the mom and dad of a specific boob tube generation).  True, Americans are still herded around by cowboys, taught to fear Russians on cue, but maybe not as much as in the 1950s and 1960s?\n\nThe protagonist is the young son (of Matt Damon's character), who befriends the black boy next door, only to be told later by his dad to cut off the relationship, by a king of the hill master of depravity.  Oh, and by the way we're sending you away to a military academy for your own good.\n\nIn the last scene, we see the relationship restored (with the black kid, not the dad).\n\nIt'll be hard to blame any more crimes, or nasty social trends, on these wholesome newcomers in particular, but as we know, those into shame and blame don't usually see their blame as unbecoming.  The suburbs still come across as somewhat ugly, when it comes to attitudes.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}