{
  "id": "4768056295171914962",
  "title": "Summarizing a Thread (Synergeo #35613)",
  "published": "2007-09-07T12:26:00.000-07:00",
  "updated": "2008-11-15T02:36:32.776-08:00",
  "content": "I think the underlying problem here is people imagine a 4 CCP ball [tetrahedron](http://mathforum.org/kb/thread.jspa?threadID=1618497&tstart=0) then zoom in on the K-points, where the balls touch, and make that a \"dividing point\" (which is why Frank keeps saying \"solid\").[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgsr7tv9I-WyzWux4jEr137v4zKAGzHjvNUcTX7w74gDttkJ-DNzNu-VVAvaMYQ_riKxVrDOdHUHuCQ9sJDQNgUjlxErtbxEQv2pNQtiqISnddd6UG4_78owvzXg-KNZUs-dEeE/s1600-h/ccptetra.png)That divider then takes us in our minds' eyes to imagining 2 frequency, which needn't mean any doubling in size if we're simply multiplying by subdividing.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg4X9RhJ1hwZzOpt497INI16pyPScw-YXlQdk8wa5U7A9IqJNA2g6pSus2DNaPlPsr5MZ25EGgWB2oRLJdOPcY4MUUI2CcvsfYsFbYaZmUn4xNIUDBG2V9MyFmVMrPKShCempsX/s1600-h/tetra.png)On the other hand, it might also mean doubling in size.The problem here is you can always subdivide and picture something else inside of what you've got. Brawley makes this process come to an end with his pionts [a neologism] in Tverse. We require no such dodge. Draw a complete Magic Kingdom inside any A module, complete with castle and flying tinkerbell. Continuing to subdivide ad infinitum is your sovereign right as a thinker.But don't let your pride and/or fascination with continuing to subdivide keep you from appreciating the austere beauty of a simple design, one in which we've rationalized our ratios as best we can, and our best really is better than what some earlier ages managed. Why surprised? Humans have been on a learning curve and it shows. So?Anyway, somewhere along the way, [Zubek](http://www.clowder.net/zubek/zubek.html) started using the 2F tetrahedron for reference, thinking 4 CCP balls must make one of those. Did [Steve](http://watermanpolyhedron.com/) feed him this corrupting thought? I have no idea.But as 2*P*F*F+2 makes clear, where F=1, and P=5, the number of balls in a cuboctahedron is 12 in the first layer (same with icosa).That \"12-around-1\" is the true starting point (similar to the start of Tverse), and the volume is 20, with Frequency unity. So the 8 sub-tets of the VE are now each set at unity, with six half-octas of volume 2. 8 + 12 = 20.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjZWSlF8w0_xfg4ZkhNXdGS9R5iIJeTEbqjAm7Ci2I9ADuvcWHKCVe7OVIfHo92IP-G7KdMpnNE8X70e90E1bYwilJZmUdbv6j8D_qv8RCw-Foe8oi0scUYof_CmGZ5YLV28ukJ/s1600-h/cubocta20.png)Notice, now, that each of those 8 reg tet components of the volume 20 cubocta, in turn made from 12-around-1, is in turn defined by four (count 'em) CCP spheres.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiv6NTgQk_pLSX6k_TOLnYqkXcevyxuFDpFQXrgz7u93D7InL1oAgLAnq-RzlQZ8tRbCdTqLJrzwjQH1qni9B8HhXtc66t0qtRvB1b5rehdslbaOZJW1ZubT7jPJ6Ep7LtWurhC/s1600-h/ivm.png)This is [the IVM](http://www.grunch.net/synergetics/ivm.html) then. All edges are CCP diameter in length, go from ball center to ball center. These edges define two shapes: tetrahedron and octahedron, of volume ratio 1:4 and population ratio 2:1.The rhombic dodecahedra that encase each of the IVM/CCP balls, as voronoi cells, are what're volume 6, made of six Couplers each of volume 1.A lot of this info is encoded in the form of QuickTime movies from the mid 1990s, by Richard Hawkins. His art is [still on the web](http://www.newciv.org/Synergetic_Geometry/) to this day, thanks to strong freedom of speech traditions.Plus of course it's all in Synergetics, complete with [color posters](http://www.rwgrayprojects.com/synergetics/plates/plates.html). Nothing new.If you lived in Korea, your kid'd probably have learned all this from the back of a cereal box by now (or from the free DVD inside).Kirby",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}