{
  "id": "115117379740379977",
  "title": "Summer Retreat",
  "published": "2006-06-24T11:10:00.000-07:00",
  "updated": "2007-10-16T20:20:16.185-07:00",
  "content": "We have a busy day lined up.  [McMenamins](http://worldgame.blogspot.com/2004/12/intourist-pdx.html) is celebrating a birthday (free cake), plus we have other cultural events in our queue.   Uncle Lightfoot is swinging by in his Aztec.  Plus Wanderers is happening (Rick Grote came by, and Dick Pugh).Although stream beds are public land in Oregon, Dick has been shot at by nervous growers of curious crops, who think public lands belong to them exclusively.  Dick had to shoot back.  But mostly he relies on his METEOR license plate.  \"Not a vanity plate\" he explains, \"but a message to the public about why I might be in the neighborhood\" (he is looking for cosmic debris, on which he is a recognized expert).Over on Math Forum, I did more to [sketch a model](http://mathforum.org/kb/message.jspa?messageID=4842790) for how to treat public schooling.  By definition, the USA's system trains its own i.e. invests in the training of future office holders, people wishing careers in public service, both civilian and military.That doesn't mean we ignore the needs and desires of private industry.  As a matter of fact, sustainable profit margins depend upon keeping our USA strong enough to foment prosperous civilian lifestyles, both at home and abroad.  Weak governments sucker for tempting illusions, such as quick fixes through war.A future president should have a route through the publicly supported infrastructure to her future desk in the Oval Office.I also wrote [about StrangeAttractors](http://mathforum.org/kb/thread.jspa?threadID=1403434), by Design Science Toys.  This was aimed at helping math educators conduct some informed debate about the tangible artifacts we might use to support children and young adults in their quest to attain mastery over the basics.  In various mock battles, educators line up for and against these toys, but the toys themselves rarely get upgraded.  Each new generation gets the same sorry-assed cubes and rectangular rods to play with.  Whoopeedoo.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}