{
  "id": "4797593854897472226",
  "title": "Sunrise (movie review)",
  "published": "2012-01-29T23:18:00.001-08:00",
  "updated": "2012-01-30T08:41:46.507-08:00",
  "content": "I had little concept of [what I was getting into](http://hollywoodtheatre.org/lori-goldston-cat-power-nirvana-performs-live-score-murnaus-sunrise/), when Nick told me about some live cello music at the Hollywood Theater.\n\nThis turned out to be part of the ongoing silent films thread, this time featuring Sunrise by F.W. Murnau.\n\nFine musicians, in this case including Nick's friend Lori Goldston on cello, provided more \"emotional bandwidth\" as Nick put it.\n\nAt\n first I surmised I was watching a recent release, made to look like a \n1920s pre-talkie.  But later I realized we were watching the real deal.\n\nThe\n style of film making then is really quite different, creating a sense \nof surreality or other worldliness around the action portrayed.\n\nSunrise\n investigates a man planning to murder his wife in order to take off \nwith a new interest, a woman from the city who smokes prodigiously and \nis of presumably dubious character.\n\nThe wife deserves better than this lout but there's no \"good riddance\" way out in this village.\n\nAfter\n he bungles his murder attempt, the wife seeks to escape his clutches \nbefore he tries again, but is perversely seduced by his (sincere) sense \nof remorse.\n\nThey stumble in on a wedding-in-progress \nand he relives taking on a commitment to look after and protect his \ndyadic other, per the standard nuclear family contract.  There's no \npossibility of a molecular family in this culture, with two moms and or \ntwo dads (this isn't Bhutan, with its above average happiness quotient).\n\nTheir faith in one another is renewed (or hers in him\n mainly), but then on the way home in the same row boat he planned to \ndrown her from, a storm kicks up and it looks like he's lost her \noverboard, this time very much not according to plan.  As omniscient viewers, we're positioned to judge him innocent (this time).\n\nI found myself awed by the consistent look and feel of this film and thought just maybe I was seeing an all time great.  The cityscapes are meticulously detailed, the trolley scenes superb.\n\nUpon doing more research, I see other film critics share this view.\n\nNick and I adjourned to Columbia River Brew Pub, formerly Laurelwood,\n across the street.  Then we bussed home so he could rest up before the \njourney back to Hillsboro.  Since Tara had a driving class in Beaverton \nthe next day, it made sense to do it this way.\n\nThanks \nto legislation passed in the Nixon Era, kidney dialysis patients are \neligible for three visits a week.  In Europe it's four, but with shorter\n hours.\n\nNick is aware of the research going on [at ONAMI](http://worldgame.blogspot.com/2009/11/onami-tour.html), as is his doc,\n but results from that effort aren't expected for some years.  \nNephrology is still in its infancy.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}