{
  "id": "1064554336273534240",
  "title": "Superbowl 2015",
  "published": "2015-02-01T14:51:00.001-08:00",
  "updated": "2015-02-02T13:38:56.735-08:00",
  "content": "Yes, I'm partaking of the national secular religion today, Superbowl Sunday.  I'll link to some [previous blog posts](http://worldgame.blogspot.com/2009/02/superbowl-sunday.html), as proof I've been around the block [at least once](http://controlroom.blogspot.com/2010/02/post-game.html) in this cult.\n\nI've got the pre-game on screen and feel properly endowed with comestibles and imbibables, namely cheetohs (flamey), Dr. Pepper (diet), and Torpedo IPA from Sierra Nevada.  Plus local sports bars are but blocks away.\n\nDr. Charles Bolton just called, the sociology professor.  I think he understands my willingness to partake in a social ritual, even though distant from football (US style).  I think back to the Mayans and the importance of ball games in this hemisphere.\n\nUS football may inherit from rugby but I think the seriousness with with civilization takes spectator sports is not confined to the North Atlantic Anglos or anything so restrictive.  Athletic events abound wherever anthropologists are willing to seek them.\n\nYes, I care about memes (memetics) [and therefore advertising](http://www.forbes.com/sites/jenniferrooney/2015/01/31/watch-the-2015-super-bowl-commercials-and-vote-for-your-fave/) and so on, and may have something later to say about that.\n\nSo far my only story is about Patriots deflating their balls or something.  I'll no doubt be doing more homework on that, given how easy a search engine makes researching such stories.  Time was, one needed to dig in the library or find gold mines in books full of such juicy stories.\n\nOmni-triangulating is [easier now](http://www.nfl.com/news/story/0ap3000000466783/article/more-details-on-the-investigation-of-patriots-deflated-footballs).  One to two pounds under.  Lots of other coverage out there, not saying it all ends with one story.\n\nFor those not from around here, US football, unlike soccer football, features goals high off the ground and no goalie per se.  You're allowed not only to touch the ball but to hug it like a teddy bear and make it your best friend ever.  Kicking it is allowed but in special circumstances only.  Hitting it with your head, which is supposed to be in a helmet, can only be a mistake.\n\nBookmark: [one of yesterday's](http://mathforum.org/kb/message.jspa?messageID=9693113), to the Math Forum (familiar themes, [pg. 119](http://controlroom.blogspot.com/2006/08/more-dimension-talk.html)).\n\nHah, I liked that Katie Couric with Brian Gumble [flashback commercial](http://www.washingtonpost.com/blogs/style-blog/wp/2015/02/01/katie-couric-and-bryant-gumbels-super-bowl-2015-bmw-commercial-tries-to-understand-this-internet-thing/), for BMW's new electric model.  The [Kickstart commercial](http://www.justjared.com/2015/02/01/mountain-dew-kickstarts-super-bowl-2015-commercial-watch-now/) was pretty rad.  Bud did another Clydesdale and puppy scenario, fun.  M&M gag was good.  Invisible woman: funny (with Matt Damon).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}