{
  "id": "8543477088946243256",
  "title": "SuperBowl Sunday",
  "published": "2020-02-03T16:14:00.002-08:00",
  "updated": "2024-02-11T17:41:18.405-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/49485474131/in/dateposted-public/)\n\nI don't know if SuperBowl is really CamelCase, but as a Geek it makes sense to capitalize in that way. We have our ethnic idiosyncrasies too, after all.\n\nI wasn't really expecting to catch the Super Bowl, in that I hadn't scheduled it, but on the other hand I'm a regular at a certain [Asylum District \"krobar\"](https://worldgame.blogspot.com/2020/02/let-them-eat-soylent.html) (a generic for me, Cork & Tap is the legal name) and the game was already in the thrilling 4th quarter.  Kansas City was down, and our dinosaur-friendly bartender is from there.  When they came back to win it, she was ecstatic, which was fun to witness.\n\nGlenn was there to my right.  Dr. D. was on vacation from what we call HH, although that could mean HopHouse (nearby) and HH is all day when the krobar is open.  Cross-eyed crossword puzzling?  Crypticism creeps into American Lit through [other sources](https://mybizmo.blogspot.com/2006/05/decoding-usa-culture.html) besides me I'd hazard.\n\nSpeaking of \"hazard\", the Daisy Duke in Dukes of Hazard should not be confused with Patty Duke, who married \"Gomez\" in The Addams Family.  Patty Duke was a celebrity on the HDTV on an earlier evening, where old game shows are a staple when the SuperBowl isn't showing.  The other screen is always sports.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgQNPTbsQyrnhORb2Ot_AX4OO849NkcfEehEphFptrO5Qnkr-Whc2MzVspI4O12cvEDUUzpEC0a41QNOSn2muewE2aD5r4j_VrDobdKy049N5pksoB_GeKkP34INPetosBasfIg/s1600/pattydukemystery.jpg)\n\nThen you might [think of Daisy Mae](https://duckduckgo.com/?q=lil+abner+daisy+mae&atb=v203-6b_&ia=images&iax=images), funny how these may all blend together.  Americans' \"hillbilly\" archetype is a part of the infusion.  I'm not planning to offer any exhaustive treatment here.\n\n[Daisy Dukes](https://duckduckgo.com/?q=daisey+dukes&atb=v203-6b_&iar=images&iax=images&ia=images) (safe search setting on, DuckDuckGo) were a type of cut-off popular with some \"guys\" (gender neutral), a fashion statement.\n\nThat's right, we analyze popular culture a lot, as we sip our various brews.\n\nThis time, [on SuperBowl Sunday](https://worldgame.blogspot.com/2024/02/nfl-day.html), I decided to stick with three consecutive 10 oz. ciders, a blood orange (blew the keg), the replacement peach-raspberry (tint of Vicks candy), and the a sour raspberry, which is really a beer but with cidery overtones.  I was one of the last to cash out.\n\nToday on the day job (OCN) I'm able to apply Miller-Rabin (not a beer) to the problem of filtering out what aren't Mersenne Primes. School of Tomorrow is [showing off again](https://github.com/4dsolutions/School_of_Tomorrow/blob/master/mersennes.py), trying to recruit high schoolers into [an alternative PWS](https://medium.com/@kirbyurner/data-science-for-truckers-53bca05c04f1) (home-schooling environment).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}