{
  "id": "197942701049495792",
  "title": "Surveying Pedagogy",
  "published": "2016-10-29T15:54:00.003-07:00",
  "updated": "2016-11-01T15:29:11.198-07:00",
  "content": "Long time readers of my writings, such as any remain (of my writings, as well as of long time readers), may have come across my use of \"andragogy\" a lot, in contrast to \"pedagogy\".\n\nIn 2016, \"andragogy\" is a recognized word, [in Wikipedia](https://en.wikipedia.org/wiki/Andragogy) and so on, however spellcheckers generally won't have it, out of the box.\n\nAndragogy means \"the teaching of adults\" whereas \"pedagogy\" is about teaching children.\n\nYes, \"child\" and \"adult\" (\"peda\" and \"andra\") are cultural categories and vary depending on how much childhood is even recognized, or how.\n\nAs Eugene Khutoryansky points out in [one of his rants](http://veganfaq.net/children.html) (Why Children Should Rebel):\n\nOur current concept of childhood is a relatively recent\ninvention. Throughout most cultures throughout most of human\nhistory, individuals today referred to as \"children\"\nhad the right to marry, serve in the army, and even act as the\nhead of state. \nI bring up Eugene on purpose as really his work is what I'm surveying today, having just come across it this morning.  He has produced and published some interesting physics and mathematics teaching movies.  [Check them out](https://www.youtube.com/user/EugeneKhutoryansky/videos)!\n\nAs I wrote to PhysLrnr-L, which I joined on invitation of Dr. Bob Fuller, whom I collaborated with on a [First Person Physics](http://mybizmo.blogspot.com/2006/04/more-first-person-physics.html) project:\n\nIs the surreality of Eugene's world extraneous?  A cat watches the action in the Quantum Mechanics video, while the Maxwell's Equations one is inhabited by two angels in a somewhat Gothic setting.\n\nGiven \"Maxwell's Demon\" is already in the literature, and that we've all heard of Schrodinger's Cat, I didn't see the imagery as entirely extraneous.  He's alluding to known memes.\n\nIn the mnemonic arts since Cicero and earlier, the idea of using exaggerated-because-more- memorable imagery has been encouraged.\nI've got a slide show and maybe a recorded talk called [Pythonic Andragogy](http://opensourcebridge.org/proposals/1102) out there somewhere (once as a Lightning Talk in Santa Clara, at a Pycon).\n\nI taught Python, the computer language, to adults a lot.  But then weren't Saturday Academy students pretty adult-like in some cases?\n\nAgain, culture and ethnicity mean many parameters stay in play, as we investigate whether andragogy deserves a long term future.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}