{
  "id": "1714493467397547295",
  "title": "Surveillance Center",
  "published": "2025-01-31T11:13:00.000-08:00",
  "updated": "2025-02-03T12:54:34.870-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEggZf6pflr-mHKogeC_ePWXLP0AwF7YUXkeq6uFhpMVkq_1HR_FKXE89Y4Hhlwb0o5g6Y79VIiLfmDbIpBNHPG96CPW8r9bbpjoHrTKLHjfrF4m-NTMA9oaXDm4SvcPzOD5X7Q6QZ340_lOZEcgk1EqPxQl_G5exRf2wqDYzlmxscWwDBr2rC8O/s2048/IMG_0663.jpeg)\nI was asking Perplexity, the chatterbox, to draw a line twixt “peep show” of the 1800s, and the genre of TikToks and Reels going big time today. Now each has a handheld device to watch short scenarios, whereas privacy around peeping was more about stepping into a booth, to become isolated from distractions.\n\nPerplexity synthesized a very plausible response, obeying my prompt to keep “voyeurism” a connecting thread. The 1800s booth was more like a diorama, likely a miniature, with the eye seeing the scene through a peep hole. Or perhaps the experience involved some live action? What were the possibilities? Picture a miniature garden, with a mechanized figure in the foreground, perhaps with energy to perform some action coming from a wound spring.\n\nMy own image of a Peep Show is the Tin Pan Alley arcade, wherein I imagine a viewer depositing a coin or two, and then peering though a viewfinder at some hand-cranked flip book of consecutive photographs, perhaps organized in a kind of Rolodex, creating animation the way film does, hitting a threshold frame rate.\n\nAm I moralizing against this evolving technology, heading towards VR and AR (virtual and augmented reality)? Invoking the theme of voyeurism maybe sounds like it. “Viewerism” sounds less obnoxious, whereas “tourism” is where it’s at, especially when undertaken voluntarily, vs compelled, as in “tours of duty” (still acceptable) and/or human trafficking (considered wrong).\n\nTo stay briefed on a complex world, requires lots of screens. Some eccentrics, I recall Walter Alter, were experimenting with multiple screens way back then, before the internet takeover. \n\nNowadays your typical nerd cave comes with a number of monitors, whereas the communal (shared) nerd cave is the typical surveillance center, with aesthetics similar to that of the Control Room and/or Mission Control. Air traffic control centers fit here too. \n\nThis very blog is named after, or “in honor of”, this very archetype (you can almost see the diorama in your mind’s eye right? — as readers, some will — some read because they love the television they get from it, meaning mind’s eye programming). My Control Center serves fielded “Bizmos” i.e. the van fleets, the business buses, all engaged in the various work-study activities of a shared World Game.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}