{
  "id": "5747258603702766982",
  "title": "Swordplay with Zorro",
  "published": "2006-11-21T11:34:00.000-08:00",
  "updated": "2010-12-05T19:42:31.050-08:00",
  "content": "Some of you old fogeys may remember TV's original [Zorro series](http://www.youtube.com/watch?v=gTfdiHxYivA), another take on the masked man lone ranger theme, this time with a more [Mexican flavor](http://mathforum.org/kb/message.jspa?messageID=5479188&tstart=0).Swordplay is also a metaphor for flashy debates, wherein each player attemps to best his opponent with rapier sharp wit (another cliché).So there's [this guy Haim](http://mybizmo.blogspot.com/2006/05/battle-lost.html) over on math-teach whom I spar with a lot, and whom I've nicknamed Zorro ([a compliment](http://mathforum.org/kb/message.jspa?messageID=5381999&tstart=0)).  We do the Y-chromo thing (fight), but I think in ways even some X-filed Pam and Betty types will find entertaining.Here's an excerpt:Cyber-curricula have a leveling aspect, as kidsnearer Katrina's epicenter tune in and bliss outon 'Warriors of the Net' (why wait for stupid bigdummy textbooks to catch up?). They feel moreempowered by Python and Ubuntu than by anyKing's English I'd warrant, given how the latterhas been dumbed down (slowed, degraded) byunimaginative bankers who can't fathom opensource and its math-teaching significance toour digitally savvy ethnicities.I might have said \"emerging digitally savvy ethnicities\" (more showing off) but that's in the nature of fast-paced think on your feet debates: lotsa coulda- shoulda- woulda- saids in retrospect. So save it for the rematch?Wanna read more?  Here's a link to the [full text](http://mail.geneseo.edu/pipermail/math-thinking-l/2006-November/001074.html) (typos elided), plus a tie-back to the [contextualizing thread](http://mathforum.org/kb/thread.jspa?threadID=1494422&tstart=0) @ Math Forum (now at Drexel University, but started at Swarthmore College).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}