{
  "id": "166212625190115420",
  "title": "Synchronous Vs Asynchronous",
  "published": "2022-11-26T11:13:00.005-08:00",
  "updated": "2022-11-26T12:05:25.223-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/52525299490/in/dateposted-public/)\n\nToday I had a wealth of education programs to choose from, some synchronous, some asynchronous.  One should always prioritize the now or never synchronous opportunities, as a rule of thumb.  However \"opportunity\" means \"affordably passed up\" i.e. if it feels mandatory maybe they shouldn't pretend you had a choice.\n\nYou know the law has you pinned down when your only button is Accept, in the face of endlessly scrolling legalize.  What they know about you is you might sue if you find a loophole.  \"Accept that we have our defenses arrayed against you\" says the button.  You press it, if you want to continue with the installation and boot up experience.\n\nAs you can tell, I'm in favor of the shorter open source user end licenses, which boil down to \"without warranty, go for it\".  Then you learn to trust the various scouts as to what's malware or irkware or nagware.  People have different levels of tolerance, with some motivated by sheer curiosity to visit the dark side of the dark side.\n\nOpen source is more than that though and I don't mean to short circuit or take lightly the long hours of philosophizing distilled in discussions of the GPL and so on.  I've attended live Richard Stallman talks on more than one occasion, with Portland once billed as a capital of open source, back when that meant a lot to the computer literate.\n\nWhat I ended up doing with my morning was engaging in telecommunications about pending business regarding acquiring a dog.  I was reminded of ducking out of a meeting at SNEC's founding, in DC, at a house hosted by R. Chu.  E.J. Applewhite followed me out to the sidewalk, curious to overhear what conversation might be important enough to take me out of this synchronous opportunity.  \n\nOverhearing my side, he assumed my wife and I were talking about a servant.  We were actually talking about a dog.  My wife was in an awkward situation, having taken Sarah (our mutt) to a Quaker gathering, a camp, where said dog was not on her best behavior, or such is my recollection.  \n\nI was amused Ed was thinking that (that I had a servant), or pretended to, and that he got me telling the truth in short order.  SNEC = Synergeticists of the Northeast Corridor, an acronym since jettisoned.\n\nNext, I'm going to hop on Protonmail and write about Dark Horse comics (not as a know-it-all mind you, more as a know-nothing).  I'll be overlapping with the TrimTabbers, who were meeting about Applewhite's Cosmic Fishing this morning.  \n\nThat was one of my synchronous opportunities.  This will be another way of jumping in on that thread, asynchronously.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}