{
  "id": "4898660404520671532",
  "title": "Synergy",
  "published": "2023-01-17T20:51:00.005-08:00",
  "updated": "2023-01-17T21:23:28.525-08:00",
  "content": "I’m listening to a recording of Peter Meisen and company on the 52 Living Ideas channel.  Bear Island, Maine, duh, not Massachusetts. \n\nHe is talking about the emergency situation in Ukraine, in the context of introducing the idea of Synergy. His focus is the energy budget, and the mix of resources, renewables versus coal.  Shrikant wants to get those already steeped in the Bucky stuff to expound upon these words “synergy” and “emergence”.\n\nMy focus these days has been Grunch dashboards, enterprise level instrumentation developed with tools such as dash and plotly, perhaps in tandem with pandas DataFrames.  We’re talking real time monitoring in many cases, of oil rigs for example.  I’m remembering a EuroPython talk.  The technology is a moving target.  I meandered over to Google Earth in one of my tabs, to talk about data visualization as seamless with these satellite painted global data displays.\n\nLong time readers of this blog may know about my Global Data Corporation, which one might call science fictional.  The murky origins were not in Delaware, in “whiteman law” as I called it, but in native peoples (“tribes” is OK, I’m not at Stanford) learning the language of supranationalism, and hearing much of our nation-state talk as holdover Anglo imperialism.  I didn’t want Global Data in the lineage of the treaty breakers.\n\nThanks to the DSR (design science revolution), the core ideas and algorithms tend to percolate outward to the periphery.  Global Data is fringe in that way, over the horizon, outside the everyday jurisdiction of most business paradigms.  \n\nThrough computer science, linear algebra, machine learning and other STEM language games, we make a bridge to this alternative commercial sector shoptalk.  The language of open source interweaves.  As I was telling my students, there’s still plenty of room for private enterprise in the context of communally shared tools.  PayPal calls it “Inner Source” (bringing the communal way of doing things in-house and making it proprietary).  Cynics will cry “co-optation” but what’s free and open poses a non-trivial challenge, a form of competition that tends to cow the more cowardly capitalists.\n\nThe Anglos are used to exercising their right to contradict where foundational metaphysics is concerned.  To what extent is the “3Dness” of space a mere dogma?  Heresy.  \n\nI talk about “hypercross dogmatics” and a quasi-religious streak in establishment science, in its embrace of Abbott’s Flatland and the mysteries of the tesseract (hyper cube). We boot a belief in the transcendent with the perpetuation of a priesthood, an elite, with a few from the laity, when we speak in hushed tones of multi-dimensionality.\n\nSpeaking of my confusion, regarding the timeline, the location of Bear Island, I'd also managed to scramble the order of the books we all talk about.  Tetrascroll came well before Critical Path, not after.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}