{
  "id": "3974387503187732138",
  "title": "Synergeo #32395",
  "published": "2007-02-06T16:39:00.000-08:00",
  "updated": "2007-02-06T23:52:36.654-08:00",
  "content": "In my first storyboard, I paid some attention to social service and academic achievement i.e. a design scientist is someone willing to mix it up in the real world, not just push for Ivory Tower credentials, as the latter without the former may be quite meaningless.\n\nHowever, the main thrust of my storyboard was to find a bridge, starting in the known and moving towards the unknown (assuming a demographic still somewhat unfamiliar with even the basics of Fuller's metaphysics).\n\nI start with the Qyoob (Cube) and use it to establish the 3D-hood of ordinary space. A 3-vector zig-zag on the corresponding simplex also combines these notions of \"3\" and \"spanning basis vectors\" but of course when the zig-zag is bent that way, you're thinking \"spatial\" the whole time, which is more the Synergetics mindset (we don't believe in Flatland per se -- a rickety old Victorian belief system, ala Abbott's scifi by that name).\n\nOver on wittgenstein-dialognet, I'm chatting with philosophers about this namespace thing some more. coxeter.d and fuller.d aren't synonymous. That doesn't mean we put these two scorpions in a bottle and make 'em fight it out. On the contrary, both steam engines and diesel engines create torque from liquid fuels. The goal is to investigate the mechanisms, to reach an understanding of inner workings, not to prove one or the other \"can't work\" (as if there weren't ample evidence that they both do).\n\nSo in moving from coxeter.3d (Euclidean 3dness) to fuller.4d, I'm not trying to \"make Coxeter wrong\" in any important dimension. Rather, I'm juxtaposing two \"ways of looking\" with a nomenclature (a namespace) to suit in each case.\n\nI think one of the gross errors in some of the secondary literature to date is this idea that \"if Synergetics is right, then XYZ goes out the window\". On the contrary, Synergetics is not about pushing any math to the back of the bus. Synergetics isn't going to stay at the back of the bus either though -- that's what academia is still trying to wrap its mind around (slowly, very slowly).\n\nAnyway, I want to get more technical with the Coupler on a second pass, making this the bridge from XYZ thinking to IVM thinking. It's very easy to place 8 MITEs around (0,0,0), one per octant, and to see this as an entry point into IVM style cogitation, wherein two of the Coupler's equators become the \"fish lip\" rhombics connecting IVM (= CCP) balls, with the K-points as \"tongues touching\" perhaps.\n\nI've segued from stickworks.py to coupler.py for the benefit of my Pythonic math teacher squadron. They'll be the first on the block to have a VPython view.\n\nhttp://www.4dsolutions.net/ocn/stickworks.html",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}