{
  "id": "5478726822136637877",
  "title": "Synergetic Andragogy",
  "published": "2022-03-14T10:31:00.009-07:00",
  "updated": "2022-03-18T07:07:56.469-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/a/AVvXsEhpXVULlPit1Xo9L2OWHiqeEWJN1gJ7H8FdlrRwEbJC_PhylkIIToU44o2gghzjA6JMEI34XRFVlWXSC2igQVfIbBxSZYVb12Rahwuv2Es4haXdSHHhoAusegQyKhh4SO1HJw7iwpqLgiCRtSkd4Ue2zfhppzqZ_gOxpimFE7Qqw0aNk4YSlA=s600)The last thing people want is a brainwashing, unless that's precisely what they want.  \n\nHowever, what I've been presenting is simply a lecture that lets you see the duckrabbit, whereas before maybe it was only the duck, or only the rabbit.\n\nWittgenstein's philosophy of mathematics, somewhat dismissed, in favor of investigations only, does help with its notion of \"language games\".  The key term \"dimension\", aside from being \"key\" is really not that august or imperial that we need put it on a pedestal. Indeed, the dimensions of said pedestal could be very concrete, in terms of linear, surface area and volumetric dimensions, the \"first three\" (with volume relating to weight per properties of the construction material).\n\nSo for a few minutes maybe, you stop thinking of the space around you as \"3D\" (which it isn't anyway, thank you Einstein) and imagine it's \"4D\" but not quite in Einstein's sense.  That we all have \"our own sense\" of these words is diametrically opposed to the possibility of an establishment, think the authorities. But they're wrong.  \n\nJust as we each have our own fingerprints and retinal patterns, so is our understanding, through neural wiring (some would say), all our own.  Private language and yadda yadda.\n\nBut when the show or program is over and you get your hat back, or whatever checked garment, you will have finished suspending your disbelief, the same way you've done countless times at the movies.  The world is 3D again, and you'll still butter your toast on the right side.\n\nIf you've seen my show, you know I get H.S.M. Coxeter in on the act, in that I dig up a quote from Regular Polytopes wherein he's at pains to distinguish the research he's doing, from the physics-minded relativity stuff happening just down the hall, say at Princeton (Coxeter was at University of Toronto, and the \"4D\" geometric philosophy I'm discussing was actually dedicated to him, now that he and Bucky were friends cite the Siobhan Roberts bio of Donald).  \n\nCoxeter tried philosophy at Cambridge, with star teacher Wittgenstein no less, famous for his intimate classroom, with Alan Turing and others.  Even after Coxeter decided this language game philosophy was not for him, a career in Extended Euclideanism beckoned, he lent his cozy quarters to the Wittgenstein group, for a meeting space.\n\nIn other words, the 4D of nD machine learning, and its multi-axis data structures, indexed with (a, b, c, d...), is not the 4D of 3D + Time and the rotating axes of spacetime.  Those were, and are, different language games.\n\nThen Bucky comes along, somewhat from left field, and tosses his own hat in the ring, in a bid to be taken seriously as more than a great architect.  How could Harvard allow that?  Sure, Bill Gates and Mark Zuckerberg had forsaken the path of ever higher education to boldly go, but into vast and respectable moneymaking enterprises, which may be forgiven even as the endowment grows. \n\nBut Fuller had failed in becoming a billionaire tycoon and settled for the role of verbal rock star, vagabond poet, instead.  How could a mere Bohemian be accredited, a gypsy, other than as another bard of mythopoetry?  But with Synergetics to his name, and all these other books, patents, inventions.  A treasure trove. Maybe he was some sort of Kubla Khan after all?  Recall Montreal 67.  The USG in its finest.\n\nSo maybe \"stand up comic Bucky\" was a great destiny after all?  I'd advocate doing more, as we have witnessed.  I've got my canned slides and lecture examples on Youtube, encouraging my colleagues to fan out and re-deliver, with personal spin.\n\nThe Charles Eliot Norton roster should be consulted again and connections made to William James and Peirce, not just Whitehead.  This is how we anchor our new Bucky in the Harvard matrix, through American Transcendentalism turning into Pragmatism.  \n\nI've already provided a pretty clear roadmap, encompassing Rorty (one of my profs, along with Kaufmann and cast).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}