{
  "id": "1411059988528272019",
  "title": "Synergetic Shoptalk",
  "published": "2015-10-12T12:28:00.002-07:00",
  "updated": "2015-10-16T00:32:27.034-07:00",
  "content": "Synergetics sometimes takes flak for Fuller's including a model of DNA as [a triple helix](http://worldgame.blogspot.com/2013/05/brilliant-blunders.html), whereas of course it's only a double helix.\n\nThe triple helix does occur in nature, [in collagen](https://www.google.com/search?q=collagen+VII+triple+helix&safe=off&tbm=isch&tbo=u&source=univ&sa=X&ved=0CDAQsARqFQoTCKb1o_3PvcgCFU76YwodroEJvA&biw=1157&bih=795#safe=off&tbm=isch&q=collagen+triple+helix) for example, used to weave fabric in the skin for example.\n\nThese are not replicatory fibers, lets be clear i.e. not every helical structure implies direct involvement [in mitosis](http://mybizmo.blogspot.com/2015/10/more-tales-of-cell.html).  Collagens get manufactured within cells.\n\nGiven the importance of \"colloids\" in [Korzybski's General Sementics](http://mybizmo.blogspot.com/2015/10/substance-control.html), I think we could use the Synergetics triple helix as a bridge to / from that title / namespace.\n\nFuller's uses \"tactile\" in the sense of \"feel\" i.e. visceral \"gut level\" intuitions versus having \"visions\" or \"seeing\" a truth.\n\n\"Seeing\" versus \"Feeling\" is contrasted within Synergetics shoptalk as Eulerian (topological) versus Gibbsian (tactile).   Synergetics remains psychological in its meanings, which is why it continued to hold Applewhite's interest.  \"Explorations in the geometry of thinking\" was the subtitle (emphasis added).\n\nWe both feel and see our networks (texts, tissues) and sense their level of \"bondedness\" as liquid, solid, gas -- with fluid the home base / happy medium for life.  One of the Synergetics animations symbolizes gas, fluid, solid using vertex, hinge and face bondings of the tetrahedron respectively.\n\n1054.50  Polyhedral Bonding: Willard Gibbs' phase rule treats with the states of the environment you can sense with your eyes closed: crystallines, liquids, gases, and vapors. Euler's points, lines, and areas are visually described, but they too could be tactilely detected (with or without fingers).  \n\n1054.51  The mathematicians get along synergetically using Euler's topology alone. It is the chemists and physicists who cannot predict synergetically without using Gibbs' phase rule. \nIs this meaning merely mnemonic?\n\nIn a tactile sense, these different bonding modes emulate (simulate) the degrees of freedom characteristic of these three phases of matter, and even of thought.  We speak of logical foundations under-girding more fluid prose, which supports yet more gaseous / cloudy styles of thinking, more uninhibited and speed-of-light.\n\nBut then logic may be too brittle, as in less flexible, so \"foundations\" may not be quite the right metaphor when dealing with crystal cores.  Fuller was not a fundamentalist.  The fluid phase was the least eccentric in his book, the zero, with solid and gas a -1 and +1 degree of freedom respectively.\n\nAn Eulerian (topological) cartoon is applied to a Gibbsian (tactile) intuition, by Bucky.  I think he'd say the move is synergetic (yielding of new insights), and not just mnemonic (aiding memory).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}