{
  "id": "5281443252307386321",
  "title": "Synergetics Dict",
  "published": "2021-10-17T14:17:00.007-07:00",
  "updated": "2021-10-20T10:38:20.724-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/2916141085/in/album-72157612330643992/)\n\n twin cobras\n\nAs many of my readers know already, I mix my Python teaching, and learning, with Synergetics teaching, and learning.  \n\nPython is a well known and loved computer language, currently one of the most used.  \n\nSynergetics is a still obscure set of disciplines carved out as a namespace by one Richard Buckminster Fuller and friends.  \n\nI hasten to add the \"and friends\" because they rescued it from being a private language. As it is, Synergetics is still semi-private, with Fuller famous for his dictum that he'd rather be not understood than misunderstood.  \n\nThat he was willing to encrypt, to keep his real meanings out of the wrong hands, might be another way of putting it, shades of Descartes.\n\nWhat helps bind Python and Synergetics together is the whole idea of a namespace, a set of names paired with objects in the manner of a lookup table, and called a \"dict\" in Python.  \n\nThen we have (a) the Synergetics Dictionary (Applewhite) and (b) the conscious use of \"dictionary\" to mean something like \"growing realm of experience\" (as documented).  \n\nIn other words:  dictionaries, as a concept and as implemented as ultimate particulars, are both core to Synergetics and Python.\n\nAlthough I think the dictionary makes a wonderful image and metaphor for how language glues to the world, each name to its object, what really happens in language is more like \"wheels turning\" (sometimes smoothly, at times grinding and gnashing).  \n\nWhat goes on at runtime is way more intricate than any tabular pairing of names with objects would suggest, which maybe accounts for our retarded appreciation for language complexity, by centuries -- at least if we're dyed-in-the-wool Wittgensteinians about it (baaa!).\n\nThe dict is apropos, and the dict may get in the way of our appreciating \"operational mathematics\" i.e. the actual weaving of the fabric of meaning (lots of action, all going on in parallel).  That's where you get both dance, and sleight of hand.  We may get makeshift and improv (hacks), or \"exaptations\" as Stuart Kaufman calls them, from the front line.\n\nAs we get to the chaos of everyday wheels turning, we likely see a need for debugging, for maintenance, servicing. Words like VUCA and FUBAR pick up in frequency.  Runtime is unpredictable, and we anticipate this unpredictability e.g. try, except and finally are built right into the language, as Python keywords.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}