{
  "id": "7110756815322634688",
  "title": "Synergetics Constant",
  "published": "2023-12-23T08:39:00.000-08:00",
  "updated": "2023-12-23T14:25:44.965-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/4903290928/)\n\nWhen you convert from one currency to another, say from US dollars to Canadian dollars (or vice versa), you need a conversion constant based on a ratio between the units of valuation in each currency. \n\nWhen computing volumes with respect to different units of volume, one needs the same thing: a ratio. \n\nIn going from quarts to liters, we use a conversion constant of 1 quart = ~0.94635 liters.\nAnalogously, 1 tetravolume = ~0.94281 cube volumes (~ means \"approximately\").How is this number derived?Lets pack four balls of equal radius together such each touches the other three. Let's call a sphere's radius R, and its diameter D. Note that D = 2R.\nOur unit volume tetrahedron has edges D, twice the length of our unit volume cube's edges R. \n\nEven though the tetrahedron's edges are twice as long as the cube's, the latter is more rounded and is therefore slightly more voluminous.\nR-edged cube / D-edged tetrahedron = 1/0.94281 = 1.06066, the Synergetics Constant we seek, also known as S3 in Synergetics.Another way to look at this ratio is in terms of two tetrahedrons: a right tetrahedron and a regular one.In the \"tetrabook\" depicted below, the orange triangle (the \"page\") is hinge-bonded to the two yellow ones (the \"book covers\"), and is free to flap back and forth.  Let the page and cover edges all be D, leaving variable length invisible edges from the page tip to each book cover tip.In the vertical position, the page defines two complementary right tetrahedra of equal volume. This volume is equivalent to that of a unit volume cube of edges R.\n\n[](https://www.flickr.com/photos/kirbyurner/52151877251/)\n\nWhen the page slants to form a regular tetrahedron on one side or the other (with a complement of equal volume), this is our unit of volume in Synergetics.  The ratio of the vertical page tetrahedron to the regular tetrahedron is S3 or ~1.06066.\n\n[](https://www.flickr.com/photos/kirbyurner/52151883088/)\n\nX-REF:\n\n[S3 on Synergeo](https://groups.io/g/synergeo/message/1050) (2022)[Canonical Lesson Plan](https://mybizmo.blogspot.com/2021/07/canonical-lesson-plan.html) (2021)[Terminology and Scope](https://worldgame.blogspot.com/2017/10/terminology-and-scope.html) (2017)[Another Introduction to Tetravolumes](https://worldgame.blogspot.com/2016/07/another-introduction-to-tetravolumes.html) (2016)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}