{
  "id": "7661079148849015044",
  "title": "Talk of the Town",
  "published": "2022-05-07T22:48:00.010-07:00",
  "updated": "2022-05-12T10:39:51.188-07:00",
  "content": "I suppose if I had to pick one story to top the charts, it'd be that Storm Large is leaving us.  She's a great avatar to have out there though, with Portland a big part of her past.\n\nI've read her autobiography, which was making the rounds, but I haven't haunted the nightlife scene since I was going out with a Palestinian I knew through CUE, indirectly.  I was also tracking a signature talent seeking to break in to the Portland music scene and maybe then move to Canada, one Lindsey Walker, just search in these blogs if curious; you'll find a window on the Portland music scene, long ago (think One Laptop per Child era, remember the XO?).\n\nYes I've been known to read and sometimes chuckle along with Willamette Week and The Mercury.   Both are free and feature rapier sharp wit.  \n\nI've not yet figured in either, not being that much of an entertainer, nor cartoonist.  I promoted Portland as ToonTown, that's for sure. \n\nI figured in the Oregonian twice but then I stopped being newsworthy.  The second time I was the prescient futurist going on about \"hypertext kiosks\" that would one day offer to sell you health plans.  I remember David Lansky showing me, when Providence later installed a few.  \n\nProvidence was my biggest client for awhile there.  Separation was difficult and I had to work with a consultant to get back in gear.\n\nStorm Large is a performer and went to the semi-finals on Americans Have Talent or one of those.  I'm in touch with her local fan base to some degree.  Consider me a fan once removed, if that makes sense.  I'm happy for her light in this world.\n\nCUE, or Center for Urban Education, was into training small nonprofits on PageMaker on the Mac, connected to LaserWriters, brand new tech at that time.  We were on SE 12th near the Jolly Roger. That was one of our core businesses, around which we had some government funded training services and other consulting.  \n\nMy work then was not that different from my work now, in terms of offering training in mundane computer skills, and also esoteric.\n\nMy Jordanian friend worked as adjunct faculty or some similar academic capacity. She was senior to me, given I'd jumped ship after my BA from Princeton and pursued other means of leaving a track record.  \n\nMy credentials as a futurist were not sufficient to catapult me into a life of fame and fortune.  Futurism is mostly deprecated these days.  It's just supposed to happen to us, without much planning or forethought on our part, seems to be the mood of our time, at least in some circles.\n\nIf you check back through these blogs, you'll find them laced with various plans, speculative in nature.  Asylum City.  EPCOT West.  Other memes.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}