{
  "id": "1008101023042585368",
  "title": "Teacher Trainings",
  "published": "2010-02-22T15:07:00.000-08:00",
  "updated": "2010-02-22T15:12:31.595-08:00",
  "content": "I characterize teacher trainings as B2B, versus B2C, in [this post](http://mathforum.org/kb/thread.jspa?threadID=2045815&tstart=0) to the Math Forum:in business, we speak of B2C vs. B2B.  That's business to consumer and business to business.  I think of teacher trainings as B2B.  Imagine Intel a sponsor, and teachers getting paid to be there (on the clock, serving the public).In the balance of this post, I'm giving examples of the kind of lore each teacher might adapt, translate, recast in terms relevant to those placed in her or his care.  The teacher manages the classroom, and the curriculum deliberately encourages a place based approach:  embed this material in local circumstances in ways that will help your students gain mastery over their own environment.That being said, the stories are from all over the map, National Geographic style, and come from many parts of the time line:\n- factoring polynomials on the Italian peninsula, thanks to the new technology coming in through Pisa from Baghdad and places east;\n- Bishop Berkeley's vicious attacks against Calculus, when first unveiled by Newton and Leibniz (and the naming of UC Berkeley in his honor);\n- the rise of perspective in European painting and the evolution of XYZ coordinates in that milieu;\n- the impact of the spread of \"cyphers\" on the Italian Renaissance;\n- the emergence of 60-degree coordination (in contrast to XYZ) in connection with the discovery of the hexane ring, newly popular drawings of naturally occuring shapes.\nWould a child in Borneo have any interest in such stories?  She or he might well.UN agencies, many school districts, some curriculum providers, prefer this \"place based\" approach.  The geographic component gets a boost. Math becomes more of an outdoor activity as navigating the subway and bus system becomes an exercise in topology or graph theory. Counting calories in an energy conserving context is not off topic either, as foods and food values have their own calculus, worth learning.  Calories connect to kilowatt-hours, other measures of energy.  Conversion constants apply.In some parts of Oregon, there's a trend towards schools having their own gardens, even in urban settings.  This is par for the course in many parts of the world.  Having \"the field\" be a gridiron and practice space for mostly physically dominant boys is likewise commonplace.I've seen many schools with ample room for both a field and a garden.  In some of these same schools girls share access to sports facilities as equal partners, with varying degrees of segregation.Entirely segregated schools may be publicly chartered in your zip code area.Language immersion schools may also be provided, with or without segregation.Once you start getting into permutations, no one district may be expected to cover every possibility.  An active exchange program will give your family access to other options, including overseas.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}