{
  "id": "3457658237871690405",
  "title": "TechNation",
  "published": "2007-11-11T17:00:00.000-08:00",
  "updated": "2012-03-14T11:39:12.752-07:00",
  "content": "Calling it \"[TechNation](http://www.technation.com/)\" (with or without a space) connects in esoterica to [TechNate](http://en.wikipedia.org/wiki/Technate), a term of art in the Technocracy movement, about which most North Americans are clueless (hey, there's just no time to learn history -- though maybe this Hollywood writers' strike will open a window, by  giving viewers more time to catch up on their nonfiction?).\n\nAnyway, going back to the dot com boom and bust, I sometimes tell the story of how I was approached by some guy, early in the boom phase, suggesting I move to New York City and become the CEO for his startup.  I looked pretty good on paper, plus had a web site pretty early, even some good press.  I'd be like his trophy executive.  Then, went the plan, once venture capital was secured and it was time to \"go live,\" I'd be replaced with someone more savvy, no doubt one of my would-be recruiter's cronies, already waiting in the wings.\n\nThere might've been some real bucks in it for me, no question, but the prospect of leaving Portland was not appealing, plus when I got the guy's business plan in the mail, I could see through the jargon and buzzwords to another plain vanilla ISP, another Internet Service Provider.  I just didn't like the hollowness of the hype, so said thanks but no thanks.\n\nA disconnect I sense in the storytelling is most North Americans aren't up to date on [this whole Open Source thing](http://controlroom.blogspot.com/2011/07/at-carnival.html).  Didn't Linux take a hit when the dot com bubble burst?  Or if it didn't, don't we at least know that those scruffy hacker types, \"dot commies\" with pipe dreams of world domination, were forced to eat their own dog food, roll over and die?\n\nHow many on Main Street know the story of SCO, which tried to eat Linux's lunch, yet ended up delisted?  How many know that IBM is a major contributor to the Linux kernel, or that Microsoft now sports a lot of Open Source DNA?  If you still think it's scruffy hackers vs. Microsoft, think again.  Of course those pathetic loser patent trolls in Texas still plan to put up a fight.  I can't say I'm much interested in their sorry fate.\n\nThe story I tell goes more like this:  lawyers still held enough cards to make the first dot com boom a Wall Street phenomenon, all about making money the old fashioned way, with lots of smoke and mirrors.  Round two still involves mirroring, focusing, but engineers now hold enough cards to keep the smoke levels way down.  [Transparency](http://controlroom.blogspot.com/2007/10/thoughts-about-bookkeeping.html) in business processes is now part of what Open Source means.  Investors should like this, though it'll mean a shakeout process as those over-depending on smoke get a taste of the competition.  The result:  a more robust economy, and not just in North America, not by a long shot.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}