{
  "id": "104933042291624654",
  "title": "Telling Some History",
  "published": "2023-11-12T12:22:00.000-08:00",
  "updated": "2023-12-04T10:43:41.348-08:00",
  "content": "The teacher strike continues, here in Portland, Oregon, reminding me of what it's like to be in class, as a student, as a teacher, as an instructor who shows up after school. I've played all of these roles. That's far from all the roles however.\n\nTypically, insofar as North Americans, USA types more specifically, get some shared education, it happens in K-12, then we go our separate ways. Those attending colleges, or maybe joining a military, are likely to have some continued need for history, and in general, adulthood continues to be about self education in a variety of topics. Dialing back to high school then, let's talk Napoleon, what did you learn about him?\n\nWarning to the reader: I get increasingly autobiographical at the end, but here up top I'm thinking of everyday school textbooks and the \"reality\" they represent, that of the school, of the teacher, and whatever learning goes on in and out of the classroom. We most likely learn about Napoleon through that context, which I'm echoing here.\n\nI'm about to seem silly. I learned the mnemonic, wholly un-PC (non-woke) in our day: A Red Indian Thought He Might Eat Tobacco In Church. First of all, why not?, as tobacco is a holy substance, used in rituals, but actually the point was to remind us how to spell \"arithmetic\" (and it worked, for me anyway). Along those same lines: \"able was I ere I saw elba\" -- have you heard that one? A palindrome for sure. Same phrase each way. And who is the \"I\" in this sentence. That's right: Napoleon.\n\nLets further omni-triangulate, with two facts you might have never learned, and a third that's more common knowledge but still obscure:\n\n- per this [IEEE Spectrum article](https://spectrum.ieee.org/untold-history-of-ai-charles-babbage-and-the-turk), Charles Babbage encountered The Turk\n- Napoleon too played The Turk (and I believe lost)\n- Charles Babbage and Ada Byron are sometimes credited as father and mother of computer hardware and software respectively\n\nThat was one Junior English School in Rome, 1960s, that taught me a way to remember \"arithmetic\". Let's put it this way: in some churches you do smoke tobacco, and probably chew it, I'm no expert.\n\nThe Turk was deceiving in that it was meant to appear an automaton through and through, a machine of gears, a clockworks. However, it was good at chess. Looking back from today, when computers play good chess, the deception was prescient i.e. what then only seemed possible and was really not yet (self driving cars), is now taken for granted (chess playing). The advance seems to be continuing. We're still debating what AI means exactly, based on what we see in practice. A kind of mirroring.\n\nNow, back to the mainstream, US history: what's going on with the US around the time of Napoleon?\n\nThe basic dynamic is, in struggling to define the ongoing significance of its own Revolution against the British Empire and monarchy, the founding fathers were engaged in debates about the significance of subsequent revolutions in Europe. We'll see the Transcendentalists joining that debate, before the Civil War. The Revolution was not about becoming another tyrannical empire. The point of democracy was not to beat the crap out of resistant countries.\n\nFrance and England were at war, the former an ally of the US, and the latter an enemy, but also a homeland, an \"old country\" for the Yanks at least. France would gift the US with the Statue of Liberty somewhat later (1886), inviting future incoming waves of peoples. \n\nJefferson stretched the reigning (mainstream) psychology into realizing that France was a check on homeland (i.e. English) bullying, and we were willing to support Napoleon with a deal, now called the Louisiana Purchase. He would become somewhat enriched thereby and enabled to further prosecute his ambitions.\n\nJefferson agreed with Hamilton, as events progressed, that it would indeed be bad for the USA if either Empire engulfed the other and then turned its menacing attention to the States of the New World, then still a fledgling Federation, not yet bicoastal. Both already had a foothold on the continent, no question, but by their staying divided in Europe... not forgetting about Spain and Portugal... remember Britain actually attacked us in 1812.\n\nThe above is in the ballpark of what a high school student might encounter, when being brought up to speed. Like, what's been happening? There's still a lot more to go.\n\nI always liked getting my info through MAD Magazine and Saturday Morning cartoons on TV (no not exclusively). As a boomer, I was already well down the slippery slope to Sesame Street and MTV i.e. madcap, fast cut, free associating music video and infomercial type formats. We might have cartoons about Napoleon against a backdrop: French History. I don't think we did though, not very many. Leave that to the textbook tellers right? Stick to fiction.\n\nOK, as a school teacher (including of adults), I have to admit feeling leery, about all this time with the Fictional Universes (e.g. from blockbuster-based Hollywood, and from the playstation industry). Is this obsession detracting from, outright competing with, actual History for bandwidth? \n\nIsn't getting that distracted dangerous? Aren't incommon narratives critical? Can we afford to grow up in all Narnia worlds, effectively in our private closets?\n\n\"That's right, you are in competition\" say the dreamer gamers.  In a way they're saying they're fed up with consensus history as forming any kind of social bond, and would prefer to bond through universes (e.g. Marvel Comics Universe) other than those dominated by the usual cast of History's narrative. \"According to whom?\" is another one, meaning who gets to tell history. Who got to choose the textbooks? Cosplay is idle recreational for some, yet a form of rebellion for the hard core. Bumper sticker: defy reality.\n\nLeaving aside those debates, I'd like to get back to Ada and Babbage who played The Turk, and always suspected there might be a midget inside. What about Ada? \n\nMy first exposure to Ada was through ADA, the computer language. This was a DoD pet project and a lot of projects going forward were therefore going to be using it (it was a spec of the job). I crashed some conferences on the topic, not as a spy but as a Princeton guy with a real interest in computer science and anthropology. A guy named Arch Davis showed me around, my guide like in Dante. I found the whole Ada vs ADA connection interesting but as yet didn't know much about Ms. Lovelace.\n\nComing from a practicing Quaker branch, I was not groomed for ADA work, meaning DoD stuff, but then DARPA brushed off on me anyway, via Python and its IDLE ide. One could say I got soaked in DoD sheep dip through other channels, such as a teen blessed with base privileges through my dad's job in the Philippines. \n\nHis job was quite civilian, not focused on military or munitions at all. His work was OK with his activist wife at least (my mom Carol). My point is I'm not wholly ignorant of matters military and I don't plan to rewrite history as though that kind of ignorance were OK.\n\nI brought the Philippines into it on purpose, as the Philippine American War cannot be forgotten, nor can Smedley Butler, nor the Business Plot, a theme of Occupy. Smedley Butler was not a big fan of General MacArthur let's remember the Hoovervilles. Then let's talk about FDR, Truman, Eisenhower and so on, and the rise of a covert government or \"deep state\" (made highly visible through the window of Iran-Contra, in the Reagan Era).\n\nThe Transcendentalists were likewise contemplating what the American Revolution meant, and to what extent what was happening in Europe was a positive or negative development. Margaret Fuller was sent to report first hand on what was happening around Rome at the time (a revolt against the Papacy). That's a story those who study the Transcendentalists well know, but beyond the purview of most high schoolers.\n\nI did get into computer programming by the way, if not from the ADA angle. There would be Python, in part DARPA boosted, but for decades in between I was focused on xBase, a language, and its commercial forms: dBase, FoxPro, Visual FoxPro. \n\nYes, I remember Clipper, used dBase II through IV, then hopped to Microsoft and rode VFP to the end, official support for VFP9 ending in 2015. Which doesn't mean there aren't still VFP9 programs out there, or dBase II for that matter, if the old PC still boots. \n\nBut I'd long before switched to teaching Python, with demo stacks showing off the DB API (talking to databases), web (Flask and Django), data science (array based), although not without a final flip with Foxpro, tracking Trucking (my last look at VFP source code was in connection with a trucking program).\n\nAda wasn't informed of the true identity of her father, Lord Byron, the poet, until she became twenty one. From the bio I read, I remember her polymathic tendencies. She had that in common with Margaret Fuller: an unflinching vision of an industrialized future.  Ada was more a harbinger of machine world than a wilderness romantic, and out of that grew her fascination for the Babbage engine, and what it foretold.\n\nThe Babbage engine was too difficult to really build at the time, but later generations of machinist have proved it works. That's the textbook rendering in any case and I have no reason to doubt it; the finished versions are on display. It was programmable to some degree, and Ada shared the vision to some level, and promulgated the Big Idea (e.g. AI) in social circles. She was a key cog among the cognoscenti.\n\nWhy do I go back to Napoleon and the Louisiana Purchase at this juncture? That had to do with proto FINCAP one could say, the politics of vast land grabs on paper, by map redrawing. The King of Spain could be talked into surrendering (ceding) his American property rights to France, which in turn could sell them to Thomas Jefferson and double the USA's size. European empires had these vast estates back then. William Penn was gifted with Pennsylvania, which state Quakers had their high hopes for.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}