{
  "id": "3158520214593302682",
  "title": "Term Limits",
  "published": "2015-07-10T12:01:00.002-07:00",
  "updated": "2015-07-10T12:26:59.963-07:00",
  "content": "BBC had an engaging episode, in the form of a multi-voice, moderated conversation, last night on the topic of term limits.  On [Newshour Extra](http://www.bbc.co.uk/programmes/p02w68yj).\n\nThe guy from Singapore posited an East-West dialog with the West trying to be more important than the East in suggesting term limits as a panacea.  An ascendant West was an aberration from this gentleman's point of view, though in some models of our spherical GU ([global university](http://controlroom.blogspot.com/2011/10/toward-history-of-domes.html)) it's hard to find these political divides in the first place.\n\nThe US President got a lot of focus. \n\nImagine a Constitution that allowed a president to run for a third term, but under different rules:  the electoral college would be bypassed and a simple majority vote would need to be obtained.  No fourth term would be possible without interruption i.e. after sitting it out for at least one term, OK to start over.  Might we vote for Obama for prez in 2020?  Not possible per Amendment XXII. \n\nGrover Cleveland was 22nd and 24th president when a 3rd term would have still been allowed.\n\nOr suppose Supreme Court justices had a maximum of eight years? \n\nWe make the Judicial Branch a \"for life\" appointment (yes, I know the theory, similar to that behind academic tenure -- freedom from influence, but if you're already partisan?) but subject the Executive Branch to stringent term limits.  Why not jigger this?\n\nObviously the inertia behind a system as vast as the United States is there's no turning on a dime.  We could have science fiction movies about this 3rd term alternative campaign. \n\nImagine \"3rd term\" were institutionalized as \"experimental\" i.e. anytime we held a presidential election for a 3rd termer, we'd assume innovation.  Then, ideas that worked well, that seemed beneficial, could be worked into the first two terms as reforms.\n\nNice idea on paper maybe but there's no turning on a dime as I've said. \n\nBut think of individual high schools full of teenagers eager to interact, to practice self-governance, along with faculty and admin.  Why not use our imaginations there?  Or in a college? \n\nThe appeal, in the college catalog, to prospective students, is not just course offerings, but this intricate manner of self-governance that really gives a resume some cred.  \"Their Student Senate has real power, wow, I should go there!\" thinks the politically-minded prospective.\n\nWe think some 200 UN nations might sound like a lot.  But think how many corporations we have, some of them supra-national. \n\nWhy not have \"corporate governance\" be more flexible? \n\nWho says it's not flexible even today? \n\nQuakers have corporations, with no voting, no Robert's Rules.  Doesn't that prove the corporate structure is already flexible? \n\nThat's a query not a rhetorical question. \n\nTo be continued.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}