{
  "id": "5334190605160379918",
  "title": "Tetrahedron Academy",
  "published": "2013-08-17T21:18:00.000-07:00",
  "updated": "2013-08-18T20:42:55.818-07:00",
  "content": "Yes, I'm playing off [Monsters University](http://worldgame.blogspot.com/2013/08/monster-university-movie-review.html), and the fact that any challenge to The Cube scares people (scream!).\n\nThat's just at first, a kind of shock, as you remember what it's like to first have to think of these things, usually with a teacher making threats if your questions went too deep.  Save those for college. It's triggering.  Spikes the stress level.\n\n[](http://www.flickr.com/photos/kirbyurner/9533711958/)\n\nI explain this drawing in [a lot more detail](http://mathforum.org/kb/message.jspa?messageID=9217443) at the Math Forum.\n\nIt's what David Koski and I have talked a lot about, on Verizon:  a triangular book, front and back covers laid open, with a triangular page free to flip back and forth.\n\nHe births some of his modules from this apparatus, an apparatus akin to some of those in Synergetics, or Myst, or Uru.\n\nI didn't used to imagine a page, and let one of the covers do all the work, but I see wisdom in adding that page, keeping the book \"open flat\".  It defines two tetrahedrons, complementary.\n\nWhen the page (shown in blue) is slanted just right to make the page-tip to cover-tip the same length as all the other edges, that's a regular tetrahedron (also blue).\n\nThe green tetrahedron, in contrast, is when the page is straight up, normal, upright.  The little green square at the dihedral angle is meant to symbolize this state.  Still five edges are the same length, call it \"D\", but then there's a longer edge, the hypotenuse.\n\nWhat's so is if the volume of the green tetrahedron is the same as that of a cube with D/2 edges (or call that length \"R\").  That's the Earthling unit volume, the R**3 cube.  The blue tetrahedron, known as D**3 to the Martians, has slightly less volume:  sqrt(8/9).\n\n[In the namespace of Synergetics](http://mathforum.org/kb/message.jspa?messageID=9218038), we go with the Martians in letting the blue tetrahedron be one.\n\nMultiplying both volumes by sqrt(9/8) applies a different lens, and D**3 is now unity, whereas R-cubed is a little bigger than unit.\n\nThat's heresy for some Earthlings, to have a unit-edged cube be other than unit volume.  They look for a new Bertrand Russell or Officer Spock to defend them against the illogical.\n\nThe Martian Ambassador has a simple message:  peaceful co-existence.  The Parliament of World Religions seems inclined to agree.\n\nIn the meantime, my [Digital Mathematics: Heuristics for Teachers](http://wikieducator.org/Digital_Math) continues to attract an elite audience.  By means of workshops and Pythonic andragogy, I get the word out about our triangular book and this little demo.\n\nIt's STEM-worthy storytelling, even if it's science fiction.\n\nMix it with War of the Worlds and the Red, Blue, Green Mars series (a trilogy) for further reading.\n\nAll hail, Marvin the Martian.  V-sign.  As you were.\n\n[](http://www.flickr.com/photos/kirbyurner/3012455546/)\n\nportland center stage, 2008:  [IEEE lecture](http://worldgame.blogspot.com/2008/11/ieee-presentation.html)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}