{
  "id": "8860638431300627218",
  "title": "The Climate Change \"Hoax\"",
  "published": "2020-02-23T21:09:00.002-08:00",
  "updated": "2020-02-23T21:21:24.305-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhKKCt_NGkdGA2Uf6TSehfuNbKsgvN7AFxGIzRSGTbnrji9MWaEJeOAdRZ4yYHQP3lPTT-m82qfB5xpUotpVjTUD1AgCz_WMP5NdB9qfPkRhBBHDq17C9kgrc-8xBjdyN8CUCbf/s1600/main-qimg-642bed9351c1af217b8bfe1c0c3d82c3.jpeg)\n\n\"Climate change\" is a hoax not because the climate isn't changing. Planet Earth has been completely transformed by its human inhabitants.  That's obvious.\n\nLook at all the new, exotic radioactive elements in the environment, the plastics, the changed gas mix, the cities, the dammed rivers, space junk, the landfills.  Look at the sheer volumetric weight of human beings as a species.\n\nStill not as much mass as termites, all told?  Add the weight of the buildings, the pavement.  Of course the planet has changed, and continues to change, thanks to human activity.\n\nThe hoax part inheres in singling out one parameter, such as global average temperature, and/or the percentage of carbon dioxide in the atmosphere, and pretending that's the one variable that matters, when it comes to talking about this isolated \"climate\" concept.\n\nWere we to [talk about the \"biosphere\" instead](https://mybizmo.blogspot.com/2014/10/biosphere-is-better.html), there'd be no argument.  But \"climate\" is something narrow, relating to ozone, ice ages and greenhouse gases.\n\nEven though it's obvious that human activity continues to change the biosphere, debates rage, because we're fixated on global sea levels.  The number of species may be plummeting, the Amazon jungle dwindling, but if sea levels stay the same, well then climate change must be an illusion.  Ridiculous no?\n\nI'm not that trusting of a \"climate science\" that tries to carve out a narrow niche and reduce itself to merely academic debates. \n\nWe're just minutes away from a nuclear holocaust, on any given day, but somehow that's not the business of climate scientists.  Even though a nuclear holocaust would grossly alter our life support systems aboard Spaceship Earth.\n\nA climate science that's not about preventing nuclear war, is not a serious science at all.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}