{
  "id": "3579821963666027128",
  "title": "The Brainiac",
  "published": "2016-07-30T18:33:00.002-07:00",
  "updated": "2016-07-31T09:35:19.723-07:00",
  "content": "Where is the brain?  In the head of course.\n\nHowever, the meaning of a word is not a \"thing in a place\"; the meaning of \"brain\" is far from fixed or constant. \n\nThe myths that swirl together with science (gnosis) move \"brain\" (its meaning) along a trajectory, creating an arc in semantic space.  In this mix:  computers, the cloud, a \"singularity\" (in some myths).  Meme soup.  Alphabet soup.  Google.\n\nI'm listening to Ray Kurzweil chatting with Neil deGrasse Tyson. I'm glad Ray is more in the utopian than distopian lineage, more like Bucky in that regard.\n\nThe reality of the cloud is helping people appreciate what used to be known as [the noosphere](https://en.wikipedia.org/wiki/Noosphere), zeitgeist or world spirit, ala Schopenhauer, Teilhard de Chardin, other transcendentalist writers.\n\nPoetry anticipates the future because language is a computation [with weighted variables](http://worldgame.blogspot.com/2016/07/deep-believing.html) (the weights shift).  Music anticipates how the melody might go.  Thomas Paine.  Prophecy.\n\nRay portrays humanoids as trapped in their own skulls for the last two million years.  I'd suggest that reading and mass publishing created a proto-cloud well before \"outward electronics\" sped it up.  Scholarship has benefited from these exponential curves.  MEMEX.\n\nI say \"outward electronics\" to distinguish our hand-held devices and supercomputers from \"inward electronics\": not designed by humanoids, but helping to comprise them.  Part of the mix.\n\nThe inward electronics joins together through \"language\" (another word of shifting meaning) to create the \"meme soup\" of culture.\n\nThen outward electronics, following Moore's Law, came along to speed up the thinking, to harness more brain power in collective endeavors.\n\nOur power to self organize is what's increasing.  We know we have the technical wherewithal to improve living standards (end world hunger), however we lack the Will (the ability to mobilize collectively).  Humanity is semi-paralyzed, retarded.\n\nWhat about the collective unconscious of the Jungians and such?  A lot of that is accessible to awareness once the swirl is seen for what it is:  a collective computation.  We might as well just talk about \"the computer\" as in Synergetics.  A solo cogito, chugging along, does not a railway system make.\n\nThe mix of cellular and silicon circuits makes for a living pattern, call it a \"spiritual machine\" if you wish (you may not wish), living in the sense of changing and adapting, or \"computing\" in other words.  We're there now, however our language may not be.  Software is thinking, laying new track, switching.\n\nRay thinks the software is converging to a better tomorrow.  With acceleration comes less tolerance for puzzle pieces not fitting, or, alternatively, a shorter lag time before fitting them in.  AI is proving helpful, because of RI (real intelligence) making use of it.\n\n[](https://www.flickr.com/photos/kirbyurner/28556615002/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}