{
  "id": "2595415056409069807",
  "title": "The Last Man on the Moon (movie review)",
  "published": "2016-07-18T18:27:00.001-07:00",
  "updated": "2016-07-30T22:48:18.173-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/28296115771/in/dateposted-public/)\n\nFriend Denny phoned from PDX, just back from Shanghai, with the Republican Convention high on his list of events to follow.  That helped tip my scales away from heading down to the code school for Flying Circus this evening, my usual Monday evening activity.\n\nI did work on [#CodeCastle](http://mybizmo.blogspot.com/2016/06/codecastle-exhibit-space.html) though, most significantly jumping onto a Pyret listserv to provide some overview, CC UMC (United Methodists).\n\nLets share [#pyret](https://twitter.com/hashtag/pyret?src=hash) through [#CodeCastle](https://twitter.com/hashtag/CodeCastle?src=hash):[https://t.co/cTAZeCHswS](https://t.co/cTAZeCHswS)\n— Kirby Urner (@4DsolutionsPDX) [July 18, 2016](https://twitter.com/4DsolutionsPDX/status/755129208536305664)\n\nWhy not work on my class for tomorrow (teaching code) and study the newly rented documentaries, plus tune in the unfolding political show via various media (radio, TV and Twitter for starters).\n\nPeople of my generation, who lived through the Apollo moon landings (I was in Rome for Apollo 11), will see the long road behind us in the high tech ruins of Cape Canaveral.\n\nThe Saturn V launch pad is now a relic.  The mixture of futurism with decaying past, makes for a surreal combination.\n\nPeople of my ethnicity, strongly discouraged from weapons training, were pretty much barred from gaining experience with the kinds of aircraft considered a precursor to NASA training. \n\nI knew from an early age I'd never be accepted in [that inner circle](http://mybizmo.blogspot.com/2010/04/hb2h-hb2m.html), but I was an avid tracker and backer of the space program nonetheless, and [am still to this day](http://mybizmo.blogspot.com/2016/07/meanwhile-in-outer-space.html).  Besides, I wore glasses.  Test pilots have perfect vision.\n\n[Eugene Cernan](https://en.wikipedia.org/wiki/Eugene_Cernan) was maybe not as good on the bombing range as some of his friends, but at least he got to experience the G forces and show onlookers he had the right stuff.  He went in and out of San Diego on aircraft carriers.  I wasn't clear where all these bombs got dropped.  [Hawaii maybe](http://bigstory.ap.org/article/9cf6f1aa594c41fe96d2dd58ceb665fa/future-funding-murky-hawaiian-island-used-bomb-range).\n\nI hope someday those willing to train to work aboard spacecraft will find a civilian pathway open to them.  Actually we've reached that point already.  I often catch myself wishing for what has already come true.\n\nThe fact that humans were able to reach the Moon and return safely bolstered confidence in the species and ushered in new flavors of futurism, including the positive-accentuating utopianism of Bucky Fuller, which I glommed onto. \n\nCritical Path is a lot about Apollo, including in the mythological sense of escaping superstition and nightmares.  So many disciplines, working together!  Apollo also seemed an exercise in socialism, in the sense of people co-owning public assets to accomplish something together, not that capitalism didn't play a role.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}