{
  "id": "2714764131111086906",
  "title": "The Social Network (movie review)",
  "published": "2015-12-07T14:57:00.001-08:00",
  "updated": "2015-12-07T18:19:45.557-08:00",
  "content": "Let me say right off the bat that I'm highly skeptical of docu-drama as a genre, but then what else is there?  Every war movie ever made is a docu-drama, almost, unless you count the few documentaries, spliced together from footage from the actual battlefield.  Usually those get caught up in somebody's \"history\" and from there acquire spin.  Fictional bits creep in.\n\nHowever, having attended Princeton, I can attest to some realism in the importance of rowing as a lifestyle, to those lucky enough to grow up around rivers or otherwise break in.  However I think Zuckerberg's character is less interested in banking on Harvard's name than on achieving redemption through smarts.  The movie is about meritocracy versus patriarchy in many dimensions, with software engineering giving rise to that nouveau riche we call Silicon Valley, self-booting.\n\nDeeper than that though, the opening scene sets off a battle of the sexes, with the Zuckerberg character honestly insecure about what he brings to the table and trying to negotiate from perceived weakness.  He's not one of those \"crew cut\" Harvard guys but he figures he still has the appeal of knowing some inner circle and so addresses his love interest in terms of a rags to riches story, as in \"I can help make you known to the people who matter\".  Isn't that a core game at Harvard?\n\nHis girlfriend breaks up with him over that as she's interested in a relationship more based in equality and neither having the leverage of social advantage.  Had Zuckerberg not felt he was coming from weakness, he might have avoided a lot of soul searching but then we might not have Facebook or this movie, so lets give him the space do the math in his own time.\n\nHis exoneration comes late in the film when a lawyer of that same ineffable species, who has heard the whole story, tells him to his face he's not what the other girl said he was.  That's worth a lot, coming from her, as she's in a position to have insight.  From that standpoint alone I could see why this movie would not prove too damaging to any of those involved.  Each walks away with something, just like in real life.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}