{
  "id": "2608135158534468990",
  "title": "The Power of Community (movie review)",
  "published": "2015-12-08T22:41:00.001-08:00",
  "updated": "2015-12-14T19:06:53.882-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/23508390592/in/dateposted-public/)\n\nThis documentary is uplifting, as it tells a story we all want to hear, of humans surviving an energy crunch by cooperating, rather than turning on one another, every man for himself.  The backdrop is local politics, less than peak oil.\n\nPeak Oil is real, and should be welcomed as our saving grace vs. global warming, as the fossil fuels are simply running out, at least half empty already mas o meno.  I always thought the Peak Oil talkers were more into [taking the bull by the horns](http://mybizmo.blogspot.com/2009/11/end-of-suburbia-movie-review.html) than the Oceans and Temperature Rising talkers, not that these are mutually exclusive talks.\n\nCuba was caught in the middle of Cold War politics and could not afford the lifestyle to which it had become accustomed, not in the wake of perestroika (перестро́йка). \n\nCubans were actually using more pesticide and fertilizer per hectare than many, and were exporting cash crops in exchange for basic foodstuffs, just like every other tropical paradise.  But for the US embargo, they had a mirror image thing going in [the Second World](http://mybizmo.blogspot.com/2009/07/2nd-life-2nd-world.html), which was a lot like the First.\n\nBut then the Soviet Union morphed into something else and left Cuba to face everything short of invasion, in terms of economic sanctions.  Any ship putting in to a Cuban port was blacklisted in the US for at least six months, a heavy penalty.  Cuba went from being Second World to Third World overnight almost.\n\nWith the sudden shut off of former sources of income, Cubans had to completely reorganize their agricultural and transportation systems.  In so doing, they made some important discoveries, such that the way soil is compacted by heavy equipment requires heavy equipment to undo, and the pesticides and fertilizers were killing the natural topsoil, necessitating more artificial ingredients.  The spiral was unsustainable.\n\nThey went back to organic farming, and to oxen, with diverse crops, less mono-culture. This was done not out of idealism but out of necessity.  Cuba suddenly needed to be more food independent.  This takes big changes at the grass roots, but then in the face of severe shortages, the status quo was not acceptable either.  The changes were highly motivated.\n\nTractors were still important of course, but someone taking a plow to his or her field, behind two oxen, was once against lionized as an agrarian superstar.  The \"peasant\" (aka organic farmer) had status again.  Agricultural engineering is about as basic as it gets, just ask the Australians (they help out with their permaculture knowledge).  Once the concept of \"working with Nature\" is ingrained, a lot of the work just happens.\n\nThe upshot of all this morphing is Cuba is now enjoying higher living standards, in terms of people having amicable relationships (i.e. social skills).  They're not mowing each other down as much as in some countries, nor living the life of sputtering gas-aholics or [shop-aholics](http://mybizmo.blogspot.com/2015/11/smart-art.html).\n\nBetter food, more savvy, a closer connection with the Earth.  Our back to the Earthers here in the US already believe in this lifestyle, and some even practice it.  Portland, Oregon is much infused with the same values.  We admire our agricultural sector quite a bit (a source for hops, grapes and wine, [cannabis products](http://worldgame.blogspot.com/2015/12/touring-home.html), pears and apples, berries and Christmas trees, [also cheeses](http://mybizmo.blogspot.com/2005/09/tillamook.html)), not just [our nanotechnology](http://worldgame.blogspot.com/2009/11/onami-tour.html) (not that these are entirely separate).\n\nWhat's interesting is to mix the older more established methods of agriculture with new discoveries and inventions.  Going back to oxen and horses does not mean giving up Google Earth or smartphone apps, which draw little wattage on the demand side.  No one says you can't use Linux to help manage the farm, whether locally or in some cloud is up to the local proprietor.\n\nThis version of \"the agrarian lifestyle\" is not about self deprivation so much as learning how to master a definite puzzle, and learning to live lightly upon the Earth.\n\nLiving longer and prospering does not have to mean replicating a suburban American lifestyle, high on synthetic foods, low on developing the skills our pioneer progenitors took for granted.\n\nComing to grips with [Peak Oil](http://controlroom.blogspot.com/2009/10/oil-water-movie-review.html) is what Cubans have done in miniature.  They're proud of what they've done and know the world needs hopeful examples.\n\n[Bucky Fuller](http://mybizmo.blogspot.com/2015/12/global-data-global-matrix.html) always called it \"starter fluid\" those oil reserves.  We have this convenient store of carbon energy to boost us into a next age, with different lifestyle solutions.  We took off like a rocket and cratered our own nest.\n\nIn this next chapter, one of weaning, if we just squander the asset away without planning, instead choosing to fight for the right to stay stuck in the mud, then we'll get to look back and wonder: just what was so important about all those \"jobs\" we were doing?  \n\nI mean, how can we even call it \"work\" if its primary goal is to distract us from what really needs doing?  What if, unlike Cuba, the rest of us just decide to goof off?  We sure burn a lot of oil just dinking around with our war toys.  You'd think as a species we might get more serious.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}