{
  "id": "4846709730452722415",
  "title": "The Joker (movie review)",
  "published": "2019-10-10T17:45:00.001-07:00",
  "updated": "2019-10-10T23:57:58.969-07:00",
  "content": "I've noticed the drop-off in the frequency of my movie reviews, and in my blog posts more generally. In part that's explained by my shifting a lot of weight to Youtube in the interim.  I'm developing skills in a different medium.  My first impulse, after seeing The Joker, was to [talk to Youtube about it](https://youtu.be/tDSTEvJg_40).\n\nWhat to single out about Gotham is Gotham itself.  This is a living breathing archetype, so familiar, and so recent past.  Some middle aged might not be used to seeing their adulthood reality cast in such a steely, otherworldly light, as the flickering dream of some past, as seen from a dark ride (like boats floating by dioramas). VCRs, VHS, answering machines... a lot of us are still using that stuff.\n\nThe Joker is again all stereotypes and archetypes.  Yes, of course he works as a clown, where as a tragic figure he struggles to stay comic.  The viewer is meanwhile seeking to get the genre.  Is this even a batman film?  In my Youtube review, I keep saying it isn't, while referring to it as the batman film.  It's a film about how Gotham could only have a crazy core, given the despair of urban misery.\n\nThe Joker (Arthur) can't help but laugh.  He has a rare form of mental illness that makes him laugh uncontrollably, a kind of turrets.  Or so they say.  We see and hear an animal suffering, and he comes to realize too, that he is so much more a victim than he thought at first.\n\nIn Gotham, everything goes from bad to worse, if you're the clown people kick when they're down.\n\nDidn't Salvador Dali report something similar?  He suffered from uncontrollable laughing fits for at least a week or two in his autobiography, which I recall studying in a coffee shop, over a sequence of visits.\n\nThe Joker's reality is likewise surreal, but not enjoyable (Dali seemed to be having some fun at least). The twists in this Oedipal Story are twisted, but that's the whole point with Oedipus (that it's twisted).  We're not really going against the grain of Western Culture; we're near its screwed up center.\n\nAre we in the Matrix, or is this Zion?  Is there a difference?  The marriage of heaven and hell.\n\nThe class consciousness uprising that the Joker inadvertently sparks, is what brings the Joker himself to higher self awareness.  He does exist, after all.\n\nHe's going to break the fourth wall and burst onto the public stage he sees on television.  However it's likewise television that lures him in, Through the Looking Glass style.\n\nIn [my Youtube](https://youtu.be/tDSTEvJg_40) I'm raising the dead, one might put it, in bringing up Marshall McLuhan.  What would he say about \"hot\" versus \"cold\"?  That Gotham is chill?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}