{
  "id": "8971670642018818136",
  "title": "The Post (movie review)",
  "published": "2018-02-04T19:48:00.002-08:00",
  "updated": "2018-02-04T21:20:54.463-08:00",
  "content": "I waited until Superbowl Sunday (LII i.e. 52) to think back on this movie. My main takeaway was \"well crafted\" in terms of summarizing the issues and relationships and adding to CR (consensus reality) in the form of a Spielberg movie, with big name stars.\n\nThe release of the Pentagon Papers, as they came to be called, is important to tackle and retell.  I'm glad to see the movie industry rising to the occasion.\n\nMcNamara tells Graham, the publisher, that the Pentagon Papers are not for the present, but for posterity. We're explaining in retrospect how [the American War](https://en.wikipedia.org/wiki/Vietnam_War) came to be lost by its losers.  Those living in the Nixon Era should keep fighting to win, as that was their patriotic duty at the time.  McNamara wanted to keep his top secrets for the present.\n\nConfusing, to have time machines bumping into each other like this.  Are we allowed to seize the day?  Lots of young people were dying, or evading the draft, or being held as political prisoners.  The hypocrisy of fighting for something called \"freedom\" overseas made for plenty of cognitive dissonance.\n\nHow does one consciously choose to \"live in the past\".  It's something one does out of habit.  When awareness expands, there's no going back by simply willing it.  The cognoscenti in the District of Columbia now knew too much to just sit on it.  They had a role in the immediate present.  Katharine Graham, played by Meryl Streep, has to break with McNamara and do her job.\n\nThe women have to explain to the men that they're not just taking orders or accepting the status quo they've been handed.  A sense of women pursuing their trajectories, building on past gains, pervades the storytelling.\n\nIn our day and age, we have another president embroiled in melodrama around secrets. Should they be published and what do they mean?\n\nHumans have been becoming increasingly skeptical that they're but extras in power games engaged in by various insider cabals. Transparency in the courts, and in government, was a way of countering the willful opacity of oligarchs. \n\nDemocracy was to be our leap forward.  People remember that and bring it up a lot during these important years, in this script at least.  The Cold War was being fought in the same vein, with the USA an ethical champion.  The other side, the enemy, might be deceptive and manipulative, but \"our side\" was definitely about serving the people. FDR helped inspire such sentiments.\n\nDaniel Ellsberg and company decided their higher duty was to shed light on the hidden \"secondary process\" rather than remain complicit in a cover up.  This movie clearly shows his motivations, and underlines how widely they were shared.  Nixon's cabal was beginning to unravel.\n\nDr. Tag, my Palestinian friend, invited me to take in this film with her.  She accomplished the impossible: finding a parking space near the theater, that time of night.  I'd more or less given up and was thinking about how we might reschedule for another day. \n\nThen we went to [Henry's Tavern](https://henrystavern.com/), the Weinhard brewery's flagship establishment, to discuss the film and its present context.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}