{
  "id": "3156313175732799311",
  "title": "The Refugee Biz",
  "published": "2023-09-24T18:30:00.000-07:00",
  "updated": "2023-09-25T08:40:04.039-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/3643446140/in/photostream/)\n\nI considered \"Buzz\" in place of \"Biz\".\n\nNo one thinks of the \"refugee biz\" as the big business of the Americas in general, let alone of the United States. But then I right away have to walk that back, as the Statue of Liberty beckons and it's built into the warp and weave of the nation that this is a place for émigrés. Come here and resettle. Uncle Sam needs you.\n\nThat message keeps changing over the years. Come pick our fruit but don't expect to be treated much above the slave level, meaning you will need to stay undocumented so we might keep our 2nd tier of exploitable labor.  We'll kick you out when we feel like it.  Sorry, we got here first.\n\nIf you switch lenses and see \"going west\" as adding to the \"refugee bucket\", then the whole saga of spreading westward, coast to coast, was the Refugee Biz in action.  Which is not to say they couldn't be enslaved or conscripted, forced into indentured servitude, onto poor farms or whatever.\n\nOnce you remember the role the military plays, of warehousing and disciplining scads of men, turning them into fine specimens, and once you see military types as socialists escaping capitalism, i.e. as economic refugees, then the \"refugee biz\" takes on its more monstrous proportions, size-wise.  The refugee biz is still the biz then. Makes sense: providing refuge.\n\nHowever, too much focus on the economic component leaves too many stories untold.  People come to the Americas to get lost, to escape being found, to start over, to gain a clean slate. Providing asylum.\n\nWhen I see the impressive ability of Chinese crews to crank out whole cities in China, I go back to Old Man River, the stadium-shaped city that dwarfs a real stadium.  \n\nNot as dense as a Paolo Soleri perhaps, but certainly a real city, like a crater, not necessarily sprawling.  It could be surrounded by a wilderness, with a few roads and train tracks coming and going. Canals.\n\nOne could build a few to get the hang of it, e.g. do the \"movie set\" version. Make some cartoons. Script the project. Do a few smaller ones? Perhaps we already have?  Do stadiums count?\n\nThe Americans would add more aerospace, continuing to take these new designs to the next level of ephemeralization.\n\nBy the way, I currently know next to nothing about \"fifteen minute cities\" although I've heard the meme.  Does that mean it takes no more than 15 minutes to get from any point to any point within the city?  Is that on foot or by Segway?  Like a Florida mobile home park but with more amenities?\n\nI do imagine an OMR would have like trains or monorails, like we have at the bigger airports.  Individualized people movers (driverless)? Who has the best storyboards?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}