{
  "id": "7726801414151575665",
  "title": "The Great Buck Howard (movie review)",
  "published": "2009-05-09T09:32:00.000-07:00",
  "updated": "2009-07-03T11:03:02.963-07:00",
  "content": "[This is](http://www.imdb.com/title/tt0460810/) an amazingly good movie, just what the doctor ordered given I'm swimming deep in the blues, thank you world and Friendly Care committee clerk (a death and dying professor, good with basket cases, this one about to turn 51).  This was my first time at [Living Room Theaters](http://www.livingroomtheaters.com/).[John Malkovitch](http://www.imdb.com/name/nm0000518/) plays everyone's projection of the washed up extra, whom we all feel we've seen a million times (on The Tonight Show probably).  His career is always just about over (or is over already) as he goes pay check to pay check, which he has to obtain through some [Friendly discernment process](http://www.google.com/search?hl=en&q=%22quaker+discernment%22) the audience isn't clear about, but enjoys watching nonetheless.The young Hanks plays against his father.  He's following his heart's desires in being Buck's sidekick, instead of finishing law school (I'd say [Blunt](http://www.imdb.com/name/nm1289434/) is proof he's on the right track), telling people he's \"a writer\", which hit home for me as that's what I was telling [Keiko](http://coffeeshopsnet.blogspot.com/2009/05/art-fine-grind.html) about myself the other day too (like [Russ](http://www.flickr.com/photos/17157315@N00/2932227543/in/set-72157607921813044/), she's from Brazil, speaks Japanese (Russ more Chinese)) -- probably thinking of [my Connecting the Dots](http://controlroom.blogspot.com/2007/07/connecting-dots.html) paper [for Vilnius](http://worldgame.blogspot.com/2007/07/slow-food-nation.html).Yet [this Hanks guy](http://www.imdb.com/name/nm0004988/) is in a successful movie with his famous dad, me watching, and I'm not even booked on Letterman yet (I'd have no idea what to say, something funny we'd hope).  So yeah, I'm jealous, even being a mentalist looks pretty good (yummy cash), I should get one of those ear mics.When cruel Las Vegas cuts out the corny parts, the act goes to hell. Buck is  happiest in Bakersfield, where he can sing about love on his upright piano.  I felt good about that because lots of [Urners](http://worldgame.blogspot.com/2005/12/whats-urner.html) live in Bakersfeld (just check the listings), bet those were some of my relatives in the audience.There's irony in our back stage talents wanting to know if the Great Buck is really gay, with the answer being \"we don't know, he's never with anybody\".  He does embrace [George Takei](http://www.georgetakei.com/) though (played by [himself](http://www.imdb.com/name/nm0001786/)), but then who wouldn't (everybody loves Sulu, me included).The punch line of this film is The Great Buck Howard is based on the The Amazing Kreskin, whom I used to watch on TV as well, and we still don't really know how he did it either.  Another tough act to follow.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}