{
  "id": "8099797455133892970",
  "title": "The Strange Case of Señor Computer (movie review)",
  "published": "2013-10-18T08:46:00.002-07:00",
  "updated": "2013-11-17T21:07:50.503-08:00",
  "content": "Lindsey built this up as the ultimate gift movie experience, a way of paying me back for all the duds we'd hit, not surprisingly, as she and I have watched hundreds of movies together (rough estimate) a lot of them from [Dominic's collection](http://worldgame.blogspot.com/2012/04/occupation-nation-movie-review.html) at Laughing Horse.  Most of his are pretty good though -- Laughing Horse is a treasure.\n\nAnyway, this movie is camouflauged as a badly directed amateur effort, which gets peoples minds off the budget and special effects.  It's uniformly ridiculous, like [Team America, World Police](http://worldgame.blogspot.com/2004/12/team-america-world-police-movie-review_04.html) (a relatively high budget film by South Park).\n\nThe star is this like [white and nerdy](http://worldgame.blogspot.com/2008/10/halloween-2008.html) mad professor guy (but younger) who just wants a girlfriend but all he has for company is this whacked out robot struggling for consciousness, and having a hard time of it.  The robot narrates the movie, in a synthesized voice, which makes no laugh track necessary.  I was cracking up the whole time.\n\nI don't get to see much of Lindsey which is probably why we were both looking forward to some time alone.  She's off at City Hall all day, [fighting to lift the camping ban](http://controlroom.blogspot.com/2013/09/occupy-vigil-episode-1.html) or working Food Not Bombs in multiple shifts around town, including R2D2.  She gives the goodie two shoes churches a run for their money, in terms of siding with the poor, not a half bad performance, even by Portland standards which are pretty high.\n\nHowever, her militancy against automobiles and refusal to ride in one has side tracked her music career as far as live night club appearances go (we did the downtown and east side circuit).  I used to be her roadie / chauffeur when she was new in town, but she gave up on those ethics and just gave me her vehicle in exchange for no rent in a basement (in far better use, by a quasi full time activist musician than for storage (that's what the garage is for)).  She tells her mom she lives with an old school teacher, and guess what, that's true (I'm 55 and I work for a school).\n\nBlue House wins with such interesting talented people playing World Game (speaking of which, Jen just left this morning, having camped out both in the backyard and in our living room as the days grew shorter and colder).  She's off on the next big chapter in her life.  [Here's a picture](http://www.flickr.com/photos/kirbyurner/10383675315/) of her early this morning, with all her worldly goods.  I wish her well and expect to see her again in a future chapter.\n\nWe we're still working on boundaries though, Lindsey and I (cell phone use and like that -- she won't own one but then I can't play social secretary so she mostly works through her girlfriend Melody for telecomm).  We've had hardly any chance to catch up at all lately, as I'm really feeling it at work.  Aside from the blow-up about maybe closing the pavilion at Colonel Summers Park (no plans to do that now), I have had my head in other spaces, as this blog will attest.  She and I don't overlap nearly as much as we used to.\n\nBack to the movie:  our hero is a mess, suicide prone, and relationships only take a greater toll than they're worth, diminishing him, not feeding him.  The robot is no help at all in this situation as the scientist's doppelganger i.e. he's pretty much going through the same thing, having a relationship over the phone, using his \"father's\" credit cards, and spending a lot of time introverted and morose, an emo kid for sure.\n\nYour enjoyment of this film will be proportional to your taste for underground comix (e.g Crumb) and other films of the same ilk.  It reminded me somewhat of Doing Easy.  Very William Burroughs.  Lindsey and I share that same wicked sense of humor to some degree (as does Christine).\n\nAfter the movie I invited Linsdey to sit in the co-pilot chair in my office and watch zombies storm Jerusalem again, in WWZ.  I like to share that clip with people.  Now that's high budget, comparatively.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}