{
  "id": "2033592292628207952",
  "title": "The Last Colony (movie review)",
  "published": "2016-07-10T19:17:00.002-07:00",
  "updated": "2024-06-11T06:24:26.037-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/27615324543/)\n\nMy thanks to the filmmaker for so many excellent interviews and really helping me come up to speed on the pending issue of the hour.  Thumbs up on the music video as well.\n\nIn my book, [Puerto Rico](http://mybizmo.blogspot.com/2016/07/meanwhile-in-puerto-rico.html) is the perfect issue to be discussing in 2016.  The narrative needs another swift kick in the rear, as the fourth plebiscite of 2012 was highly inconclusive and another was promised for this year (that's where the movie leaves us). \n\nThe needed \"consensus\" for statehood was not reached in 2012 and the Obama administration committed funds to a fifth run at the same question.\n\nTo resolve the dispute, President Obama proposed Federal support for a \nplebiscite under Federal auspices. The law requires that the options be \nable to resolve the status question, and the U.S. Justice Department \nmust confirm that the options presented are possible under the \nConstitution, laws, and policies of the United States. The Governor of \nPuerto Rico has committed to hold the referendum by 2016.  [ [source](http://www.pr51st.com/puerto-rico-destined-statehood/) ][ emphasis added]\nSo when is the next plebiscite scheduled?  I'm having trouble Googling up a specific date.  [November 8](https://en.wikipedia.org/wiki/Puerto_Rican_general_election,_2016)?  November 6?  What will the ballot look like?\n\nThe 2012 ballot was some kind of flow chart, with the majority saying \"no we don't like the way it is\" but then a great many stopped there, failing to choose from the set of next steps offered.  Of those choosing, 61% chose statehood.  Counting the \"protest vote\" of not choosing, the percentage of the total shrinks to about 45%.\n\nAs the movie makes clear, Puerto Ricans don't like how they're treated by the colonialists in DC (also not a state) and the unincorporated territory has recently (in the last couple weeks) made history by defaulting on paying a full amount owed to bond holders.  No US state or territory has done that [since Arkansas did](http://www.nytimes.com/2011/01/23/weekinreview/23davey.html?_r=0) the 1930s.\n\n[Bond insurance kicked in](http://www.bloomberg.com/gadfly/articles/2016-07-08/puerto-rico-default-fires-starting-gun-on-resolution) this time, helping creditors, and proving buying such insurance is meaningful.  The myopic financial markets are maybe only too happy to turn a blind eye of malign neglect at this point, but candidates for public office need to speak to the big issues of our day.  Plus we want proof that they do their homework and are willing to show leadership by educating their fellow Americans along the way.\n\nHow would Donald Trump suggest the island reorganize?  What better time to get advice from the Bankruptcy King?  If only Trump University were still around, right?  There's no question of \"a wall\" here right, in terms of barriers to statehood?\n\nAnd Hillary is a policy wonk, by her own admission, so does she have any advice for these 3.x million US citizens?  The standard thing is to encourage finding a resolution to the issue.  That's been going on for over a century.\n\nBernie:  Puerto Rico pays more in income taxes than your state of Vermont they tell me, yet have effectively no voice in the US Congress, how can this be?  Is this about imperial laziness?  Is Puerto Rico too big to fail?  What would failure look like?\n\nThe problems are thorny, twisted, legalistic, exactly the kind of issue more people should chew on.\n\nIf we can't manage to think through what to do in Puerto Rico, what makes us think we should be \"pivoting\" to \"deal with\" China, or \"spreading democracy\" in... actually I don't know if that's on anyone's agenda anymore, least of all in the \"USSA\" itself, what with all the secret supranational trade agreements under negotiation and so on.  Is the process [of desovereignization](http://www.alternalia.com/desovereignization.html) about 99% complete?\n\nPuerto Rico has all the hallmarks of a great puzzle in need of many eyeballs.  It's an open source project par excellence.  If politicians have any ability to improve lives and make things better, here's a golden opportunity to show leadership and provide a road map.  Or should we turn the matter over to engineers?\n\nProbably \"statehood, yes or no\" would be the most \nstraightforward.  Figuring out how to get smartphones enabled with a \nvoting app, one token per Facebook or Google authentication, might make \nsense.  Is anyone working on it?\n\nYou could still vote \nin a polling place of course, but not both, not multiple times on \nmultiple phones.  Might we use a blockchain somehow?  When we say people\n \"vote with their wallet\" maybe that would be literally true, as ballots\n show up like bitcoin, in your ballot wallet.\n\nMainlanders need to psychologically prepare themselves for a 51st state of the Union.  Lets at least get [a preview of the new US flag](http://physicsbuzz.physicscentral.com/2013/07/the-51-star-flag.html).  Even if statehood doesn't happen (is becoming incorporated versus unincorporated the next step?), at least we'll be thinking about it as a real possibility, which is more than we can say of the average mainlander today.\n\nPuerto Rico holds up a mirror and offers many lessons of history.  Given how little the average voter knows of history today, I think the issue of Puerto Rico's future is just the right issue to catalyze informed and informing debate.  Enough stalling already.  Lets get this show on the road.\n\n[@LastColonyMovie](https://twitter.com/LastColonyMovie) [@PuertoRicoPUR](https://twitter.com/PuertoRicoPUR) looking forward to sequel. [#blockchain](https://twitter.com/hashtag/blockchain?src=hash) might give us legally binding voting apps. Oregon has Vote by mail.\n— Kirby Urner (@thekirbster) [July 11, 2016](https://twitter.com/thekirbster/status/752359279844159488)\n\nHey [@FP_DemLab](https://twitter.com/FP_DemLab) you seen this one? [https://t.co/OI8ei0wipv](https://t.co/OI8ei0wipv) Congrats to Y-Combinator for funding [https://t.co/I7vk5knhlN](https://t.co/I7vk5knhlN) [@LastColonyMovie](https://twitter.com/LastColonyMovie)\n— Kirby Urner (@thekirbster) [July 11, 2016](https://twitter.com/thekirbster/status/752365876821696512)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}