{
  "id": "6471062932547637451",
  "title": "The Imitation Machine (movie review)",
  "published": "2015-01-05T13:35:00.003-08:00",
  "updated": "2015-01-05T13:46:03.239-08:00",
  "content": "I recommend coming at this as a theater play with historical content, not as some \"docu-drama\" or historical re-enactment.  That way you needn't worry about \"manga-fication\" (cartoonification), the process whereby subtle tensions become much more in your face and melodramatic, anything but subtle.  Like with Wittgenstein and that fire poker.  He almost killed Popper right?\n\nLike in real life [a Rumsfeld](http://worldgame.blogspot.com/2014/10/the-unknown-known-movie-review.html) might dictate some acerbic memo, a \"snowflake\" in Pentagon-speak, asserting his primacy in the chain of command over Condi.  In the \"manga-fied\" movie version, he gives her a punch across the jaw and she responds by dancing with nun-chucks on the ceiling, in slow motion, in a leather rain coat. \n\nTaking a real example from the movie: I doubt a fist fight broke out over withholding strategic life-saving information after Enigma was cracked, or that the Really Stupid General was really so stupid as to take a crowbar to a Turing Machine named \"Christopher\" and almost lose the whole war single handedly for His Majesty.\n\nI was glad to see the Soviets getting sympathetic treatment from MI-6, as Churchill was indeed worth bypassing; you can tell I'm not a huge fan, [Human Smoke reader](http://controlroom.blogspot.com/2013/10/some-quaker-overview.html) that I be.\n\nI wasn't privy to any of this salacious storytelling or gossip around Alan i.e. Bletchley Park was no Hogwarts for me.  They didn't celebrate that history yet.  I grew up in the Cold War when such things were still secret.\n\nPublic key photography would have to wait for the power of GCHQ to wane against New Zealand's (long story, [PGP-related](http://controlroom.blogspot.com/2014/11/citizenfour-movie-review.html)).  I started to catch up thanks to [Neal Stephenson's Cryptonomicon](http://4dsolutions.net/ocn/clubhouse.html).\n\nGreat acting, by all the Turings!\n\nFor a minute there I thought Scarlett Johansson (aka \"Lucy\") had [come back in time](http://mybizmo.blogspot.com/2014/08/lucy-movie-review.html) in her \"know everything chair\" to help Alan with his puzzle.  But no, Keira Knightly is actually a different person, duh.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}