{
  "id": "1477544783209903133",
  "title": "The Devil's Eye (movie review)",
  "published": "2016-02-10T16:43:00.002-08:00",
  "updated": "2016-03-03T10:03:49.907-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/24578567219/in/dateposted-public/)\n\nWe seem to have embarked on an Ingmar Bergman retrospective, with the Seventh Seal and now another religious parable, playing up similar memes.\n\nWe don't get Death this time, as a character, but the Devil himself.  Given the title, we might think his eye problem is less prosaic than a mere sty, which he seems unsure about and needs a mirror to half-discern.  The Devil, being vain, strives to see himself in his own wretched glory, and thereby hangs a tail, er tale.\n\nThe Devil is consumed with desire for the wholesome soul of a young maiden, still alive, on Earth, and thinks he has just the man to get it for him:  the corrupting Don Juan, accompanied by his likewise wily vassal.  Both are already denizens of Hell, so this offer of a foray back to Earth comes as a welcome invitation and both prove eager to rise to the challenge, plus a demon is sent after them, just to supervise.  The demon hangs out as a black cat, when not in male form.\n\nThe film portrays itself as a Divine Comedy, not unlike a midsummer night's dream, a parable with stock characters in which we may see ourselves reflected.  A naive dad, the vicar, a Ned Flanders type, does not see his daughter as a grownup, nor life in general from that standpoint.  He comes across as the clown, gent of somewhat stunted development, yet unwittingly a prime mover of events.\n\nThe vicar's wife, weary of living with such a child-like husband, is open to someone new.  The vassal senses this opportunity and his scenario plays out in parallel to Don Juan's,.  The demon goes after the vicar, trying to shake his faith in human nature.  The vicar proves to be quite a challenge, with an agenda of his own. \n\nThe happily engaged couple, the vicar's daughter and her boyfriend, between whom Don Juan's inserting himself would be disruptive, likewise have an unwitting air about them.  Everything seems so planned, so by the book, with the stock players unused to reflecting deeply, going through the motions, eager to do what's expected of them.\n\nWith Don Juan on the scene, Hell bent on hot pursuit, our female protagonist is plunged into self examination of her own values, and her cogent self assessment seems exacting enough to take some wind from Don Juan's sails.  She's inwardly loyal, or says she is.\n\nGiven Don Juan seems unable to penetrate her emotional armor, a merely physical \"love scene\" would seem extraneous and perfunctory, beneath his pride.  He would prefer to discover true love in his own assessment of what that looks like, a move perhaps uncharacteristic for him, but a breakthrough in spiritual maturity.  Don Juan finally up to the level of pining for someone other than himself.\n\nThe Devil is predictably upset by this outcome.  Don Juan has grown in stature and comes closer to matching the Devil himself in his capacity for despair.\n\nDon Juan has attained a kind of proud boredom and disinterest in his own eternal abuse, which involves endlessly striving to seduce, yet always waking up at the brink of victory, in some perpetual [Ground Hog Day](http://controlroom.blogspot.com/2014/01/anchorman-2-movie-review.html) of devilish design.  He addresses the Devil almost as an equal, as a consequence of his own most refined sense of \"designer sin\" and its high price tag.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}