{
  "id": "2079446860194336851",
  "title": "The Price of Peace (movie review)",
  "published": "2016-07-04T08:16:00.002-07:00",
  "updated": "2016-07-06T10:52:54.364-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/27979159992/in/dateposted-public/)\n\nPortlanders packed into the Clinton Street Theater for this July 3 premier of a new documentary (110 minutes) about the life of S. Brian Willson, against the backdrop of Endless Wars.\n\nEver since the discovery of the principles of nuclear physics, which humans weaponized to use against themselves, those who've believed themselves to be \"in power\" have wanted to achieve some sort of Final Solution to something, using these nukes as leverage.\n\nThe US population was galvanized to [fight military fascism and Hitler](http://controlroom.blogspot.com/2016/06/war-planning.html), only to inherit the mantle of \"superpower\", which to many generalists and generalissimos meant \"we\" (their side) had a window in which to purge the world of any [nasty ideologies](http://controlroom.blogspot.com/2016/06/songs-from-north-movie-review.html) that might threaten their superpower's newly achieved King of the Hill status.\n\n\"Communism\" was identified as the number one threat to continued world domination by many self-proclaimed authorities.  However, the consensus that made World War Two possible and turned the US economy into a war-fighting economy, started to break down after Eisenhower.  The rise of the Imperial Presidency was a big turn-off for many. \n\nManifest Destiny and the Indian Wars had played a strong role thus far, in the creation of a Lower 48 plus Alaska and Hawaii, with some territories, such as [Puerto Rico](http://mybizmo.blogspot.com/2016/07/meanwhile-in-puerto-rico.html).  The US was now ready to take to the world stage in a new way, as a colonial power, at least until Communism could be wiped out.\n\nAfter that, maybe more nations could be trusted with self determination (e.g. the Philippines), which would naturally be friendly to US business interests.\n\nS. Brian Willson grew up Catholic and Catholicism shared the US business community's fear and hatred of a new form of \"rationality\" that had grown up in the West through writers such as Hume and Diderot, culminating in the French Enlightenment.\n\nThose branding around \"God\" and \"Jesus Christ\" in particular, had suffered a loss of power as the 1800s saw the rise of \"unbelievers\" only a minority of which considered themselves to be Communist.\n\nEven deists [such as Thomas Jefferson](https://youtu.be/QcrYefMB3qM) were not buying that church authorities should impose their values through laws, a power earlier taken for granted.  The public space was coming under the management [of secularists](http://mybizmo.blogspot.com/2016/06/love-is-verb-movie-review.html).\n\nIn the absence of any consensus on God's Plan, and with the emergence of industrialization, two main schools of thought developed in the West:\n\n(A) The Marxists encouraged workers of the world to unite and share in common the means of production (to which a Capitalist class believed itself entitled) whereas\n\n(B) the Social Darwinists saw the relatively greater fortunes of some Capitalists as proof of their better breeding and consequent right to run things.\n\nThose still believing in God could see Him operating in mysterious ways in either camp, depending on their political leanings.\n\nMany within the Church were moved by Liberation Theology and the struggle for the rights of the most exploited.  Liberation Theologists became a new A-team and had much in common with the US abolitionists of the US Civil War.\n\nThe family in which Willson grew up was Catholic Social Darwinist whereas those seeking their independence in Vietnam were led by [Ho Chi Min](https://youtu.be/IHv3nQovuik), not necessarily a Communist but demonized as such.\n\nAsia was cast by the B-team as the place where the \"dominoes\" were about to fall.  Indonesia was another \"trouble spot\" with colonial heritage.\n\nWhen Willson got to Vietnam as an officer in charge of some forty men, it was his duty was to assess the \"success\" of various bombing runs.  These low altitude aerial fire bombings of fishing villages, followed up with napalm, were indeed very effective (just about everyone was maimed or dead), which was no doubt highly gratifying to the engineers behind these patented inventions.\n\nHowever, Willson, as a soldier on the ground, was not seeing the US winning hearts and minds with these tactics.  How would Social Darwinists win by continuing with human subject experiments, ala [the Marshall Islands](http://worldgame.blogspot.com/2016/06/golden-rule.html)?  He didn't buy this could be a winning grand strategy and felt his motivating ideology crumble.\n\nUpon returning to the US, he found crumbling ideologies everywhere he looked.  A lot of people were feeling like losers, having gambled on beliefs that had stopped making sense.\n\nThe Social Darwinists, for their part, were also Malthusians and saw the world as infested with millions, probably billions, of excess people.  War had become an acceptable means of \"population control\" in the minds of those believing themselves to be running things.\n\nUsing humans to test new kinds of weapons meant more resources, more spoils of war, especially for those inventing and manufacturing the munitions.\n\nGiven DC and the Pentagon had fallen to the B-team's forces, many US flag flyers with higher ideals (many of them decorated as war heroes) found themselves on the outside, fighting against other US flag flyers. A new kind of civil war began to simmer, even as Marxism began to fade.\n\nNew ideologies (memeplexes) were circulating through the population.  New so-called \"Aquarian conspiracies\" were popping up, much to the consternation of the FBI.\n\nThe movie takes us next to Central America in the Reagan Era.  By this time the CIA was taking over more command and control responsibilities, a trend that continued into the Drone Wars era.\n\nWar funding had been driven underground as more of an organized crime and drug running business (fighters need their meds, always have).  The budget had become \"black\" and privately owned mercenary businesses such as Blackwater had taken over the show.\n\nWillson and many Veterans for Peace were now full fledged hearts and minds warriors, rejecting the Social Darwinism of many in the business community.  They were in competition with the CIA when it came to the Contras, which later were being overtly and covertly funded in these newer \"black\" ways.\n\nWillson turns 75 today on July 4th.  His principled ideological positions have won him a huge following.  Portland's peace activist community has long celebrated his heroism.  He lost both legs to a munitions train taking weapons to Central America, and ordered to not stop.\n\nThe movie was co-sponsored by KBOO FM, which is also rebroadcasting the Blues Festival.\n\nThe bravery and courage of Vietnam Era fighters against Social Darwinism has won many hearts and minds in the Pentagon and FBI as well, which institutions have suffered from crumbling ideologies in tandem with their demographic cohorts (people from the same zip codes).\n\nA new McCarthy style purge of \"A-team Aquarians\" or whatever we call them, would be difficult and would lead to backlash (blowback). US presidents have tried to pander to both sides -- and felt rejected by both sides.  The simmering civil war continues.\n\nThe old [Business Plotters](http://www.huppi.com/kangaroo/Coup.htm), many of them by now of nursing home age, have been scrambling to find new arenas for human subject experiments, settling on that Cradle of Civilization known as Baghdad.  Their goal is a New American Century dictated by themselves and their mostly dead cronies.\n\nThe \"world domination\" meme, on the other hand, was inherited by a new breed of engineer into \"free and open source\" (the polar opposite of \"classified and secret\").\n\nMunitions are not as sexy as they once were (drones are for civilians) and \"military porn\" is seen more as an addiction and pathological perversion, ala Gitmo and Abu Ghraib.\n\nOutward war, a kind of theater, is geared for perverted perps with runaway mental illness, those without self control.  The new post-Marxist A-team has higher tech and greater self-discipline than the more conventional B-team, still motivated by Social Darwinism and various phobias.\n\nStarting a religious war against Islam is what the B-team is toying with, but given Muhammad Ali and what he stands for in peoples minds, that's unlikely to pan out.  Islam, like Christianity, is too factional to paint as a single mindset.  The great religions keep morphing.  The world does not stay still.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}