{
  "id": "8731271377068969578",
  "title": "The Day the Earth Stood Still (movie review)",
  "published": "2009-02-01T14:50:00.000-08:00",
  "updated": "2009-02-01T20:55:33.384-08:00",
  "content": "I'm posting about [the remake with Keanu](http://www.imdb.com/title/tt0970416/), who by now has lots of street cred as \"the one\".  This is a Judgment Day reverie, with God replaced by a Really Big Metal Person, Keanu his quasi-human emissary.It's the same dark pestilence though, with the same humans in denial about [their selfishness](http://controlroom.blogspot.com/2008/10/open-source-for-children.html) and depravity, a very Biblical film, could be one of Cecil B. DeMill's, but we've come a long way (a long way) in the special effects department.I went with my North Portland friend Leslie, sometimes a man's name.  Some people wonder if ethnic Quakers are allowed to mingle in mixed company, especially if single.  Our practices aren't especially unusual in that regard, at least not in [the USA](http://worldgame.blogspot.com/2007/12/hollywood-usa.html).We exercise our civil liberties in a democracy, meaning our meetings (of even just two or three) criss-cross ethnicities and genders (related concepts).Jesus is encouraged as a role model, in that he pow wowed with tax collectors, Roman soldiers, other non-Jewish types (however a lot of his best friends were Jews, as he was).That wasn't an entirely irrelevant aside, in that the biologist mom in this movie is the non-biological guardian of a cute little boy, who could pass for a girl in the introductory scene, even though playing a violent video game (as many girls do).  Later it's clear what sex he is.Although the relationship between Helen and Jacob is somewhat strained, it's real enough, and strong enough, to give Keanu pause.  He's also met with a wise Chinese sage (note \"Chinese dialog coach\" in the credits), formerly one of \"them\" who has become comfortable with his humanity, thinks we're OK.Those metal mites eating the truck and stadium were awesome, very Prey.Our venue was the St. John's [McMenamins](http://worldgame.blogspot.com/2007/02/sunday-outing.html), a charming stop on any leisurely itinerary.  Read up on your history.  [Expo 1905](http://platial.com/map/1905-Lewis-Clark-Centennial-Exposition/6586) was no joke, one of the great world's fairs of all time.  [Seattle's](http://mybizmo.blogspot.com/2006/11/seattle-center.html) came later.National Cash Register (NCR) had the domed pavilion, and that dome was preserved, what you'll [look straight out at](http://www.flickr.com/photos/17157315@N00/3245142899/), from inside the movie theater.I'm reminded of the [Expo 1897](http://www.goddess-athena.org/Museum/Temples/Nashville/) in Nashville.  Most of the pavilions went away, but Nashvillians fell in love with [Athena](http://worldgame.blogspot.com/2006/03/temple-to-athena.html), a relationship that has only gotten more serious with the passage of time.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}