{
  "id": "3084702956496064594",
  "title": "The Founder (movie review)",
  "published": "2018-03-18T19:00:00.000-07:00",
  "updated": "2018-03-18T19:24:17.002-07:00",
  "content": "I like having this review in sequence with Suburbicon (below) as both are set in the 1950s and roll forward towards our time.  The Founder is about Ray Kroc and the story behind the McDonald's franchise.\n\nDeke came over to watch it with me.  I picked it up from Glenn at lunch over at his apartment.  This copy is from Multnomah County Library.  I'll return it tomorrow.\n\nIn the Quaker circles I frequent, we inherit from way back the idea of a utopian business, like a company town that really provides.  I think religious orders that make chocolate or beer, may seem idyllic in the same way, at least from a distance. There's no need to grow bigger.\n\nRay starts with his country club friends, getting retirees to park their savings in his new restaurants.  Then he hires mom and pop couples who get the vision and stick to the script.  However as the franchiser he's not meeting expenses nor has he the leverage he needs.\n\nThe McDonald brothers who started the whole show in San Bernardino had tried franchising but didn't see a way to maintain quality.  The solution, according to the movie, came not from Croc but the future CEO:  make sure you own the land, meaning you can yank the lease if a franchise fails to conform.\n\nI think the \"welcome McDonalds\" scene set in Minnesota tells the real story.  Americans were extremely eager to have this restaurant chain spread.  Kroc was right to see it as more than just a drive in (they movie doesn't mention the drive through window innovation).  He wanted to create a \"religion\".  He invented branding in many ways.\n\nDeke stayed to watch the panel discussion as a bonus feature.  The actors, producers, and director, as well as McDonald brother grandsons, get to weigh in and share their personal perspective on the making of this 2016 film.\n\nMicheal Keaton, who plays Croc, explains his understanding of the American Dream as something much more modest and attainable than what has become the caricature:  making a huge fortune and joining the tiny inner circle of mega-rich and famous.  Making that a goal may more likely be a source of nightmares.\n\nI'd like to see the spread of \"company town\" campuses, somewhere between universities and Martian bases (on Earth), in terms of product placing and high technology.  Would these towns feature assembly line style kitchens?  Maybe so, though not exclusively.  I recognize the need for efficiency and appreciate the role of automation.\n\nThis movie takes a \"tip of the iceberg\" look at the more current McDonalds, mostly in the Bonus panel discussion on the DVD.  Ronald McDonald, the trademarked clown, is nowhere mentioned, nor the children's hospital.  The meat doesn't look frozen.  The new shake machines get zero focus.\n\nIn other words, there's room here for many more movies, whether they're ever made is another question.  We could make movies forever on the material already stockpiled, yet new generations are anxious to \"[make history](http://mybizmo.blogspot.com/2018/03/studying-wars.html)\".",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}