{
  "id": "116209914631214462",
  "title": "The U.S. Versus John Lennon (movie review)",
  "published": "2006-10-28T22:19:00.000-07:00",
  "updated": "2008-05-29T17:56:54.160-07:00",
  "content": "I saw this with Matt, appropriately, as John was a star in his sky, and his murder left a palpable emptiness. But this movie isn't about the senseless act of violence that ended his life. Rather, it's a shared trip down memory lane with some of our favorite talking heads. A lot of this story was new to me (I followed The Beatles from a much greater distance, mostly from my perch in Rome).Yes, Lennon had a privileged life by working stiff standards, and probings by the FBI don't begin to approach the terrors of Vietnam, but that doesn't make him an enemy. His was a family values lifestyle, if that means loving your wife and kids and wanting what's best for them.But when your wife is an already accomplished conceptual artist, quite able to expertly morph into some ninja princess master of psycho-guerilla warfare (as Bucky sometimes called it), and when you're one of these new breed of idols called \"rock stars\" whatever that means, and pretty clever besides, it's really unlikely your adventure will remain within \"normal\" parameters. Theirs certainly didn't.Many of these fans (plus a few loyal opponents) were new to me, as on camera personalities, although G. Gordon Liddy I've seen and always get a big kick out of.Richard Nixon has become archetypal in some way, [surreal](http://controlroom.blogspot.com/2006/02/history-is-surreal.html) and Shakespearean. He's the star of his own universe most definitely, but one that's hard to break into, if you're not him. I experience [compassion](http://worldgame.blogspot.com/2005/01/assassination-of-richard-nixon-movie.html).This fight between angry killer bee isms (communism... anti-communism), always so ready to devolve into stupid shootouts, as if that solves anything; Lennon was trying to show a better way to fight these battles, making them [more like chess](http://worldgame.blogspot.com/2008/05/other-russia.html). He definitely engaged Nixon's attention, made more of a game out of it. Clowning is a serious business my friend, any real circus manager knows that.And remember to set your clocks back tonight folks; the summer of '06 is long over, never to return. On a happier note, we get that extra hour in bed, perhaps reminding us of John. Peace.[](http://photos1.blogger.com/blogger/1134/545/1600/john-lennon-peace.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}