{
  "id": "8036234881856538996",
  "title": "The Happening (movie review)",
  "published": "2008-06-19T19:35:00.000-07:00",
  "updated": "2008-06-19T20:38:26.895-07:00",
  "content": "A couple of curious young people talked me into this R-for-horror American Gothic, like a bedside novel (not an expensive budget buster, only good if the acting is, and the make up), then text messaged me when it got too scary (they'd hopped to a different venue) but I wasn't consulting my phone, so thanks for letting me know eventually (we caught up later), so yes, I watched it through to the end (a lot like the start, by design).So is there anything psycho-therapeutic about the genre, let alone this specific film?  Not really a fair question, as within the genre we have apples and oranges, just like in any other genre.This one had some good advice:  don't be all macho-ornery around shut-ins, other isolated folk, especially in the Northeast (but I'd say anywhere).  They're alone for a reason.  The silly young boys just wouldn't listen, or at least one of them didn't.The main teaching:  [nature's power](http://worldgame.blogspot.com/2004/12/forces-of-nature-movie-review.html) includes psychic storms, not just outward stuff.  We sound stupid even to ourselves, trying to explain them, otherwise counter them.  The [science teacher](http://worldgame.blogspot.com/2005/11/science-project.html) did his level best to think it through though, and we admire him for trying.The running joke in this film was trying to plug \"air holes\" in drafty houses, drafty vehicles -- reminiscent of people putting tape on their windows, officially crazy, but what can you do?  So entirely hopeless, these counter-measures, because [nature is within](http://controlroom.blogspot.com/2006/02/welcome-to-reality.html).Granny's theory, about one always chasing, seemed somewhat profound, but in other ways she didn't behave like an elder.  Blame the bees, blame the flowers.  A lot like [War of the Worlds](http://worldgame.blogspot.com/2005/11/chicken-little-movie-review.html) in some ways (but not a blockbuster), also reminiscent of a more [light hearted art project](http://cityskip.blogspot.com/2008/02/video-frozen-grand-central.html) (a stunt) at Grand Central that time, but more horrifying (duh).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}