{
  "id": "3684078291757438552",
  "title": "The Zero Theorem (movie review)",
  "published": "2014-10-11T08:48:00.000-07:00",
  "updated": "2014-10-11T10:47:49.204-07:00",
  "content": "Glenn and I agreed afterwards, at the nearby English-style pub, lights out shades pulled (a holdover from bombers over Britain days, unfriendly).  This Monty Python esque movie is a frolic in the collective consciousness of our day, with perfectly played stereotypes or masks (archetypes [if you're Jungian](http://controlroom.blogspot.com/2014/10/red-book-not-maos.html)).\n\nThe \"ga-ga girl\" from Management, top of her class, kept being a spelling teacher in my fantasies, and [I knew why](http://controlroom.blogspot.com/2009/06/pythonic-means-pithy.html).  The son of Management was convincing, with the onset of hormones, already a smart cookie.  The supervisor of our anti-hero (or hero) is brilliant as well.  And so on.  Management does a great job.  Having so much set in a church, which burned down when none of the faithful monks (vow of silence) would yell \"fire!\" made this a comic Brazil like relief.\n\nThe job life there is so utterly crazy yet a lot like mine \"crunching entities\" (I crunch with \"[objects](http://worldgame.blogspot.com/2009/02/regarding-objectifying.html)\"), and instead of pneumatic tubes ala Brazil we have glowing test tubes of fluid as the storage medium du jour, with human hands still in the picture.  Storing data in fluids as gene sequences (packets) to be assembled later (they're numbered) isn't such a bad idea, and glowing is like labeling, so Gilliam's team may have nailed it.  Pizza will of course still be popular.  The realism level here is quite high, right down to the almost-contemporary advertising and product placement gags.\n\nI won't go into the plot or share more of the jokes.  Check the official trailer for more details of that sort.\n\nGlenn knows about the authentic English-style pub tables one may procure in Dundee, a nearby town in wine country, Willamette Valley.  I used to live about three blocks from here in Hollywood, for which the theater is named or vice versa, used to serve on the Neighborhood Committee in fact, with neighbors and realtors bellyaching about the supermarket moving out, and someone with a pet cougar.  I rented a basement space from a dear Quaker family with kids, watched 'em both grow to adulthood before I passed on (met my death on) _______ [intentionally left blank].",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}