{
  "id": "2260589323007972399",
  "title": "The Seventh Seal (movie review)",
  "published": "2016-01-24T06:22:00.000-08:00",
  "updated": "2016-01-24T11:51:58.759-08:00",
  "content": "This much-written-about classic by Ingmar Bergman is embedded within every film school curriculum and overview documentary I would suppose.  [The Story of Film:  An Odyssey](http://worldgame.blogspot.com/2012/08/the-story-of-file-odyssey-movie-review.html), certainly cites it.  For all that hype, had I ever see this movie start to finish?  Not for credit certainly.\n\nThe plot is set in medieval Sweden and appropriately follows a formula, popular at the time (and later), of a small troupe on a pilgrimage, eventually braving dangers together, and in this case, witnessing a witch burning in progress.\n\nThe fragility and ineptness of the entire belief system of the day is exposed, almost to the point of comically, in a somewhat Monty Pythonic (satirical) manner ([\"bring out your dead!\"](https://youtu.be/GU0d8kpybVg)).\n\nIronically, they are being punished by God, for being so forgivably clueless.  Fools are not exempt from the laws of nature however, and Death reaps souls aplenty.\n\nThe pilgrimage begins with the Knight and Squire, just back from the crusades, soon joined by Death, who stalks the Knight throughout the film, playing him at chess.  The Squire turns out to be the most learned and free thinking of the bunch and challenges the Knight's belief system in a teasing manner.\n\nThe Squire is chivalrous in rescuing a Damsel in distress, from a wicked thief who used to be something of a church authority, the one who encouraged the Knight and Squire to venture abroad on their crusade in the first place.  The Damsel joins the party, as does a troupe of three actors:  the Clown, his beautiful young Wife, their Director, and the baby Michael.\n\nThe Clown is perhaps closest to God in having visions all the time, which make him seem the most foolish, though his Wife listens and loves him.  The Clown is in good physical shape given he practices his moves all day, though his juggling is pathetic, what we see of it anyway.  He hopes Michael, their son, will grow up to become a juggler too.\n\nThe Wife is not so sure that's a good career choice for their boy.  Maybe he could be a Knight?  The Knight warns that's not much fun either.\n\nThe Knight is beset with existential concerns.  He wants answers.  What was the point of his pointless crusade, at the end of the day?  Helping the church burn women at the stake?  The Squire is especially repulsed by the whole business.\n\nThe Knight is initially open to the idea the \"witch\" might have some answers, given her supposedly close relationship with the Devil.  Then he sees she's just delusional, shaking her own faith as well.\n\nIn challenging Death to a game of chess, he delays his own demise long enough to win a reprieve for the small family he comes to care about.  The Clown, his Wife and Baby, escape Death for now, thanks to a combination of the Knight's nobility and the Clown's psychic powers.\n\nThe world (Sweden) is not a nice place, beset with the Black Plague.  Many are sure these are the End Times.  When Death arrives at the Knight's castle, where our party (minus the Clown family) has gathered, the Damsel seems most drawn to her next world, meeting Death with a look of anticipation.\n\nThe Knight rejoins a loyal spouse, who tended the castle all these years, awaiting his return, and yet he is far from overjoyed.  He's too tired to be capable of much emotion.  After his epiphany over cream and strawberries with baby Michael's family earlier, he has become exhausted.  He knows this small party is doomed (the chess game did not go well) and so remains emotionally distant.\n\nThere's a subplot with the Director, seduced by the Iron Smith's spouse.  These two, the Iron Smith and his unfaithful Wife, also join the party, rounding out the characters and providing contrasts.  Compare married life for these two versus that of the Clown and his significant other.\n\nThe different personality types, at different places along life's journey, all travel together, with Death on the heals of each one.  Like a medieval  audience, we learn from these characters, confronted with challenges and adventures.  We feel called to contemplate our own life's journey.\n\nClosing on the theme of Life as Chess (a strategy for winning over death for an interval), let us hear from Benjamin Franklin circa 1750 on the value of learning it: \n\n“The Game of Chess is not merely an idle amusement; several very \nvaluable qualities of the mind, useful in the course of human life, are \nto be acquired and strengthened by it, so as to become habits ready on \nall occasions; for life is a kind of Chess, in which we have often \npoints to gain, and competitors or adversaries to contend with, and in \nwhich there is a vast variety of good and ill events, that are, in some \ndegree, the effect of prudence, or the want of it. By playing at Chess \nthen, we may learn”  [ [source](https://diceygoblin.com/blog/the-full-history-of-board-games/) ]",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}