{
  "id": "8191912455722842679",
  "title": "The New Atlantis (movie review)",
  "published": "2010-10-17T08:39:00.000-07:00",
  "updated": "2011-06-11T21:33:23.320-07:00",
  "content": "This obscure DVD, a talking head documentary interspersed with theatrical re-enactments, is Volume One in the Secret Mysteries of America's Beginnings series.  The material is not anything that oughta be kept secret, if the goal is to provide a deeper understanding of past and contemporary myth-making.  The content is certainly PG enough to share in an American History or Literature class, is not even TV-14.I agree with the premise of the filmmaker that the ideologies driving the colonization of the so-called New World, by the English in particular, included these so-called occult and/or esoteric brands, the Freemasons and Rosicrucians in particular.The screenwriters don't want to come across as mindless shills for the Masons, and so frequently cut to disapproving voices tsk tsking about \"witchcraft\" and \"the occult\" (as if Christianity didn't have its share of occult teachings).  The disgraceful kidnapping and murder of one Captain Morgan, who supposedly divulged some Masonic secrets, is re-enacted such that one could understand why the ensuing backlash took its toll on membership.Francis Bacon is the pivotal figure throughout the narrative, cast as the successor to John Dee, a core member of the Rosicrucian school.  Dee was at first a confidant of Queen Mary (daughter of Henry VIII), but he fell out of favor (for not being Catholic enough?) and was later confined, along with Mary's sister Elizabeth (later Queen Elizabeth 1) for whom he became a mentor as well.Given the Pope had declared Queen Elizabeth and the Anglicans in contempt, a secret service formed around the new Queen as a protective body, headed up by Sir Francis Walsingham.  One could see where these secret societies would have a role countering the Roman Pope, and later the King of England during the American Revolution.  The formation of underground (sometimes literally) secretive societies in the face of persecution and/or prying busy-bodies is an ancient design pattern.The Boston Tea Party, a protest against the East India Company, was organized by such Masons as Paul Revere.  This is perhaps ironic in light of today's \"tea party\" seemingly wishing to disavow any such \"occult\" and/or \"outlaw pirate\" affiliations.The documentary, being of recent vintage, connects a lot of contemporary dots, including [the ](http://worldgame.blogspot.com/2005/01/national-treasure-movie-review.html)[National Treasure](http://worldgame.blogspot.com/2005/01/national-treasure-movie-review.html)[ movies](http://worldgame.blogspot.com/2005/01/national-treasure-movie-review.html) (deemed too literal and materialistic), Dan Brown's [Da Vinci Code](http://worldgame.blogspot.com/2006/08/da-vinci-code-movie-review.html), and several other lesser known scholarly works.  The Masonic philosopher Manly P. Hall gets a lot of attention.The script claims John Dee is the model for Marlowe's version of Faust, Rowling's [Dumbledore in ](http://mybizmo.blogspot.com/2009/07/hp-half-blood-prince-movie-review.html)[Harry Potter](http://mybizmo.blogspot.com/2009/07/hp-half-blood-prince-movie-review.html), and even Ian Flemming's \"[007](http://worldgame.blogspot.com/2006/12/casino-royale-movie-review.html)\" (Dee's occult signature).  And yes, there's a whole chapter laying out the Baconite view that Francis Bacon, Dee's protege, was a principal ghost writer behind the Shakespeare plays, not the Stratford-based actor, who provided the cover story (Mark Twain was also a Baconite in this sense).Speaking of Shake-speare, the story about \"spear shakers\" Athena and Apollo as core archetypes for Bacon and his cronies -- with a tilt towards Athena -- is [perfect PR](http://controlroom.blogspot.com/2008/01/greek-polytheism.html) for [Coffee Shops Network](http://coffeeshopsnet.blogspot.com/2010/05/buzz-about-shops.html), likewise anchored and tilted.Sir Francis Bacon comes across as [passionate about alleviating misery](http://article.wn.com/view/2011/06/09/Where_Are_Utopian_Visionaries_and_Ideals/) and contributing to collective prosperity through invention in language.  He sought to improve English, based on his experience of what the French were up to.  As a curriculum writer, he was doing his best to have the inevitable colonization of the New World be a positive experience yielding lasting benefits, even a paradise on Earth if possible (hence the title:  New Atlantis).I was reminded of E.J. Applewhite's Paradise Mislaid, which title suggests we might have gone astray with respect to Bacon's metaphysical program.  Applewhite lived a life of the mind and was an admirer of both Bucky Fuller (with whom he collaborated) and J. D. Bernal.  Does today's curriculum promote such mental aliveness, or does idiocracy prevail?  Utopia or oblivion?What may annoy some science-minded viewers of this DVD is the murky blend of experimentalism and spiritualism shared not only by these historical figures, but by some of the contemporary talking heads.  Perhaps John Dee felt he could contact angelic beings, but today you need to [see a shrink](http://mybizmo.blogspot.com/2007/01/wanderers-2007123.html) if they catch you thinking like that.I'm not saying I think this is a great documentary that somehow \"reveals all\" (whatever that might mean -- nothing probably).  The analysis of the Woodstock era North American counter-culture of the 1960s is quite superficial.  Linking [Britney Spears](http://mybizmo.blogspot.com/2009/03/explaining-esoterica.html) and Madonna to the occult seems more like naked piggy-backing on popular culture, in an age when the Masonic subculture has reached a low ebb -- which is not to deny an age-old link twixt celebrity / court culture and esoteric science fiction.  Indeed, a core point of the movie is people like Ben Franklin would have little choice but to frequent the eating clubs of the spoiled witless (somewhat notorious for hanky panky, especially in the projections of the puritanical), when seeking sympathy for the USA's upcoming forking off (Declaration of Independence).In remaining tightly focused on a very few secret societies, many other factors, such as slavery and the genocidal \"manifest destiny\" ideologies, are overlooked or simply absorbed as footnotes to an unquestioned Anglo imperialism (somewhat Reichian to begin with, as if Atlantis were some \"superpower\").Watch more documentaries then, lots more.  But at least weave some of these threads into your world model as well. Keep the secret societies on your radar, if you want your analyses to remain credible.  Also keep in mind there's a fine line between \"secret\" and \"accessible only with study and practice\".  Too many people forget that \"intellectual property\" refers to the capabilities of those who know some craft, have some skills (like computer programmers).  Scribbles on paper, a few diagrams, do not in themselves constitute the transmission of the relevant metaphysics.  In other words, don't forget to \"know thyself\" in your efforts to know the selves of others, and choose your friends wisely.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjDMB1mNscuDcqVN_g_trTe-oO1-BYRhyphenhyphenslmrCpR7Wi1Xh1KC5OO5zWnSq5qN4aJFWEQf2cyAVHBiDVzn76F3QrPXd0Y0U3GhtJTdGeonHDHsdXD-A24qH5HgCV91kwxc9dzBeU/s1600/athenas_friends.png)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}