{
  "id": "1597355945371399230",
  "title": "Theme Park USA",
  "published": "2022-07-12T10:57:00.003-07:00",
  "updated": "2022-07-12T11:02:16.971-07:00",
  "content": "I'd stumbled upon Defunctland's account of Disney's America, cleverly imitating Ken Burns film making techniques, but little did I know about Freedom Land U.S.A.  The two videos do not cross reference the parks specifically.  Freedom Land U.S.A., developed by graduates of the Disney Academy (an imaginary place, I mean Walt himself and his company), actually ran for five seasons, hoping to meet up with the Robert Moses World's Fair of 1964 on the tourist circuit.   These longer term dreams did not pan out (a housing project was in the wings as backup), but a lot of kids got to experience American history through a cartoonish carnival experience, the theme park theme.\nBy the time Disney's company decided to do its own version, under Eisner, partly to counter the Euro Disney disaster, the American public was less enamored of the theme park theme.  The circus sector could not be trusted to coddle the American ego.\n\nDisney and Henson (Muppets) were fighting the same battle:  to make cartoons and puppets a valid means for communicating culture, including adult to adult.  To some extent, this battle was won, in animation and graphic novels, in robots and AI (more semi-autonomous thanks to coding).\n\nOur telling of history has to be fluid.  Committing to one generation's narrative, in the form of a theme park, is to risk becoming obsolete rather quickly, as a future generation comes to mock the quaint views of the past (that's one dynamic).  The world of screens is less of a financial risk.  Keep it virtual.\n\nSpeaking of which, I salute C.V. Wood of dubious engineering credentials (at first) for being a great social engineer when it came to selling the theme park idea, which I am personally enamored of to this day.  Dark rides, as well as real train rides, and later roller coasters, have been deeply influential on my own psyche.  Like I can relate.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}