{
  "id": "8593583078273717844",
  "title": "Thinking with the Ancestors",
  "published": "2022-08-18T08:07:00.003-07:00",
  "updated": "2022-08-18T09:31:01.769-07:00",
  "content": "I rarely talk (or write) about my Uncle Earl.  As is the case with Uncle Bill, I'm using ancestry shoptalk in a shorthand, as both uncles are actually siblings of grandparents, not parents.  \n\nEarl was the in-law of my grandma Margie's sis Betty. I recall the last name was Poole or Poolton, I'll ask Bill if he remembers, probably not.  Carol might.  \n\nMy dad's side did not get to meet all of my mom's side, but isn't that usually the case?  We meet the most of our respective clans at weddings and funerals, oft times.\n\nAnyway, I recall this conversation with Earl, who seemed enigmatic, yet good humored, happy to have time with me, asking why we say \"the campus\" instead of \"Campus\" or something like that.  Why wasn't Campus a proper name?  But for what?\n\nI have only this dreamy recollection, which includes the room.  Then along comes this \"the universe\" versus \"Universe\" talk with respect to the Bucky stuff (R. Buckminster Fuller).  These seem to be grammatical investigations.\n\nWhere I come out, almost as a sum of these data points, is with Global University in place of and/or as a synonym for Spaceship Earth.  We say Earth as often as \"the earth\" it seems to me.  So we might say Campus and mean Earth, as in \"the planet\" (the one we're on).\n\nCampus in Universe.  Works for me, why not?\n\nI'm fine imputing a subjectivity to these terms, thinking of a passage in Synergetics wherein a Universe is like a complete game of how it might have turned out, something subjunctive flavored like that.  There's a wistful \"could have been\" to one's own world (shades of Wittgenstein again).\n\nOn a rather different subject I'll chronicle here that I got up early and started taking in high volumes.  The complete Silva Ultramind commercial, and then free episodes of the new Showtime documentary on Bill Cosby.\n\nAnd William James Sidis, the smart kid who just wanted to be left alone to think, therefore to be, not unlike Descartes, always pestered by his \"friends\".  Later they found a manuscript he'd been thinking on (i.e. writing) and it seemed to be about thermodynamics in some way.  They ran it by Bucky Fuller for his assessment.  Small world.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}