{
  "id": "113466075967861324",
  "title": "Thinking Globally",
  "published": "2005-12-15T08:25:00.000-08:00",
  "updated": "2012-01-19T22:04:13.021-08:00",
  "content": "[](http://photos1.blogger.com/img/254/1836/640/fullerproject.jpg)\n\nFuller Projection\n\nThis recent call from some president in Iran for Israel to vanish from the world map might be construed as a proposal to make more use of the Fuller Projection, whereon all nations have disappeared.\n\nThe idea here is it's all Israel, while the frequently-heard accusation that Jewish networks seek [global domination](http://mybizmo.blogspot.com/2009/04/cywar-in-cyberia.html) is less a source of paranoia than of hope. Mature schools of thought, many found within Judaism, are indeed committed to the long term viability and sustainability of Spaceship Earth, our promised land, for millenia to come.\n\nOur USA operating system is up to the same thing: providing robust, secure infrastructure for our global dominion. Certainly many pro Russians think intelligently about their ship, and act accordingly wherever they may be. Space-minded Chinese call it [Our Land](http://worldgame.blogspot.com/2004/12/our-land.html).\n\nThe Fuller School encourages [thinking globally](http://controlroom.blogspot.com/2005/02/on-edge-of-chaos.html). We want whole systems thinking, global management philosophies, people who think in big picture terms. Letting your mind get boxed in by some arbitrary political boundaries just dumbs you down, artificially constrains your horizons.\n\nSo, how will the new Persian power plants fit in to the regional grid and how will the IAEA be assured that no weaponization is happening? These are supranational concerns. Let's use a Fuller Projection to brainstorm some answers. Let's make our Iran a safe and secure world.\n\nMid-level managers who still need to cling to some jigsaw-puzzle nation state approach to global thinking are welcome to do so, have plenty of other maps to choose from to sustain their patterns of thought.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}