{
  "id": "7817107495387246478",
  "title": "Thirsters 2016.5.12",
  "published": "2016-05-12T23:11:00.004-07:00",
  "updated": "2016-05-13T10:08:38.661-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/26949398056/)\n\nI was unclear what the topic would be, but a friend on Facebook was suggesting I go.  My house guest, here on business, was game to come along and sample our subculture.\n\nAs luck would have it, Don's [former student Mark](http://mybizmo.blogspot.com/2007/07/returning-to-source.html) was by.  We'd had a day on the boat together some years ago.  Don visited Mark in Guatemala that time, and [talked to Wanderers](http://mybizmo.blogspot.com/2005/11/wednesday-pauling-house.html) about it.  The presentation was on recent developments in Guatemala.\n\nIn particular, our speakers included a forensic anthropologist, well-versed in crime scene discovery, and a mother-daughter team who had attended a part of a recent trial, brought by victims of abuse against the perps.\n\nWhat was new in this case is (a) the defendants were military officers in the Guatemalan armed services and (b) they were found guilty by a court in Guatemala itself.\n\nThe steady flow of refugees from American states has everything to do with the [culture of impunity](http://mybizmo.blogspot.com/2013/09/wanderers-2013924.html) they've permitted, frustrating the movement to eliminate slavery.\n\n[](https://www.flickr.com/photos/kirbyurner/26949396836/in/photostream/)\n\nPeople in the US complain about immigration without understanding the dynamics behind people pushed off their ancestral lands, people who might have rather stayed put.\n\nThese women, now in their 70s and 80s, had been enslaved during the Reagan Era, when violence against native peoples was at an all time high across the board.\n\nAs the government effort has been to assist a property-owning class engaged in land grabbing, much as in the US, the Guatemalan military has been cast against native peoples as an enemy, and slave women have traditionally been among the spoils of war, just ask the Romans.\n\nI asked if this recent guilty verdict in anyway imperiled business as usual around US bases, both at home and abroad, where a sex industry abounds, but without being seen as [outright slavery](http://mybizmo.blogspot.com/2016/05/recent-reading.html).\n\nThe exiled people [of Kwajalein and Bikini](http://www.greenplanetmonitor.net/news/conflict-and-environment/the-marshall-islands/) come to mind, as among those pressed into servitude and dependence, after having their ecosystems [poisoned by radio-toxins](http://controlroom.blogspot.com/2013/11/pacific-islanders-meet.html).\n\nUpon arriving home, I couldn't find my XQ-1, the camera I use for all these pictures.  That resulted in over an hour of searching high and low, retracing my steps, driving back to the venue.\n\nI found it, finally, on the floor in the back seat area of the Nissan.  I'd looked under the front seats but hadn't spied it lying there.  I surmise it fell out of my coat pocket.\n\n[](https://www.flickr.com/photos/kirbyurner/19812362065/in/album-72157655634700169/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}