{
  "id": "4762983938445094245",
  "title": "Thoughts about Bookkeeping",
  "published": "2007-10-01T21:20:00.000-07:00",
  "updated": "2007-10-01T21:30:36.061-07:00",
  "content": "What'll be fun is when some of the smart cookie NGO charities get their books projected in real time.Make a donation, watch the money go to work.  Track every penny if you like.A \"no secrets here\" open books policy often makes for good fund raising, plus gives donors bragging rights they might not otherwise have.However, these same practices might work for a mom & pop coffee shop just as well.  Buy a bagel, watch the debits and credits ripple through the system on a wall-mounted [flatscreen](http://mybizmo.blogspot.com/2006/12/caf-philosophique.html).Is the profit margin scandalous?  No.Do loyal customers like seeing a special fund build, so that staff might get some much deserved R&R?  Yes.Per my limited [Free Geek experience](http://worldgame.blogspot.com/2007/09/open-source-within-health-care.html), I'd say top quality free and open source generic bookkeeping software is still in short supply.For the NGOs at least, it'd make sense for Foundations to band together and to give them a boost.  Pioneer some new designs that take advantage of hindsight, why not?\"Want our millions?  Then document your expenses using X\" might be a stipulation.Of course that might get out of hand, if each funder tried to micro-manage which open source bookkeeping application got selected, as a condition for funding.A more realistic goal is to design and implement systems capable of generating the kinds of feedback requested by each funder.  That might include a growing archive of videos, with donors getting special access rights.Don't be afraid to tell it like it is, only to see some backers drop away, even as others freshly join and/or step up their involvement.Not every relationship is meant to last as long as every other. A given funder might relish the one night stand as it were.  \"Get in and get out, make a difference\" is the preferred [M.O.](http://www.urbandictionary.com/define.php?term=M.O.) (the \"pinch hitter\" design pattern).One hallmark of a friendly system is it's good about dumping its data, doesn't interfere with migration to competing systems.Unfriendly systems count on using the captured data as leverage:  \"Want out?  It'll cost ya.\"",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}