{
  "id": "6878647983334244860",
  "title": "Threshing Session",
  "published": "2014-10-12T11:47:00.003-07:00",
  "updated": "2014-10-17T07:08:50.192-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/15516744251)\n\n:: meeting room, Stark Street facility ::\n\nYes, I'm blogging from the meeting room right now, but like a TV reporter in front of the camera before the event begins.  The Quakers are mostly down at Social Hour, schmoozing, which is what I'd usually be doing, but the hubbub was distracting.\n\nI'm also listening to [SomaFM](http://somafm.com/) (Drone Zone), probably sucking off Meeting Wifi.  Lew et al have done a good job reconfiguring the building to take advantage of what bandwidth we have.  The laptop is likewise \"live\", which is why at least the first couple paragraphs were real time.\n\nI'll probably want to put this away soon, when more people show up (only three in here besides me, listening to Lucinda).  In geek world, like at Google, it's OK to keep using a laptop when a speaker is speaking, as remarked upon soon into it [by Andrew Bacevich](http://controlroom.blogspot.com/2014/09/vectors.html), a progressive Catholic (or so he seems to me).\n\nNow there's no one here but me, when I snapped the above picture.\n\nQuakers are not like [Mormons](http://mybizmo.blogspot.com/2014/06/gay-pride.html) or Masons in having \"members only\" rooms or rituals.  We have rooms and rituals, inner sanctums, retreats, but non-members are allowed to infiltrate by design, as a way of keeping a check on member honesty.  Quakers noticed from studying history (lived experience writ large) that a \"members only\" club design leads to abusive relationships, institutionally speaking.  Chuck Fager goes into this at some depth in [an adjacent blog posted video](http://worldgame.blogspot.com/2014/10/on-progressive-friends.html).\n\nWhat are we threshing about?  Depends whom you ask but the Bulletin distilled it down to a little box, so I should grab a screen shot of that:\n\n[](https://www.flickr.com/photos/kirbyurner/15518420135)\n\nThe prospect of losing the PSC committee is exercising (worrisome, anxiety-producing) for many Friends as it looks like a disembowelment, a suicidal act.  The right to have such a Committee was won through bitter struggle so to just give away the store looks a tad cuckoo to put it nicely.\n\nBut that's just one angle, probably more prevalent among oldsters like me.  The younger hipsters see a way forward where we all turn to one guy or gal for guidance, or treat as a catalyst or whatever.  I'm hoping to pick up on what the new lingo might be, in the aftermath of such a radical surgery.\n\nMy guess is Friends will back away from the precipice and signal a willingness to resume their duties as Quakers (a self identified Friend has one choice: to walk the talk or appear hypocritical).\n\nHowever, that we've even [been to this brink](http://controlroom.blogspot.com/2014/06/end-of-era.html) says a lot about us and the State of our Society.\n\nOur upcoming State of Society Report will need to draw from whatever Megge and Rick put together (they're to write some report).  I'll be sending some analysis to Philadelphia, plus blogging here obviously.\n\nI think I'll move to the library now, and take some more pictures.\n\nMarty has a laptop open, so I feel OK for me to do that also.  Good to see Carl, sitting in front of me.  He's clerk of Nominating, which is sourcing this proposal to shelve Peace and Social Concerns.\n\n\"Friends do not avoid issues which are difficult and controversial, or complex, or require learning information of an esoteric nature, and threshing sessions help the community get up to speed in advance of going back to executive mode.\"  That's a paraphrase.  Hmm... I don't see Josh.  I thought he might have a view on all this.\n\nMegge is opening the discussion on whether we agree that the topic is \"how best might Multnomah Meeting address Peace and Concerns issues?\"\n\nWe're back to the water / welling / bubbling metaphor which has been popular in meeting lately, one of our thematic memes.  Catholics go through these.  Seems the topic wording is more vague than what was put in the newsletter.\n\nSome Friends are too upset by the prospect of killing off Peace and Social Concerns (OK, icing it for a couple years); they want to thresh about their shock and worry about losing it, and maybe to share about their PTSD from being on the committee in the past.  We have some PSC veterans here.\n\nVeterans:  Joanne Luchini, Carol Urner, Jim Metcalf, Desiree Hellegers, Debbie Averill... so far everyone is speaking passionately about how a Peace and Social Concerns Committee is vital to Quakerism.  Jan Kjerne remembers a time thirty years ago when the committee members all wanted to act solo and never attend meetings.  That's probably the time this meeting seriously faltered before, in the 1980s.\n\nJim emphasized that such a committee is not about solving all the world's problems, but about supporting people doing serious work in the world as peace workers.  The committee provides advice and coaching and is a repository for the meeting's organizational memory.\n\nStill an hour to go.\n\nCarl, clerk of Nominating, finally addressed the question as to why we're even having this discussion, as so far no one has backed Nominating's proposal.  Mostly, it seemed to Nominating that Friends were not interested in serving on a reputedly \"falling apart\" committee. \n\nThe idea that people might come to Peace and Social Concerns meetings without going through an appointment process sounded like [a good way](http://mybizmo.blogspot.com/2014/10/innovations-in-role-playing.html) to address this apparent reticence on the part of potential committee members to come forward with concerns and leadings.\n\n\"There's still a Peace and Social Concerns Committee\" Carl claims.  That sounds a tad euphemistic to my ears.  He used the word \"goofy\".  Mom said \"I don't think you're goofy Carl\".  Carl:  \"well, it may be that the proposal was.\"\n\nEddy is reviewing her career with the meeting, as several Friends have.  We have only about nine minutes left.  Glee is confused about how to separate her concerns into Oversight and/or Peace and Social Concerns.  She's relatively new to Friends.\n\nI don't sense any interest in shelving the committee so far.  My guess is the Meeting will move to resume operations as usual, with this vital organ intact.  That doesn't settle [the issue of AFSC Liaison](http://controlroom.blogspot.com/2014/06/notes-from-business-meeting.html) though, as I will likely discuss in [a future blog post](http://worldgame.blogspot.com/2014/10/revised-org-chart.html).  For today, that's a tiny footnote.\n\n[](https://www.flickr.com/photos/afscportland/15333262530)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}