{
  "id": "3624562204989389301",
  "title": "Time Management",
  "published": "2018-10-31T13:46:00.003-07:00",
  "updated": "2018-11-14T13:01:00.169-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/31782490358/in/dateposted-public/)\n\nPeople go to school to learn about scheduling in the software sense.  The operating system's primary job is to protect processes entrusted to its care, meaning it gives them each attention.  We hope the OS is not stretched to capacity, as might be USA OS version 0.2, or whatever that is still running in the District. A former image.\n\nHere in [Asylum District](https://medium.com/@kirbyurner/intraquaker-dialog-9ac6102e2b1c) I talk to a leading expert in concurrency.  [Synchronous parallelism](https://mybizmo.blogspot.com/2018/07/parallel-processing.html) with multiple CPU cores is distinct from letting a coroutine sit on the shelf in pause mode, because it has no new work.  A lot of your bureaucracy consists of people waiting for results, and not pressing the matter, because already working with earlier requests.\n\nCase in point:  I'm heading down to county elections this afternoon, on behalf of my mom.  We stopped by in mid September to make sure her ballot would come here and not go to California.  It went to California.\n\nIf they try to mail another one today, it will also go to California.  No one in the bureaucracy has gotten that far in the queue.  The request is on file, but there's nothing immediate about updating the main database.\n\n[](https://www.flickr.com/photos/kirbyurner/31782492378/in/dateposted-public/)\n\nI was trying to strike up a conversation with other businesses on social media about whether gambling for charity is still gambling.  I see these restrictions against gambling over the wire, but in these games, the winnings go to the charity of your choice, and you get to be the one with a hero's profile.\n\nPeople will commit to your potential winnings on the basis of your wise use (in their eyes) of their commitments.  I've spelled out all the plans and protected them for the public, in [this sister blog](https://coffeeshopsnet.blogspot.com/2018/10/the-economics-and-psychology-of.html).\n\nSpeaking of being a hero, I understand how people [use the I Ching](https://mybizmo.blogspot.com/2008/03/unicode-experiments.html) as a mnemonic device.  There's a pattern language to the hero's journey, and in being willing to have the I Ching be [the labyrinth](https://mybizmo.blogspot.com/2008/10/ppug-20081014.html), one gets a well trodden, spelled out adventure.\n\nWelcome to LARP.  Live Action Role Playing.  Your life. What's wrong with feeding your inner hero?  Isn't that what psychologists say to do?  Lets be consistent.\n\nThe empiricists and frequentists cry foul, saying it's \"superstitious\" or \"magical\" thinking to consult the I Ching or look at Tarot decks or whatever.  They're not thinking of how reinforcing a Memory Palace using the events of one's day is simply taking up the raw material of everyday living and applying that as a kind of glue language, to something worth holding together (a model).  \n\nHaving a Memory Palace is not in itself a bad idea.\n\nSo what if a random billboard reminds you of one of its many rooms?  Would you rather just obey the billboard?  Some would prefer that you would.\n\n[](https://www.flickr.com/photos/kirbyurner/30716657927/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}