{
  "id": "1682232190087887180",
  "title": "Time for Blender?",
  "published": "2019-01-12T11:03:00.002-08:00",
  "updated": "2019-01-12T11:12:04.697-08:00",
  "content": "I woke up this morning to Youtubes about Blender Beta 2.8, perhaps to be out of beta by June, 2019?  Blender is a large open undertaking aiming at the 3D sculpting and animations market and has a large loyal following.\n\nFor many, it provides a training pen, sophisticated enough, for the less free commercial products they'll end up using, such as products by Autodesk or maybe ESRI.\n\nI remember when Kenneth Snelson, a star developer of CGI, was expressing some distress over the prospect of tackling Maya. No matter how many peaks one has ascended, there's always another, and peaks are difficult by definition, and one is only getting older.  So should I learn Blender 2.8 in 2019 and work at getting really good at it?\n\nThe motivations would be many here: (1) I'm a curriculum developer around the Bucky stuff (2) hypertoons were my invention and I should make more of them (3) for Coffee Shops Network (4) which is about pumping funding to the field.\n\nAccording to this workflow, the bottleneck between getting funding to the field, and the status quo, is my not knowing Blender nor having made those synergetics hypertoons yet.\n\nThis is probably where I start to rebel against myself (my own science fiction) as (a) I have done some simple synergetics hypertoons and had them on Youtube years ago (b) lots of folks are way better at that animation stuff than I am right now and (c) the field needs its funding now, yesterday, not in some fond future when Kirby has had time to reinvent himself yet again.\n\nI'd rather jump on the advisory team doing the 4K IMAX type movies for science museums, that will pump out the Bucky stuff in super high def, and have those coffee shop reveries downloading right away.  So I keep looking around looking for who else is in the business and doing the work?\n\n\"When you can't be the best, buy the best\" is a slogan close to what I'm getting at.  Let's not wait for Kirby, is the main idea.\n\nThat being said, Kirby has signed up for a Maker Space lesson, presumably in 3D printing.\n\nI have the STL files from Jeff and I'm looking at Koski identities using phi-scaled S-modules as my opening topic, with a UVT (unit volume tetrahedron) used to scale everything else in this Sculpture Garden (SG).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}