{
  "id": "114425716261956333",
  "title": "Today's Networking",
  "published": "2006-04-05T13:48:00.000-07:00",
  "updated": "2006-11-15T11:44:17.347-08:00",
  "content": "Today I'm busy working with Erica at Associated Oregon Industries ([AOI](http://www.aoi.org/)) on improving their database program (inherited Visual FoxPro code which I've mostly rewritten by now).I phoned Multnomah County to reschedule jury duty once again, this time for mid January 2007.Dawn is having many high level discussions with her care team.  She's the kind of patient many doctors like having:  she takes it straight, unvarnished, yet with sensitivity and grace.  Her professional care givers, in both eastern and western traditions, are among her biggest fans.I'm planning to take Tara to AAA after school; we need to get her passport reactivated per family overseas travel plans.  I really want to show them Italy, Rome especially (many favorite boyhood haunts).  We've ordered a copy of her birth certificate on-line, after not finding our earlier copy.  I'll also pick up a map of London, and maybe of the southwestern USA (Dawn's hoping for a [bizmo](http://worldgame.blogspot.com/2004/12/whats-bizmo.html) trip).I swung by the Linus Pauling House on Terry's invitation to meet with our ISEPP guest, [Dr. Ulanowicz](http://www.isepp.org/Pages/05-06%20Pages/Ulanowicz.html), and maybe listen in on some fun conversation.  Apparently Wanderers had invited him to lunch some place (I found evidence of a meeting in progress).  Given time constraints, I elected to scrawl a \"Kirby was here\" on the board; I'll hope to catch his lecture tomorrow evening.Dawn ordered, and I picked up from the vet, a new bag of Moon Kitty's special cat food.Arthur Seigel and I have another [interesting thread](http://mail.python.org/pipermail/edu-sig/2006-April/006086.html) going on [edu-sig](http://mail.python.org/pipermail/edu-sig/), which again explores the nature of my commitments and investments as a Fuller Schooler.Hugh Watkins, the Copenhagen-based fellow student of Wittgenstein's philo, excerpted some recent [Kirbiania](http://mybizmo.blogspot.com/2005/07/kirbiania.html) about Wittgenstein in his blog ([link](http://bloog2.blogspot.com/2006/04/wittgenstein-seen-from-usa.html)).Nick Consoletti is staying in my basement again.  He wants me to write a recommendation for the [Design Science Lab](http://www.designsciencelab.org/), which I currently know only a little about and am not involved with.  I have no problem recommending Nick though.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}