{
  "id": "8183171371228126429",
  "title": "Today's Confabs",
  "published": "2007-06-19T20:25:00.000-07:00",
  "updated": "2008-11-15T02:36:42.095-08:00",
  "content": "I joined a tetrahedron of phi guys today: DF has been studying the spiral; GS knows sacred geometry; DK (who phoned my cell while I was having Thai food with DF); myself.Chatting with DF is always a pleasure. He knows lots of tricks I don't, just as CalTech has fared better at providing email to its alums, Princeton's TigerNet having caved under ambient conditions within Spamalot, our trashy cyberslum.I'm boosting coffee consumption, beans from Burundi, cutting back on other calories (I have plenty in storage).DF and I spent a pleasant quarter hour exploring the OED around \"jerk,\" a real name for the third derivative at Boeing, where people value smoothness as a passenger experience.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi-X6SciEn_5CLi8rc6YcKCrMv6j6dTl3k14PqxAlIz4dERaeyMXyi0-ANFJ8Xe5_D0RWjdmmjIEGgRYvbB-fVdrlp7brt7ZpUzn_QnhLTFvQ4Lg7BUb_5rxs6hVvqxhGPhQqB_/s1600-h/physpy.png)r = pow(math.e, theta * (2/math.pi)*(math.log(phi)))DF: the successively shrinking quarter-circles-in-squares in a phi spiral aren't exactly quarter circles. That f(x,y) = 0 would put too much jerk in the joins.OED: another meaning is to \"jerk out\" something sage between draws on one's pipe, not quite the same as \"blurting\" nor \"pontificating\" either.This association with witty, whip-like quips, is in stark contrast with another meaning of \"jerk\" as in \"slow to catch on,\" \"a dim bulb,\" a spectrum mirroring people's differing experiences of the same performance on occasion.Judging was a major focus of our lunch as well.DF's visualizations around the science fair model, of judges ranking projects with an eye toward awarding prizes, have been evolving for some time now, a fascinating process to observe and to learn from I reckon.GS found me at the supermarket, looking for butter pecan ice cream for mom, mint chocolate chip for Tara. We then co-spiraled down the beer aisle.I returned DK's call from earlier. He's recovering fast from an injury, has almost finished the new garage.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}