{
  "id": "115764688718420362",
  "title": "ToonTalk",
  "published": "2006-09-07T10:34:00.000-07:00",
  "updated": "2018-06-08T12:48:31.487-07:00",
  "content": "So you'll find me [apologizing to my gnu math teachers](http://mathforum.org/kb/thread.jspa?threadID=1444930&tstart=0) over on Math Forum for our slowness in getting them a usable stash of mathcasts suitable for gnu math teaching. Like, the following query still only pulls up my [briefing to Wanderers](http://mybizmo.blogspot.com/2009/01/about-habitats.html) re the high tech housing we're trying to recast in higher rez these days: video.google.com/videosearch?q=polyhedra (7050 results Jan 2012). [Update: Google Video was discontinued].\n\nNot much selection in other words.  Not my doing (I'm not trying to be the one and only producing in this genre -- I seek no monopolists' powers, more relish the prospect of competing).\n\nYou'd think polyhedra'd be a hot topic for would-be TV producers, if gearing up to showcase their Renaissance savvy.  But then, B2B is still pretty weak; CEOs sometimes got behind the big desk without knowing about our Platonic Five, the Archimedeans, [A&B mods](http://worldgame.blogspot.com/2005/12/incomprehensible.html), other purged and indexed topics, held back by the controlling Inquisition (aka math content police).\n\nNow, when it counts, their handicap is more evident, right when a better quality education could have helped with the bottom line.  Lots of opportunities for explosive growth as a mathcaster these days, lots of room for green field development.  That scares some away, I realize.\n\n[As John Saxon discovered](http://mathforum.org/kb/thread.jspa?threadID=1308115&messageID=4123864), upon retiring from a distinguished military career, special interests in this country associate anything \"pentagonal\" (as in [hexapents](http://mybizmo.blogspot.com/2006/08/hp4e.html)) with Elvyn Lore, other Lord of the Rings anti-Christian storytelling.  Not that ol' [JRR](http://en.wikipedia.org/wiki/J._R._R._Tolkien) ever imagined himself the AntiChrist, but for some people, that's just what one is, if making money off bestsellers that aren't about what's literally in the Bible.  C.S. Lewis:  same problem (lots of obvious, out-of-the-closet pagans are goodies in Narnia -- how could Aslan allow it?).\n\nIn Saxon's case, t'were his story problems that left parents disgruntled.  They didn't want Little Johnny absorbing all these fairy stories involving [species unknown](http://mail.python.org/pipermail/edu-sig/2006-September/007004.html) in the Middle East, and which lead to uncomfortable questionings of authority.  Disney:  another threat (just look at [Fantasia](http://www.imdb.com/title/tt0032455/) -- too scantily clad, plus a nasty promo from some [diabolical](http://www.arrogantbastard.com/) corporate sponsor towards the end).\n\nSo it's not just lack of CEO sophistication that's road-blocking our advance.  It's fear of capitalizing on Arlington's [most famous architecture](http://mybizmo.blogspot.com/2006/08/mathcasting-about-phi.html), making an asset out of something so blantantly phi-based.  The left fears sacred geometry (too over-the-hill hippie, too unsophisticated), and the right fears some sort of feminazi [Blair Witch](http://www.imdb.com/title/tt0185937/) conspiracy (anything with pentacles and tentacles is a candidate under-the-bed [boogeyperson](http://en.wikipedia.org/wiki/Boogey_man) for them).\n\nA solution?   We need to bypass \"white man superstition\" and capitalize in less backward nations, at least to start.  In Canada for example, or maybe Alaska.\n\nLet the Christian Taliban have their \"Afghanistan\" in whatever necks of the woods.  This isn't about wresting totalitarian control from the mom and pop church-loving.  It's about going only where we're welcome.\n\nWhen it comes to cyberspace, that's somewhat harder to police from our end, but we trust parental control blocker software to keep the more sensitive households secure against our [semi-subversive](http://worldgame.blogspot.com/2005/11/charter-schools.html) (yet all American)  style of thinking.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}