{
  "id": "110710042656227006",
  "title": "Total Information Awareness",
  "published": "2005-01-30T08:34:00.000-08:00",
  "updated": "2017-03-29T11:35:59.592-07:00",
  "content": "In this highly effective [ACLU ad](http://youtube.com/watch?v=-4LtYMNl4yw), some hapless netizen phones to order pizza and gets more than he bargained for: an encounter with big brother (or big sister in this case). And she's right of course: he should lay off the double meat, given that waist line and medical history -- although she'll allow the transgression if he signs a release from the HMO (expensive!).\n\nPart of what makes this encounter seem so unfair is the pizza lady holds all the cards. Our would-be consumer knows nothing about his order-taker inquisitor. The violation of privacy is entirely one-sided. This suggests an important principle: to the extent that we are moving towards total information awareness (no one really knows the future), it shouldn't be about empowering Obnoxico (Fuller's term) at the expense of the average citizen. Here at Global Data, we don't just work for pointy-headed geeks named Poindexter. We work for you, the average pizza lover.\n\nIn my view, the average citizen is still sovereign. Like, go ahead and pig out on pizza if that's your karma, provided you allow for the rights of your neighbors (they don't have to watch, nor care if you kill yourself). Corporations on the other hand, being not human, don't have the same rights to privacy, especially the really big ones working closely with planetary infrastructure. The public has a right to know what these big name players are up to, given we'll all pay the consequences of bad decision making, and so increasing transparency is the name of the game.\n\nI learned these values in the open source community, wherein I've taken an active role (like, why trust your life to source code they won't show you?) -- but also from Uncle Sam. The American commitment to freedom of information is not about providing exclusive and one-sided advantages to tiny elites, anonymous shareholders in their gated communities, or to military planners with fantasies of global domination. The commitment is to serve all of the people. That's why top management at Global Data has such love and respect for the Smithsonian Institution and the National Geographic Society -- and Google. And yes, we think the ACLU is pretty cool too.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}