{
  "id": "7255785075744787559",
  "title": "Towards an Anthropology of Geekdom",
  "published": "2013-01-24T13:21:00.000-08:00",
  "updated": "2013-02-07T14:36:53.824-08:00",
  "content": "Freshman year Princeton found me in the engineering library browsing standards, not really knowing why.  I'd fallen to Earth and now had a world class open stack library within walking distance.  Time to catch up on what's been going on.  I believe it would have been in the course of that reading that I would have first stumbled upon Unicode, along with ISO this and ISO that.  No W3 yet, back then.\n\nIn some ways social commentary by the pundits is uninteresting because it hasn't swallowed enough of the facts.  We have social engineers now ([e.g. Facebook](http://groups.yahoo.com/group/WittrsEX/message/4753)), much as you folks feared we would, and we actually do have a human languages friendly way of preserving diversity.\n\nSome conservatives just assumed the engineering caste was so partial to Anglos that we would just get on with some conquest.  That's not how it turned out however.  Pirates took in engineering and now so many engineers talk like pirates, use profanity, or at least feel safe in doing so when they wish.  Sailors strut on land, full citizens, despite the landlubbers' having their traditional puppet authorities (Kings and Queens and such).  A more believable form of democracy seems close at hand some days.\n\nI was just realizing I'd been tacitly waiting for universities to get wise and field any number of anthropologists, as that's what management needs (more insights), whether it knows it or not.  Books [like Bucciarelli's](http://controlroom.blogspot.com/2006/05/isepp-lecture-end-of-season.html) were pioneering (How the Hippies Saved Physics also).  But the wave didn't come, and I realized what that means:  it's up to us to think [more like anthropologists](http://controlroom.blogspot.com/2011/04/roller-coaster-at-reed.html) and not wait for the self-professed to get wise.\n\nLearn from the anthropologists what you'll need and [apply the skills](http://controlroom.blogspot.com/2011/06/sketchy-ethnography.html) as they develop.  Don't worry about your \"credentials\" to think in those terms.  You don't have to pay licensing fees for the thoughts you have, much as we've become amputees in other respects, thanks to \"the law\" and its rewarding of selfishness past the point of pathology.  The wages of sin.  The sorrows of empire.  Illiberal policies, when it comes to knowledge sharing, leads to a Tower of Babel syndrome pretty quickly.  Almost no one has enough puzzle pieces, even Gollum.\n\nConference badges are a space where it all comes together, as well as patient-facing medical monitor screens.  If they can't print or display the Chinese or Thai characters that make up your name in its native context, then to what extent have they bothered to master our shared technology?  How lazy, in a more negative sense, are they being?   For sure the competition will eschew advertising such incapacities.  The LCDs in the hotel room (or hospital room) will be in your favorite language (or choose the one you're learning).  Use the remote to change the view.\n\nIt's OK to judge at this point, to stop making allowances for yet another generation of journalist that can't write about Unicode intelligibly.  You needn't be a \"technical writer\" to tackle that subject.  The schools have had the time in principle, it sort of doesn't matter whether they lunged at the opportunity.  It's a computation:  oh, you could have and didn't, lots of time lost, so now we stop waiting.  We refine our level of expectation: \"Ah so, it was too hard for them.\"\n\nWhat some anthropologists might study is the geek use of the term \"laziness\".  The usage pattern goes with the grain of many a Chinese philosophy.  The management caste is well aware of how easy it is to fall into a hero mode that's unsustainable and self-overwhelming.  You start accelerating, go into \"fixit mode\" whereas a big picture generalist will allow that some individuals need to hang back and keep to some level of overview, much as some soap opera or melodrama becomes interesting.  Quakers have their overseers ([rotating positions](http://controlroom.blogspot.com/2007/12/management-by-rotation.html)) for this purpose, not just their clerk.\n\nIn software, you have the tools to automate drudgery and push the work onto machines.  It's an overwhelming amount of work happening at superhuman speeds, so even a hint of it coming the other way, starting to make you the big \"doer\" has the whiff of incipient tragedy.  The geek knows that and insists on writing a script to do the work.  \"If I end up doing all these things manually, my day will rapidly become hellish\" is the familiar diagnosis.  Treatment is indicated.  The prognosis is good if the geek is given the liberty to pursue \"laziness\" as an end in itself.  Enter the Church of the Subgenius and Bob's gift of \"slack\".\n\nThe role of profanity is starkly clear in Titanic, the movie.  I'm not sure this aspect of the film was accurately captured in the various dubbings, as some movie-going ethnicities may not accept cussing in public.  The Titanic itself has upper and lower deck subcultures.  When the ship starts to sink, the lower deck people have no priority for life boats.  In the near future of this world, [a more globalized engineering caste](http://groups.yahoo.com/group/WittrsEX/message/4819) is controlling the search vessel and indulging in lower deck like banter.  One interpretation is the future was less mindful of class.  In a related meme, the King and Queen are invited to eat \"hot dogs\" with Bill Murray, playing FDR.  The findings of science have been accepted. \n\nThe idea that \"the blood itself\" contained distinguishing chemistry had mostly vanished from medical science.  We were all software running hardware running software.  The concept of \"race\" was following \"class\" into intellectual morbidity.  That doesn't mean we had stopped believing in selective breeding or genetic material.  Distinguishing chemistry exists, like finger prints.  Distinguishing memes also make their circuits.  Peers continue to recognize one another by gesture and secret handshake.  The many protocols would only continue to proliferate.  The idea of \"no class\" and \"no race\" is in becoming so very very many, Venn diagrams gone wild.  Everyone is different, that's for sure (even twins).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}