{
  "id": "8344916395503081870",
  "title": "Toy Story 3 (movie review)",
  "published": "2013-06-27T23:17:00.001-07:00",
  "updated": "2013-06-27T23:53:17.545-07:00",
  "content": "I've seen the previous two Toy Story movies, but long enough ago that memory fades.  However, like Harry Potter, like Jackie Paper in Puff, you need to grow older with your audience (or freeze in time like Peanuts or Simpsons).\n\nAndy is going to college and is ready for somewhat darker themes, hinted at in a toy modality.\n\nBuzz Lightyear, the most militarized, is the most easily flipped, once Book Worm delves deep to find his primitive psyche.  He turns himself into a thug for Boss Bear, a bear terminally angry at life for the abandonment he experiences.\n\nThis is the more horrific world of Scary Baby and Frowny Clown.  \"One bright morning in the middle of the night...\" topsy turvy.\n\nOur migrant colony, trekking together after a family disownment, falls into a state of servitude.  The connotations might be Biblical, with Boss Bear as Pharaoh.  We needn't press the analogy too far.\n\nFunny though, was how the soldiers were first to bail, seeing the reality of a mission accomplished, another boyhood done.\n\nAlthough George Bush was ridiculed for his [Mission Accomplished](http://controlroom.blogspot.com/2008/04/pentagon-policies.html) strutting and puffing, I think he was doing his best to deliver and bring this media extravaganza / violent orgy to an end.  Let's say \"it's over\" in a big patriotic gesture, with the president pretending to fly in, to land on that aircraft carrier -- so cinematic.  \n\nThe cynics just laughed at this silly swagger because they better knew how far from over this war would be.  They were just getting started it seems, never mind if the White House was happy to call it a win, and a day.\n\nThere'd be that trial of sorts, to give people catharsis.\n\nThe \"conquering\" attackers were of course not on trial.\n\nSo what was the big win supposed to be after that, or in Afghanistan, with its mission accomplished once again?  Bin Laden had been neutralized.  Later.  In the [Obama term](http://controlroom.blogspot.com/2013/02/zero-dark-thirty-movie-review.html).\n\nOne could mock the whole farce on television, [as a president](http://youtu.be/f_tFKa2_YBQ), even them.  The \"stove pipers\" had set up a dog and pony show and sold the UN a bill of goods. Some of us watched it on television.  \"[Aluminum tubes...](http://mybizmo.blogspot.com/2007/09/lampoon-harpoon.html)\"\n\nAnyway, back to Toy Story, Buzz somewhat redeems himself with \"Spanish mode\" wherein he makes eyes at the Cow Girl.  This is easier to forgive than his shill-for-Boss-Bear persona.\n\nThe recycling plant is a place to face death.  The very meaning of \"deus ex machina\" -- that plot device which delivers last minute rescue -- is in fact a machine, and piloted by ETs as luck would have it (fortunately the \"toy tribe\" is cosmically diverse in this alternative universe).\n\nAs we learn in History of Money, there's a circuit wherein the soldiers march across the land, buying provisions (not just pilfering) if planning to sew good relations, but then the sellers (including contractors) need to remit a portion in taxes (or call it tribute).\n\nContractors [need the money](http://controlroom.blogspot.com/2008/12/iron-mountain-revisted.html), soldiers need the provisions.  The currency stays afloat.\n\nOr call it \"foreign aid through conquest,\" what Washington DC calls \"spreading democracy\".\n\nThe little girl receives the toys with proper ceremony.  There's a passing of the torch.  We've said good bye.  Toy Story 4 will not be necessary, at least not for this generation.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}