{
  "id": "8940525283049901925",
  "title": "Tracking Tulsi",
  "published": "2021-10-10T13:24:00.008-07:00",
  "updated": "2021-10-19T13:54:44.945-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgireVzhxO7-8LR3GeRW0LD9HQhdv3O6YigAV7IB81Ry2TFnoHP2jPAsUM-YLq9nOspEJs8T5FP2todE2IkLVbTJoH5f2m1OWGpRprPzembiFOmbe3BZVs5tq0TBqlGglAspstj/s806/gabbard_youtube.tiff) \n\nI never soured on Tulsi Gabbard in the wake of Joe Biden's gaining the throne in the White House. Perhaps because I had few illusions in the first place.  I see her primarily as a \"Hindu-bot\" with -bot a suffix one may add anywhere (\"Jew-bot\"... \"Xtian-bot\") to hint \"set in their ways\" and/or \"programmed from birth\" and/or \"high inertia\" (and possibly high caliber to boot). \n\nI don't think the Lower48ers collectively have much of an ability to emulate or empathize with the reflexive tension one oft finds, on the Indian subcontinent, twixt Hindus and Muslims.  I'm talking about real Indians here, not about \"Indians\" in that backward \"cowboy\" way many sheepish Amerish stick to, as a matter of pride in their homespun namespace.\n\nThe Islamic Mogul (Mughal) civilization (Turkish, Persian, Urdu speaking) colonized much of India, and to this day one has a cast of Indian bureaucrats in the Arab-speaking states, so grafted together these subcultures have become.  Pakistan is hardly that secular of a state either.  Lower48ers forget they're children of The Enlightenment (many have no idea what that means in the first place). \n\nOne might object that the English superseded the Moguls and the most evident hybridization is thanks to remnants of the UK.  That's a bit of a straw man position though, as of course it's not either / or. The Amerish overlay the Japanese who overlay the Spanish when it comes to archeological layers in the Philippines, and that's only a tiny piece of the story.\n\nI recall taking my computer problems to a Hindu family man, from India, and his letting me watch over his shoulder while he fixed my PC.  He liked talking geek with a guy like me (a geek).  Before long, he was warning me about the nefarious nature of the Muslim type, by which I gather he mostly meant people he remembered from in his homeland.  I doubt he knew many Muslims here in Greater Portland (not that there aren't any).\n\nTulsi is a militant, in the military, with that patriotic calling to serve her country, in Congress as well.  She's not a WILPF member, not an Ava Helen Pauling. \n\nShe ran for president on the basis of calling for \"no more regime change wars\" not ending use of weaponized drones, and in doing so she was stirring up the ire of covert operations buffs, the types who count on the Pentagon's collusion going forward, in planning all manner of derring-do operations (drone-based included) designed to harass and disappoint, if not ultimately frustrate, this or that competitor in the market place of ideas.\n\nTulsi helped disrupt the fragile narrative around Syria, another point on which she is not easily forgiven, as that narrative has continued to crumble, much to the disgrace of various old guards operating mostly in face saving mode these days.  \n\nDisobedience and defiance of the DNC became evident early, in her \nembracing Bernie Sanders in successive presidential elections.  The \nSanders wing seemed too unlikely to prosecute regime change wars in a \npredictable fashion, with its wavering grasp of a worthy enemy.  At \nleast the Pelosi-Trump axis was unified behind Juan Guaidó, the Wikipedia-ordained acting president of Venezuela.  Bernie does his best to sound sincere. \n\nShe also helped unravel the phony Russiagate hypothesis, by taking offense over being labeled as their tool.  The DNC resorted to name-calling too transparently in that case, crying wolf once again.  These were punishable offenses and in recent news cycles the neoliberal wing has done its best to bring down the hammer, and evict Gabbard from the DNC circle of cronies once and for all.\n\nSomewhere, a contained conflict must be instigated, to perpetuate the war machine's profit-taking.  Tulsi is on board with that if that means targeting radical Muslims i.e. the extremobots she has a beef with and sees behind 911. She has plenty of room for a more liberal Islam, sure, but is ready to fight the fanatics, anywhere she's deployed.\n\nThe Lower48ers are confused about foreign policy and many of them know it.  Fantasies take hold amongst them and becometh as folk religion, which the priest-witch politicians know how to make roil and boil, to create a potent psychedelic (as in screen-cast) brew. \n\nBefore long, the populace is collectively hallucinating, entranced by those long optical fibers called cable television, stretching back to the studios of mind control (an imprecise art to be sure).\n\nAs a Quaker type, I argued with my sister about whether it made sense for a pacifist to support a militant Hindu for president in any way.  However my rhetoric was somewhat nuanced.  I didn't think Tulsi could win, as Lower48ers don't \"get\" her that well (they can't related, only project).  \n\nWhat we needed for a president was another crime boss, a mafioso type (not to specify an ethnicity here) which is what we always seem to get at the end of the day.  \n\nTulsi's way of thinking was too idealistic, more like a soldier's, when said soldier is eager for someone or some ideology to follow.  A tinge of idealism and hope for the future rubbed off, and helped some people stay awake, but most got their optimism through Bernie.\n\nThat Ms. Gabbard is currently taking solace from her remaining popularity with the right is not a problem for me.  She's a good antidote to the likes of Trump.  I don't think they understand her either, but they remember she called Hillary \"Queen of the Warmongers\" and stood up to those DNC juveniles.  That won her some respect at least.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}