{
  "id": "2877156544842909062",
  "title": "Train Reading",
  "published": "2010-05-23T16:52:00.000-07:00",
  "updated": "2010-05-23T19:12:22.636-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/4633215915/)I used much of the time to/from on the train (Amtrak Cascades) to study The Long Emergency by James Howard Kunstler. The author uses the well-worn calculus of nation-states, unabashedly saying \"we\" for the Americans he considers his compatriots.He expects a steady increase of entropy in human affairs, as oil reserves are depleted. It's the end of the world as we know it. Our chauffeur to the train used the word \"anomie\" for such identity-disrupting changes, a word I later found in the book.Although Kunstler mentions \"Spaceship Earth\" in passing, he's not seeing desovereignization via Grunch as a potentially hopeful sign.  He intends his \"we\" to remain rather exclusively North American, projecting the potential for \"political psychosis\" on Chinese, even while admitting North America's sprawling commuter-based suburban lifestyles are kooky and squanderous.  Europeans are relatively sane by his yardstick, their commitment to agriculture and urban growth boundaries still well defined.Kunstler is pessimisstic about the global grid getting any nuclear juice from Persia, given high levels of paranoia all around.  WWIII will not begin with an attack on these power plants in his estimation, but only because it is already well under way.  In this sense, his lingo somewhat dovetails with that of the world gamers, who see WWIII beginning with [the so-called Cold War](http://controlroom.blogspot.com/2008/05/teacher-training.html) (cite Critical Path).Also on tap:  The Corporation, a DVD borrowed from Laughing Horse for Tara's benefit, and screened in a rural setting on an HDTV (at a private party).At this same venue, I launched into my little rap on the Mite and the T-module, using Mag-Blocks and Ball of Whacks.  This mirrored my posts to Math Forum, where[ I question the censorious attitude](http://mathforum.org/kb/thread.jspa?threadID=2078323&tstart=0) of comtemporaries.  My audience included one math savvy computer science person, steeped in Java, Ruby and Visual Basic (not Python).  She works in trucking, a sector I'm also starting to tune in, a primary consumer of fossil fuels.We didn't screen the whole of The Corporation as the arguments against corporate personhood are already well known in this neck of the woods.We took Amtrak's Cascades to/from.  The conductors over the PA were entertaining.Going north, we had a Russian guy, thanking us for supporting this one international train in the region.  He suggested we keep our seating area clean and tidy, lest we be judged rude and crude by our fellow North Americans across the border.Going south, our conductor suggested we refrain from smoking lest we be offloaded and transported to a secret prison in Eastern Europe, \"extraordinary rendition\" in action (he used those words).  So the CIA does operate domestically after all (surprise surprise).Also on my reading list:  Sum:  Forty Tales from the Afterlives by David Eagleman, a series of reveries encouraging self reflection.The notion that communities might experiment with different lifestyles, versus kowtowing to one centrally dictated standard, is important to the idea of religious freedom.Islamic forms need campus facilities, places to test themselves in relative security, just as do other religious forms, including Mormons in Texas.This notion that lifestyles must be exterminated by force versus allowed to pursue a diverse set of options, goes against the idea of experimental prototype communities of tomorrow (some of which [may be Taliban](http://controlroom.blogspot.com/2009/05/bait-and-switch.html)).World Game's focus on artifacts aims to lower barriers to entry for those wishing to create viable small (or large) scale communities.  Perhaps a blend of traditional ways and aerospace tech will assist in the terraforming.On the other hand, easy access to armaments and deliberately fostered feuding, an old divide-and-conquer technique, prevent a live-and-let-live ecosystem from occurring.Scholarly forms of Islam have fostered such peaceful relations in the past, as have other religious lineages. Secular brands not religiously anti-religious likewise have a track record of fostering non-violent lifestyles.A program of student exchange will provide the necessary diplomatic glue.  Those fearing a campus is secretly training militants in bomb making and torture techniques ala School of the Americas etc. will have ample opportunity to interview the exchange students.  We all spy on each other, by design and prearrangement.The monitoring of nuclear facilities develops along similar lines: a global cast moves among them, both reporting and lending its expertise. Civilians monitor themselves.  The weaponization of nuclear materials is judged a crime against humanity, wherever and whenever, the hallmark of a corrupt Dr. Evil who must be stopped (like in the comic books).A new media campaign:  Terraform Earth! This perhaps sounds ridiculous, as Earth is already terraformed.  However, in the Martian literature, \"to terraform Mars\" is \"to render Mars habitable\". We need to use our best engineering and understanding of anthropology to keep Earth habitable over the long haul.  Terraforming is our ongoing responsibility, and if we're unable to do it here, then it's unlikely we'll ever be able to do it elsewhere.This work may mean taking a somewhat alien point of view, not identifying with this or that nation too much.[Cyber-nations](http://mybizmo.blogspot.com/2010/01/cyber-nations.html) (aka \"virtual nations\") might help serve as an antidote to rampant nationalism, a mindset which keeps way too many humans trapped in some \"us against them\" mode of scenario planning.Our only Promised Land is Spaceship Earth. Responsibility for the whole entails responsibility for the parts, but not vice versa.Will world religions inspire us with positive and attainable visions of community, sacred spaces, or is religion inevitably invested in Apocalypse, with an afterlife situated in other worlds besides this one?Those colonizing the so-called New World for religious reasons were looking for opportunities to practice unhampered, and to create relative utopias in so doing.  The motives behind the founding of Pennsylvania were not that different from those behind the founding of Israel or South Africa, with maltreatment of indigenous peoples a source of on-going karma.Nation-states are not synonymous with communities however.  We might have campus facilities in a Global U, with students free to move among them, independently of the claptrap of vast land tracts claiming sovereignty under God, lands often grabbed at gun point.If we want our students to be intelligent, equal to the challenges at hand, then the jigsaw puzzle of nations need not appear on every map that they study.  Those learning to see Earth from Space need to see her as she really is:  a single ecosystem / economy.Refugees without established citizenship might be among the first to enroll, gaining new identity within these schools.Corporations already incorporate many of the relevant memes, in being global without requiring vast contiguous land tracts in many cases.Allegiance to all humanity is a curriculum goal, not as a matter of empty idealism, but of necessity.  We need at least some future thinkers, world leaders, to escape \"the calculus of nations\" as their only frame of reference.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}