{
  "id": "7228675734527698269",
  "title": "Triangulation Puzzles",
  "published": "2015-09-21T19:28:00.003-07:00",
  "updated": "2015-10-04T17:17:06.270-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/21381449720/in/dateposted-public/)\n\nI invited [Alan Potkin](http://controlroom.blogspot.com/2015/09/zardoz-movie-review.html) to address Wanderers at Pauling House tomorrow, about his work in the field of environmental impact.  We've had lots of \"eco talks\".\n\nAs Alan points out:  so often the institution charged with undertaking an environmental impact study has a vested interest in the outcome in that it not mess with already drafted plans, many jobs on the line.  \n\nThe dam building company is supposed to do PR about what could be lost?  The builder is supposed to pay for an objective review?  They'd hire Alan and get what they'd paid for; and more than they wanted to know.\n\nWhy isn't this design in itself seen as a problem?  We let the accused plead the Fifth.  If someone is going to be working against you and your perceived interests, then really have that be someone else.  One can only be one's own sparring partner up to a point.\n\nHow do we solve conflicts of interest?  [Triangulation puzzles](http://mybizmo.blogspot.com/2006/10/terminal-movie-review.html).\n\nNot solving them [begets corruption](http://worldgame.blogspot.com/2015/09/investigating-how-things-work.html), we know that much.\n\nAlan may have left town however; no reply to my voicemail.  Maybe next time.\n\nOther loose ends, for the Home Management committee:  the 1000 megabit service is to be throttled back to just 40, and they'll throw in TV.\n\nI'm also getting the local digital broadcasts in the public frequencies.\n\nThe main thing is to stay on fiber with its faster up as well as down speeds, for an affordable monrhly fee.  CenturyLink would actually charge me more to not get TV, same bandwidth!\n\n\"No\" said their office, I must pay the installation I thought was thrown in, but she agreed to shave off the bill for the few months.\n\nLumping [Car and House karma](http://mybizmo.blogspot.com/2015/09/car-karma.html) into one:  K&M had it fixed by this afternoon; indeed a new starter was needed.  Thanks to AAA for prompt towing.\n\nCity life can be pretty smooth, if you're able to pay for it.  Aye, there's the rub.\n\nA cornucopia of animations from ToonTown:  that's what Portland Knowledge Lab was forecasting, in an earlier chapter.\n\nI'd rented an office near Lucky Lab, but [moved out](http://controlroom.blogspot.com/2006/12/new-beginning.html) when Internet proved too slow.\n\nI'd been expecting Synergetics-infused blends \"[any day now](http://mybizmo.blogspot.com/2008/01/curriculum-notes.html)\" but that assumes art schools were priming the pump with lectures of the type I've not been slated to give ([yet](http://controlroom.blogspot.com/2015/10/art-history.html)), nor much of anyone apparently.\n\nSo that economy stalls.  Malesh.  Think where we could have been by now.\n\nOther parts of our economy keep barreling ahead.  Even the bare ToonTown image seems to stick.  That's because Portland does have relevant heritage.  I was building on an existing image.\n\nWe could be making more manga, not to mention anime.\n\nBut I'm thinking most especially of cartoons of a techie type i.e. in [this age of nano-tech](http://worldgame.blogspot.com/2015/09/opting-out.html) / ONAMI it's the area of STEM visualization (or STEAM) were we need most focus.\n\nJust talking heads are not enough.\n\nThe genre of biology videos, showing the happenings with DNA...  the problem being the bottleneck [identified by Pfizer](http://controlroom.blogspot.com/2012/02/munching-on-medical-data.html):  everyone is silo-ing IP (intellectual property) when it's the Open Way that's known to work (the liberal arts model, not penalizing sharing information but on the contrary making it easier).\n\nRoadblocks aside, we could be practicing with curriculum treating of topics that already are Open Source, such as file systems and how they work.\n\nLets see what I can find...\n\nYeah, I do like those \"sped up\" drawing whiteboards, with fun drawings.  I've watched [lots of those](https://youtu.be/zDZFcDGpL4U).  Too many talking heads, teacher's back turned, writing... Not how we want it on TV.\n\nI'd also like [more density](http://controlroom.blogspot.com/2006/02/boosting-bandwidth.html), with cutaways to talk about hardware, the history of storage ([per Von Neumann](https://en.wikipedia.org/wiki/Selectron_tube))... a much wider selection of topics, inter-connected.\n\nHow 'bout it? Better STEM TV anyone?\n\nLets build up the library, the videogrammatron, of short clips anyone might use.  High production values are maybe self defeating if locked entirely behind some IMAX screen.  Lets share the IP.\n\nPlus I'm talking about quirky art in addition, affordable and within range of solo artists.\n\nThe mix would be reminiscent of Sesame Street in some collections.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}