{
  "id": "8219183134067386623",
  "title": "Troop Rotation",
  "published": "2008-03-30T14:41:00.000-07:00",
  "updated": "2008-05-01T17:29:39.829-07:00",
  "content": "The endless conveyor belt between the burbs and Baghdad, taking enlisted both ways, leaves many Americans wondering when and/or how it will end.The substance of what gets conveyed is especially critical, in terms of livingry versus killingry, as Bucky would put it.  To the extent [living standards](http://controlroom.blogspot.com/2005/02/proposal-baghdad-grid-monitor.html) deteriorate, serving in a militia, however decaled and branded, becomes the only remaining option, the very definition of poverty in much of the world today.Given both sides in Iraq see an end to the foreign military occupation as a common goal, what divides them is more a push versus persuade strategy.  The more militant factions want to push, whereas the more established party prefers to believe that a deescalation of violence, already accomplished, will prompt a voluntary withdrawal in response to political pressures back home (not much sign of that happening, which bolsters the militants' view).On the civilian front, most of the action is behind the scenes, but with the cooperation of various supranationals, it's becoming easier to bid on reconstructive, post-war projects, not just in Iraq, but throughout the Middle East.  Whether the US Army Corps of Engineers gets a piece of the action, in [stabilizing that dam](http://www.voanews.com/english/archive/2007-11/2007-11-30-voa2.cfm?CFID=219681727) for example, remains unclear, at least to this analyst.Certainly there's nothing stopping a formerly enlisted engineer from returning to the scene in a civilian capacity, as has happened [in Vietnam](http://worldgame.blogspot.com/2008/04/biz-page.html) in the aftermath.  Civilian energy projects need trained personnel, this hasn't changed.  Whether the home office is in Belgium or Birmingham matters less than an understanding of the scene on the ground.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}