{
  "id": "7457810324772274820",
  "title": "Trucker Nation",
  "published": "2021-10-23T10:43:00.006-07:00",
  "updated": "2021-10-26T20:00:04.806-07:00",
  "content": "I bring several associations to the \"trucker nation\" meme, first and foremost the tendency to tack on \"nation\" while meaning \"space\".  Oregon has its Rogue Nation, a brewery, including farms and farming, as beer-making is an agricultural process.  We don't take \"nation\" literally in the sense of needing to approach the UN on bended knee seeking a seat at the table in NYC and/or Geneva.  There's no need to take it that far.\n\nOn top of that, in addition, there's this tendency to add \"planet\" before or after, as in \"Planet Python\". I could go on to add \"World\" as in Disney World (or DisneyWorld in CamelCase).  Trucker Planet would be a fine caption to a Spaceship Earth picture, as is Global University (already in full swing).\n\nThese \"nations\" tend to bind globally, and without regard for contiguous borders. The topology is more complex.  An airline dots the globe with airport gates and counters, facing outward from its native space: data centers, maintenance hangers, office space, the air between tarmacs.  \n\nAirlines have storefronts facing landlubber space, much as do shipping companies.  Many airlines no longer bother to maintain ground-level customer service offices for would-be passengers.  Brick and mortar is passe. \n\nMy point:  the glue that holds a brand and team together may be strong, without the benefit of some lengthy contiguous border to defend.  These \"diaspora nations\" are more networks of \"islands\".  One of the oldest forms of diaspora nation is a religious sect, with its temples, churches, mosques and synagogues, but also schools and communities.\n\nAt the moment, the movement of container shipping is stalled around the world because of the intermittence of supply chain services, along the shore, and moving inland.  The system was fragile to begin with and with sars2 (a mutant of sars1?) hitting it broadside.  That world shipping hasn't capsized (figuratively) all together bespeaks its resilience if we want to accentuate the positive.\n\nTrucker Nation represents a bloodstream level service, as vital, literally as well as figuratively, as the flow of nutrients through the bloodstream is where it's at.  Along arterials.  Along capillaries.\n\nOne of the chief complaints of drivers in the UK, perhaps among the most forthcoming with their grievances, and comprehensible to me, is a lorry will be sent down a country road that really has no business taking such traffic.  We do have a fleet of more intermediately sized vehicles, including designed for delivery.\n\nAnother chief complaint is drivers must abide by strict drive time rules, but when the time comes for a mandatory break, there's no pull-off, no parking, no truck services in the vicinity.  Routing software does not pay attention to random elements such as mandatory stop times.  Drivers will therefore stop early if necessary, because a destination has been reached, and then have to start up again at crazy times.\n\nThe pull-offs stink, are unmaintained, were not designed for drivers needing to relieve themselves.\n\nIn other words, Trucker Nation is both vital and oppressed and is in severe need of a redesign.  I've been forecasting more of a merger with university campus culture, merging a life of work-study, with that of hauling loads, at least intermittently in the course of one's career.  Outside of these blogs, I have more on Medium regarding the Trucker Exchange Program, which includes academic credit possibilities.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}