{
  "id": "371312683457104282",
  "title": "Truck Stop Based Futurism",
  "published": "2019-04-24T11:10:00.001-07:00",
  "updated": "2019-04-26T12:29:00.905-07:00",
  "content": "[ originally a social media conversation with architect John Driscoll ]\n\nInteresting how Cybernetics \n(like Synergetics) became more twilight zone after these authors (Alan Turing,  John von Neuman, Ross Ashby, Norbert Weiner, and Herbert Simon, Stephen Wolfram). \n\nLike \nwho champions this discipline today, or General Systems Theory for that \nmatter, ala Kenneth Boulding et al? \n\nDid computer science get sidetracked\n somehow, in failing to come together with architecture?  In addition to\n individual buildings, are the plans for camps, colonies, communities \n(bases, villages, forts) i.e. multi-structure agglomerations that might \nor might not be planned. \n\nIf planned, by what algorithms?  Fractal \ndimensions come in again.\n\nIn my science fiction \ndevelopment banking, truck stops play a big role, as hubs in a campus \nsystem, where citizen diplomats have opportunities for R&R, \nincluding for religious services and classes, eat, sleep, games, \nmulti-functional. \n\nWe have our standard image of what a truck stop looks\n like.A lot of people are expecting all that \ntrucking to become automated, however I see a rapidly growing freeway \nsystem from deep inside China to the Indian Ocean and Europe.  Africa\n is planning more freeways.  We need more tourism as a lifestyle, including by \nworking tours of duty, involving truck driving around the world. That would \nkill two [virtual] birds, as they say.  It's another way to \nsee the world, while working, which we could consciously shape and \ndesign versus ignore as beneath our calling.Why not\n have Cybernetics and General Systems Theory both come alive with global\n trucking and inter-modal transportation a central theme, unifying \nmaritime architecture with land-lubber architecture?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}