{
  "id": "2120982967756291826",
  "title": "Turning Back the Clock",
  "published": "2024-07-08T16:00:00.000-07:00",
  "updated": "2024-07-09T12:30:28.683-07:00",
  "content": "Per my intake interview, as I think of it, I mentioned my goal of \"turning back the clock\". I was referring to the so-called Doomsday Clock of the atomic scientists, the ones who tell us how \"close to midnight\" we might be (really close in their estimation). \"Midnight\" means WW4 (per Critical Path, I'm going with \"WW3\" as the cold one, still ongoing).\n\nRather than manufacture a ton of consensus around the clock turning back, let's say to a quarter 'til, I should offer my thesis as to why I'm right about where we're at, relatively far from WW4, based on something other than majority rule (oxymoron?) or majority perception.  \n\nIn other words, we're not on the brink of nuke war because both the Russian and American elites (and I'm not talking about average rich people, as clueless as they come) are at ease with where we appear to be going, in terms of World Game and energy sharing. The Chinese too. \n\nWe all read Operating Manual for Spaceship Earth in the 1970s. We didn't forget our thinking and plans when the helpless children, grownups in name only, took command of the various dashboards now disconnected from reality.\n\nNo, I'm not saying the elites enjoy a level of telepathy the muggles don't experience, or that our oracles at Delphi give us the insider view. I'm saying if you do your homework, you'll find that legacy media tend to waste people's time with low quality narratives designed for know-nothings. More glimmers of the truth shine through here and there.\n\nIn a world wherein the default is to get force fed a nasty diet of drivel and bad info, one can't then turn around and blame the hoi polloi for not being able to follow. Of course they can't. Let's hope at least a few find their way out of that cesspool.\n\nIf I sound like an elitist snob, that's by design. At least I'm not a mindless hawk like those morons in the US congress, or like those so-called \"justices\" (no longer respected), or like the dysfunctional executive branch. If I'm not a hawk, does that make me a dove? Why so little imagination? I'll be a crow instead.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}