{
  "id": "6448018177934247357",
  "title": "Two Meetings",
  "published": "2013-06-13T23:55:00.003-07:00",
  "updated": "2013-06-16T19:56:54.630-07:00",
  "content": "[](http://www.flickr.com/photos/kirbyurner/9040574952/)\n\nI'll try to tie these two meetings together.\n\nThe first was a presentation by Allen Taylor at Linus Pauling House about some of the things going on in the private sector around space exploration.\n\nPlanetary Resources, a new company interested in mining asteroids is raising money, [via Kickstart](http://www.kickstarter.com/projects/1458134548/arkyd-a-space-telescope-for-everyone-0), for the million dollars needed to add another mini-telescope satellite, this one to offer its services to the public.\n\nYou'll be able to get your picture flashed through the on-board camera, with the Earth or Moon as a backdrop, given the external LCD to which the photos will be uploading.  For $25 or so, you can get a wedding picture with a cosmic backdrop.\n\nThe second was a presentation by an Iranian-American from Tuscon, AZ who thinks relations between the respective people would improve were more people in the US aware of what a cool guy Mossadegh was.  He has his [Mossadegh Legacy Institute](http://mossadeghlegacyinstitute.org/) to help spread the word.  He's on tour thanks to this vision.\n\nThe Veteran for Peace introducing Moji was the same guy who gave a speech at [the Eagle Scout ceremony](http://worldgame.blogspot.com/2013/06/eagle-scout-ceremony.html) on Saturday.  This was at [Portland's Peace House](http://controlroom.blogspot.com/2013/02/report-from-afghanistan.html). \n\n[The Huntworks](http://mybizmo.blogspot.com/2005/10/rambling-on.html) live there, an older couple who raised their family in Iran and have Farsi-speaking children.\n\nMany Iranians have a fascination with space exploration and appreciate that, with a more cosmic perspective, there's a withering of fascination with nation-states.  Human beings and [their planetary saga](http://worldgame.blogspot.com/2010/01/more-geopolitics.html) becomes the focus.\n\nThe break-down into \"nation-hoods\" with many humans falling through the cracks as \"not documented\",  is breaking down.  We have leaders in each nation working to be responsible for a global context, even if their particular position in that context is ethnic-flavored.\n\nI agree with Moji's view that the Persian lineage has much to contribute to the ethics / aesthetics of \"modernity\" and ongoing \"modernization\".  What has hurt Persian civilization, set it back was the absorption of modernization within the context of colonialism.  China went through a similar chapter, as have others.\n\n\"Future shock\" has been real enough (Toffler was right to predict it) but is not a one way street.  As technology continues to morph our civilizations, unexpected synergetic effects of cultural inter-mixing will continue to make us all better off.\n\nSome see such \"multi-culturalism\" as a threat, as if the mixing of cultures were something new in this world.  That all depends.  So far, Portland is [integrating well](http://controlroom.blogspot.com/2009/08/iranian-festival.html) with Persian culture.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}