{
  "id": "532577593373252662",
  "title": "United Nations Under Fire",
  "published": "2017-12-20T09:54:00.002-08:00",
  "updated": "2017-12-21T19:28:47.043-08:00",
  "content": "A cabal is firing up its bots (paid stooges) to hate and fear the United Nations a lot more.  The main issue is of course Israel and the UN's attempt to figure out what's \"legal\" with regard to forced colonization and land seizures.\n\nThe US well knows that it would be nowhere near its present size were the UN around in the good old days.  Tribal nations would have asserted their rights and come to some settlement.\n\nIsrael's current plan (such as anyone has one) is to play by those older rules.  That's what makes the drama all so Biblical in the minds of many Christians, not to mention apocalyptic. Relive the wild west. One can almost hear the player piano.  Welcome to Westworld, where people and bots are really hard to distinguish.\n\nThe question as to whether nation-states must be taken seriously gets a variety of responses, depending on context.  Many of them are broke on paper and dependent on the largess of transnational enterprises for continued solvency.  Greece and the US are in the same boat on this one.\n\nGiven the rise of Trumpism in the US, more people are willing to admit that particular soap opera is over.  Planet Earth is a single ecosystem inhabited by reprogrammable humans.  \"How reprogrammable?\" is the core question, i.e. will our belief systems adapt to new circumstances?\n\nPsychometrics firms are busy discovering answers.  Social media have been added to the equation.  Theories swirl that Russian intelligence is powerful enough to tip elections, with firms such as Cambridge Analytica claiming similar powers.  How much of such claims is marketing hype and propaganda?\n\nTV has been the reprogramming device of choice for several decades and still is.  Radio too.  When it comes to shaping public opinion using psychological techniques, sophistication has improved with the evolution of broadcast advertising.  The Internet allows for more specific targeting and individualized data collection.\n\nThe word \"programming\" and verb \"to program\" have a unifying aspect when applied to both TV and computers.  We program both.  Humans are already trans-human in the sense of a \"cell-silicon interface\" i.e. our brains have already been augmented.  The synergetic effects have been amazing.\n\nWhere does the Jungian notion of a collective unconscious fit in?  I think in that idea we have something of an antidote to paranoia about any one specific cabal or conspiracy steering the show. A lot of content wells up within each individual.  In some sense, we're all wireless devices.\n\nAnother reason the UN is coming under fire has to do with the Treaty to Ban Nuclear Weapons, connected to the ICAN campaign, Nobel Peace Prize (2017) and so on.  DC and [Jerusalem](http://www.quakerquaker.org/profiles/blogs/jerusalem-world-capital) need to harden themselves for their Cowboys versus Indians role, wherein the cowboys are (a) outnumbered but (b) have nukes (or think they do).  Stay tuned.\n\nUltimately [the sun powers the planet](http://grunch.net/synergetics/gst3.html), in terms of energy.  Even fossil fuels trace back to ancient sunlight.  Agriculture is a solar energy business.  For any human institution to insert itself and take credit for all the wealth is of course absurd.  Our shared wealth has extra-human origins, which is not to make any claims regarding ETs.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}