{
  "id": "6054954323825342123",
  "title": "USB to Kill CubeSpace?",
  "published": "2009-05-22T15:46:00.000-07:00",
  "updated": "2009-05-22T18:08:10.562-07:00",
  "content": "Much as PPS is wanting [to discontinue LEP High](http://controlroom.blogspot.com/2009/03/pps-to-kill-lep-high.html), which put Portland on the map as a city where big dreams come true, so is US Bank wanting to destroy its own reputation for thinking outside the box, which it briefly had [when investing in Cubespace](http://mail.python.org/pipermail/portland/2009-May/000706.html), a place for Portland's [most computer savvy](http://groups.google.com/group/pdxjs/msg/aec5d207dba4cd91) to be productive.  No, this is not a joke.Rumors that PDC might take over the contract are probably wrong, but it's not too late to contact bank shareholders and suggest they start quizzing management on [the thinking here](http://groups.google.com/group/pdxjs/msg/e76fa51bd29f2637).  Does it originate in Portland or is Colorado calling the shots?  Given it's [a real estate issue](http://cubespacepdx.com/node/2012), we might even interest The Oregonian, as that's the only topic it seems to care about these days (local property values).I'm thinking Portland has an interesting ability to nip itself in the bud, economically speaking, probably comes from working with roses so much.  You won't get much out of City Hall when it comes to \"[shovel ready](http://worldgame.blogspot.com/2009/02/shovel-ready.html)\", as they're too busy whooping it up in [some daytime soap](http://controlroom.blogspot.com/2009/02/more-marketing.html), as if anyone really cared about that stuff beyond an outraged minority fed by a sensationalist media.In terms of geek hangouts, we have other options, use Twitter, Calagator, other tools to stay organized.  So it's not like the end of the world, [just another bank ](http://worldgame.blogspot.com/2004/10/more-on-education-reform.html)going down in flames in terms of reputation for foresight, happens every day.  Remember Ben Franklin?  I used to work there.  Now it's a government office building.[](http://www.flickr.com/photos/17157315@N00/494375784/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}