{
  "id": "230804972801359256",
  "title": "Vectors...",
  "published": "2014-09-26T18:23:00.001-07:00",
  "updated": "2014-09-28T12:27:11.062-07:00",
  "content": "I spent some of this morning reopening NARMIC files one might say, not that I actually made it [to Swarthmore](http://www.swarthmore.edu/library/peace/DG201-225/dg208NARMIC.htm) or anything.  This is [Opt Out season](https://www.flickr.com/photos/kirbyurner/15188645000/) in Portland and plus AFSC is always studying militarism in one form or another.\n\n\"Ain't gonna study war no more\" is maybe a fond hope on the part of that folk singer, but I don't see a way to follow suit at the moment, as steeped in war as the planetary humans still be (it's more about upgrading the quality i.e. making it [more virtual](http://mathforum.org/kb/message.jspa?messageID=9606801), that [AVP](http://worldgame.blogspot.com/2008/03/peace-teams.html) is about:  Alternatives to Violence, lots of blog posts already...).\n\nSo in that mode, it's unsurprising I found myself watching this Google Talk by Andrew Bacevich regarding hyper-militarism in the USA.  Shades of [Walter Kaufmann](http://worldgame.blogspot.com/2014/09/quoting-nietzsche.html) I'd say, in issuing these warnings, and of course [Chalmers Johnson](http://controlroom.blogspot.com/2009/08/some-analysis.html) would be in this choir.  Hey, I'm obviously appreciative.\n\nThen an unplanned nap hit me and the day went by.  That kind of time shifting happens when you're a world traveler and need to accommodate time zones, which sometimes one accommodates by ignoring, as in some cities the infrastructure is permanently active and in fairly high gear.  So just keep going in whatever time zone you're in and ignore the relative positions of planet and star.\n\nPortland is getting to be a lot more that way.\n\nBut then of course the Internet is always that way too, as it's always \"rush hour\" in some subnet or other.  Topology replaces geography at some level.\n\nOK, back to the lambda calculus (i.e. day job).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}