{
  "id": "3843926844571147913",
  "title": "Versioning Membership (Faith and Practice)",
  "published": "2013-09-23T10:21:00.001-07:00",
  "updated": "2013-09-23T12:18:11.663-07:00",
  "content": "Membership in a Meeting is ideally non-coercive, like a marriage, and is designed to form a public bond between an individual and a Quaker Meeting, such that the individual is publicly encouraged to say \"I am a member of such-and-such a Meeting\". \n\nThis declaration signals to the wider world that people calling themselves members of the Religious Society of Friends are [still among us](http://worldgame.blogspot.com/2009/09/catholic-analysis.html), at work in the world, and feel led to publicly identify as such.  To proclaim one's membership in the Religious Society is a way of establishing one's identity in terms of one's ethics and practices.\n\nOther Friends choose to advertise their affiliation with the Religious Society without obtaining or retaining formal membership in a particular Meeting.  If questioned about membership, such a Friend may say \"I attend such-and-such a Meeting\" and Quakers know that some of their attenders are \"weighty\" (influential) Friends, just as some of their members are.  Many Meetings treat members and attenders on an equal footing in regards to service on Committees, except for reasons the state may require in the corporation bylaws. \n\nThose opting out of formal membership may include:\n\n(a) those in transit, not ready to settle down and participate in the life of a specific Meeting\n\n(b) those who grew up in Quaker families and felt accepted into Quakerism without needing to go through a Clearness process (some of whom later transfer their membership i.e. their Meeting acknowledges \"birthright Friends\" and a Meeting that doesn't accepts the transfer),\n\n(c) on doctrinal grounds, that \"membership\" is \"club language\" whereas Friends of Jesus (John 15:15) can't be a \"membership club\" and\n\n(d) those who feel their beliefs and practices, while maybe consistent with Friends somewhere, would place too much strain on a nearby Meeting e.g. they're a gay couple near Meetings which still do not recognize gay marriage i.e. the application for membership would be too upsetting.\n\nAnother example: the Langley Meeting in Virginia went through a prolonged process after someone with the CIA asked for membership.  My recollection is the request was declined, and so the officer continued with attender status.  \"Why put them through all that in the first place?\" a (d) person might think, \"I can still be on Oversight.\"\n\nWhether or not a Friend has obtained membership in a Meeting by the recognized Clearness process, overseen by overseers (the members of the Oversight Committee), a Friend is always open to being tested and queried by others about Quaker testimony and ministry.\n\nFriends continually test one another, regarding integrity and clearness of purpose.  In joining with Friends, both members and attenders are signifying their openness to having their leadings investigated and sometimes challenged by peers.  Friends who keep journals on-line i.e. world-readable, are especially open, at least in principle, to peer review.\n\nGrounds for dismissal from membership include taking membership in another church with incompatible beliefs (e.g. it participates in warmongering), and breaking important rules, such as refusing to stop talking multiple times in the same Meeting for Worship nor accepting feedback (eldering) when such transgressions are pointed out.\n\nFriends may also freely lay down a membership in one Meeting and take it up in another, a process called transferring membership and described in other sections.  Sometimes Friends just drift off and are not heard from.  The Meeting has a process for contacting such individuals in writing and then proceeding with an amicable separation wherein both parties agree that a relationship with a particular Meeting is over for now, and there is no likely prospect of transfer.  To resign from membership does not preclude rejoining at a later date.\n\nHistorically, entire Meetings have disowned one another owing to various irreconcilable differences.  The many branches created through schism and divorce are sometimes diagrammed in a \"Quaker guts\" poster.\n\nQuakers disowned any slaveowners in their midst rather early in US history, following the lead of London and Philadelphia Yearly Meetings.  Their resulting unpopularity in the south led them to migrate westward across North America as a part of the general drift of migrants of European heritage.  Earlham College in Indiana was one of the schools founded by Quaker refugees in the aftermath of the Civil War.\n\nWestward migration was sometimes a way of escaping further persecution and establishing a fresh set of Meetings in the wake of a schism.  The North Pacific Yearly Meeting, for example, traces its history to a couple named Bean who fled Iowa Yearly Meeting, which had disowned them, to California, where they founded the College Park Association.  In retrospect, this branch of the Religious Society is recognized as important to Liberal Friends more generally.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}