{
  "id": "2361252858309215432",
  "title": "Villa Touma (movie review)",
  "published": "2015-06-16T10:50:00.001-07:00",
  "updated": "2015-06-16T11:30:30.972-07:00",
  "content": "Thanks to a heads up from Dr. Tag, I was able to bus over to 16th & NW Glisan to McMenamins Mission Street Theater & Pub just in time for this fundraiser for Palestinian Childrens Relief Fund (PCRF).\n\nThis showing of Villa Touma, a film by and about Palestinians, was an event designed to launch a  new PCRF local chapter.\n\nAn orphan girl, of an eligible age (almost 19) is taken in by her aunts, who live in the past and want to marry her off to someone judged to be of high social class.\n\nThe Palestinians I was watching this with found lots to laugh about, but questioned the realism of the premise.  \"No one is really like that, it's not true\" one of the audience members commented.\n\nBut then the film is a spoof, gently mocking those who try to live in the past.\n\nThat these sisters take themselves so seriously only adds to the comic element.\n\nWe get a window into a dollhouse inhabited by these sad clown ladies, a dog, and a caretaker.  The atmosphere is purposely claustrophobic, redolent of the dead ends these lives have become.\n\nBadia does bring some light and joy into this household, slowly lifting spirits, but her oppression is severe and she fails to meet the unrealistic expectations of her silly aunts.\n\nFrom my angle, the film was a lot better than the nasty and [shallow review](http://variety.com/2014/film/festivals/venice-film-review-villa-touma-1201295632/) by Jay Weissberg in Variety.\n\nAs a movie reviewer, Jay has perhaps proved his talent elsewhere, but his panning of this film is flat and unmodulated, deriving from a failure to recognize that he's dealing with a comedy of manners, not a compelling political analysis of anything.\n\nFaulting a film because one guessed wrong about the genre is more a reflection of viewer immaturity than anything to do with the film itself.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}