{
  "id": "8890020377981680381",
  "title": "Village Lore",
  "published": "2018-08-12T08:13:00.001-07:00",
  "updated": "2018-08-13T12:48:19.394-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/479677094/in/album-72157600265827036/)\n\nThe GST PWS (personal workspace) is typified by [researchers](https://www.youtube.com/channel/UCIQrZNGOPGakKKdJ1my6pvQ) comparing notes on telemedia, with Youtube providing the early sandbox for many, who then move on to more virtual environments. I've followed essentially this same path, uploading to Google early (Alphabet) and later giving my [Synergetics lectures](https://www.youtube.com/watch?v=vk-cpknOz9E&list=PLeBIlkJm4xglicSifacG4eewD9CQaWvU0).\n\nIn researcher mode, we go back to Greenwich Village.  My core question is whether [Bucky's term there](https://medium.com/@kirbyurner/bridging-the-chasm-new-england-transcendentalism-in-the-1900s-1dfa4c2950d0) had anything to do with Bohemians using \"square\" to insult other social classes. Philosophically, that would make sense, while journalistically it's somewhat too good to be true, which is why I'm compelled to play the skeptic.\n\nLets be clear that I'm not operating entirely outside the realm of possibility, as Fuller was a one of the \"village idiots\" (meant affectionately) along with \"Will and Ariel Durant, e.e. cummings, Theodore Dreiser, John Sloan, Burl\n Ives, Zero Mostel, Edgar Varese, Brancusi, Isamu Noguchi, Diego Rivera \nand hundreds of other shining lights of literature, art, theater and \nacademia\" (I'm quoting from a blurb on Amazon).  He and Isamu got along famously.  I would later visit the Best of Friends exhibit, set up to memorialize their relationship. We also visited [Kenneth Snelson](http://worldgame.blogspot.com/2006/10/our-big-new-york-adventure.html) on that trip.\n\nBut what about the Ginsberg crowd i.e. William Burroughs, Jack Kerouac, Patti Smith and like that? Neal Cassady definitely talked about \"squares\" but where had that started?\n\nRomany Marie, [the Queen](https://www.amazon.com/Romany-Marie-Queen-Greenwich-Village/dp/1884532748), established her centers, one might say prototypical of [Centers Network](https://controlroom.blogspot.com/2009/12/some-storytelling.html) (for which I volunteered, later in New York's history), which influenced my marketing around Coffee Shops Network (CSN).  How these centers served more than one generation of \"beatnik\" is the documentary focus of my research this morning.  I'm not making a podcast out of it, but others might. The radio audience is especially receptive to Village Lore given how much of the output was audio to begin with.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}