{
  "id": "5838321666866650269",
  "title": "Visiting Vancouver",
  "published": "2017-08-06T19:57:00.001-07:00",
  "updated": "2020-07-23T22:33:38.259-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157684852773550)\n\nVancouver, Washington is an important port and way station, a gateway to Oregon. People complain the I-5 draw-bridge is a choke point, however Oregon State Senator Lew Frederick says the studies he's seen point to replacing the rail bridge instead, re-routing trucks to their own deck.\n\nIn some simulations, this redesign would do much more to alleviate the problem than replacing the I-5 bridge, especially if people enjoy reading and social media enough to prefer taking mass transit, even high speed rail in some possible futures.\n\nSam Lanahan has view property overlooking the Willamette-Columbia confluence, though from a safe distance away, which explains the telescope. Freight traffic is fun to watch.  Glenn and I got to see the hexagonal flextegrity table, which Glenn had helped build in my garage, amidst other marvels, on our car trip there today.\n\nFor those of you into intellectual history, when [Alexander Graham Bell](http://worldgame.blogspot.com/2006/02/octet-truss.html) had the command of vast resources, post inventing the telephone, he plowed time and energy into what he called \"kites\", and which today we might call an \"isotropic vector matrix\" if into Fuller, or perhaps an \"octet-truss\" if aware of the patent literature.\n\nSam's matrix is no mere knock off of Bell's solution as the tension and compression forces get distributed by a different strategy.  However it helps to see it in the lineage of space frame solutions, in this particular family of lattice structures.\n\nIn the latest incarnation the basic \"brick\" is a soccer ball of hard plastic made of six base parts, hence the name C6XTY, all identical, with eight screw-in disks to secure each assembly.\n\nArmature members with their own smaller screws then fix these spherical components in place, creating the Bell-like lattice with the ball centers in CCP or FCC positions, for those of you schooled [in crystallography](http://worldgame.blogspot.com/2017/02/class-notes.html), or willing to watch a few Youtubes.\n\nStanding in the courtyard at his house, Sam had a prime example of the kind of sculpture one might create from C6XTY, given the liberty to explore the IVM \"in vitro\" so to speak, as an organic pattern.\n\nHe's working on and/or commissioning several more examples for an upcoming photo shoot.  My backyard is one of the construction sites.  We returned with a portable gazeebo on the roof of my car. I excavated and removed the brick fire pit to make room for the new work area.\n\nI need to study Quantum Mind again tonight, a book by Arnold Mindell.  You'll find Jungian psychology a recurring theme in these blogs.  I'm thinking Bell, Bucky, Lanahan and others were attuned to resonant frequencies in a collective unconsciousness that surfaces in their cases.  Something deep within us wants to get it out there.  The zeitgeist is making waves.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}