{
  "id": "1347821189105046684",
  "title": "Volume Formulas",
  "published": "2018-10-27T12:15:00.000-07:00",
  "updated": "2018-11-14T13:06:12.523-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/41211295565/in/album-72157624750749042/)\n\nAs a young adult, I was adamant that I wanted a Web to publish within, meaning I was salivating for hypertext, just at the time of its advent.  I was a fan of the Web before it popped up at CERN, my Higgs.\n\nSo once HTTP was in vogue, I published to that \"medium\" (i.e. to cyberspace).  However, my peers in academia were schooled to channel their thinking to subscriber audiences through specific journals.  These were not using hypertext for the most part.  I felt my thinking required hypertext.\n\nFast forward, and a lot of interesting mathematical results are rattling around in a volatile medium.  I say \"volatile\" because Forum 206, where I published over a decade of writing, was taken over by the NCTM, which appears to have killed the entire Math Forum website  [Followup: [it was kept](http://mathforum.org/kb/forum.jspa?forumID=206)].  The Web is more of a war zone in some ways. \n\nFor example, there's a lineage through [Piero della Francesca](https://mathpages.com/home/kmath424/kmath424.htm) to volume formulas for a Tetrahedron given only its six edges.  Euler came up with something like that too.  On Synergetics-L, a listserv that's gone belly-up, Gerald de Jong came up with something simple we could implement in code (see below). A lot of [my tetravolume computations](https://github.com/4dsolutions/Python5/blob/master/Computing%20Volumes.ipynb) come from there.  Just today I was doing these:\n\n[](https://www.flickr.com/photos/kirbyurner/45586281061/in/dateposted-public/)\n\nKoski is on the other end of the line doing some work around the S-factor.  He fed me another test to try, which came out as expected.\n\n[](https://www.flickr.com/photos/kirbyurner/44695079795/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}