{
  "id": "4529154432184366211",
  "title": "Walking a Plank",
  "published": "2024-10-21T10:48:00.000-07:00",
  "updated": "2024-10-21T11:01:35.091-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEirh5_l1dXmXR3WpLZTDDE5TYXFZvwJU_To4UFdKs39XGQ3zqiAolKqtgy1DWJKg774xZmcJZSTnallkwvo6VrNPTWlJcEMGKFQx7c735qR2vTMbSUBAVyHk5AZElW9iXDJY4YwyzNc_3RMcy-zPb-UsJ0DSpYQtAZSLkHpYyLSNNWOwZbOzQ-r/s826/Screen%20Shot%202024-10-20%20at%206.20.24%20AM.png)One of [our party planks](https://controlroom.blogspot.com/2020/08/pirate-party-planks.html) is to not see Russia or China as adversaries in military terms but as competitors in how well they treat their civilians. \n\nWhen civilians have high living standards you get a military that's idealistic and not just in it for the job. The poorer the health of your middle class, the less the military seems to have standards (or honor). The privilege to not be in the military is what creates esprit de corps for those choosing this lineage of decorated service and rank.\n\nSo Nixon and Khrushchev were essentially agreeing to move their adversarial relationship to a different register: how well did their respective societies meet the needs of motherhood? A primal question. The so-called Kitchen Debate was a welcome reprieve from the way more juvenile comparing of military dick size. \n\nWho had the better recipes and, as important, the appliances and ingredients to pull them off? \"What's the price of saffron in your commie supermarkets?\" the Nixonites could ask, sassily, suggesting that Americans had better prices on saffron.\n\nSo we of the Pirate Party might congratulate both Khrushchev and Nixon for \"walking the plank\" (hah hah) when it comes to being smart about relations with both Russians and Chinese. Who woulda thought, way back then, that we'd have devolved to the sloping forehead neocon pre-human stage?  Of course that's propaganda. Pirates jeer and sneer a lot.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}