{
  "id": "1530173925740159324",
  "title": "Wanderers 2015.5.19",
  "published": "2015-05-19T23:18:00.000-07:00",
  "updated": "2015-05-20T15:35:50.611-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/17882353512)\n\nTonight was my turn to give a Wanderers presentation.  I decided to spice it up by saying I was acting a part, not really being my ordinary self.\n\nI wore [shiny shoes](http://mybizmo.blogspot.com/2015/04/back-at-work.html) and my Quaker hat (a Stetson).  I was the \"Quaker futurist\", like a gig, or act.\n\nTrevor (depicted below), being the Egoist presenter recently, was an inspiration.  \"If someone says I'm egotistical, I correct them, saying it's really egoistical that I'm being\" (bada boom -- one of my jokes).\n\n[Shades of Portland Center Stage](http://worldgame.blogspot.com/2008/11/ieee-presentation.html)... \n\nAnyway, I was a bit gruff and abrupt, and people warmed to that as I'd warned 'em.  I practiced by telling Don to \"shut up\" a couple times, like I thought I was [Bill O'Reilly](https://youtu.be/9J2Ds6zjKtM).\n\nThe idea was my Martian-tinged cult had some future in the pipeline and here was [a Saturday Academy class](http://www.4dsolutions.net/satacad/martianmath/toc.html), already delivered, that had already passed the torch.  The future just passed you by, did you even notice?\n\n1, 12, 42, 92... I kept harping on that, like a mantra.\n\nI was touting the standard [Garden of Eden in a Climatron](http://worldgame.blogspot.com/2015/04/garden-of-eden.html) stuff, a kind of utopianism associated with Whole Earth Catalog if anyone remembers those.  The Bucky stuff, I call it.\n\nStewart Brand had a hand in this stuff, and so did J. Baldwin.  Stewart pushed to get pictures of the whole Earth, as in \"from-space photography\" into the public domain.\n\nShots from space (ET PoVs) were entirely new in those early days of the first orbiting satellites, ala Sputnik et al.\n\nI started my hour-long presentation with two misanthropic cartoons, pulled from my Facebook profile, then flipped through slides from the Martian Math class.\n\nThe Martian Math stuff was portrayed as 10-20 years ahead of the pack.  I was purposely somewhat Cabalistic or cliquish one might say, in implying Silicon Forest was moving ZomeTool, as implied by a picture from our [field trip to ONAMI](http://worldgame.blogspot.com/2009/11/onami-tour.html), as a part of some cultic process.  We talked about Grunch a lot (Fuller's coin), and [Ed Applewhite's](http://grunch.net/archives/171) Cosmic Fishing.\n\nBut I digress.\n\nPeople were quite engaged and full of insights and questions, as I'd hoped.  We talked about dedicated freeways with self-driving trucks -- but don't we have those already?  They're called trains and only one of the cars, called the engine, needs to drive (the trucks would need some kind of supervision too).\n\nAlthough I was walking them through some slides, the idea was to inspire conversation.  We were there to think about Futurism as a discipline, and about how Science Fiction works, as [distopian-to-utopian](http://worldgame.blogspot.com/2008/07/interest-group.html).  I mentioned the Paul Allen museum on the subject, in nearby Seattle.\n\nThe ratio of science to fiction matters.  That's on one of the slides.\n\nAnd also:  is it about humans expanding elsewhere, or being expanded upon, as in invaded?  A little of both maybe?  I talked about \"angels and devils\" as the old days ETs.\n\nRegrets poured in from some of the people Don had invited (that's his role) but who couldn't make it and maybe wanted to be polite and all, but as you can see from the picture (above), it's a small room.\n\nThanks for thinking of me, and lets get together soon!  Life is short.\n\n[](https://www.flickr.com/photos/kirbyurner/17160510029)\n\nTrevor in character at Mother Foucault's",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}