{
  "id": "8928241874881086314",
  "title": "Wanderers 2010.3.16",
  "published": "2010-03-16T18:54:00.001-07:00",
  "updated": "2010-03-17T21:33:36.879-07:00",
  "content": "This is a meeting regarding the Parliament of World Religions, take two in some ways (I missed the first take).  We're here to learn about the most recent convergence, which took place in Melbourne (Australia) recently.I plan to tell a couple stories about my experiences at [said parliament in 1999](http://www.flickr.com/photos/17157315@N00/4439344723/), in Cape Town, when we go around the table.  I attended with [my late wife Dawn](http://controlroom.blogspot.com/2009/03/celebrating-wicca.html), my daughters, my parents.We were a Quaker family, with mom & dad based in Maseru, Lesotho.  Dawn flew solo to Durban for a workshop with the Dalai Lama.[We stayed with Nosizwe Madlala-Routledge](http://controlroom.blogspot.com/2006/12/coffee-shop-talk.html) and family while in Cape Town.  She was Deputy Minister of Defense for the RSA at the time, and a Quaker -- not necessarily an inconsistent role.Later, we got to meet with Tenzin Gyatso, [DL XIV](http://worldgame.blogspot.com/2007/07/10-questions-for-dalai-lama-movie.html) in a Cape Town government building (a parliament building).  I use a familiar name because, as Quakers, we're sometimes avoiding of titles.  Noziswe asked us how she should introduce this great man and we suggested including his familiar name as a part of the introduction.He looked slightly askance when he heard her intro, but took it in stride.  Weird stuff happens when you're the DL, goes with the job description.  In the meeting, he expressed the fond hope, based on analysis, that future wars would become increasingly regional, not turn global so easily.In his keynote to the assembled Parliament of World Religions, his message was to \"be skeptical\", not just buy in to whatever beliefs.  Some might consider that ironical, given the source, but Tantric Buddhism is actually quite experiential, experimental and empirical, so I wasn't that surprised.The first Parliament, in 1893, was a huge breakthrough by many measures.  This was the first time that leaders in certain faith groups had shared a podium and spoken to the same audience. Approximately 10% of the presenters were women, which for that time was a benchmark.It took almost 95 years for a next Parliament to reconvene. Swami Vivakananda made a big difference in this regard.  Parliament basically means \"a safe place to come to talk about important things\" i.e. this isn't a legislative body.  The space is open to the participation of people from all walks of life, provided they're not there to convert and/or prostelytize -- except in your own booth.  The next Parliament took place in 1993, again in Chicago.[Helen](http://mybizmo.blogspot.com/2009/02/wanderers-2009211.html), our presenter, has been on the board of the Parliament since 1990.The Parliament in Cape Town had a lot to do with the contributions of the various religions in ending apartheid.  We had something real to celebrate.  South Africa has been an example to us all.  I'm reminded now of [Bishop Desmond Tutu's appearance at the University of Portland](http://worldgame.blogspot.com/2009/05/time-for-reconciliation.html) and his clearly expressed affinity for the Dalai Lama.The Parliament in Barcelona in 2004 had a lot to do with terrorism, the events of 911, of March 11 in Madrid.  Ending religiously motivated violence, the debt of most impoverished nations (such as Haiti, the USA), assuring access to sanitary water supplies, were among the chief concerns.Australia's changes in immigration policy, with more commitment to diversity, were something to celebrate in 2010.  I asked about [the Doctrine of Discovery](http://controlroom.blogspot.com/2010/02/notes-from-lunch.html), whether that came up (I know it did).  Like Glenn Stockton, I'm focused on [the representation of indigenous peoples](http://mybizmo.blogspot.com/2008/07/some-quaker-pr.html) at the Parliament.  Aboriginal peoples, who have been treated genocidaly, were a focus of this 2010 event.The Doctrine of Christian Discovery (manifest destiny) has been cited by the US Supreme Court as recently as 1995 (some case from upstate New York).  The slave trade depended on this kind of thinking as well.  Australia has had the common decency to forswear appealing to such lame and obsolete principles in future.  The decrepit USA, backward and impoverished, has been unable to keep pace.The Parliament is not about converging all the religions into one, nor about judging what is and what is not a religion.  Consensus is not a goal.  Finding common ground, looking for ways to work together, is a goal.Our presenters were Helen Spector, Don Benson, [Milt Markewitz](http://controlroom.blogspot.com/2010/02/wanderers-201022.html) and Lynne Taylor, all of whom attended the Parliament in Melbourne.  Some of the pictures were spectacular.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}