{
  "id": "7661335360112179106",
  "title": "Wanderers 2015.8.25",
  "published": "2015-08-25T20:09:00.001-07:00",
  "updated": "2015-10-18T11:46:03.700-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/20699615578/in/dateposted-public/)\n\n:: still slow but getting faster ::\n\nI got here late. Ecology talk.\n\nHow does all that decaying salmon nitrogen feed the forest floor?  Mycelium, mushrooms, provide nutrition-moving infrastructure, like capillaries.  The Pacific Northwest forests owe a lot to dead salmon, or lets just say the salmon cycle in general.\n\nThe salmon used to pile up high in the spawning grounds, given how many got through.  That was before all the logging and dams.\n\nCenturyLink sent an engineer to affix a fiber box to my house and run a wire into the basement, up into the Buddha Room.  I had to move Lindsey's altar.  Then I dug into the garage to fish out an old fairly tiny desk for the Mac workstation, an [Open Bastion asset](http://worldgame.blogspot.com/2011/02/open-secrets.html).\n\nWith a direct Ethernet cable, I'm seeing around 450 MBps to an OS X workstation, which is awesome.  My Wifi is still 802.11n (not 802.11ac) and I'm apparently not exploiting the 5 Ghz bands this mid-2011 Mac Air supposedly capable of using, netting up to 300 MBps.\n\nThe CenturyLink modem comes with WiFi but not at rated to such high speeds.  Having a large number of devices, as in a classroom, would be the model.  I'm still well under 100 MBps both up and down over Wifi, still way faster than with DSL.\n\nThis talk reminds me of Jim Buxton's talk on the [Nehalem River watershed](http://worldgame.blogspot.com/2004/12/nehalem-watershed-wanderers-meeting.html), some years back.  That talk was all about salmon too.  N8v casinos have been paying for culvert upgrades that will help with the salmon cycle.  I'm no expert.\n\nWith an accessory purchased at Apple Store today, the Thunderbolt plug (also used for external monitor) becomes an Ethernet port.  I expect higher bursts to / from the Mac Air by that means as well.  This is a trial, a free month demo, a way for CenturyLink to get the box to the customer before fixing a final rate.\n\nMy thought is to drop to a slower but still fiber optic speed, keeping the modem in service, with the ability to crank back up again should devices warrant it.\n\n[The Countdown to Zero campaign](http://controlroom.blogspot.com/2010/12/countdown-to-zero-game.html) (as I call it) is in high gear these days.  Citizen diplomats are concerned that legislators in DC no longer have our best interests at heart (did they ever?).\n\nThe UN nations do not want to subject themselves to the continued oppression of a few Dr. Strangelove disciples who cling to their balance of terror dynamics and puppet their politicians accordingly.  Of course harboring nuke weapons with an intent to use them is a serious crime against humanity, who doesn't see that?\n\nApparently the hypocrisy of having nuke WMDs for oneself, while dictating that all others should kneel in obedience, is just common sense to those intending to engage in nuclear blackmail.  Those who would use nukes to threaten others cannot be considered other than terrorists.\n\nYet you'll hear such threats as a subtext in many a speech and / or off-the-cuff remark.  People have their ways of divulging their own psychopathologies, resulting in demotion more often than promotion (statistics work in our favor).\n\nOur networking around the playground bullies proceeds at a furious apace.  We outnumber them and have agility on our side.  The nuke-heads tend to think more slowly, given they're weighed down by cognitive dissonance and psychological repression, not to mention a lack of self reflection. Getting an edge in the business world is not that difficult, when the competition is so lacking in integrity.\n\nObviously my train of thought has strayed from the coal trains now under discussion.  I should do some shopping maybe?  Here's a call coming in, from [Deke the Geek](http://worldgame.blogspot.com/2015/10/starbucks-asylum-district.html).\n\n[](https://www.flickr.com/photos/kirbyurner/20704120789/in/dateposted-public/)\n\n:: speeding up ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}