{
  "id": "7155634646536797031",
  "title": "Wanderers 2006.11.28",
  "published": "2006-11-29T11:15:00.000-08:00",
  "updated": "2006-11-29T11:27:29.971-08:00",
  "content": "[](http://photos1.blogger.com/x/blogger2/8007/1273/1600/246996/sunanda.jpg)Terry Bristol (foreground) feedingvideo signal of Micheal Sunanda (background)to Doug Strain (on screen)Micheal Sunanda regaled us with stories about spirals, their omnipresence, their vortexial and toroidal properties, with a special focus on the Earth's magnetic field.Other Wanderers chimed in, both supportively and with skeptical wise cracks.  Micheal was very engaged, the opposite of a shrinking violet.  He's a credit to his hippie ethnicity.Doug Strain, [metrologist](http://www.answers.com/metrologist&r=67), joining us by closed circuit TV, reminded us that words in a vacuum are difficult to control, meaning-wise, which is why sharing measurements and observations is so important -- we need shared access to lots of raw global data to find common ground, even before we pinpoint any areas of real disagreement.But it wasn't as if Micheal was avoiding all data, plus he's right that lots of relevant empirical info is shrouded in secrecy, locked away from public view (motivations vary as to why), so \"establishment scientists\" don't always appear to be playing with a full deck either.The game is to get some dots (data points) out there, then edge-connect them into some credible model, the more omnitriangulated the better.  The result is always full of holes (dots + holes = connections + 2).  That's just in the nature of thinking.  We improve our models over time, provided we're still open to feedback.Science should be in a relationship of friendly banter with its own fringe, participating in the give and take, not hunkering down defensively in humorless silence.  Micheal's emotive polemics, his wild theories about the Earth actively synthesizing matter from energy, physically growing as a result, deserve continual reality checking. Science is an ongoing enterprise, not a completed body of work.It's these feedback loops that we need, intelligent cybernetics, not one side or another proclaiming eternal victory, picking up its marbles and going home, outwardly prideful, aloof, disengaged, snooty to the max.The best way to showcase mature theories is to compare and contrast them with competing alternatives.  Simply dismissing the competition out of hand with a haughty sniff robs onlookers of educational opportunities.  Micheal wants to be grappled with.  Wanderers provide a good venue for him.We had a great turnout, including dear Nancy, to whom I waved from my darkened alcove off to the side of our packed meeting room. Then she vanished into the night as stealthily as she'd arrived.I got home late, after hobnobbing with principals, stopping by Glenn's new apartment, closer to his work.  I donned my wireless headphones, so as not to disturb sleeping family members, and caught up with Couric and her CBS team (example story:  [the dying Dead Sea](http://www.cbsnews.com/stories/2006/11/28/eveningnews/main2213458.shtml)).[](http://photos1.blogger.com/x/blogger2/8007/1273/1600/295193/sunandaposter.jpg)poster about spirals in nature",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}