{
  "id": "2866146650927907397",
  "title": "Wanderers 2013.4.17",
  "published": "2013-04-17T18:45:00.000-07:00",
  "updated": "2013-04-17T19:06:48.023-07:00",
  "content": "Today's discussion veered into Intellectual Property.  I think Fuller's universal scholarship, paid for by the benefits accrued to us all by the leading innovators, has been sidelined by a gambling system that walls out most would-be participants.  Safe to say, I'm not a big fan of the current IP regimen and don't really care what the Supreme Court has to say on the matter.  Washington DC is a corrupt little town (OK, major city) that hasn't earned the right to dictate to anyone, about anything.  Actually, it has subsystems with integrity and that complicates matters.  I'm a fan of some offices.  But IP law is BS.  I have no problem with the fact that it's crumbling.\n\nWe also talked about the impending fluoridation of Portland's water supply.  This is one of the few municipalities not to add fluoride yet.  I'm against doing it, as the environmental impact of higher fluoride levels on salmon runs, such as this impact has been studied (not much), suggests that it's both significant and negative.  I'm tired of humans whining about their teeth, claiming they're too lazy to brush with fluoride and need their dose to be administered through the public water supply.   What lazy good-for-nothing jerks, to risk salmon runs out of inertia.  That sounds exactly like humans though, oblivious to the welfare of any but themselves, ugly stupid ape-like numbskulls that they be.\n\nI didn't have the luxury in wallowing in my misanthropy though.  I was glued to my computer, actually plowing through my case load, or \"slaying the queue\" as I put it.  Lorri calls me a slayer (blush), which makes me feel buff, whereas I'm anything but, and with two pizza slices for lunch (no breakfast) the situation is unlikely to improve -- and a beer, [C-Note by Lompoq Brewery](http://beeradvocate.com/beer/profile/2641/12153).  We ate after Wanderers at Oasis, right across from the Bagdad, scene of many event in this blog, from [OMSI science pubs](http://worldgame.blogspot.com/2011/10/science-pub.html) to movies.\n\nThen I went to Fresh Pot next to Powell's on Hawthorne and slew the queue for many more hours.  By late afternoon, I was ready to take a crowbar to my ceiling again, in [the Buddha Room](http://worldgame.blogspot.com/2013/02/reconstruction-phase-2.html), and pull down more dry wall.  I'm trying to get that room back in shape as my office / studio.  Then I went upstairs and slaved away in Tara's room, turned upside down (figuratively) by my other daughter's crashing there for several weeks, with two pets no less.  That was a fairly smooth interlude actually.  She got launched in a new job, serving in one of these far flung answering services that lets people work from home, kind of like [CareWheels](http://worldgame.blogspot.com/2005/07/wanderers-meeting-200575.html) was going to be, had that been allowed to take off (Canada said no, I thought stupidly).\n\nI've been reading Wittgenstein's Poker, which so far is good on chronicling the deterioration of the Ludwig-Bertrand friendship.  Bertie did a lot to give Wittgenstein a leg up, but the latter grew disillusioned with \"logic\" as it was then conceived and pioneered in new directions.  In retrospect, I'm glad the protege outgrew the master, yet I'm quick to acknowledge Bertie's positive impact on me as a boy.  His books, in the parents' collection, helped galvanize my interest in that subject (philosophy).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}