{
  "id": "2006826247488608691",
  "title": "Wanderers 2014.11.4",
  "published": "2014-11-04T19:09:00.003-08:00",
  "updated": "2017-03-16T22:39:02.474-07:00",
  "content": "David Chandler was our speaker tonight.  He's made a name for himself in 911 circles by proving, fairly persuasively, that WTC-7 fell \"at the speed of gravity\" meaning \"controlled\" demolitions were happening, in addition to crashing airplanes (no airplane hit \"WTF-7\"). \n\nNIST in its [final report](http://www.nist.gov/manuscript-publication-search.cfm?pub_id=861610) agrees WTC-7 was in free fall for over two seconds.  The North and South Towers had their own pathologies.\n\nThe Twin Towers were certainly alluring as a symbol of cogitation, including to me, in nearby Jersey City for some years, a high school math teacher.  I was taken up with the plight of Tibet and seeing office towers as a place for \"[virtual nations](http://mybizmo.blogspot.com/2011/01/states-in-flux.html)\", like corporations, to base themselves.\n\nMy fantasies tended toward offices of the Dalai and Panchen Lamas in respective towers, maybe goofy but I thought poetic, given the imposing nature of the towers.  This was before the family relocated its HQS to Bhutan.\n\nWere one to dig up my crudely hand-drawn comic books of the day, the Twin Towers in silhouette would show up on various pages, and one might imagine I had nefarious designs.  The designs were benign however.\n\nI'd ride the PATH train from Jersey City to WTC quite often, Manhattan's Penn Station even more often.  I had other designs as well, our family (dad in particular) having \"planning\" on its resume:  for a high definition Dymaxion Map billboard on the back of Loew's Theater (near my house); a rail spur to Newark Airport (like Portland's MAX to PDX); an [IMAX in The Stanley](http://controlroom.blogspot.com/2009/05/flash-back.html).\n\n[](https://www.flickr.com/photos/kirbyurner/33043125322/)\n\n:: big dreams for JCNJ ::\n\nWhen 911 actually happened, Dawn and I, in Portland, Oregon, were expecting a wedding anniversary, which it was, but not one of the normal kind obviously.\n\nAs a matter of logic, one cannot conclude from evidence of an intentional demolition that hitting the button on the buildings was long planned for that day, even if there was such a button.  How many more would be saved versus burned alive?  So many were leaping to their deaths, would that be going on for several days then?\n\nWould helicopters and long ladders have made it all better?  Viewers would have felt moody and blue watching all that dying day after day, not that they weren't moody and blue already. \n\nThe \"mercy killing\" theory is the antithesis of the \"part of the same assault\" theory.\n\nIn between is the \"needed to do it there and then for insurance reasons\" theory.  Only the \"coordinated assault\" scenario really requires pre-planning.  Other scenarios require quick judgement calls one may question in hindsight... and [a button](http://mybizmo.blogspot.com/2014/11/out-of-clear-blue-sky-movie-review.html).\n\nDepending on the theory, different groups get to push the button.  Bin Laden pushed it?  Yeah right. Not enough is made of Bin Laden being the [construction company](http://newyork.cbslocal.com/2013/04/16/bin-laden-construction-company-spared-from-911-lawsuits/).\n\nThe idea a building of [that size](https://www.metabunk.org/threads/thermite-has-historically-been-used-for-demolition-at-least-twice.2856/) would need to come down someday, so would be pre-wired for [self destruction](http://makezine.com/projects/make-39/hans-goldschmidt-and-the-invention-of-thermite/) -- seems like a good idea at least.  Nothing lasts forever.  I'm not sure you'd need to sneak around adding [explosives](http://digwithin.net/2013/12/08/thermite/) later.  [Paul Laffoley's](http://worldgame.blogspot.com/2010/10/reminiscing.html) story suggests otherwise.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}