{
  "id": "8710131274352362390",
  "title": "Wanderers 2016.11.23",
  "published": "2016-11-23T19:25:00.002-08:00",
  "updated": "2020-07-21T08:42:22.813-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/31168770706)\n\n:: working through JavaScript challenges \nusing a Nodeschool Workshopper script ::\n\nNaming this group Wanderers owes much to a saying of Mandelbrot's, the fractal guy (I met him, gave an opening talk before an elite audience at PSU, before he came on as the main event).\n\nHere's that quote we use for a tagline:\n\n\"Science would be ruined if it were to withdraw entirely into narrowly\ndefined specialties. The rare scholars who are Wanderers-by-choice are\nessential to the intellectual welfare of the settled disciplines.\"\n\n(Benoit Mandelbrot)\nI'd say we're also name that because our conversation follows a pattern I first noticed from the backseat for a car of the floor of a living room:  none to speak of.  Or rather, themes may develop and cycled round to, but a lot of what goes on around a dinner table, say, is \"rambling\".\n\nI rambled in late, having overslept.  Several topics had already been broached, obviously.  While I was there the conversation turned to airport security dogs, species of rat used to sniff out land mines, bomb and drug sniffing.\n\nWhat occurred to me later is how we'd ventured into a mainline theme around Thanksgiving in the US, a national holiday associated with traveling.  Chinese have those too.  The trains, not just the planes or the buses, feel the added weight and responsibility, given so many travelers.\n\nI'm fine with the hypothesis that group dynamics exhibit replicable phenomena. [Nick Consoletti](http://worldgame.blogspot.com/2012/05/twenty-one-guns.html) did his doctoral dissertation on \"Bohmian dialog\" and had hoped to attend a class led by Dr. Bohm himself at Schumacher College in England.  Nick did his thesis work in Eugene, starting a Bohmian dialog group himself and making recordings (with permission of the participants).\n\nBohm's theory was conversational fields could be established that wandered within constraints and actually produced useful results when no individual nor even faction could for long control the flow.  Think of a focus group without a focus.  That's what Wanderers sometimes achieves.\n\nWhat I also hadn't realized, at least consciously, as Barbara had brought the dog she cares for sometimes, to the Linus Pauling House (our venue).  Our conversation centered on responsibly employed non-humans who serve us loyally, without our non-human guest saying a word.\n\nMuch of the rest of the day was code school business, talking with one about an offer, advising another taking a JavaScript-only (mostly) tack.  One needs to say \"mostly\" as all these languages negotiate within an ecosystem of other languages.\n\nThanks to Nathaniel Bobbitt I was able to learn about Nodeschools and their [Workshopper technology](https://nodeschool.io/index.html#workshopper-list).  I'm plowing through some of those.  Note how they've been done in many human languages. [ i18n](http://worldgame.blogspot.com/2014/07/i18n.html) is one of my themes.\n\nCBS News tonight was very much about the nation's transportation arteries, especially around WDC, site of many a monument, including the one to Lincoln, the last story's focus.  I'm likely to join the throng, hoping for a lull on Black Friday, when a family branch has strategically staged their Thanksgiving dinner meetup.  I've already made some pies, and dented one of them.\n\nI'm running the Node modules, downloading through NPM, on my Raspberry Pi 3 in the basement.  I used to visit the basement to use the R-Pi 3, but now I just VPN into it, and use the UI in a window from anywhere in the school (a home school hybrid, as allowed by law). \n\n[](https://www.flickr.com/photos/kirbyurner/30836580880/in/dateposted-public/)\n\n:: R-Pi from Mac Air over school LAN ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}