{
  "id": "8977858249536634174",
  "title": "Wanderers Retreat (spring equinox)",
  "published": "2011-03-19T20:08:00.000-07:00",
  "updated": "2015-11-29T10:01:23.969-08:00",
  "content": "Yet again I missed an opportunity to see the next movie after The Cup by that [cool Bhutanese director](http://www.imdb.com/name/nm0634897/). I'm not despairing though, and used the time wisely to continue my visit with [Rick and Cody](http://mybizmo.blogspot.com/2011/03/spd-sponsored.html), whom I hardly ever get to meet. \n\nTheir visit over [St. Patrick's Day](http://worldgame.blogspot.com/2010/03/remembering-dawn-wicca.html) (\"we're back\") was well timed and appreciated. I'm glad they got to meet Alex. \n\nI spent a lot of the day [with David Feinstein](http://controlroom.blogspot.com/2005/04/judging-science.html), a rare privilege. He vectored one of his inner circle through Pauling House, a protege working in Tri-Cities, and chalking up another in the XX column, Trish having invited her friend from yesterday, and Jessica bringing her girl. \n\nMostly we who show up tend to XYs, with me sometimes offering up some archetypal [Athena talk](http://controlroom.blogspot.com/2015/11/athenas-sail-makers.html) ([feminist?](http://mybizmo.blogspot.com/2006/01/wanderering-in-pdx.html)) in somewhat [the Francis Bacon tradition](http://controlroom.blogspot.com/2010/10/new-atlantis-movie-review.html) (via [Nashville](http://worldgame.blogspot.com/2006/07/movie-sunday.html)).\n\nTara has invited Reed over to see a movie. LW, free schooler, is practicing with R2. Having \"qualed for nats\" Tara is looking toward Dallas, then some other American states, including south of \"the border\" (bell sound), Friends a factor.\n\nTrisha wanted me to explain \"Quaker\" and I did an account based in the 1600s, which is around when the East India Company began. I should have talked [about branches](http://worldgame.blogspot.com/2004/11/quaker-politics_110167340290091180.html) in GIT, sometimes mergings, ala [this O'Reilly book](http://oreilly.com/catalog/9780596520137) I've been reading.\n\nYes, these are somewhat random notes for building upon later (in Facebook?). More happens on retreats than meets the eye. Glad Rick and Cody could come by Pauling House last night, to meet some of the crew. \n\nLots happening on the discussion list as well, though a lot of it's dino talk (antediluvian). Tara and I made Hotcake House memories, also the site of tonight's victory dinner.\n\nSpeaking of privatized military firms (what the nats were about), I'm not noticing much civilian procedure whereby another front for warfare was entered, as a fait accompli. We saw the committing of inventory and personnel without much formal legislating or even policy debate. Talk about wagging the dog...\n\nThe premise: that some phenomenon in \"the Arab world\" is the monster, versus some more inter-generational breakdown (more a natural process than a beast to be contained), is resulting in some miscalculations. \n\nWhy not connect more dots, in Thailand, Burma, Greece? Big cities, small countries, brimming with hopes and dreams, want more democracy, why should that be a surprise? \"Passing the torch\" to [a next generation](http://www.youtube.com/watch?v=DdAVl1LvQL0) is not always a smooth process. Perhaps with better media, it's getting smoother? \n\nThe Academy Awards helps keep the wheels turning, as does the awarding of Nobel Prizes. David Feinstein's comments reminded me again of the importance of merit in meritocracies, often signified with bits of resume and credential. I'll have more thoughts about that another time.\n\nFor all these mixings of worlds, I'm hoping to mix them more.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}