{
  "id": "4640857666455100980",
  "title": "Wanderers 2008.7.8",
  "published": "2008-07-08T19:40:00.000-07:00",
  "updated": "2008-11-15T02:35:54.306-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhbtJOPIIsBzsItyb157vVrX8YmM1_TqdY1hyphenhyphenGz24DU06NHyKf6azD0aee55qmymIbab5-jgXL5Jhznc2UHBiGQe-Q1SAzfvQ4wK_F9v0nyshCtyW3Y9SdOUb5-iIib2Hme8mDZ/s1600-h/IMG_8586.jpg):: duane in action ::Duane Ray is using us as a kind of focus group to test his mainstream science presentation about the Big Bang (he's a creationist in that sense, not one of the eternally regenerative crowd). Wanderers is good for this, helps people refine their spiels.In brief:  photons are important, yield up the spectra: we and stars share a common set of constituents, [quarks & leptons](http://www.physics.ox.ac.uk/documents/pUS/dIS/fundam.htm), denizens of a primordial soup (mixed in with the dark stuff), which gave rise to these bigger masses, atoms, planets and stars.He's being quite animated, giving me ideas for cartoon characters.\"Iodine, uranium... hydrogen, helium...,\" a separation into layers with heavier stuff towards the center, hard planets, within the first couple billion years, bringing us up to date (between 13 and 14 billion years into it -- 13.7 to be more exact).Meanwhile the rate of universe expansion is continuing to speed up (we just figured that out, based on [supernovae](http://imagine.gsfc.nasa.gov/docs/science/know_l2/supernovae.html)).Black holes behave like garbage collectors, but evaporate nonetheless (takes awhile), giving us this closer to zero heat death of the universe.There's no connecting the ending to the beginning in this cosmology -- more of a linear one-off, nothing much to compare it with. Dark matter (23%), dark energy (73%), atoms (4%)...Editorial interjection: given the standard Big Bang story doesn't explain the dark stuff, it's probably premature to suggest we have a working model or theory here, but that shouldn't dampen our enthusiasm for cosmology, which doesn't depend on always having a coherent explanation for everything -- maybe in a couple of years?  Data acquisition proceeds apace.I just got an email back from [Kenneth Snelson](http://www.kennethsnelson.net/), woo hoo (count me [a fan](http://controlroom.blogspot.com/search?q=barrel+tower)).[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgGDibavOZYRkx9xIIxWT1GNKMz0iNY6Y3LcLxqjhyphenhyphenPJy718LDEeJk0Wn1mq8fX0BtBSB9Hx9wa68JYy5O83DVf9R3YTBgWG-mQWaQ0tKtIkTVACtoK2qrbCP6uYsqCIBdATEcn/s1600-h/wwwanderers_willamette.png)\"subway map\"",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}