{
  "id": "5320187364309275211",
  "title": "Wanderers 2012.6.19",
  "published": "2012-06-19T22:26:00.001-07:00",
  "updated": "2012-06-19T23:38:16.615-07:00",
  "content": "Lew was focused on finding the right technology for the meetinghouse.  Our acoustics are actually quite good now, with music events quite doable on the 2nd floor.  We're mostly interested in keeping it quiet for our neighbors, not because the room can't handle music.  However Lew's challenge is the spoken voice, occasional singing.  He's looking at array microphones and their ability to direction-find a sound source.  Not a dumb idea.\n\nI'd CC'd Lew earlier today, when [SDW](http://worldgame.blogspot.com/2011/10/halloween-2011-2-of-3.html) sent a memo on the kitchen.  [FNB kitchen use](http://controlroom.blogspot.com/2011/08/board-games.html) is more my focus than Pauling House scheduling, where I'm nominally a listowner on the shared calendar (a Yahoo! gadget).  That was a solution from another era.  In SDW's case, it's the new baker we're seeking to accommodate.  Luckily, FNB doesn't do meat or lard.  We're not about to fill the atmosphere with grease.  A gluten-free baker has nothing to fear, and indeed it's a synergetic combo.\n\nAnyway, I CC'd Lew because I was sharing about meetinghouse history.  We have some overlap with St. David, in terms of current and former members.  Chatting about our presence on Google Earth, [thanks to Lew](http://www.flickr.com/photos/17157315@N00/6854605156/), is something of an ice breaker, when working with these other neighborhood religious groups.\n\nThe link between the Pauling House and the Meetinghouse is Doug Strain's company, ESI.  [The corporate booklet](http://mybizmo.blogspot.com/2005/09/planting-seeds-in-silicon-forest.html) gives 1958 as a date, whereas other sources say ESI vacated the building in 1956.  But remember:  the fire at the place on Macadam.  ESI moved out, then lost the new place in a fire.  Did they need to move back, temporarily?  I'm not privy to corporate archives, but the meeting archivist (Dr. Carl Abbott) might have some of those records.\n\nMore discussion of UAVs.\n\nCameras producing pictures that let you [change the focus](http://www.lytro.com/) after the fact were another topic.\n\nAs a courtesy to one of the tenants, involved in alcohol counseling, we no longer bring alcohol to our meetings.  We've been [criticized in the past](http://controlroom.blogspot.com/2010/05/wanderers-2010511.html) for allowing it, but then wine is a social drink in this region, with OMSI lectures taking advantage of the McMenamins license to run a full bar.  We were like a Spaghetti Factory or Red Robbin in allowing minors, but with like a TED talk going on (no, not pole dancing -- that would have been down the street).  [Private party rules](http://mybizmo.blogspot.com/2009/11/think-tank-techniques.html) applied, with no selling to the public either expected or implied.\n\nWe're getting ready for the Summer Retreat.  [That time of year again](http://controlroom.blogspot.com/2010/06/wanderers-summer-retreat.html).\n\nI had lunch at [Laughing Planet](http://worldgame.blogspot.com/2009/01/quick-recap.html) on Belmont.  Yesterday:  [Toney Bento](http://www.yelp.com/biz/toney-bento-portland).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}