{
  "id": "943319815574825314",
  "title": "Wanderers 2017.3.15",
  "published": "2017-03-15T12:06:00.002-07:00",
  "updated": "2017-03-15T12:27:40.829-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/33366546696/in/dateposted-public/)\n\nWanderers was what I hoped it would be about: public schooling. Barbara, an experienced retired public school teacher, had already started the ball rolling. Dick Pugh was there as well, likewise a high school science teacher from way back, including at Cleveland PPS, where my younger daughter went. Alexia went to Grant PPS.\n\nI didn't bring up anything about the Gulen Schools, not necessarily called that except informally, until towards the end of our meeting, as our discussion was not specifically focused on that particular controversy and I wasn't trying to commandeer the thread.\n\nI'm on that physics listserv, provided a seat [by Dr. Bob Fuller](http://mybizmo.blogspot.com/2006/04/more-first-person-physics.html), I'm explaining how the 95% conventional XYZ approach, with the [added spice](http://worldgame.blogspot.com/2017/02/class-notes.html) of the \"IVM\", might be more effective at imparting core STEM concepts than convention alone. I call this \"thinking outside the box\" in [my longer essay](https://medium.com/@kirbyurner/a-case-study-in-ethnomathematics-d4731f4d090d) on Medium.\n\nI've been suggesting that Quaker private schools might be the most influenced by American Transcendentalism ala Margaret Fuller and her grandnephew Bucky Fuller. However the Islamic tradition comes to tiling a plane and filling space as topics, and so could as easily start sharing about Mite, Rite and Kite as we Quakers could.\n\nThe best way to think of a Mite might be as a 1/8th Coupler, the latter a key shape in the game of filling space with Archimedean Honeycomb Duals. [Guy Inchbald](https://www.jstor.org/stable/3619198) maps it out for us, minus any use of said nomenclature, which traces, as I've mentioned, to Transcendentalists in American literature (not just Quakers).\n\nIn today's political climate, [the Gulen Schools](http://worldgame.blogspot.com/2016/10/ethnic-schools.html) are feeling stigmatized for their Turkish roots. In Turkey itself they're branded as part of a terrorist organization, much as people in Germany and the Netherlands are today considered Nazis by the Ergodan government.\n\nErgodon sounds a lot like Trump when sounding off about what are supposedly CIA plans to undermine their respective administrations (the failed coup of 2016 is laid at the door of Gulen and his Falun Gong like movement, as well as the CIA's, whom he casts as \"working in cahoots with\").  The lingua franca of paranoia is becoming more global, thanks to Alex Jones and friends; thanks to Youtube.\n\nWhat may be paradoxical, too early to tell, is Uncle Sam's ongoing friendliness towards these newfangled public schools (so-called \"charter schools\") that supposedly introduce much-needed innovation without crossing various fine lines in the sand. Crossing those lines makes you private, no longer qualified for public funding.\n\nThe challenges to public schools are somewhat new now that TV has taken much of the burden of providing social cohesion.\n\nI asked the group: could the USG set up thousands of boarding schools with admissions criteria, of course not at all based on race (a dubious concept to say the least)?\n\nThey might not take all comers, just as NASA doesn't admit just anyone into astronaut training.  If there's political support for these academies, they could spring into operation overnight.\n\nThe military is already such a network, run on the public dime (and borrowed currencies). \n\nThose who see schooling as a way to eradicate niche ethnicities and quake with missionary zeal about doing so, have become niche ethnicities themselves.\n\nMost of us are content to offer choice and be generous with the freedom to create and operate public school facilities. Sure those might have an ethnic focus, by design. In Portland, we enjoy Japanese immersion as one of the magnet school options.\n\nAs I wrote on Facebook:\n\nSo\n what you want is choice right? Including the right to home school. Or \nperhaps they get the Judaism at home but your family purposely chooses \nsomething more alien, like Japanese immersion, because of long range \nideas about role / career opportunities \nthat open to those with hybrid skills and capabilities. \n\nMy parents were \nquite willing to immerse me in an Italian school when we moved to Italy,\n to make me bilingual, but I rebelled against the smock and bow kids my \nage were expected to wear, so they immersed me in an English school \ninstead, where I had to wear blazer and tie. \n\nTo be a fully public \nschool, one needs to meet certain criteria, but what criteria? That's a \ndiscussion we never have in much depth owing to more superficial topics \nco-opting all channels. \n\nHow Jewish might a school / curriculum be and \nstill count as public? The answer would interest the Catholics as well. \nGiven religion is a huge aspect of the human experience, why not allow \nany student to go deeply into a religion of her or his choice from an \nacademic perspective. Public schools should not shy away from allowing \nstudents to study anthropology (the A in STEAM, if you ask me and not an\n artist).\n\n[](https://www.facebook.com/thekirbster#)\n\nI'm\n fine with a public school offering safe gun use as an elective. No way \nshould it be required. It's like taking a safe driving class. Owning a \ngun and a car are similar concepts as both are lethal in the hands of an\n unskilled operator.\n\nI'd\n keep the guns, skis, snow shoes, snowmobiles, ham radio, tents, stoves,\n other equipment under lock and key, to be distributed during course \nwork, which may include outdoor survival skills, scouting style. \n\nMore \noutdoor options is what the public boarding\n schools are about.  Many thousand of those.  Lets see if the local \nfolks are smart enough to create those opportunities for themselves \n(lots of good jobs) and their children. Of course we're all skeptics as \nif they had the smarts they'd be enjoying these already.\nAgain, I'm simply describing the military, our number one public education facility, by far. \n\nThe country wants to have a debate about education, [not just health care](http://worldgame.blogspot.com/2017/03/nuts-and-bolts.html).  We understand the military, with its six billion a year budget, is the Education King, dwarfing all others. The military has campuses around the world, many of them floating.\n\nHowever one may serve in the military and still be a Sufi.  Fuller himself was in the USN and distinguished himself as a Cold Warrior during what he called WW3.\n\n[](https://www.flickr.com/photos/kirbyurner/33366552966/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}