{
  "id": "2141302550487322605",
  "title": "Wanderers 2017.1.10",
  "published": "2017-01-11T16:49:00.000-08:00",
  "updated": "2017-01-28T01:16:08.224-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/32093641162/in/dateposted-public/)\n\nOur honored guest at Wanderers last night is an extremely intelligent and diplomatically skilled dude.  I've met a few of these Afghani-Americans with a foot firmly planted [in both worlds](http://worldgame.blogspot.com/2013/11/a-khan-at-thirsters.html), that of the US, and that of contemporary Afghanistan.\n\nDr. Monammad Khan Kharoti is a medical doctor, a surgeon, with a strong understanding of the cultures he's dealing with.  His focus, since well before 9-11, has been [providing schooling](http://www.greenvillageschools.com/) for Afghans, for girls as much as for boys.  The Taliban have never objected to that agenda.  The facilities are internally gender-segregated and religious texts are not eschewed, as has been the Western standard until quite recently.\n\nKhoroti sees two scourges in Afghanistan: illiteracy (which leads to incapacitating ignorance) and the misfortune to have been associated with Osama bin Laden, which turned the US from friendly to definitely hostile.\n\nOffering free tours of the US to small groups of Taliban, [through the State Department](http://mybizmo.blogspot.com/2009/03/chauffeur-duty.html), just to learn about the differences first hand, would go much further towards establishing a peace than misguided attempts at [military takeover](http://controlroom.blogspot.com/2013/02/report-from-afghanistan.html).  Ideologies spread by osmosis, not bullets, which only harden the hearts of those shot at.\n\nWe reminisced about the good old days when the world was less in turmoil.  I took a commercial bus for ordinary folks from Peshawar to Kabul that time, through the Khyber pass, with my mom and dad. We had no reason to be fearful in the 1970s.  From Kabul we flew to Tashkent on Aeroflot, then on to Moscow and St. Petersberg, then Helsinki no problemo.\n\nThose were the golden years maybe? Any way back to that?  The trucking industry needs the routes from Istanbul to Kabul to work without obstruction.  Kabul isn't far from Islamabad after that.\n\nKharoti is well respected by [the Taliban](http://controlroom.blogspot.com/2009/05/bait-and-switch.html).  He's clearly acting in the best interests of the people he serves. His integrity goes unquestioned.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}