{
  "id": "9126167530479309531",
  "title": "Wanderers 2019.3.13",
  "published": "2019-03-13T11:21:00.001-07:00",
  "updated": "2019-03-13T11:28:44.308-07:00",
  "content": "I was up by 4 AM, deciding to make my daily Youtube earlier rather than later.  Carol had set her alarm for more like 6:30 AM, given she intended to attend this Wanderers meetup, about the Green New Deal and its relationship to the UN Declaration of Human Rights.\n\nI was in chauffeur mode for this one, unable to take the indoor lifestyle of a round table discussion.  They talked for two hours.  Between tours outside, including to the tax company down the street, I would sip coffee and listen to the conversation.  Carol managed to get her words in edge-wise, as a respected elder and storyteller.\n\nSometimes I just don't have opinions I consider worth something and/or any patience for politics.  I'm more the dumb animal, the ox or lion. \n\nThe tax office had a Time article about the Dalai Lama and Tibet, which I perused.\n\nI mused on the impact of Tibetan culture on my own life, which has been considerable, especially if one takes in the Tantric and Vajrayana subcultures of Bhutan (a family home for a spell) and Nepal.  The Newar temple around the corner from the Linus Pauling House has also had ripple effects in my life.\n\nI first started tuning in Tibetan culture in a big way when I was still living in Jersey City.  At this point, I had no inkling that my parents would be moving to Thimphu.  Sometime later, I would be Alan Potkin's best man for the Buddhist wedding ceremony in our living room in Druk-yul (the Dragon Kingdom).\n\nJohn Driscoll, the architect, was present, after many months of absence from Portland.  Our presenter, Pat Haynes, on the other hand, was on the verge of leaving the west coast for the east, for an indefinite period.\n\nJohn phoned after I got mom home and we (Glenn, Don, John and I) adjourned to Pepinos for lunch.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}