{
  "id": "2385836803671788863",
  "title": "Wanderers 2008.9.2",
  "published": "2008-09-03T10:31:00.000-07:00",
  "updated": "2008-09-03T10:32:07.457-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhkhTCASy0jJvf9lPHNS1z_qKBjGz2RLWOWnZ88g5ztFaJEri3mnT6ATSnVLLqWkA-faBlPgUi-nh-uxJUj3BpphLtCi76nrsH9fZp9DVEbCX8aa_4RretgL0_hfTIlMU0OGJkB/s1600-h/linda_richards.jpg):: Linda Richards ::Linda Richards is our guest this evening, a grad student at OSU.  She's telling us about the two operational nuclear plants in Oregon, one at Reed College, the other at OSU.  Followup:  both are 1.1 KW capable and 40 years old, Mark 1 and Mark 2 [TRIGA models](http://triga.ga.com/45years.html) by General Atomics respectively, with OSU's designed for 3.2GW [pulse operation](http://www.youtube.com/watch?v=6I3JKYdGWTE) (thanks Keith).[Her research](http://pauling.library.oregonstate.edu/exhibit/) started with the question:  what did Linus Pauling think of this reactor, when it was going in?  She hasn't yet discovered the answer to that question, but in the meantime her studies have branched out to many related questions.Linus was still alive during the Three Mile Island incident, was in Hawaii when it happened, getting some award.  He spoke to his concerns about nuclear power at that time.This is kind of a family event in that we're talking about the Paulings in [his boyhood home](http://mybizmo.blogspot.com/2006/08/linus-pauling-house.html) on Hawthorne (age 11 - 14?), plus I have my own family here, Carol (my mom) and Tara (my younger daughter).Linda is reading from [No More War!](http://www.amazon.com/No-More-War-Linus-Pauling/dp/0396081576), first published in 1958.  Writing for a re-edition 25 years ago he wrote:  \"I hope that when the year 2008 arrives... the world will have survived and that the human race will still be here, although I will probably no longer be living, and I will no longer need to republish the book... because world peace will have been achieved.\"  I paraphrased at the end there, as I'm taking notes live.Now she's talking about [Doug Strain's](http://worldgame.blogspot.com/2005/09/wanderers-200597.html) recollections of 1941, the National Guard's operation on the Cal Tech campus in the wake of Pearl Harbor.  Linus questioned the registrar's authority to convene this meeting for hate speech, pointing out that Cal Tech was known for being an institution dedicated to reason and considered debate.  The students applauded his boldness and views.  Many thought he earned his Peace Prize right then and there.He debates Edward Teller live on TV at some point, taking notes during the face-off, saving remarks for future archivists (Linda is passing copies of these hand written notes around now).This was a really good presentation, well attended and video taped by Terry.  Linda is a lively and thoughtful person with a very active mind, a natural Wanderer in my view.  The Paulings are lucky to have such a qualified student digging around in their [extensive collection](http://osulibrary.oregonstate.edu/specialcollections/rnb/index.html).  The [Linus Pauling blog](http://paulingblog.wordpress.com/) is definitely worth a visit.Wanderers expressed their wish for Linda to give another presentation down the road, more specifically about Ava this time.  She sounded quite willing to give it a go.  Don set up an appointment between herself and [Doug Strain](http://controlroom.blogspot.com/2008/01/launching-mother-ship.html) for tomorrow morning.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEipknhoS6BiE0dKsIWQlhESsnHjmLObDIxDib_cKsHb1giYLp_Wk-HkzLq2IxEk9RcC4jtNhl4iLmiguQm-0HfHCbi77Bs9d6396EYCLkarT3MCoJwNnz_62m4DuQk20q9C6Wwk/s1600-h/linus_pauling.jpg):: Linus Pauling, age 7 ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}