{
  "id": "112379751266945566",
  "title": "Wanderers 2015.3.10",
  "published": "2015-03-10T19:38:00.004-07:00",
  "updated": "2015-03-10T23:39:36.278-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/16574754857)\n\nOur guests, Brian Haug and Eli Eichenauer, are crowd sourcing their businesses based on the new Crowd Funding law, encouraging Oregonians to invest in Oregon-based enterprises.\n\nA small number of business were chosen to showcase the model.  Small enterprises scattered across the state have started up various green industries that care about profits, people, and environment as an integrated bottom line.\n\nOregon is around the fifteenth state to define a Crowd Funding game. \n\nYou have limits on how much you can raise, both minimum and maximum.  The law passed in January 15.  Hatch, a community innovation lab, wrote [Hatch Oregon](http://hatchoregon.com/), a web site implementing the game (picture [Kickstarter](https://www.kickstarter.com/)).\n\nSoftware engineering allows many games to be implemented, with variable risk levels, possible payouts.  On this one, you get money back, if the business thrives.  You've got something like stocks and bonds. \n\nThe new law allows investors to take risks without engaging in public trading around IPOs in the usual, more exclusive way.  As long as people understand the rules, and the state approves, these experiments remain possible.  [ If the state does not approve, it's called a \"numbers game\" or something, and the FBI gets more annoyed (sometimes, depending on jurisdiction). ]\n\nHatch players need to be Oregonians.  Investors go shopping for businesses to invest in, through the web site.  Hatch is a nonprofit and does not take a cut. \n\nSome of the success story establishments pay rent if on site, so when the law works, Hatch looks good because its tenants look good.  Training, listing, launching -- a \"purpose wheel\" is in the making.\n\nThe business talking to us tonight Of Hops & Men, a Taproom-Barbershop, is not open for business yet, but will be shortly we hope, in 2016.  The shop will be OLCC licensed.  As a CSN guy brainstorming about a network of licensed coffee shops, my ears perked up.\n\nAn 18-block area near the Lloyd Center named Hassalo on Eighth (an eco-district development) is currently under construction.  This is property close to the Oregon Convention Center.  Offices are flooding in, bringing lots of new retail, hence OH&M.  The picture of Portland's NE quadrant in 2035 shows impressive growth projections, a busy skyline.\n\nBrian, a former Navy diver, Peace Corps vet (I know him from Thirsters) is a 4th generation Portlander.  His Portland pedigree is impressive.  He can feed that in to the decor. \n\nHe has a floor plan laid out. \n\nHe hopes to work behind the bar, with the hair cutters paying him for their high profile positions. \n\nHair cutters are like journeymen and bring their own equipment. \n\nDespite the name, women are quite welcome, the maleness being a branding theme not a deterrent to female customers.\n\nIf Brian gets his preferred location he'll be a stone's throw from the Max line.  He wants bicycle-related decor, but not overdone.  Digital Pour, like at Bailey's and Growler's, will show the beers.\n\n Hotel Eastlund is growing out of the old Red Lion.  A new Oregon Convention Center hotel should be here by 2017 maybe?  For Pycon round two?   \n\nI'd like to see a Henry George based analysis of the Hassalo project.  Taxing land value, versus income, is how that game is played and its proponents claim they're able to \"raise all boats\" more successfully.\nEli is doing WebLively, Your Wellness Network, a website for clients to maintain a secure profile with medical information. \n\nPicture Facebook, but HIPAA compliant. \n\nProfessionals (doctors, nurses, other health professionals) also store profiles, but publicly. \n\nPicture a dating service betwixt clients and professionals, but perhaps with a team, not just one on one.\n\nMy questions had to do with patients wanting to withhold information i.e. why does a massage therapist need to know anything about my bout with malaria six years ago (just making that up). \n\nExactly: the client is able to set permissions for different specialists. \n\nOK then, I've been thinking about these issues for awhile, so the model feels familiar to me already.\n\nHatch Oregon is involved here as well of course, i.e. WebLively is another showcase business developing as a result of the new Crowd Funding law.\n\n[](https://www.flickr.com/photos/kirbyurner/16574762217)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}