{
  "id": "2202542420563408715",
  "title": "Wanderers 2012.12.18",
  "published": "2012-12-19T23:54:00.003-08:00",
  "updated": "2012-12-20T13:39:50.253-08:00",
  "content": "[](http://www.flickr.com/photos/kirbyurner/8289605001/)\n\nDon tells me Trish recruited this guest as a speaker and I should take her as a role model.  I'd been in the doghouse before, as some of my invited speakers had proved a bit shocking to our more shockable members, or maybe they'd been too religious or not religious enough...  In any case I'm happy to take Trish as a role model.  She and Eric knew each other from Apollo College, and by now I know both as excellent teachers, not run of the mill.\n\nEric, whom I was just meeting, has transformed himself into an urban ecologist with a focus on metropolitan creeks.  \"Creek\" is a lovely word evoking images of forests and wild animals, whereas the reality is more like in Spirited Away:  polluted drainage paths for industrial / human effluents.  \"Preserving wetlands\" was diametrically opposite what these earlier earth movers had in mind.  A manicured and paved industrial utopia, unmarred by pre-existing nature, would push creeks into culverts and underground pipes.\n\nEric isn't a raving \"need to make a trail everywhere\" guy, even though he spends a lot of time wading in creek beds and getting his hands dirty.  He's been a Marine, a photographer, a college teacher, an administrator.  He has good people skills and stays fit clambering around Fanno Creek.  His urging us to join him in exploring our watershed regions, as planners, systems students, Wanderers or whatever, was sincere.  He knows, as does Brian, another ecologist, that actual contact with the ecosystems in question makes a difference.  They need human friends in high places.  Ecotrust had the same teaching.\n\nIdeally this'd be a book review of Up Fanno Creek, but I only just bought it last night and haven't really gotten into it yet.  I have [Wittgenstein & Psychoanalysis](http://www.amazon.com/Wittgenstein-Psychoanalysis-Postmodern-Encounters-Heaton/dp/1840461322) in the queue, thanks to the Study Circle.  But when I patted my pockets for it later (it's a smallish book), all I got were dim memories of maybe having filed it on the \"time capsule\" (art decor hemi-cylindrical book shelves, home of a Wittgenstein collection).  A careful inspection, book by book, yielded nothingness and angst.  I did some backtracking with a flashlight but ended up ordering a new copy.  So Up Fanno Creek jumps to the front of the line then, along with From Peace to Freedom, Quaker Rhetoric and the Birth of American Antislavery, 1657 - 1761 by Brycchan Carey.\n\nI ran into Trish earlier in the parking lot, as she was out shopping with her teenage son and his friend.  Carol got to come to this too, enjoying her newer smaller O2 tank, B size (she's till post-pneumonia).  Given Jack was a land use planner, and a huge maps fan like Eric, we both thought of him a lot.  Mom is now experimenting with my Kindle, reading Human Smoke.\n\n[](http://www.flickr.com/photos/kirbyurner/8290660134/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}