{
  "id": "115696645283921459",
  "title": "Wanderers 2006.8.30",
  "published": "2006-08-30T13:03:00.000-07:00",
  "updated": "2012-01-30T08:53:08.122-08:00",
  "content": "We had a lot of heated discussion at the [Pauling House](http://mybizmo.blogspot.com/2006/08/linus-pauling-house.html) this morning, arising from the Sustainability Archetypes book and workshop experience that Milt Markewitz, our presenter, is in the process of writing and designing.\n\nOne diagram he uses is an XY grid with Mechanical vs. Organic along X, Malthusian vs. Cornucopian (different from Copernican) along Y.  That generates the four quadrants around the origin (++, +-, --, -+ going clockwise, although Milt doesn't use such grade schooler signage, a potential source of unnecessary bias).\n\nI predictably suggested a tetrahedron instead, with all six edge relationships given equal weight.  Then I spent some energy oscillating between Power (-+)  and Planet (+-), speaking in passionate defense of NavAms (a People ++), which Terry was ragging on as incapable of turning a Profit i.e. creating surplus (the fourth P --), nevermind the casinos (or [the airline](http://mybizmo.blogspot.com/2006/07/more-bizmology.html)?).\n\nI say \"predictably\" because, per [this recent post](http://groups.yahoo.com/group/synergeo/message/28680) to Synergeo (re hurricane Katrina), we [buckaneers](http://mybizmo.blogspot.com/2006/08/buckaneers.html) are always getting up off the XY plane whenever \"[four corners](http://worldgame.blogspot.com/2006/08/street-corner-tetrahedron.html)\" are involved.  That's just basic to General Systems Theory ([GST](http://www.grunch.net/synergetics/gst1.html)).\n\nMilt also shared about the book Finite & Infinite Games by James Carse.  In the former (finite games), the purpose is to win, thereby ending the game, whereas in the latter (infinite) it's more about just keeping the game going (which sometimes means changing the rules).  The latter encompasses the former, but not vice versa.\n\nMilt told the story of two Cold War powers escalating through the [Cuban Missile Crisis](http://mybizmo.blogspot.com/2006/08/blaming-castro.html), up through the Reagan years, and culminating in Bush Sr.'s visit to Japan for a summit, after the fall of the Berlin Wall (the summit Bush barfed at).  How far we'd come, I think was his point.\n\nI followed up with an account of an earlier event, when Eisenhower was all set to talk turkey, after Russia'd been devastated by WWII, and DC held the nuclear card (another \"I'm the only superpower\" moment i.e. not a level playing field).  That time, Russia's \"shooting down\" of the [U2 spy plane](http://worldgame.blogspot.com/2009/02/u2.html) derailed the president's bold plans for a lasting world peace (cite Prouty).\n\nDavid Tver talked about issues confronting Nigeria, and personal choices he's had to make.\n\nLater, I spoke passionately about this \"4P\" Tetrahedron, saying it's all good (it got us this far didn't it?), and how the naturally evolved integrity of humanity would keep us centered.  As individuals, we wander in its phase space, changing character in complement with the environment (including other workshop participants).\n\nLike, if we don't include the Dark Side (Power) consciously, then we'll just end up projecting it unconsciously, like all those [Over the Hedge](http://mybizmo.blogspot.com/2006/05/over-hedge-movie-review.html) security moms behind keeping the troops in Iraq (a species of \"[power nester](http://worldgame.blogspot.com/2005/10/market-research.html)\").  Christine found my point \"archetypal.\"\n\nBrian Sharp also joined us this morning, which I was pleased about (he asked about Dawn).  We seemed to see eye to eye on a lot of issues this time, including on the vital importance of trusting our intuitions and senses (the wisdom of the body), including our undervalued sense of smell (likewise Nietzsche's focus).\n\nRelevant web sites:\n[Appreciative Inquiry](http://appreciativeinquiry.org/)\n[Chaordic Commons](http://www.chaordic.org/)\n[Grunch.net](http://www.grunch.net/)\n[Spirit Mountain Community Fund](http://www.thecommunityfund.com/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}