{
  "id": "4942525713884814386",
  "title": "Wanderers 2013.5.30",
  "published": "2013-05-30T00:05:00.001-07:00",
  "updated": "2024-09-17T15:02:35.242-07:00",
  "content": "I showed up late for Wanderers this morning (yesterday morning by now -- it's late) and was surprised to find only Glenn.  I was even more surprised to learn of Jay's passing, one of our group and one of Terry's oldest friends.\n\nDave DiNucci came by when we'd all left, then turned up in Pepino's when I did, having invited The Open Bastion.  Steve is out of town but his small staff continues working in the new office.  Dave is giving a talk tomorrow, to a meeting of an esoteric languages (computer) society.  I will likely try to find it.\n\nTara had suggested a couple weeks ago that I might like The XX, a band she already liked a lot and followed, but had never seen perform live.  Coexist is the album they were sharing.\n\nIndeed, concerts, rock or otherwise, have not been big on her radar.  We joined with Rose and Elliot beforehand looking for food, though on a Memorial Day our choices were more limited than on a typical Monday.  Parking was free.\n\nMy impression of The XX and the opening band,  Hundred Waters, was they were not in the \"angry rebellion\" school of rock.  That's just one branch in any case.  This group is more introspective.  I enjoy mellifluous and electronic, am a regular on SOMA FM, so these musicians were in my ballpark. \n\nThey're on a grueling tour playing all over North America.  The truck and bus were parked out back.  This is serious showbiz with lots of lights and lasers, with voices and sounds strong enough to keep it entrancing and tight.\n\nSpeaking of show biz, my thanks again to Uncle Bill for inviting me to La cage aux folles at Lakewood Center for the Arts, in Lake Oswego.  Residents of Willamette View Manor were there in force, packing the house and raising the average age.  Bill chatted with a woman of 94 who may not have understood the play, which is about non-nuclear and classic nuclear families and their attempts at coexistence.\n\nLindsey Walker continues to record in her basement studio.  Her anti-fossil-fuel-use philosophy means she has no big dreams of truck and bus tours.  Even encouraging local teens to drive to a local venue is something she's given up.  It's experimental music and out there for free.  Free Box is the title.\n\nMy evaluations at work have been positive, even though I've been challenging my bosses regarding some of the workflow designs.  We're all co-developing and many variables are in flux.  Consistently good quality performance overall is what allows space for adjustments and \"exaptations\" (experiments) to happen.  \"Learning experimentally\" is a Quaker theme and yet obviously not anti-science.  The myth that science and religion have to be at odds is just that, a myth (and not one of the better ones either).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}