{
  "id": "1694810906715944605",
  "title": "Wanderers 2008.7.30",
  "published": "2008-07-30T10:45:00.000-07:00",
  "updated": "2013-01-13T14:12:19.328-08:00",
  "content": "Wanderers were lucky today.  [Allen Taylor](http://worldgame.blogspot.com/2005/01/shanghai-city.html) is a world class speaker, a veteran of the cruise ship circuit, and knows how to make scholarship come alive.  I found his discussion of the Vikings highly satisfying, even though I spent a lot of it trying to establish an Internet connection, Patrick assisting, and whispering to Nancy, from Terry's desk in the alcove.\n\nAllen framed the entire talk as if he were trying to myth bust one final question, as to whether the Vikings were exploring in Minnesota (so-called) in pre-Columbian times.  The running joke is how some to this day dispute the \"yay\" answer, given the runes and moorage holes, no reason to have not, other than potentially unfriendly natives (not a new problem).\n\nFrom the Viking side, the Estonians (today known as) basically asked for better supervision, after trying hillbilly feuding and preferring a skillful style.  Three brothers got the ball rolling, on a 700 year dynasty, which USA school kids study too little, hearing only about Rome ad nauseam, as if all we cared about were around the Mediterranean.  He told many more stories besides those, plus got into showing a lot about the ships, sometimes crewed by women right to the top, but they didn't wear horns in battle (another myth, popularized by comic strips to this day).\n\nAnyway, it's sad that we inflict the story of poor delusional Columbus on school kids, make them think he \"discovered America\" in any important way.  But once these stories worm their way into a culture, there's not much you can do about 'em, except now and then underline what garbage gets handed out in the guise of \"learning\" even from universities that should know better.  And no, I'm not forgetting about those Chinese in 1421 or whatever (dates subject to change without notice).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}