{
  "id": "5495859888554178496",
  "title": "Wanderers 2010.12.15",
  "published": "2010-12-15T09:48:00.000-08:00",
  "updated": "2010-12-15T19:08:56.694-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhgqGCkJN__KQPtESRd6yAuf9-7cZO6UwH8KDidU3m624KVZQAMxzAjBVU86Bp5FvMySYd4G0eeO0uL9y2Oi5X8TTmcWjMdVKyB6oAOlwMmaGZGAy8SZs7ZCTuWCLnml4pt5WcC/s1600/ohman12192004.jpg)[Ohman, Dec 19, 2004](http://worldgame.blogspot.com/2004/12/twenty-wall-posters-digital-art.html)We're having one of those open sessions dominated by comparing notes on computer matters, quite boring to some.  The \"Microsoft treadmill\" is a theme, which is not really a good name for it.  Any number of companies require fees to keep their software functional.Bookkeeping companies want you to download new tax tables.  Of course the government should have made such software available for free ages ago, as compliance with the government's own laws is what's at issue.  It's an executive branch function to interpret the will of Congress into running code.  However, DC doesn't have the imagination for real government, is just coasting on past fame and glory.  Or maybe I'm just unaware of the cube farms already working on this challenge?  [Where's the beef](http://mybizmo.blogspot.com/2008/01/wheres-beef.html)?Speaking of which, the Blue House would be happy to prototype the energy simulation games, contemplated for use in the schools.  These give both a household view and more zoomed out views, comparable to first, second and third person.  Monitor your resource consumption as an individual, team or household, or grid sector on the globe.  With [this equipment](http://mybizmo.blogspot.com/2010/12/office-work.html) in place, we could also look at those gorgeous new bookkeeping front ends the government is thinking about, complete with a [Wild West motif](http://worldgame.blogspot.com/2007/11/fixing-g.html) for those wishing, lots of history tucked away as easter eggs.  Even people who \"hate money\" will love playing these wonders of contemporary engineering.Even if DC is planning to pass on all these opportunities to keep the USA alive, other cities might share the responsibility more.  Hollywood has done plenty to inject life into various myths, such as Iron Man, Batman, Superman and all of those.  People use these as matrices for internal guidance sometimes (internalize role models). Introjecting comic book characters is phase one in becoming a geek, escaping the larval nerd incarnation.  A kind of morphing (transformation) occurs.The same thing happens at more zoomed out levels.  [USA OS](http://www.grunch.net/synergetics/usaos.html) gets a new shape, new feathers.  HQS are more distributed.[Congressman Wu](http://controlroom.blogspot.com/2010/09/serendipitous-opportunity.html) put his finger on it when comparing it to a geodesic sphere, not a pyramid hierarchy.  Should we change the dollar bill, and put the eye in the middle?I shared my view that the rest of the world is hopping onto the free bandwagon where \"metaphysical assets\" are concerned.  Most cities don't torment their kids with negative propaganda about the \"[free Web](http://www.flickr.com/photos/17157315@N00/5236862304/in/photostream/)\" being a bad thing.  That's more retro thinking from the 1900s, still spewing, still polluting the 21st century.  We wave good bye in the rear view mirror.Speaking of \"[girl scout math](http://groups.yahoo.com/group/synergeo/message/63836)\", Trish showed us a website where she'd gotten the template for a free antenna that enhanced her laptop's wifi reception considerably.  This led to many additional forking conversations, regarding access to bandwidth.  Jim would like something other than dial-up where he lives, but not at exorbitant cost.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhPNOayaaTWVeUWVHqxiarmDP8WclnortsbEpb5kKE1gwvR4uBboQ0oB3oqbpaygs6XHOws_UqidD_WaM-O-Nnw4aimoyTi6o2t-243uTzdXbEYtSlKnE4_PixHudJftZ2fxsMe/s1600/thb_fiscal.png)suggesting Uncle Sam supply \"liberty apps\"",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}