{
  "id": "63769346955426172",
  "title": "Wanderers Spring Retreat",
  "published": "2010-03-19T20:55:00.000-07:00",
  "updated": "2010-03-20T17:35:58.530-07:00",
  "content": "Don Wardwell is singing Angel from Montgomery to our party, accompanied on guitar by Jon Bunce, a professional musician.  Lynne Taylor introduced her upcoming talk on eco-tourism.Nick and I joined somewhat late, though in plenty of time to partake of salads.Lindsey is playing at Laughing Horse tonight, was at E-room last night, Laughing Horse again the night before, at Roots Brewery tomorrow (a fundraiser to supply more books to prisoners).I was challenged to do a lot of big picture thinking today.  I've been reflecting on my most recent meeting [with Patrick](http://worldgame.blogspot.com/2006/07/wanderers-2006725.html) of [Portland Energy Strategies](http://www.portlandenergystrategies.com/).  He's seeing the same thing a lot of us are seeing:  a way to make the \"smart grid\" a reality, that depends on the active and conscious participation of many of those served.Smart grids are related to smart meters, also appliances that report on their own energy use, smart houses, intelligent systems for load balancing.  I'm not an expert.These ideas have been the stuff of science fiction for decades.  By around 2000, a lot of writers (analysts, forecasters) anticipated we would have these technologies.  But would people learn how to use them?So far, a lot of smart meters have been deployed, but the smart grid has yet to materialize, perhaps correlating with public unawareness of [the global grid](http://controlroom.blogspot.com/2010/03/wanderers-spring-retreat.html) in general (a grid which includes communications transmissions, not just power transmission).Imagine your rate changing by the hour.  Run your clothes dryer in the middle of the night, and take advantage of a lower cost per kilowatt-hour.  What if you had grown up playing simulation games wherein you'd trained a family of Sims to so optimize?  Patrick's games would have both macro- and micro-economic dimensions.An open question, in my own mind anyway, is to what extent energy companies, public utilities, want to get back into public education.  Do they worry about consumer backlash, accusations that they're playing big brother?  If there's a commitment to sharing some substantive data, giving consumers more of an over-the-shoulder look, then the sought-for partnership relationship might materialize?  What's the interface with public schools?  Where does local government enter the picture?Obviously I'm neither the first nor only person to be asking these questions.  Patrick has been in the energy business for much of his career, has been pondering such matters and with a lot of grist for his mill.  His proposals are more definite and refined than I'm getting across here.Trevor came by [with a new template](http://groups.yahoo.com/group/synergeo/message/58038) for [the Grunch web site](http://grunch.net/), so named for Fuller's whimsical, satirical, subversive, radical Grunch of Giants (St. Martin's Press, 1983).The site looks more like a Wiki now, which is apropos, given my work in Wikieducator on [Digital Mathematics](http://wikieducator.org/Digital_Math) (mostly heuristics, [like Dr. Tomalia is into](http://worldgame.blogspot.com/2010/03/towards-nanoscience.html) -- though different ones).Earlier:  [our meeting](http://worldgame.blogspot.com/2010/03/another-day.html) about supporting educators on the front lines.  Getting a better handle on this 60-degree coordination business is a top priority for all of us.  What's the best strategy?  We're talking about art schools, schools of design, liberal arts colleges... [war colleges](http://mybizmo.blogspot.com/2010/03/world-lifestyles.html)?I worried later about too many gray icosahedra cluttering the ecosystem, some Dr. Seuss like fantasy based on a possible classroom workflow.  Glenn assured me that PVC is easily reground and recycled.There's no danger of an over-abundance at the moment, as the supply is quite limited, with artist-engineers resorting to recycling what few icosahedra are already in circulation.  The assembly process itself makes lights go on, according to [those lucky few](http://worldgame.blogspot.com/2010/03/public-policy-2-of-2.html) getting to participate in the process.If students are learning something, are developing a stronger grasp of geometric principles for academic credit, yet are also producing some in-demand good as a result, then do we worry about child labor laws, exploitation?When [touring China in the early 1970s](http://www.flickr.com/photos/17157315@N00/2560278266/in/set-72157605485853546/), I saw elementary school kids doing what looked to be circuit board assembly.  Were those usable circuits?  I don't actually remember.I'm also contemplating David Koski's work.  He seems to be mining a rich vein in polyhedral geometry, sending a lot of gold my way.  How much slips through the cracks, because I'm only an average interpreter?  I turned two recent emails [into a web page](http://www.4dsolutions.net/ocn/koski_ennea.html), with a [follow-up to Synergeo](http://groups.yahoo.com/group/synergeo/message/58034).There's always the hope that we'll get some more help.  Animators could be having a field day, is my sense of it, but are missing the boat as we're not investing in work / study sufficiently.  Findings need to be disseminated, not shelved, but then where's the audience [for esoteric geometry](http://coffeeshopsnet.blogspot.com/2010/01/coffee-shop-schools.html), especially where [tetrahedral mensuration](http://en.wikipedia.org/wiki/Synergetics_%28Fuller%29#Tetrahedral_Accounting) is concerned (relates to 60-degree coordination).  Universities?  Mostly not yet.Tara is with her sister this evening, plans to come home rather late on public transportation, fairly safe and convenient in Greater Portland.  To tourists, other visitors, I recommend taking the Max to the Oregon Zoo.[](http://www.flickr.com/photos/17157315@N00/4448527859/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}