{
  "id": "5512306922722556567",
  "title": "Wanderers 2010.1.9",
  "published": "2010-01-19T19:09:00.000-08:00",
  "updated": "2011-08-01T20:00:44.545-07:00",
  "content": "We're going around the table introducing ourselves. Our guests are from Borneo. Adrian Lasimbang from near Kota Kinabalu and John Paisley. Here's John's thumbnail autobio:BSEE '87, came to Portland that year to work in test and measurement at Tektronix which lasted for 5 years when I discovered I'm terminally self-employed and went back into residential construction. Presently owner/president of John Paisley, Builder, Inc. I've worked with [The Borneo Project](http://www.borneoproject.org) since '95 protecting indigenous peoples' land rights from timber, mining, and other extractive interests, through projects such as community mapping, longhouse construction, village scale microhydro, solar-powered, satellite-linked internet at remote villages, and preschools for Penan (an exceptional group of hunter-gatherer nomads).We have a therapist and zoo guide visiting with us tonight. She knows about orangutans, which is what took her to Borneo last year. She and I have chatted before, during the Appreciative Inquiry seminar.I made a quick trip to Frys this morning. The Win7 laptop had a loud and vibrating CD/DVD drive, but seemed to work, until I pushed it to a limit, in trying to read an Ubuntu 9.10 iso. It burned OK, but would not read it, even though my desktops would. Frys graciously exchanged it. That's good, as this is a work machine. The 150 GB backup device came in handy.Patrick and I were looking at Beautiful Soup at Angelo's this evening. This cool guy engaged us in talking about gauges versus metric. Turns out he's a glass blower and has [this cool Youtube](http://www.youtube.com/watch?v=KA8RVAXOki8) about trying to \"blow lava\" (as if it were glass, which it sort of is -- Pele's in this instance).Small villages in Borneo, using micro-hydro for power, do manage to gain Internet access in some cases. Bringing in trainers helps minimize the negative effects of future shock. The communities retain control over their own adaptation process and that proves a more satisfying and sustainable process. Kids don't need to trek off to school, learn right there in the village -- a valuable development.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}