{
  "id": "2265803427206019534",
  "title": "Wanderers 2013.3.6",
  "published": "2013-03-06T17:29:00.000-08:00",
  "updated": "2014-08-20T11:59:43.037-07:00",
  "content": "Don invited me to turn my AFSC adventure into a formal talk.  I took awhile to respond, and Micheal Sunanda, not often around, had signaled his willingness as well, so we split the platform.  He actually left the building during most of my talk, whereas I puttered in the kitchenette, making coffee, during a lot of his, also dove into emails.\n\nWhat I emailed was my exultant sense for having Elizabeth Furse join us for the AFSC part of the meeting.  She's worked with AFSC, which I hadn't known, out of Seattle, and for sure knows Arthur Dye, a former director there.  Elizabeth had visited Wanderers recently, thanks also to Don, and impressed everyone with her command of US / NavAm relationships (I use \"NavAm\" as an abbreviation for Native American, with plenty of resonance left over to mean an airline ala PanAm, connecting airstrips within NavAm bases and/or connected sovereignties -- been doin' it for years).\n\nEddy and I had just been to the corporation meeting (annual), both in the same capacity:  as NPYM representatives.  Yes, we have a lot of acronyms going.  I've blogged about some of these before:  WQM, FUM, EFI, FGC, GWYF, QUNO... FCNL.\n\nIronically, what Elizabeth had to teach me today was that Quakers were perhaps at the forefront of that \"kill the Indian to save the man\" movement that was so counter to NavAm interests.  A major portion of Friday night at Friends Center was about this genocidal campaign.  We reviewed slides of the concentration camp boarding schools where the young natives were coralled brainwashed, forced into thinking like Anglo-Euros, much to their detriment in terms of continuing the family lineage and traditions.  These cultures continue to feel decimated and healing is going to take awhile.  Yet perhaps a corner has been turned, that's the good news.\n\nSo I see the need to dig more deeply, into Quaker works in this area.  Having work camps together still is an important tool of diplomacy from a Quaker viewpoint.  My parents were camp leaders as late as the 1970s, wherein Palestinians, Israelis, and a smattering of cosmopolitans from American University of Beirut, all hunkered down to build a swimming pool in solid rock.  This was before the general erosion of an older intelligence that kept a relative peace in many areas where conditions have since deteriorated.  This was in Ramallah, not far from Jerusalem.\n\nThese camps were entirely voluntary however.  In the WWII chapter, they were less so, as conscientious objectors were assigned to them willy nilly.  I know it sounds like I'm rambling but we're intersecting Doug Strain's scenario, and his associations with AFSC are quite significant, his associations with Linus Pauling at Cal Tech even more so.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}