{
  "id": "1680532994365308811",
  "title": "Wanderers 2012.2.14",
  "published": "2012-02-14T19:46:00.000-08:00",
  "updated": "2012-02-20T13:51:06.226-08:00",
  "content": "Lynne Taylor is here talking about her paintings, water colors.\n\nThe Internet domain name stuff from a previous meeting is still on the board.  Linus Pauling House. \n\nIt's \"two dog night\" (Nirel has one in a bag, helping with her daughter's move), and Blueberry (a veteran attender). \n\n[Shomar is missed](http://www.flickr.com/photos/17157315@N00/3260966801/).  I was thinking about David earlier, thinking we should have dinner.\n\nThe first painting represents the new hadron collider at CERN and the particles they seek.\n\nThe second has lots of nanotubes and DNA and stuff.\n\nWe have two bottles of double dog dare (cheap wine on the table).\n\nLynne's paintings have frequently featured as covers of [ISEPP programs](http://www.isepp.org/), handed out at the concert hall (usually [the Schnitzer](http://www.flickr.com/photos/17157315@N00/2908124961/) downtown).\n\nWe have some visitors tonight, first timers.\n\nTomorrow I'm giving a talk on the Bucky stuff at Quakers, having dropped the ball earlier.\n\nOne of our guests had been on Ken Kesey's bus that day.  She was later a college English teacher, wrote poetry. \n\nHer cousin, also present, was a career fireman with Portland's fire department.\n\nCraigmore Creations has move out, taking the fancier table and chairs.  We're using the standard institutional folding tables with an assortment of chairs, some stackable.\n\nWe talked about [Henk Pander](http://www.oregonlive.com/art/index.ssf/2011/03/henk_pander_memory_and_modern.html) and his show.\n\nDavid called last night.  We talked about Nick Espinoza whom he knows, an inventor of \"[glitter bombing](http://en.wikipedia.org/wiki/Glitter_bombing)\" -- a Blue House topic conversation sometimes.  Speaking of acting up activists, I hear Tre might be campaigning for Mayor.\n\nI was [writing about democracy again](http://dir.groups.yahoo.com/group/Wittrs/message/7214) today, on the Wittgenstein list, mentioning [DemocracyLab](http://www.democracylab.org/).\n\nWe spent most of the evening going around the table.  I brought one of the Pinot Noirs, and some cheese and crackers.  I drank some coffee.  Looked at pix of the newer [stealth boats](http://mybizmo.blogspot.com/2005/07/stealth-boat.html) (still pretty secret).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}