{
  "id": "6298895947874524819",
  "title": "Wanderers 2012.3.7",
  "published": "2012-03-07T13:58:00.000-08:00",
  "updated": "2012-03-07T18:01:07.163-08:00",
  "content": "[Dick Pugh](http://worldgame.blogspot.com/2009/03/wanderers-200933.html) and [Barbara Stross](http://worldgame.blogspot.com/2007/10/wanderers-2007102.html) were with us this morning, always big news.  They were colleagues in my daughter's current school so many years later.\n\nI devoted quite a few hours in on United -- which doesn't take cash in the cabin (OK by me) -- reading that Democracy Despite Itself book, as well as the Wittgenstein one.  Lots of wheels turning.  The politician in the opening, who says psychologists should wear pointy hats and brandish wands, had a point I think, and might be the kind of guy I'd vote for someday.\n\nIs democracy a luxury that depends on darker underpinnings?  More debates needed.  We pretty much resolved at AFSC to keep the curtains raised on the blight of slavery, which has hardly gone away with the advent of privatized forced labor camps preying upon wayfarers and pressing them into service.  Moving about one's planet, one's birthright, should not constitute a crime.  Keep those public roads / channels open so that more wandering humans might fly their friendly skies.\n\nInteresting to see Immanuel Kant writing on democracy.  You shouldn't get away with calling yourself a \"philosopher\" and not have remarks on file that would constitute \"sticking one's neck out\" on the questions of the day.  [Kauffman](http://mybizmo.blogspot.com/2008/02/philosophy-101.html) was entitled to strut as braver in the positions he took, not just anyone could have delivered those lectures in the Princeton physics building (Frick was it?).  Anyway, if I can't find what you said when it mattered, at the brink of this or that, then please accept my skepticism of you'd lay claim to that title.  Nor is academic experience alone usually sufficient (Kauffman again).\n\nMy last day in Philly was with Chris and Jeannie, serious scholars and community organizers for our Synergetics Explorers Club (as it were).  They've been immersing themselves in all manner of open courseware offering ala Glenn's \"Open Source University\" meme (he may have caught it from somewhere, as such memes are \"blowing in the wind\").\n\nOPDX is not having much success with [conventional mayoral politics](http://worldgame.blogspot.com/2012/02/forest-grove.html), with [Cameron](http://controlroom.blogspot.com/2011/12/comic-interlude.html), one of our candidates, expressing some relief that his competition, Tre, has been temporarily incarcerated once again.  That latter detail came up at Wanderers this morning, which was mostly a meeting about chemical and/or radio toxic substances, lots of stories and lore.  Dick was yakking about [Teledyne Wau Chang](http://yosemite.epa.gov/r10/nplpad.nsf/0/e230747f1aeadb5685256594006c7c5b?OpenDocument) when I got there, late [from Noah's Bagels](http://controlroom.blogspot.com/2008/12/winter-traditions.html) (I brought a baker's dozen, three kinds of shmear).\n\n[TarBoush](http://tarboushbistro.com/) was a splendid place for another catch up session last night.  I hope Suzanne makes one of these meetups again soon.  Note to self:  I need to [ask Maureen](http://mybizmo.blogspot.com/2007/10/fine-friday.html) about the Moody kid, another Nietzsche scholar.\n\nWhile visiting Upper Darby, I got to see some of the video from the RISD event.  I'm sorry I missed this opportunity to meet up with Pearce.  I don't think I'm going to make Gathering for Gardner again this year, though I've given it some serious consideration and posted the invite proudly in the Blue House kitchen.  I saw where [Dr. Nystrom](http://mybizmo.blogspot.com/2011/12/jitterbug-party.html) mentions \"[quadrays](http://en.wikipedia.org/wiki/Quadray_coordinates)\" in his talk.  He has to be one of the few explorers to take them up in earnest since their elaboration by David Chako et al (myself a part of [that dev team](http://www.grunch.net/synergetics/quadrays.html)).\n\nKeeping up with other Pythonistas is the name of the game here.  I wrote to Nate about the auto-mosque generator for Blender (it might do churches as well).  Cyberspatial interiors can't face a physical Mecca maybe, but then the latter may have a cyber-interior as well, that we face towards.  Speaking of which, I saw about hackers doing something with the Vatican website recently.  I was having lunch and watching the LCD behind David NiNucci's head, so don't expect me to source any details.  Ask CNN?  CBN?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}