{
  "id": "5980995054832582808",
  "title": "Wanderers 2018.4.25",
  "published": "2018-04-25T12:27:00.003-07:00",
  "updated": "2018-04-25T17:26:29.298-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/39898226040/in/dateposted-public/)\n\nWe adjourned to Linus Pauling House this morning with our various ongoing investigations. Dr. DiNucci had been doing anthropology, attending the public portion of an Intel board meeting, and listening to the works of a new and already famous composer in a nearby Christian church, of which I have pictures in my Photostream.  A really nice one.\n\nQuakers have \"meeting houses\" in this neck of the woods, if of the Unprogrammed variety (as we call ourselves), with Quaker churches in other places.\n\nWe finally got around to one of our Yahoo list topics:  5G and its implications.  You'd think as software engineers we'd be talking smart house IoT, but our attenders were more from the chemistry side of things, cell biologists.  The effects of RF up and down the spectrum, on organisms up and down the scale, has been under study for some decades.\n\nAbout two decades ago, much of the focus was on \"cooking\" and how very light cooking, lowest setting, could be OK for one's brain, gonads, DNA in general.  The concern was more therms than actual frequency, as the sophistication of cellular networks of the biological kind were only coming to be appreciated.\n\nWork in sonar probably alerted some of the same scientists to the impact of high pitched beacons and so on, on the hearing of whales.  The nonhuman populations are not radio-silent lets put it that way. Ionized radiation, as well as not-ionized, has both health benefits and may be used as a weapon, perhaps of defense.\n\nI might have started on the wrong foot in jumping to the Gateshead Conspiracy right away, a viral topic (trending).  The city council has acknowledged the network, but claims to know at exactly what operating frequencies it's being tested, in an effort to control lighting.  Smart meters use the same technology.  Back to the Internet of Things.\n\nSteve was a platinum engineer and understands the curative powers of ionized platinum, in preventing cell division.  I don't know to what extent RF serves to catalyze these reactions.  Plain old AC current is what he talked about.  Think of gold plating.\n\nThis morning I wrote [Conspiracy Theories Rock!](https://medium.com/@kirbyurner/conspiracy-theories-rock-eb156d0f14e5) to help some of these detectives keep their chins up. Science requires bravery as \"coming up against established dogmas\" is a perennial issue.  Keeping writings tucked away, yet world readable to those with the URL, is the job of a filer, clerk and curator. Archivists.  I know some of those.\n\nMost of the morning meet-up was devoted to Glenn's Show & Tell.  He has quite a collection of Neolithic Tools.  I took some pictures.\n\nAnyone want a free gazeebo?  I keep meaning to put that out on Freecycle.  It's for setting up in your backyard.  We used to have one [from Costco](http://mybizmo.blogspot.com/2007/01/another-day-in-matrix.html), that gradually fell apart.  This one looks higher end and longer lasting, but was for an art project that took a different shape in the end.\n\nAdvertising free stuff in an old blog post is probably not the brightest move.  Check the date and time  of this posting, and presume I handed the thing off if it's more than a week later.  Or be in touch.  I'm requesting the recycler pick it up.  I had it strapped to the roof of my car at one point,  bringing it over from Vancouver, but that's not a trick I want to repeat.Great hearing a bit about Barbara's adventures in Guyana. Jaguars, Anacondas and Vultures oh my!\nGood having Jeff Godard, Dr. DiNucci present, with Glenn presenting on Neolithic Artifacts (Show & Tell items). I'm about to upload a few pix.  Bob!  From faraway Washington!",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}