{
  "id": "5519616831046572165",
  "title": "Wanderers 2016.10.26",
  "published": "2016-10-26T09:51:00.000-07:00",
  "updated": "2016-12-15T19:18:33.616-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/30549488256/in/dateposted-public/)\n\nI brought my ballot along, and the Portland Mercury for some guidance on the more esoteric measures.  I was gonna vote in front of everyone, as a fun input to the conversation.  However I don't have the right blue or black ink pen.  By the end of today for sure.\n\nWe agree about Measure 97 (the paper editors and I), whereas Willamette Week came out against it.  Probably not enough information about where the money would go has come forward.\n\nI understand suspicion about abuse.  I've urged these big companies that'd pay more in taxes, to get involved in public policy more explicitly, like Mentor Graphics does.  That doesn't necessarily mean creating more charter schools.  How does one create [new public schools](http://mathforum.org/kb/thread.jspa?threadID=2808442) that are not charter schools, by the way?\n\nWhen we started at Sunnyside Elementary, a bevy of parents had built a school within the school, and even had some hire-fire responsibilities vis-a-vis the teachers. This was a public school.  In Portland, anything is possible, might be a useful motto, even if the \"laws of physics\" still pertain.\n\nFor one thing, big companies (if I may address you as personhoods for a moment), tell us more about how we're to integrate math teaching with coding skills.  Just telling the high schools they need to hire an army of computer science teachers, leaving math immutable, is not gonna fly. Suggestions?\n\nI'm not being sarcastic; I have my own [very good ideas](http://worldgame.blogspot.com/2016/10/revisiting-lambda-calc.html).  So if someone like me, a steep property tax payer, is able to offer strong answers, maybe a fancy pants CEO might do the same?  Not that I have anything against [fancy pants](http://controlroom.blogspot.com/2008/10/mens-fashions.html). \n\nSpeaking of immutability, the MVC pattern (Model View Controller) has taken a turn, with React coders understanding the data flow as more [unidirectional and circular](http://controlroom.blogspot.com/2007/09/more-curriculum-writing-re-mvc.html).\n\nThe Components, represented [in JavaScript](http://worldgame.blogspot.com/2016/10/javascript-for-pythonistas.html), pass down info about state changes to their children on a need to know basis, whereas changes to state through the UI get tossed on the heap without trying to talk directly to other components.  They'll be updated soon enough.  Treat state as a giant global.\n\nConway's Law says all this micro-stuff (how we code) has maxi-consequences in the form of organizational structures.  We self-organize as we conceptualize, is another way of saying it.\n\nThink of sitting in your cubicle and getting the usual memo traffic.  Suddenly, you have a great insight or idea.  Rather than passing it \"up the chain\" from manager to manager, just stick it in your Github account and let sifters and peer reviewers note the state changes. \n\nReact was tossed on the heap as open source by Facebook, in danger of dying from the complexity of its own code until this new paradigm got some legs.  React is typically used with JSX, a way of avoiding a templating language like Jinja2 and just sticking with mostly HTML inside of JavaScript functions.\n\n[](https://www.flickr.com/photos/kirbyurner/30592004945/in/dateposted-public/)\n\nLast night I breezed through a bio of William James on my shelves (so many borrowed books I've not read!), learning of his huge disappointment over living in an imperialist bubble.  He was distraught over the US-Philippines war.\n\nPoliticians today register faux shocked surprise that the RP might be registering independence and siding with China more. The Philippines is not wanting to be proxy-maneuvered by Uncle Sam into some faux fight over fish, duh.\n\nQuakers were semi-disgusted from the beginning, with the pell-mell eagerness of the human creature to make war, not love.  \"Lets fight them Injuns\" was the morons' battle cry.  And so it was. Quakers resisted stooping to that low an EQ (same as IQ in the Garden) and [lost much of their clout](http://worldgame.blogspot.com/2009/09/catholic-analysis.html).\n\nMaking war is far easier than building an initially fragile set of trusted relationships, later codified, then institutionalized, to make torch-passing easier.  The costs get postponed to a time when paying those costs get disconnected from root causes, and people therefore stay confused enough to be bullied into wanting yet more war.\n\nJames also found USers too high strung, too on edge.  This was well before [Frenetic TV](http://worldgame.blogspot.com/2016/10/meme-machine.html) (a subtype of Hectic, a cousin of Hysterical).  What would he say today?  That USers are crazy?  Where's the news there?  USers hyperventilate excessively, reports the New York Times (can you see the headline?) — pretty much on cue.\n\nI remember celebrating the 1999-2000 odometer flip-over in Lesotho and watching each culture celebrate as the world turned, on the BBC.  People were upbeat about it all, enjoying themselves, until we came to the US time zones, where people were crazed about Y2K.  \"Are the fighters still flying?\" \"Check\"  \"Are the war ships still sailing?\" \"Check\". William James had a point I think. \n\n[](https://www.flickr.com/photos/kirbyurner/30286449810/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}