{
  "id": "1582397899672952984",
  "title": "Wanderers 2015.9.8",
  "published": "2015-09-08T19:25:00.002-07:00",
  "updated": "2015-09-09T15:43:51.565-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/21074360659/in/dateposted-public/)\n\nI got to the Pauling House early, given Carol (mom) is the presenter again.  I fumbled for keys, realizing I didn't have them, when Dick Pugh tried the door.  It was open.  Duh.  We made ourselves at home around the table.  Glenn, the official opener, arrived on time.\n\nDick was on the cell about the fire ball over Thailand last night.  Meteorite.  He's on it.  Don usually opens but he's got a meeting that will delay him until start time.  Hey, here he is!  I'm blogging in real time (I do that quite a bit, then polish up later).\n\nCarol is talking about developments in the Countdown to Zero campaign, i.e. the abolitionist movement vis-a-vis WMSs (weapons of mass suicide).  She's been working in this area, mostly with Women's International League for Peace and Freedom, for quite a number of years, certainly since 2000, when she moved back to the US from Lesotho, after the accident.\n\nShe opened by talking about the Iran Deal, inviting discussion.  She passed around some PR, a poster, on Keeping Space for Peace.\n\nThis year the campaign is delving into Cyberspace more, which one might suggest is only metaphorically space, or virtual space, but that's taking too narrow a view.\n\nCyberspace is supported physically by satellites, which are used not just to carry communications, but to support GPS, which means ballistics / guidance.\n\nCarol suggested that Geeks have the most insight into cyber warfare, which triggered a discussion of the difference between Geeks and Nerds.  I gave my standard \"a nerd is the larval form of geek\" spiel (short), while Glenn reminded us of the etymology of \"geek\" (carnival origins).  I think of nerds as socially awkward, more the ugly duckling phase of the more socially adept swan.\n\nJon sees the parallels to Lysistrata, what the women are doing, in trying to drag the guys away from wartime fixations.  WILPF does include men however.\n\nNot one single nuclear weapon has been destroyed, according to [Ban Ki-Moon](http://www.fukushima-is-still-news.com/2015/08/ban-ki-moon-calls-for-nuclear-free-world.html), according to Carol.  They've been stowed, or are being cannibalized to make new / improved weapons.  Dave DiNucci came up with an actual quote.\n\nDick Pugh insists that many physical warheads have indeed been destroyed, but the active materials stay active.  Dick thinks a lot of warhead material has been diluted in some cases, to be useful for reactors only.\n\nOur little group is not uber-informed about all this, it seems to me, but that just goes to show why we need a [college major of Weapons Inspector](http://controlroom.blogspot.com/2010/12/from-day-to-day.html) or something similar.  Decommissioning is going to require a lot of watch dogs and engineeers.  Such dogs do not just appear without grooming.\n\nCarol went over the Marshall Islands lawsuit, against all powers who are supposed to be working on disarmament, according to existing treaties.  The [Okinawa Nuclear Free Zone](http://www.hankaku-j.org/data/jalana/npt_008_en.html).\n\n\"How much does Japan contribute to the Countdown to Zero campaign?\" a Wanderer asked.\n\nI said I was looking forward to a simple ethical code wherein anyone harboring or nurturing the creation of nuke weapons was obviously a [Dr. Evil type](http://worldgame.blogspot.com/2007/05/aqua-teen-movie-review.html) psychopath Baddie worthy of some 007 or 003 type take down by a Goodie state and/or agency.  Persian Intelligence is already looking forward to fighting Dr. Evils on a world scale.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}