{
  "id": "9092353231259301877",
  "title": "Wanderers 2009.8.27",
  "published": "2009-08-27T00:24:00.000-07:00",
  "updated": "2009-08-27T23:22:54.728-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhisbzLgWiTw3_fMEnzq5cbob_pLjozfS7sHI5M5pwb5m9LdeH-u7YT9T8ZRaNqIOGAmAY6gF7ziyNvDC55mNQzGNB8d9XDFVxMWnNIs26EZ4KJhyphenhyphenowBEfw92EaJm3jkSD6r1OP/s1600-h/BALAS+AG+27+DE+09+%281%29.JPG)[by Mario Marín](http://www.mariomarin-poliedros.com/)I'd gotten some of the inside scoop from two of the returning crew at the potluck, however Jeff's projected pictures this morning added a whole new dimension.  Sam's boat is quite commodious, although five pretty much packed it.Jon Bunce joined us, in good form, and later Buzz.  A lot of the talk was about music, early cartoons (including Disney's), and about Wikipedia.One could invent a back story about this small co-op of good-hearted people, either selling out to, or having control seized by, some conglomerate that now censors the content out of rapaciousness and/or cowardice.I offered an alternative back story:  entrepreneurs suck down open source Wiki software but are competing with the likes of Britannica and can't afford to let the Wikipedia brand \"go bad\" because (for example) fringe ideologues capitalize on its \"free and open source\" nature to troll, spread FUD, trash talk and be obnoxious i.e. you've gotta set standards and enforce them to be taken seriously as an encyclopedia with backbone, and not just a hodgepodge of misleading misinformation.We talked about the new \"geezer teaser\": talking heads of the Woodstock era, retrospecting.   I'm looking forward to seeing it.We also yakked about needing an appropriate buyer for Pauling Campus, an ally.  I recycled some of my somewhat stale (or at least no longer novel) ideas, then came up with [a fresh one](http://mybizmo.blogspot.com/2005/10/hotel-oregon.html), relating to aerospace.  The Fuller School has all these plans for adapting technology in that sector for civilian shelter solutions, going back to Wichita house and before (the genesis of that 4D moniker, which I perpetuate with my 4D Solutions).Whether or not this particular idea pans out isn't the real point I suppose.  It's more just a sign of the times that we'd even consider reaching across ideological lines in this way.Teddy Kennedy is being remembered on all networks today for his ferocity and commitment to worthy causes.  His ability to bridge across chasms in our political landscape is what many think we're missing today and I see much reason for concern, although I think the White House is still pretty good at it.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}