{
  "id": "959946352538305329",
  "title": "Wanderers 2017.5.30",
  "published": "2017-05-31T00:24:00.002-07:00",
  "updated": "2017-06-01T01:41:52.049-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/34637269780/in/dateposted-public/)\n\nI spent some of the morning listening to the Seymour Hersh telling of the [Zero Dark Thirty](http://controlroom.blogspot.com/2013/02/zero-dark-thirty-movie-review.html) story, based on actual events. Prying apart fiction from non-fiction is not always as easy as some pretend.  He provides missing puzzle pieces.\n\nMy sense of not needing to pry these apart at every turn, carried me into Peter Bechtold's talk, giving the history of Syria, the heartland of the Holy Land, as they called it in President Wilson's day.\n\nSure, Wilson sounds racist by today's standards but that doesn't make him a complete idiot. Peter sees Wilson relegated to the sidelines as French and British create their own narrative around what happened in the Middle East, subsequent to the end of the Ottoman Era.\n\nThe kinds of maps Peter showed of Syria, showing patchworks by micro-climate, language, religion (ethnicity) could be used with North America as well. However as Peter restated several times, these were static snapshots from an earlier time.  Much has transpired.\n\nGiven we're in Portland, how the District of Columbia sees the world remains influential.  Peter knows a lot of people and has great respect for many of them.  He's no fan of the New American Century PR or what the neocons have accomplished, using perhaps dated terminology.  Richard Perle and like that.\n\nDr. Bechtold volunteered that he had no inside information on events in Idlib, site of the chemical attack in early April, 2017.  The relevant international bodies have not confirmed the Assad government still has any chemical weapons, nor was there clear motivation to use them.  I share his skepticism.\n\nAnyway, Wilson probably had the right idea, about providing peoples in the region with more apparatus for self determination.  The arbitrary boundaries and agreements made by English and French social engineers have not withstood the test of time.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}