{
  "id": "8405274391310003810",
  "title": "Wanderers 2019.1.8",
  "published": "2019-01-08T20:41:00.003-08:00",
  "updated": "2019-01-09T17:45:10.288-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/511415516/in/album-72157600254540815/)\n\nThis was our first evening Wanderers (alternate weeks) in 2019. We're named Wanderers because we sometimes practice Open Forum, which means the conversation is allowed to wander, in a kind of Bohmian dialog, and takes on Ouija-board like qualities.\n\nEspecially if we have a critical mass, which I won't call  quorum as we're not following Robert's Rules or anything like that.  The Quaker practice of consensus is just beneath the surface.  We're not doing business, usually, so it's closer to Meeting for Worship.\n\nHowever, tonight some business came up, as the estate / campus is under some pressure to do its nonprofit business of memorializing Linus Pauling and his contribution to humankind.  He received a Nobel Peace Prize among other prizes.\n\nHis wife Ava Helen was active in WILPF (Womens International League for Peace and Freedom).\n\nSpeaking of WILPF, my mother has been a long time WILPF activist, even went to the The Hague for its centennial.  Today she got some copies of Western Friend, January - February 2019, the On Weapons issue.  She has an interview published in this issue.  She's what we call a weighty Friend.\n\nSpeaking of weighty Friends, I'm back on beer as it's 2019.  Glenn just phoned to say Wanderers was finished and I could join the after party at his place.\n\nAnyway, very public talks about ISEPP and the Pauling House, with \"strangers\" (members of the public) present, is very much in accordance with the spirit of nonprofit management.  We're servants of the public, not shareholders.  As a socially responsible form of capitalism, we compete with the non-profits who set up around cost plus military contracts.\n\nSpeaking of government, Don came by early from the hospital to watch the president's speech on the telly.  We went through CBS.  President Trump was about done when Don arrived.  Then we heard the rebuttle from the other party.  Don visited with Carol a bit and then gave me a lift to the venue.  I took some time over at Fred Meyer's to tweet, on [@4DsolutionsPDX](https://twitter.com/4DsolutionsPDX/status/1082832040137961472), one of my channels.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}