{
  "id": "4867157933208055469",
  "title": "Wanderers 2012.01.17",
  "published": "2012-01-17T19:15:00.000-08:00",
  "updated": "2012-01-28T18:47:26.143-08:00",
  "content": "Pursuant to the previous installment, I did leave a follow-up voicemail with Tre, as he seemed truly distressed up that tree, not just playacting.  Just climbing that thing was a feat, of circus quality.  Add the red and blue lights, crowds, and you get the expectation of entertainment.  We've seen this in cartoons, with people shouting \"jump\" and so on.\n\nI wore my chauffeur hat again today (not literally, I have no special hat for when driving), picking up an MVP at PDX.\n\nYou might think, if we were truly a spiritual community, of this network of colored houses, this board game of assets (safehouses and so on), that our personnel would be rotating through retreat centers, heading off to meditations, disappearing on vision quests.\n\nIndeed, that's how it is, and has been, for a long time.  Dawn was far more active in her practice than I was, by so many measures.\n\nJust today for example, two meditators from another house came by, in route by bike to their meditation center (a yurt in this case, at some higher altitude).  Melody is away on retreat as well.\n\nNow I'm at the Pauling House for a talk on Computability, Turing Machines, [Gödel's Incompleteness Theorem](http://controlroom.blogspot.com/2007/05/incompleteness.html) and all that.  One of the seniors, a professor by training, is holding forth.  He's got his super duper unlimited registers machine with just four instructions, for defining computability.\n\nWe should not forget the Quakers have a meditative inward practice, sometimes labeled \"unprogrammed\" to distinguish it from a scripted service, or ceremony, led by a minister, teacher, pastor or [rabbi](http://worldgame.blogspot.com/2012/01/scholar-talks.html).\n\nUnprogrammed Friends are free to attend programmed services of course, and many do.  There's no necessary either/or relationship between programmed and unprogrammed (a lesson that may apply to computability also).\n\nA senior member of a meeting may minister informally, in an authoritative (\"weighty\") manner, both inside and outside the Meeting for Worship context.  Indeed, a Meeting has its ritualistic aspects for creating a privileged space, a fact Dawn was adamant about recognizing.\n\nI've been publishing some of my philosophy of mathematics around [the Koski toons](http://worldgame.blogspot.com/2012/01/lights-camera-action.html), taking off from the flapping 4sys (Gene Fowler).  The Wittgenstein list gets [a front row seat](http://groups.yahoo.com/group/WittrsEX/message/4701), not surprisingly.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}