{
  "id": "7357593764344556144",
  "title": "Wanderers 2014.2.5",
  "published": "2014-02-05T18:34:00.001-08:00",
  "updated": "2016-08-17T20:08:45.061-07:00",
  "content": "Great introductory talk this morning, taking us into the weird world of a nation-state system in shambles, with the [still-cannibalizing LAWCAP](http://grunch.net/synergetics/gst2.html) writing \"trade agreements\" (aka \"treaties\") the populace is not allowed to read, yet which are supposed to be passed at the highest levels in DC -- \"fast tracked\" most preferably.\n\nWe were learning about the Trans Pacific Partnership, another NAFTA-like codec.\n\n\"Fast track\" powers are currently not in effect yet the Obama execs would love the cut of the pie that they'd get if they could heroically deliver the bacon.\n\nThe bacon's avid recipients would be those \"private investors\", the ones busily suing governments to recoup on might-have-been (speculative) profits.  \"You said we couldn't, so now pay us for what we might have had.\"\n\nIt's so easy bullying governments, after having successfully dismantled them in so many ways already.  They have no dignity left it seems, pomp and circumstance notwithstanding.\n\nSome of the representatives in the US Congress who still take their jobs seriously are insisting on doing at least some reading of the LAWCAP edicts.\n\nThe Intellectual Property and Environmental chapters were wikileaked awhile back which helped stir the public at least a little (mostly the mass media steers clear of TPP).\n\nAs someone at the open source / open data end of the spectrum, I wonder which [big pharma company](http://controlroom.blogspot.com/2012/02/munching-on-medical-data.html) will be first to open source some important drugs voluntarily instead of being seen for all time to be fighting tooth and nail in a knee-jerky LAWCAP manner to be a deliberate bottle neck / choke point versus a healer and benefactor of humanity.\n\nYou'd think the branding people would understand \"brand loyalty\" better.  Isn't the market supposed to be drenched in information?  That's what Pareto Optimality is all about, no?  Transparency?  Shared awareness of costs?\n\nSuch a ridiculous spectacle these \"corporate persons\" provide to the world stage.  So [worthy of parody](http://worldgame.blogspot.com/2004/11/yes-men-movie-review.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}