{
  "id": "5555782671376446684",
  "title": "Wanderers 2009.6.10",
  "published": "2009-06-10T05:26:00.000-07:00",
  "updated": "2009-06-19T15:34:32.642-07:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/3614141861/)The plan was to show up on time, given we had a guest presenter, but when I saw Katie Couric was doing a short on the history of [Donald Duck](http://worldgame.blogspot.com/2008/10/duck-typing.html) as a final news story, I had to linger and watch.  I had no official duties at Pauling House, in terms of set up, arrived the same time Barry did to find a full house, our speaker still on the way.Earlier in the day, I'd had one of those \"you're breaking up\" conversations with Alaska regarding state standards, charters and such.  I took my [usual position](http://mathforum.org/kb/thread.jspa?threadID=1952850&tstart=0), that if your state isn't doing anything around [V + F = E + 2](http://worldgame.blogspot.com/2008/11/posting-from-my-xo.html), using that to anchor the concept of \"dual (or reciprocal) polyhedra\" then you live in \"a loser state\".  It's [an easy position](http://mybizmo.blogspot.com/2009/05/show-me-polyhedra.html) for parents to understand, and a conservative one, as we have no business dropping polyhedra from geometry, a wisdom of the ages and basis for architecture and chemistry alike (we meet in the Linus Pauling House, so are especially aware that chemicals form [polyvertexia](http://www.flickr.com/photos/17157315@N00/2987035149/in/set-72157600254540815/) or \"molecules\" as we call them).The talk, on Netness, by Sheldon Renan, was mostly about connectivity (interoperability) and Moore's Law.  This was one of those frustrating talks where you don't know what you're getting, if anything, until well after the fact.  The guy has a track record, reminded me [of Paul Laffoley](http://worldgame.blogspot.com/2009/02/1-2-3-marketing.html) a little, in his accounts of heroics.  He talked about Xerox-Parc and Intel quite a bit, various geniuses he'd known.  He also introduced us to an interestingly young entourage, [a cyborg anthropologist](http://oakhazelnut.makerlab.com/thesis/) and [a typographer](http://bram.me/), who turned me on [to Gentium](http://scripts.sil.org/cms/scripts/page.php?site_id=nrsi&item_id=Gentium) (we also discussed [Akbar font](http://controlroom.blogspot.com/2009/01/operations.html)).I spent most my time standing, plus had airport chauffeur duty looming (really early today) so left with a new Wanderer for some quick discussion outside, where we could [raise our voices](http://mybizmo.blogspot.com/2009/06/out-riding.html).  After lots of chatter, Don dismissed people to The Bagdad and our crowd dispersed.  [Aldona](http://www.flickr.com/photos/17157315@N00/3471303736/in/set-72157617170752129/) liked the talk.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}