{
  "id": "7282255519624438413",
  "title": "Wanderers 2015.11.11",
  "published": "2015-11-11T19:20:00.002-08:00",
  "updated": "2015-11-28T21:16:07.795-08:00",
  "content": "I made it to Wanderers this morning.  This group has met in the Linus Pauling House for many years, settling on a Tuesday night, Wednesday morning weekly format, often just a wandering conversation, whoever's there spinning it one way or another.\n\nI remember as a little kid looking up at \"grownups\" (much taller) and listening to them talk.  I noticed this form called \"conversation\" could twist and turn quite a bit, depending on whom were the talkers. Other times there'd be \"an agenda\" and the talk might be less free form.\n\nCarol took off on the bus for Pioneer Place, where Veterans for Peace were holding their annual vigil [for Armistice Day](http://worldgame.blogspot.com/2012/11/armistice-day-2012.html), a name that recalls the war is against outward war; we haven't given up by accepting Endless War as our \"evermore\" end fate (to quote the raven).  The goal all along has been to get beyond outward war, even if we still fight about stuff.\n\nA few people really groove on outward war though.  The simulations have been getting better and better.  Perhaps with the next version the few holdouts will give in and go out and buy a console.\n\nToday the conversation wandered through the geography of Oregon, where some of us (not me) were well traveled.  Yes, I've seen the Canyonville Museum, been to Fossil, but these were once in a lifetime experiences for me, whereas for many long time Oregonians, this is all more of a familiar stomping ground.  I'm lucky if I make it either to the coast or over the mountain to the high desert, like to Mount Scott in Terrabonne.\n\nOSCON is earlier this year.  I don't know if I'll make it to Austin, but I'm checked in as a proposals reader again.  Open Source is not to be taken for granted, oxymoronic though that sounds (doesn't Open Source mean Free -- so why not take it for granted?). \n\nFree as in freedom (vs. \"free\" as in beer) requires protection, and I understand Veterans who say freedom is worth fighting to preserve, even when that means engaging in outward wars.  I'm not the backseat general who sees how it all could have all worked out better with me calling all the shots.  I keep calling shots though, some of them.  I have a front row seat on some \"operations\" (doctors call them that too).\n\nThe local news tonight talked about the Blob, which may be starting to dissipate.  We haven't been hearing much about the Blob on televised media, or at least I haven't, so I'm glad to see more of that information getting out, KOIN the one breaking the news.  Charlie Rose anchored the CBS News that followed.  I left the radio on downstairs, along with the space heater, for the dog, and retreated up to my direct broadcast TV.  I also pay for some of the same stations through CenturyLink.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}