{
  "id": "4139899776150546959",
  "title": "Wanderers 2016.11.9",
  "published": "2016-11-09T09:56:00.004-08:00",
  "updated": "2016-11-09T14:07:55.237-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/30794357011/in/dateposted-public/)\n\nWe're convened at the Linus Pauling house. I came in late and found the discussion was about municipal restrooms, public infrastructure, its state in our city.  That was something we looked at during OPDX as well, an ongoing issue.\n\nGlenn bravely agreed to do a presentation, the morning after election night.  I expect we would have rehashed the electoral results had we not preprogrammed the discussion.  Glenn had a bag of books he's been reading and did a \"reading rainbow\" kind of thing.  The focus was public policy.\n\nWe're also talking about drugs and [drug pushing](http://mybizmo.blogspot.com/2016/08/drug-pushers.html).  The legals don't call their hype or advertising \"pushing,\" a term used to differentiate themselves from the black or grey market competition, which they marginalize through criminalization.\n\nSpeaking of which, Proposition 64 passed in California.  Law enforcement doesn't see criminalization i.e. locking people up, as having anything to do with public health, because of course punishment for crimes is unrelated to providing remedies for social ills.\n\nThe military is a big user of drugs as well, with government approval and encouragement, also as a source of funds for \"black ops\" (unaccounted for, off the books). Warlords & Ganglands is a hot seller game in supermarkets this Christmas.  No wait, I made that up.\n\nGlenn's commentary is somewhat along the lines of Michael Moore's [Where To Invade Next?](http://controlroom.blogspot.com/2016/10/where-to-invade-next-movie-review_66.html) in that he's circling relatively more enlightened approaches in other countries that it might pay to adopt, Finland's in particular. \n\nDirect A-to-B action, which always looks so rational and right, turns to unobtainium rather often, doesn't it? \"Precession\" is not big in most vocabularies (not even in my spellchecker -- now it is), along with \"deliberately non-straight lines\" -- two Buckyisms we pick up reading Synergetics (not a popularization of anything, so not really that popular).\n\nThe psychological commentaries [by Maurice Nicoll](http://worldgame.blogspot.com/2016/10/ethnic-schools.html) seem pretty clear on a \"second force\" which is not equal and opposite (as then nothing would happen) but almost, with a resultant payoff or outcome. The payoff may not be what one expected though -- alluding to last night's election.  Nature tends to be surprising, the future unpredictable.\n\nNicoll's system is psychological though, not counter-posed to Newton's laws.  Synergetics actually paints action - reaction - resultant vectors into its low level event physics, somewhat a break with the past, and therefore more of an uphill project.  Anyway, something to think about.\n\nI was thinking of heading to Th'underground today.  Measure 97 went down to defeat, despite our best efforts, but I haven't given up on #CodeCastle, a project relating to [teacher training](http://mybizmo.blogspot.com/2016/07/measure-97.html).  However Wednesdays feature a special schedule with shortened hours as I recall, given the space doubles as a food distribution site. Th'underground is a coffee shop in the #CodeCastle basement.\n\n[](https://www.flickr.com/photos/kirbyurner/30249525473/in/dateposted-public/)\n\n:: political cartoon ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}