{
  "id": "9002333127640729006",
  "title": "Wanderers 2019.2.19",
  "published": "2019-02-19T21:13:00.003-08:00",
  "updated": "2019-02-20T14:47:13.993-08:00",
  "content": "I haven't chronicled a Wanderers meetup in awhile.  Tonight's had all the elements.  Or at least the more unstable ones.  I will explain.\n\nDick Pugh, the former high school physics teachers, [meteor man](https://worldgame.blogspot.com/2017/12/meteor-man.html), and sometime before that, a worker on top secret projects for government labs, also known as the Manhattan Project.  He launched into his well-rehearsed lecture on radioactive decay, through all the byproducts.  Isotopes anyone?\n\nI used a pause to interject [Hugh Thomforde's story](https://mybizmo.blogspot.com/2011/03/corporation-meeting.html) of going to the Cook Islands to share about pearl farming.  The locals seemed interested until he mentioned the pearls would need to form around  \"nuclei\".  They suddenly lost all interest, thinking he was starting down that ugly path. Hugh had to further \"disambiguate\" as we say on Wikipedia.\n\nDick went on with the radioactive decay lecture (shades of Asimov).  I remembered I needed to buy fish and ducked out through the back door to grab the last sockeye salmon fillet.  I was back in my chair before anyone missed me. \n\nThe history books say Japan was the only country nuked, forgetting the fact that the US nuked itself, over and over, and yes, with people there.  Sometimes the people were put there on purpose.  Who knew that lithium might get involved in the chain reaction?  The Bikini explosion was a bit more than was planned for.  Even the mainland got nuked, many locals irradiated, although not on the scale of [Nagasaki and Hiroshima](https://worldgame.blogspot.com/2007/08/remembering.html).\n\nThe long and short term health effects on Americans in the vicinity was all a part of the experiment.\n\nAfter Doctor Strangelove came out, the word went around the circuits Dick was in (top secret) to keep quiet about it. No comments were welcome.  What was eerie about that film was the cockpit sequence, wherein they had the whole procedure realistically displayed.  Dick said they'd redacted some of those parts, in later editions of the movie.\n\nWe talked about other topics of course.  [Barbara](https://worldgame.blogspot.com/2017/09/fall-equinox-celebration.html) brought up the [PDX Death Café events](http://deathtalkproject.com/pdx-death-cafe/):  \"At a Death Café people drink tea, eat cake and discuss death. Our aim is\n to increase awareness of death to help people make the most of their \n(finite) lives.\"  How would you like to be remembered?  What were your accomplishments and so on?\n\nI've been looking back on some of that myself, doing a retrospective set of videos.  [From the Underground Railroad](https://medium.com/@kirbyurner/from-the-underground-railroad-93390c678891) is my latest attempt to encapsulate what I've been up to, all these years.  At sixty, I'm statistically likely to get some more years, but that's never a promise or guarantee.\n\nFrancher has been reading 24/7: Late Capitalism and the Ends of Sleep and gave us a synopsis. I see I can get it for my Kindle for $10, however I recently split for Safari Books and might have reached the end of my reading budget.  Besides, I'm still plowing through the free Gutenberg Press version of H. G. Wells, on [Washington and the Riddle of Peace](http://worldgame.blogspot.com/2019/02/riddle-of-peace.html). \n\n[Don's boat Meliptus](https://mybizmo.blogspot.com/2012/05/memorial-day.html) almost went down last night.  A leak around the exhaust pipe went undetected until he was back to the boathouse and about the close down.  He heard the aft bilge pump working.  That was his cue.\n\nAfter stuffing a towel in the hole, he managed to turn the boat around and hoist it up be its rear (no room at the gas dock). Had he not heard the pump, it very likely would have sank to the bottom.\n\nHeading into the Linus PaulingHouse, [#Portland](https://twitter.com/hashtag/Portland?src=hash&ref_src=twsrc%5Etfw) [#Oregon](https://twitter.com/hashtag/Oregon?src=hash&ref_src=twsrc%5Etfw)for a fascinating presentationon nuclear history, concepts,and builds.Alpha, Beta, and Gamma, oh my.A Wanderers meeting is alwaysan education.[#pdx](https://twitter.com/hashtag/pdx?src=hash&ref_src=twsrc%5Etfw) [#science](https://twitter.com/hashtag/science?src=hash&ref_src=twsrc%5Etfw) [#history](https://twitter.com/hashtag/history?src=hash&ref_src=twsrc%5Etfw) [#nuclear](https://twitter.com/hashtag/nuclear?src=hash&ref_src=twsrc%5Etfw) [pic.twitter.com/VRptCi3bzU](https://t.co/VRptCi3bzU)\n— Deke Bridges (@dekebridges) [February 20, 2019](https://twitter.com/dekebridges/status/1098067495741583360?ref_src=twsrc%5Etfw)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}