{
  "id": "8223219148974964962",
  "title": "War Planning",
  "published": "2016-06-21T10:51:00.002-07:00",
  "updated": "2016-07-03T10:36:03.819-07:00",
  "content": "Watching documentaries [about Egypt](http://worldgame.blogspot.com/2016/06/the-square-movie-review.html) and Turkey, and the fate of Islam therein, has reminded me how much Islam suffers from oppression at the hands of [so-called \"secularists\"](http://mybizmo.blogspot.com/2016/06/love-is-verb-movie-review.html) who think their job is to oppose all religion, except maybe some state religion that cozies up to them.\n\nReligions harbor [pacifists and idealists](http://controlroom.blogspot.com/2010/02/notes-from-lunch.html), which need not be terrorists, but what's terrifying to militarists is a shortage of recruits.  How does one carry out Endless Wars in the face of a burgeoning civilian economy with attractive lifestyle opportunities for women as well as men?\n\nMaking civilian lifestyles untenable (unsustainable) is step one, and this is relatively easy when the atmosphere permits raining down bombs on civilians.  This has been the status quo since at least [the Franco-Hitler alliance against Spain](http://mybizmo.blogspot.com/2009/11/into-fire-movie-review.html), in which many courageous Englishmen lost their lives, fighting for Spain.\n\nFDR was warned, by [Ernest Hemingway](http://worldgame.blogspot.com/2009/11/kicking-can-down-road.html) in particular, about the advance of military fascism.  The world was sick of Endless War by then.  [Bertrand Russell](http://coffeeshopsnet.blogspot.com/2010/05/buzz-about-shops.html), a pacifist, only reluctantly came out as pro fighting against Hitler.  The US was having none of it.  Until Pearl Harbor that is.\n\nBut the wave of military fascism was not stopped by WW2 and US Americans saw their civil liberties curtailed like no time since the Civil War, given the new fight against \"Communism\" in Korea and Vietnam.  \"Fascism\" was no longer the enemy it once was.  Joe McCarthy, Richard Nixon his protege, had other enemies to prosecute.\n\nMuhammad Ali defied the fascists and stood up for his rights as a civilian, converting to Islam in the process.  Islam was a source of pacifism during this period, providing meaning and hope to millions in America's racially divided cities.  The fascists would incite them to violence though, as radicals make easier targets in terms of PR.\n\nWe see the same phenomenon in Turkey and Egypt:  make Islam seem radical, a major threat.  The pacifists won't seem that way, but others will be lured into the limelight to make the case.  Focus on the radical elements within any group, in order to marginalize the ones making the most sense.\n\nIndeed, some zealots will be already radicalized and won't need much encouragement to throw stones, at which point they may be shot, unless on the \"right\" side, in which case they're Freedom Fighters.\n\nEndless Wars requires these \"right\" and \"wrong\" sides, endlessly, with little chance to debate as resorting to violence is the whole point, though often with prior lip-service to \"diplomacy\" which the endless warriors pray will fail.\n\nLooking ahead to its superpower responsibilities with only a volunteer army, still largely based on the pressure of untenable civilian lifestyles, the Grunch war planners realized they'd need to tap women in much greater numbers.  Appealing to their sense of patriotism might work, despite the transparency of [the thin disguise](http://worldgame.blogspot.com/2016/06/golden-rule.html).\n\nThe \"equal opportunity\" to get drafted and sent to a base anywhere around the globe, perhaps to die doing onerous duty, is what feminism then became, in media campaigns designed by the military and shared on public radio.  Not only men should welcome this opportunity to serve their masters.\n\nHowever the degradation of the biosphere, brought on in part by Endless Wars and wasteful ways, was making it obvious that the larger ecosystem (economy) was in jeopardy and principled pacifists, wanting instead to help heal the Earth, formed into vast networks of conscientious objectors.  Sufis and Quakers got together on this.\n\nFaced with the prospect of growing pacifism, the military fascists needed ways to suspend the Bill of Rights and further erode the tenability of civilian lifestyles.  The prospect of firing up a full scale planetary war between the religions was starting to look unlikely, thanks to anticipatory networking.\n\nMuch time has been lost in the meantime, as cleanup and environmental projects get postponed.  The attack on [civilians in Syria](http://controlroom.blogspot.com/2013/08/city-of-morons.html) was maybe a tipping point, proving that those puppetting the nation-states were more into sponsoring Endless Wars than into caring about innocent civilians, seen as \"collateral\".\n\nThe tech sector, in the meantime, is into sharing banking services and [the benefits of cryptography](https://advocacy.mozilla.org/en-US/encrypt/social/4) with an ever larger percentage of humanity, along with the ability to fact check misinformation and recognize media campaigns for what they are.  Misinformation, as a tool, is becoming harder to use, as it's getting easier to find inconsistencies in stories that don't hold water.\n\nAs women pour into tech and realize the elements of tenable (sustainable) civilian lifestyles are all present, their eagerness to capitulate to military fascists and their Endless Wars continues to wane.  The pacifist networks have already set these wheels turning in a big way.\n\nSo what will the fascists try next?  Demonizing Islam, as all about violently oppressing women, has worked well in the past, but is these days looking too predictable and socially engineered.  Fewer diplomats are falling for it.  However, the campaign seems to still work with a new group, the New Republicans (not quite the same as Neocons, though maybe not all that different?).\n\nHowever, the pacifist networks are global in scope and get through on many channels with their message of hope and better prospects.  This religious message, of Peace on Earth, even has some Christians behind it.\n\nThe fascists face a globally active form of religious pacifism and their efforts to demonize Islam may not be enough to keep the Endless Wars going.  Is there a way to demonize pacifism itself?  Stay tuned.\n\n[](https://www.flickr.com/photos/kirbyurner/27165472964/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}