{
  "id": "4701703176751696446",
  "title": "War and Christmas",
  "published": "2016-09-09T11:42:00.001-07:00",
  "updated": "2016-12-25T14:28:32.452-08:00",
  "content": "I recently learned the mantra that some unnamed nation is into \"War and Christmas\" as its two major products and themes.  To modern ears that sounds Dark Ages, like the Crusades.  However some schools promote the Crusaders, as well as [the Conquistadors](http://controlroom.blogspot.com/2007/01/aguirre-wrath-of-god-movie-review.html), as \"the good guys\" even to this day, and even the non-violent will speak of \"the Lamb's War\" as a metaphysical jihad.  Santa actually loves giving out guns, as we learn from many believable Google Images.\n\nMuslims and Christians came together in the civil rights movement, back when Malcolm X and MLK were contemporaries. They didn't agree, but in striving for greater equality and more respect for human rights, they brought two traditions into close proximity, and put them on the same side.  A fusion of Islam with Christianity along some branches, such as Sufi, has already occurred.  The Parliament of World Religions events have offered previews.  Muhammad Ali followed his conscience in ways Christians around the world openly respected.\n\nFor my part, I'm not going to blame Americans for not being in the mood to shop until they drop, given all the news they're getting is to the effect they'll be dragged through wars for the rest of their lives, even as the planet continues to overheat.  Humans appear to be an incompetent species, for all their advantages.  Why blame people for wishing (even praying) the world were otherwise?  Maybe novels and escapist fiction movies will do well.  The November - December lineup of movies promises brief respite from World at War, at least for a couple hours.  [Cartoons will be big](http://mybizmo.blogspot.com/2016/12/christmas-2016.html).\n\nBoard games and computer games, a few of them serious enough to be \"[simulations](http://worldgame.blogspot.com/2016/08/hp4e-continued.html)\" will likely sell well.  However I think it's unrealistic to expect civilians to stay completely mindless, even if that's their supposed economic role.  Minus much spark of hope or optimism, objectively measurable, I'm expecting showy Affluenza will be about as popular as Zika as a \"look\".  Ostentation in trying times has a way of appearing ridiculous, to the point of tasteless.  Extravagance and war as a combo, just seems garish.  War means frugality and thrift.\n\nI'm not suggesting the malls will be ghost towns.  Lloyd Center, one of the first such shopping malls in the country, is working hard on the latest remodel, hoping to recruit more loyal shoppers. However macro-economics matters more than micro-economics sometimes.  The world has committed a lot of resources, both physical and metaphysical, for the exclusive use of those into military theatrics.  I expect sales of booze and mind-altering substances to remain high, as they do [in the battle zones](http://worldgame.blogspot.com/2008/06/random-zine-covers.html).  People seek to mitigate their pain by whatever means possible.\n\nSome have suggested boycotting the shopping aspect of Christmas, withdrawing consumer support for the economy to the extent civilians get excluded from solving world problems more amicably.  This is hardly a new idea. \"I'll do it because I want to and not because you tell me to\" (take vows of poverty). Christmas used to come around with the slogan \"peace on Earth\", which we're hearing less and less of late.  Minus the meaningfulness of the occasion, shopping \"just for the hell of it\" starts to lose steam.  Civilians become refugees in their own economy. Some sign up for war duty, minus other options.\n\nWill some of the new branches (Quaker?) result in new intentional communities?  We might be able to get some interesting Reality TV from some of these, and more reasons for hope.  I've already brought up the product placement opportunities a million times.  I wouldn't call myself anti-advertising.  On the contrary, I'm eager to support a more robust civilian economy.  These could be high tech camps ([campuses](http://controlroom.blogspot.com/2016/08/refugees-camping.html)) with ample bandwidth.  What companies would sponsor those?  REI?  North Face?  [Boeing](http://mybizmo.blogspot.com/2009/01/about-habitats.html)?  Many Jewish faithful are ready to experiment with more promising forms of settlement.\n\nHaving everything [Iron Mountain](http://controlroom.blogspot.com/2008/12/iron-mountain-revisted.html) is simply not conducive to celebrating Christmas.  War has a Grinch-like effect.  The \"War and Christmas\" business model doesn't look all that sustainable, but from what I read, many Economists think it's a given or the best we've got, or something along those lines.  I'm more into GST than Economics, so sometimes have trouble following their logic to its bitter conclusions.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}