{
  "id": "113786419817848536",
  "title": "Web Wrangling",
  "published": "2006-01-21T11:43:00.000-08:00",
  "updated": "2006-11-15T11:44:14.777-08:00",
  "content": "NPYM's nominating committee (nomcomm) approached me about webmastering for [NPYM](http://www.npym.org/) and I originally said OK.Then it turned out the leadership had no keys to the website -- I'd have to go to whomever is being relieved of duty and beg for the keys (not that this is the actual soap -- the current webmaster and I are friends -- but it could be, procedurally speaking).  Bad process.NPYM needs to be able to change the locks at will. The outgoing webkeeper simply finds the web site subaccount has been rekeyed, while the new webkeeper gets the new keys by some channel. Keys to the master account, with control over the subaccounts, stays with a trusted inner circle (say the NPYM secretary and clerk).Otherwise, what if we were infiltrated by a bogus webkeeper who then spray painted \"work of the devil\" all over our pretty NPYM website? More realistically, the webmaster might just start making all kinds of design decisions that don't jibe with our sense of who we are, and refuse to change course even in the face of negative feedback.Is NPYM going to say \"please kind sir, we'd like you to stop\"? That's silly. That's the tail wagging the dog. Just decide it's not working out, change keys, restore from the backup. Should take about 30 seconds, once the decision is made.The only way to really challenge NPYM at that point, once the web site is truly secure, is to define a schism, i.e. some breakaway rebel team says \"we're the real NPYM.\" Happens all the time in religion. In politics too i.e. governments in exile. Or the rebels might just create their own namespace (which is how NPYM itself came into being, having \"branched off\" from PYM).After finding out how ramshackle and unprepared the NPYM leadership was to do the job correctly, I started to reconsider. Do I really want to work this hard, starting from scratch with a bunch of amateurs?My prior commitment is to [Nirel](http://mybizmo.blogspot.com/2005/08/web-wrangler.html), web wrangler for [Wanderers](http://wwwanderers.org/). We've never paid her anything, and Wanderers itself is a full time job for Don, her dad (likewise uncompensated). This volunteer family does a dynamite job in my estimation. NPYM is back burner compared to Wardwells and Wanderers in my book, when it comes to advancing my design science agenda (Fuller School business).So I changed my mind and said no to NPYM nomcomm.  Some other time maybe.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}