{
  "id": "5526051493648878723",
  "title": "Weighing In",
  "published": "2022-09-21T19:19:00.003-07:00",
  "updated": "2022-09-23T14:19:30.629-07:00",
  "content": "I'm not one to frequently weigh in on what everyone's talking about, nor pile on where others are piling.  That behavior is less out of snobbery, I would claim, than out of respect for those more into it than I am.  \"Let's not be redundant\" I tell myself.  I'd prefer to be effective, have some leverage.\n\nThat being said, I think the former oval office guy is being consistent with his narrative the election was stolen. That's why he was a government in exile, still privy to all the secrets because one has to govern, it's a responsible job.  Never mind the view out the window is of an ocean and golf links, and not The District. In this day and age, one works remotely, especially if one is a powerful president.\n\nTo have the \"imposter administration\" (in his mind) push back against this public psychosis, shared by many who follow the one, is rubbing salt in the wound of an illegal defeat.  When sinners act against God's will and depose one of his chosen ones, they must be punished.  There's consistency there too.\n\nAm I saying I'm on the side of Mr. T?  I'll admit my narrative includes an \"impotus\" in the oval office ever since at least Reagan, owing to lack of a truth process regarding the intrinsic unconstitutionality of having high offices in the pocket of The Grunch.  The monied have captured the democracy, which then died in darkness.  Getting back on track will require shining more light on the process and coming up with some new circuit designs for motherboard Earth.\n\nHowever my narrative is not overtly partisan.  The two parties remain to duke it out, with founder ideals trampled underfoot. I think more people would say I'm part of a \"cult of personality\" in seeming to kiss the ground my Buddha has walked upon, that Buddha being one Guinea Pig B.  In translation:  my narrative about impotus and the Grunch inherits from American literature penned by a Medal of Freedom winner.\n\nMr. T's ego had utility as a driving engine and helped an audio-animatronic presidency seem more believable.  That same ego denied the validity of the electioneering behind 2020, but that's the only way voters know how to run an election.  Those who succumb too quickly to conspiracy theories (some of which will be true on occasion) got some therapy.  Too many conspiracy theories in thick succession (e.g. Venezuelan voting machines) tend to be self-canceling and self-undoing.\n\nNow the momentum of Mr. T. is underlining his ongoing unhappiness with the election results and his willingness to take active measures to defend his government in exile, in an alternative reality America that's being made great again (meaning it isn't great now -- a self-defeatist attitude, as many have pointed out).  Getting an audience whipped up enough to mount another attack will likely not work twice, given the evident weakness of the leadership.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}