{
  "id": "6132213382948203100",
  "title": "Weird Technoinvective",
  "published": "2009-01-09T09:29:00.000-08:00",
  "updated": "2009-01-09T10:04:51.435-08:00",
  "content": "From the Wanderers list (adding hyperlinks here); me swatting at something.  FAQ:  \"[what's technoinvective Dr. Urner?](http://mybizmo.blogspot.com/2007/07/adventure-in-vilnius.html)\"Yeah STEM is a big buzz word, see that on Math Forum, also in Anna's writings (she's the charter school founding home schooling Sarah Palin type in Wasilla, doing Thunderbird Charter based on STEM).What I [heckled IEEE about](http://worldgame.blogspot.com/2008/11/ieee-presentation.html) at Portland Center Stage is how it's all so much lip service, as here I am, giving [the basic STEM class](http://mathforum.org/kb/thread.jspa?threadID=1879421&tstart=0), focusing on [late 20th century sphere packing etc.](http://worldgame.blogspot.com/2009/01/techie-toons.html), which you'd think we'd be up to by now, yet I have approximately zero competition.  They cart kids back to their public school prisons in tears after [my class](http://www.4dsolutions.net/ocn/pymath.html), as that's probably the last light of intelligence they're ever gonna see.  Then it's [back to dark ages Oliver Twist](http://controlroom.blogspot.com/2008/09/please-sir.html) and anglophile curricula ([count me an anglophile](http://mybizmo.blogspot.com/2006/11/flushed-away-movie-review.html), but these curricula are from the time of Malthus-Darwin and we've come a long way since then).So I do tend to [snicker and sneer](http://mathforum.org/kb/thread.jspa?threadID=1879975&tstart=0) when I hear people tout their \"reforms\".  As a [back stage](http://controlroom.blogspot.com/2006/06/summer-retreat.html) kinda guy, I know they're just bluffing, have no intention of saying \"buckminsterfullerene\" in the context of teaching about hexapents ([e.g. nanotubes](http://mybizmo.blogspot.com/2006/08/hp4e.html)) which, if they have any clue about, they're not sharing (Alaska, on the other hand, does seem sincere, even wants to teach Python).  It's the lower 48 (48L) that serves as a base for a cesspool of scam artists, a lot of them big name foundations, very into strut-and-puffery (reminds me of pre-WWII in some ways).Anyway, not to sound too pessimistic, I don't think it's all up to the lower-48 where we go with STEM.  Japan has a lot of strong leadings, and South Africa has already been a key player, will continue to be so.  Alaska ain't so stupid either.  Even Guam is ahead of West Virginia I'd hazard (but then who isn't?).I'm just not looking to WDC for any leadership on this (Obama an exception -- he's from Hawaii, not L48), as legislator-lawyers don't have much math-science under their belts, can't think their way out of a paper bag, just take direction from Obnoxico ([cite my rants on Exxon Math](http://controlroom.blogspot.com/2008/12/exxon-math.html) recently -- hollow self-promotion in the wake of wanton eco-slaughter).Doug Strain was pretty funny on this, when talking about the transition to \"[cesium time](http://worldgame.blogspot.com/2005/09/wanderers-200597.html)\" -- lots of pretty boys in the Navy, acting all miffed, just because they couldn't wrap their heads around metrology (Doug's forte).  So they go down in history looking stupid, so what else is new?Kirby",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}