{
  "id": "114029035166011793",
  "title": "Welcome to Reality",
  "published": "2006-02-18T11:20:00.000-08:00",
  "updated": "2009-06-22T21:25:53.046-07:00",
  "content": "[](http://photos1.blogger.com/blogger/1134/545/1600/cooper.jpg)Writer / Director Stephanie Cooper(photo by K. Urner)Stephanie Cooper’s Welcome to Reality, a play in nine scenes, is set in Lone Oak, a small New England town wherein all the adults have committed to a rationalist / literalist mode of thinking, with two exceptions: a science fiction writer who speaks of his characters as if they were real, and a civil war buff who believes he was once a rebel captain (sometime before the car accident).  \n These latter two have no problem relating to Hannah, an eight year old with an imaginary friend, Mr. Teddy the giraffe. \n\n But Hannah’s mother and grandmother take the majority view that an imaginary friend is but a stepping stone to madness. Hannah should be focusing on learning to count past 29 (she has trouble with 30). They and other townspeople conspire to drum the two quirky eccentrics out of town, because of their supposedly subversive influence on the children.\n\n Ironically, many of these hyper-rationalist adults later prove defenseless against meme epidemics spreading through popular culture: Hannah’s father gets sucked in by the Left Behind series, and dissolves his family in order to preach about the coming Rapture in Washington, DC, while Hannah’s grandmother spends her life’s savings on a “Da Vinci tour” in France, organized around Dan Brown’s popular novel, The Da Vinci Code.\n\n I took Stephanie’s theme to be the danger in not recognizing and nurturing the double-barrel nature of the human psyche. We’re designed to think both logically and mythically.  Those who fail to responsibly mythologize as free-standing individuals tend to fall prey to mob mythologies created and propagated by others. \n\nTo stifle one’s powers of imagination, so evident in childhood, is to risk lowering ones immunity against oft times predatory and/or opportunistic belief systems in later life.\n\nThe actors, a cast of sixteen, put a lot of time and talent into this one-time performance of Stephanie’s senior project. Our venue: Ms. Brunel’s drama classroom at Whittier High School, on the evening of February 17, 2006.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}