{
  "id": "5899001446223830942",
  "title": "What Our Father's Did: A Nazi Legacy (movie review)",
  "published": "2016-06-27T16:14:00.002-07:00",
  "updated": "2016-07-02T10:57:01.393-07:00",
  "content": "This documentary consists of an extended conversation between three principals:  two sons of high ranking Nazi officials, and a lawyer, Philippe Sands, who's family was wiped out in the holocaust about seventy years prior to when the film was made.\n\nThe lawyer is professionally prosecutorial towards Horst, who believes his father did what little he could to resist the Final Solution, but \"high ranking\" doesn't mean \"standing up to\" (quite the opposite).  People in a military machine are \"just following orders\" (a standard defense).\n\nIs responsibility the same as guilt?  What is responsibility?  In [the est Training](http://controlroom.blogspot.com/2009/12/some-storytelling.html) (no longer offered), each individual had an opportunity to accept responsibility for the Holocaust, but that includes people like me, not born yet, and the namespace was philosophical more than juridical.\n\nHorst is not even close to a Holocaust denier.  He accepts what happened during World War Two.  However he had a good experience of his father and sees him as a decent man caught up in events beyond his control, and who did his best for the Ukrainians at least, but could really do nothing for the Jews, given wheels already set in motion by Hitler's killing machine. \n\nThe other son, Niklas Frank , thinks his dad Hanz Frank, the \"butcher of Poland\" got what he deserved, and despises the way Horst, who's father worked for the butcher, continues to defend his father's record as a Nazi functionary.\n\nThe film contains footage never before made public.  The girl in the red dress, in the Warsaw ghetto, or was that Krakow, connects us cinematically to Spielberg's Schindler's List.\n\nHorst's dad, Otto von Wächter, died under the protection of the Vatican and was [never tried in Nuremburg](http://mybizmo.blogspot.com/2015/12/hannah-arendt-movie-review.html), allowing Horst to take refuge in his longer view of history.\n\nHorst is something close to Jewish himself given his own brand of scholarship.  He became an assistant to the famous Jewish artist, [Hundertwasser](https://en.wikipedia.org/wiki/Friedensreich_Hundertwasser), and [captained that artist's ship Regentag](http://www.hundertwasser.at/english/oeuvre/arch/arch_regentag.php) to New Zealand.  Horst's own home was the secret meeting site of a former art colony focused on the teachings of [Hermes Trismegistus](https://en.wikipedia.org/wiki/Hermes_Trismegistus) as passed down through a Hebrew line.\n\n\"We tend to see people as victim or perpetrator\" says the Philippe, but then the justice system is all about discovering who or what to blame.  \"Command responsibility\" has specific meaning in an international court of law.  The lawyer is sure Otto would have also been sentenced to death for his war crimes.  I have no reason to doubt his conclusion.\n\nI learned a lot from this film and would recommend it to anyone studying World War Two or the Holocaust.  Also Shoah.  There's quality content here for art historians and architects as well.\n\nI realize I take after grandma Esther, my dad's mom, in being eclectic in my reading and viewing habits.  She would likely have loved Movie Madness and its wide selection, of documentaries especially.\n\n[](https://www.flickr.com/photos/kirbyurner/27898795502/in/dateposted-public/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}