{
  "id": "7927753417784412071",
  "title": "What is Socialism?",
  "published": "2018-01-16T17:58:00.004-08:00",
  "updated": "2018-01-16T18:30:19.605-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/25841923568/in/dateposted-public/)\n\nThe short answer is: I have no idea. My fancy Princeton education only served to sensitize my ear to the \"meaning as use\" paradigm, meaning I need to study a given language game rather extensively before I have a sense of its meanings, should I ever develop an ear for said language.\n\nAny randomly chosen pair of people, asked to talk about \"socialism\" will likely talk past one another, and neither may realize it.\n\nConsider a sibling question: what is capitalism? I have a wildly divergent meaning up my sleeve, a use in contrast with nationalism.  Nationalists see the world in terms of various nations, vying for world domination.  Capitalists see capitals instead, city-states, like Tokyo and Madrid.  Capitalism is the world game of world capitals, some of them sister cities.  No one but me has that meaning for that word.\n\nI'll define socialism like this:  I work for the public half the year, and for myself the other half.  People talk that way about taxes:  given the government took X% of my total gross, I worked for the government Y% of the fiscal year.  Fine, let's say it that way.\n\nWhat makes this system \"progressive\" is that we all chip in for the common good only 50% of the time.  Whether you're a neurosurgeon or bartender or stand-up comic, you get half your life to do whatever you like whereas the rest of the time you're engaged in community service.\n\nNow I'll get theological on ya and suggest that God is a socialist.  Ideally, you're acting in accordance with God's will half the time, whereas the other half you're given over to tempting alternatives, working in ways that might prove purely selfish, but from your point of view were worth a try.\n\nWorking for God feels a tad totalitarian, a little bit Big Brotherish. Subduing your own will to serve the all-powerful is like that.  Exercising your own ego feels rebellious in contrast.  You're going out on some limb, by choice.  Half the time.\n\nStandard theology says God has forgiven us our Free Will in that without it, we couldn't choose to obey, so our coupling our will to God's would be an empty gesture. Thanks to our ability to stray from God's path, we partake of the divinity of Angels.\n\nThis must be a kind of Religious Socialism, not necessarily Christian but neither anti-Christian either.  That's fortuitous as one way people like to attack socialism is by calling it godless, meaning they consider it to have no ethical compass.  Somehow capitalism is supposed to have one.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}