{
  "id": "1394239563161865341",
  "title": "What is \"Work\" in GST?",
  "published": "2018-02-17T14:28:00.002-08:00",
  "updated": "2018-02-17T14:35:03.971-08:00",
  "content": "I was blessed with a visit from Sam Lanahan today.  He was fresh from a concrete convention, which had worn him out.\n\nTurns out Flextegrity has applications as a replacement for rebar.  Asian markets may understand it best, given they're in surge mode while a wartime economy (what the US enjoys) of necessity involves throttling back (applying the brakes, in other words). By Flextegrity I mean to include C6XTY. See the newest version of Sam's book.\n\nMostly I'm cramming on statistics, going back to high school days and relearning about how sample variance and population variance each need their own formula.  I'm moving into linear equations territory (y = wx + b and back propagation by means of gradient descent i.e. multi-variable calculus and machine learning) not because I expect to become a data scientist, but because I'm a Python instructor.  Like a piano teacher, these are the pieces I'm expected to play and relay.\n\nRemember, statistical (stochastic) algorithms were developed in the social sciences and ported over to thermodynamics.  If \"entropy\" still has the flavor of \"political chaos\" there may be reasons why.  Sometimes \"entropy\" is a positive, as in cryptography, as true randomness proves problematic in a deterministic universe.  A legitimate source of chaos proves a godsend.  By God's grace alone are we liberated from our own robot-hood.  Automaticity rules, a sin which can and will be used against us.\n\nThe many jargons (shop talks) bleed in both directions across their bordering membrane barriers, I can hear Peter Sloterdijk intoning, in native German.\n\nFor example: energy the way the physicists mean it, as work, has to mean something in terms of economics (having a job, or jobs) as well.  Take the Latin word \"tractatus\", a root for \"traction\" \"tractor\" and even \"tract\" as in \"opera\" or \"opus\" i.e. a dramatic \"work\" (Gilbert & Sullivan).\n\nPeople work hard to star in soap operas (an expression of their wish to remain clean?).  The meaning of \"work\" is not a constant, in that \"joules and calories\" vie with \"dollars and yen\" to express work's value.  \"To keep up this rate of energy expenditure (horse power), I'll need to be fed\" -- that's just physics.  Capitalism fantasizes not being responsible for human welfare thanks to robots.  But what can robots really do?  That's an ongoing exploration.\n\nAs general systems theory (GST) authors (Kenneth Boulding etc.) would sometimes talk about:  current and currency have much in common, in terms of the cyber metaphors applied.  Both dollars and electrons \"flow\" and without a steady flow of dollars (US, Canadian...), or other denomination, the \"machinery\" grinds to a standstill.  Cash liquidity is like oil:  grease the wheels.  We have our ways of repaying favors.\n\nA big problem (challenge) around World Game is ivory tower types devise the ground rules and spin out these board games, theoretically playable. However, given still emerging facts about human psychology, animal psychology, physics, other sciences, it turns out these games aren't always that playable as envisioned.   The ivory tower, full of know-it-alls, turns out to be not so all-knowing after all, an old story.\n\nIn practice, the rules need to be tweaked, if not overhauled, and pretty soon we're in some unknown territory where in people draw upon their own moral compasses regarding what's ethical.  They're disobedient.\n\nThis state of affairs is associated with higher entropy and \"[corruption](http://controlroom.blogspot.com/2010/05/wanderers-2010511.html)\".\n\nPeople are not following the edicts properly.  They're in violation.  A scandal.  History then turns into a procession of scandals, as the game architects continue to spin out one unplayable game after another.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}