{
  "id": "8978322781875578370",
  "title": "Where's the Fair? (movie review)",
  "published": "2014-12-15T00:57:00.003-08:00",
  "updated": "2014-12-20T09:47:34.619-08:00",
  "content": "[Where's the Fair?](http://www.imdb.com/title/tt2415482/) asks why the USA no longer seems to care about the World's Fair or Expo concept, having withdrawn from the international body that plans them while producing only lackluster pavilions and then only when goaded by foreign governments to step up to the plate.\n\nTalking heads propose various theories as to why the State and/or Commerce Department have dropped the ball, while the Freedom of Information Act begets a lot of heavily redacted documents.  No one seems to know for sure.\n\nThe film spends very little time on the Montreal dome of 1967, Buckminster Fuller's contribution, and mentions Kabul and Khrushchev not at all.  Minus the Bucky thread, perhaps too much of [the narrative](http://mathforum.org/kb/thread.jspa?threadID=2666220) unravels?\n\nWashington does not want to get trapped into doing another dome probably, while winning hearts and minds is an undertaking that city despairs of doing anymore, having alienated just about everyone.  \n\nThe confidence to spin truly hopeful visions of the future is not in the USIA's repertoire anymore, as there's [no longer a USIA](http://www.unc.edu/depts/diplomat/item/2013/0105/bk/book02_dillen_usia.html). \n\nI learned quite a bit from this film.  I had no idea Spokane, Washington had hosted a World's Fair in the 1970s, or maybe I'd known that once and forgot.   Archival clips from some of the events were exciting.\n\nPerhaps the USA is just too diverse to be represented by some out of touch State Department in any case.  Cascadia could have its own pavilion someday maybe?  GM did, in Shanghai in 2010, with its Chinese partner company.\n\nMilan 2015 will be the site of the next Expo.  The documentary suggests the USA will not have a pavilion but from the perspective of December 2014, we [do expect one](http://www.usapavilion2015.net/).\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg3D6H4uPpOhN4EmRDbxaaqITZg1fJ1Ym5Z2rNmg8ZCcRLTV0Tbn2YPFBgIQ-WcqShSX-l_tEmA3Rw6prVlCLHI96AVZgAEFEIEz9z1LB9jJcr9b-AuwQMwRfOZAlmX7kHTmyzN/s1600/pavilion-side.jpg)\n\n:: rendering:  usa pavilion 2015 ::\n\nFollowup proposal:\n[A possible food candidate](http://mathforum.org/kb/thread.jspa?threadID=2665156) for the American Food Pavilion",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}