{
  "id": "3867415364974638264",
  "title": "Where to Invade Next (movie review)",
  "published": "2016-10-22T16:46:00.001-07:00",
  "updated": "2016-10-24T16:32:48.173-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/30498324745/in/dateposted-public/)\n\nMichael Moore films follow the same pattern, well known in journalism, wherein we get to know the journalist as one of the players, an actor in front of the camera. \n\n\"Omniscient narrator\" documentaries, if political in content, tend to sound phony, though many oldsters will still hear a Wild Kingdom interpretation of animal behavior without hearing a mockumentary.\n\nThere's much to say about how the ear is tuned.\n\nSo here's this bumbling guy, playing the \"dumb American,\" stumbling around Europe and North Africa, getting a positive echo from the difference the USA makes, or made.  All those reforms Americans fought for paid off, in other countries.\n\nBetter benefits in Italy, school food in France, no drug wars or death penalty in Portugal, better prisons in Norway, better schools in Finland, more women's rights in Iceland and Tunisia, more affordable higher education in Slovenia.  The list goes on.\n\nEveryone gets more paid vacation than average USers.  Moore doesn't even mention [working for tips](https://www.fordfoundation.org/ideas/equals-change-blog/posts/american-tipping-is-rooted-in-slavery-and-it-still-hurts-workers-today/).\n\nNow these relatively happy and enlightened people are hoping what they see on TV about Michael Moore's home country is not their worst nightmare coming true.\n\nMichael Moore appears to come from some hell people wish to avoid, at this point.\n\nHow might we explain this grave turnaround in reputation, and will the USA recover?\n\nThe explanation offered has to do with a \"race to the top\" being harder to win than a \"race to the bottom\".\n\nThe recipe then, was to criminalize all [drug pushing](http://mybizmo.blogspot.com/2016/08/drug-pushers.html) outside legal advertising, as a way to keep people down and out and/or hard at work within \"chain gang\" prison colonies, thereby providing prison labor to Victoria's Secret and many others.  \n\nOperate some kind of Gulag in other words. Perpetuate slavery. Practice eugenics (war against the weak).\n\nWhether Michael's country will bounce back or not is one of the major soap opera concerns of our time, and if Wagner were alive he'd likely have given us some great Hollywood soundtracks about it.\n\nI'll settle for Weird Al.  Like John Oliver, he's wondering if this really could be hell that we've entered, have actually been in for quite awhile maybe.\n\n[Carol](http://mybizmo.blogspot.com/2016/10/mystics.html) has been especially eager to see this latest major box office Michael Moore flick.  She watched it from the big chair, wrapped in a quilt, eating popcorn.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}