{
  "id": "4368296008399357578",
  "title": "Which Hollywood Star for President?",
  "published": "2007-08-25T12:46:00.000-07:00",
  "updated": "2010-10-18T20:19:24.078-07:00",
  "content": "Hindu cultures have done much to mix celebs with politicos with minor dieties, and that may be catching on here, what with [President Reagan](http://worldgame.blogspot.com/2007/04/horse-country.html) & Cronies being such a smash hit at the box office with many voters.Who would we consider drafting today, of the Hollywood variety?I'd propose [Whoopi Goldberg](http://www.imdb.com/name/nm0000155/), though I'm quite aware of the hilarity and fast times we'd enjoy under the current [Governor of California](http://www.imdb.com/name/nm0000216/).I just like her Calypso energy whereas so many of the guys are so slimy and retarded (no offense guys, been there done that).It's all about balance.  We could revert to a John Wayne down the road, when all the shrill testiness has died down a bit.  Whaddya say voters?Back to reality:I like having camps champion constituencies, no question.  You don't have to be a huge party to be impressive.Take the [Pirate Party](http://www.piratpartiet.se/) in Scandanavia for example:  very exclusive, but walks a good talk, has clout.  Voters give it just enough credence to stay in the game, like adding hot sauce (them Veekings ain't cowards).In the USA, we're mostly supposed to declare Red or Blue to even get chips on the table.  Then at higher levels (e.g. intelligence community) it's like we're completely forbidden to play either Red or Blue cuz that's just \"too political.\"Go figure.  A nation of [turkeys](http://mybizmo.blogspot.com/2007/11/air-america.html) if you ask me [or Ben Franklin](http://controlroom.blogspot.com/2010/10/new-atlantis-movie-review.html) ([smile](http://mybizmo.blogspot.com/2008/11/smiley-guy.html)).[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEip7_rBhdtLSBpcwIGdTNDy9YYFEgI5FGhyphenhyphenLZZad25maXRtmcgWY5eChPdoyRJxtUeMMVSQQu0I7RoP-ZNsWAytQ8XQ9SYlez_2w5xEsRy_aYWq0jRc_gAY7SJMDp1ImsMWGFNR/s1600-h/kirby_bbq.jpg)for bbq",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}