{
  "id": "7782158734446607531",
  "title": "WILPF Festivities",
  "published": "2015-09-26T19:07:00.004-07:00",
  "updated": "2021-03-17T09:03:22.776-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/albums/72157659076799646)\n\nThe gala events were in The Hague, NL, and Carol (my mom) got to go, as an official delegate this April, when the Women's International League for Peace and Freedom celebrated a hundred years of existence.\n\nOne hundred years ago, Grace De Graff -- who'd moved to Oregon from Illinois, to become a school teacher, administrator, and education planner -- was at the league's founding in The Hague, invited by Jane Addams herself.  Jane was on the lookout for strong manager women, still struggling to gain basic parity, in terms of rights, with men of privilege.\n\nToday's events were the Portland, Oregon WILPF chapter's version of a Centennial, and I was invited to be one of the photographers (I believe technically I'm also a member of WILPF).\n\nCarol Urner wrote a letter to the Oregon Reporter in the early 1960s, when I was pre-school aged, expressing fear and disappointment that this was all she had to look forward to:  a lifetime of fear under the threat of thermonuclear war.  That was no kind of world in which to bring up children, surely Russian moms agreed.  She'd wished so long for a family life, and having it end up a twisted science fiction nightmare in the wake of WWII was just heartbreaking and she wrote that to the newspaper.\n\nAdult readers, other mothers especially, from all over town responded by telephone the next day, really wanting Carol to cheer up as \"we can do something\", and so a Portland women's movement was formed, to create some outcry about the standard assumption that we should all be buying and installing bomb shelters, with kids learning to duck and cover.\n\nThis movement later fed into WILPF, already active, and discovered by my mother and her friends as a perfect fit for their concerns.  Another famous WILPF member: Ava Helen Pauling, wife of the two time Nobel Prize winner, Linus Pauling.\n\nCarol has been at it ever since, though in Rome and the Philippines, Cairo and Bhutan, she back-burnered her focus on abolishing nuclear weapons.  I'm glad she did, as that way she did get a family life mostly free of obsessing about The Bomb, and the end of civilization as a place of playgrounds and carefree kids.  She got to study history a lot more (one of her passions) and work with women's self help projects, handicraft-based, and teach grade school, and write text books.\n\nOne of the women who took the torch from De Graff, not directly but in a reconstitution of Portland's WILPF, was Eleanor Davis, age 92.  She grew into WILPF through her mother, whom she recalls being active in the 1950s.  Iona Tanner, whom I remember from childhood, has chronicled some of the history, as did [Mary Bolton](http://worldgame.blogspot.com/2015/09/some-family-history.html) later, in the form of scrap books and clippings.  There's a lot of organizational memory here, worth curating I should think.\n\nMy job, as chauffeur plus photographer was to take Carol, Eleanor and their equipment and literature, to the staging site, named Walk of the Heroines on the Portland State campus. This monument was designed specifically to memorialize women, and a great many names appear thereon, sometimes grouped by organization.\n\nThe WILPF section is two or three stones of names towards one end.  I'm not sure how the monument is managed as to whether more names might be added.  Either way, I'm glad for this monument, though I'm biased given mom's name is inscribed thereon, next to that of Mary Bolton.\n\nSonya Pinney, not named (she's self effacing) was at the event, as observant as ever, seems to me.  She'd been digging through the recent issue of Western Friend and seeing letters replying to my article (two long ones).  That had led her back to the article itself in the previous issue, so we had quite a bit to talk about, comparing notes.\n\nThen I had to attend to my car, moving it and the wheel chair to a next terminus, where the march would end.\n\nYes, the women marched with their WILPF banners quite a few blocks.\n\nFor some of that time, I was talking with Joel, a Food Not Bomber connected with Unitarians, and grabbing a quick salad at Safeway, catching up with the women at the Eliot Center.\n\nFor those into digging, the slides embedded in the show above are but a sampling, with more in the Photostream.\n\nI won't try narrating the entire program in Eliot Center, save to say I took Eleanor home a little early, as she'd had all the fun she could bear, as [my wife Dawn](http://controlroom.blogspot.com/2015/09/autobiographical-interlude.html) was wont to say.  Also, I caught up with Elizabeth, [Ben Linder's mom](http://www.wweek.com/portland/article-6828-remembering_ben.html), just a little.\n\nCarol, who made at least three speeches over the span of the \nprogram, was pretty exuberant the whole time, on not much sleep, and \ncrashed upon our arrival home.\n\nGiven all the logistics involved, and how much time had \ngone into the planning, I'd say stress levels were somewhat high, but \nthat we all worked together on pulling it off.   Part of my job was staying peripheral, an unobtrusive observer, similar to my role [at Disarm Day](http://worldgame.blogspot.com/2015/08/disarm-day-2015.html).  My camera and I wandered off into the surrounding context, capturing a slice of Portland in the Fall of 2015.\n\nMaking Sarah-the-dog hold it for so long was an oversight on my part and I phoned Deke rather late in the game to please check up on her if in the neighborhood.  I didn't have a clear grasp of the script we were following and imagined getting home earlier.\n\nCongratulations to WILPF on a hundred years of focused work.  May the next hundred be likewise invested in having the world become a more humane place.  Lets hope we get to look back on continued progress, with thanks to our heroines for showing a way forward.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}