{
  "id": "7486632290279660912",
  "title": "Winter Repairs",
  "published": "2013-10-28T22:52:00.001-07:00",
  "updated": "2013-11-27T10:36:58.403-08:00",
  "content": "I'd already planned to leave the Nissan in the shop when I went to California.  They told me last time, something about needing valve cover replacements or something.  Well, I waited a little too long I guess because those lights on the dash meant what they said:  I was eating through the battery; mom and I pulled up the driveway from Old Wives Tales, after the AFSC meeting, with zero Joules to spare.  Trying to restart confirmed:  battery dead.\n\nFortunately, I'm up to date [with AAA](http://worldgame.blogspot.com/2008/10/future-of-friends.html) and my annual dues covered the tow to Gladstone, near Oregon City.  That was Thursday morning.  This Monday, all was repaired, including the new alternator.  The spray or leakage from the decayed valve covers is what had damaged the alternator over time.  Front and back brakes were down to 10%.  Other repairs needed.  The grand total was over $1800 2013 US dollars, paid against a standing loan (the credit card).  Why I put it on the non-mileage VISA I'll never know.  My right and left brain don't always talk I guess.\n\nI've been concerned about the python, with which I share an office.  The dog comes by quite often as well.  During office hours, I'm more with non-humans than not, but the snake has been very balled up in his box, his shack within the larger aquarium.  Tonight, he came out.  I'd sneaked him a test mouse earlier, picking one up on the way back from Gladstone.  He passed the test.  I should give him another one before leaving for California.  Must dry clean the jacket.  Works out.  Mouse store and dry cleaner are adjacent and within walking distance.\n\nLindsey professes to despise the [Blue House Party Mix](http://worldgame.blogspot.com/2013/10/blue-house-party-mix.html), though I think both videos were new to her.  Dumb uninteresting beats, is her take, as a musician.  I guess that makes me easy to please, although I do like her more off beat experimental stuff sometimes.  We didn't get to that \"[all video-game sounds](http://www.youtube.com/watch?v=OYxfxf3wTLM&feature=share&list=RD15C_0qCrZW4kY)\" version of [Gangnam Style](http://mybizmo.blogspot.com/2013/10/corrupting-oldsters.html), just as well.  114/94/SAT was my work today, a shorthand I've developed, chicken scratches.  Patrick would know what I meant.  He chauffeured me past Cleveland High School, Tara's old haunt, and Oak's Bottom, Dawn's and mine, in route to Gladstone.  We at first missed the Nissan repair place because I'd misremembered the Nissan layout.  No biggie.  We drove home separately, reunited at The Open Bastion.\n\nWhat Marx called product fetishism is real enough, as is consumerism as a lifestyle.  Shopping.  Some like to eBay all day.  Trading is turnover and variety is the spice of life.  I expect to receive a ton of philosophy books tomorrow.  Blue House is like grand central these days, with lots of comings and goings.  On the other hand, the power of having the right tools for the job should not be trivialized with dime store psychology.  Honing in on artifacts, such as cameras, even jewelry (some ornaments are also instruments in some science), is not anti-Marxist per se, but nor is it about being intimidated by Marxist labels.  The Blue House Party Mix obviously celebrates new / vogue technology and the accompanying razzmatazz (bling).  That seems superficial, if tools can't be deep.\n\n[Alan Watts](http://worldgame.blogspot.com/2013/10/satori.html) used to point out that shopper-consumers were often the antithesis of Materialists.  They were in pursuit of a concept of a concept of happiness (pointers to pointers) and the mundane reality of materials was actually no longer capable of inducing thrills.  The idea of being at a certain restaurant was more important than the food forgettably consumed.  American Psycho comes to mind, for alluding to such a lifestyle.\n\nThen lets look at Debt:  The First 5000 Years, and review the meaning there given \"communism\".   You may be sure the professoriate is \"going here\" i.e. today's colleges are already abuzz with some new thinking (not a new phenomenon right?).  The meanings of words do not hold fixed spontaneously and in fact it takes work and review to uphold a meaning.  Stories pegged to seasonal changes, star patterns and so on, have a longer half life than some.  Political stories, sustained by journalism, can sometimes just fizzle.  You reach a kind of terminus and there seems nowhere next to go, like a StopIteration exception in Python.  [The generator](http://wikieducator.org/PYTHON_TUTORIALS#Generators) is exhausted.  The bandwidth is a scarce resource I suppose you could say, not asynchronously so much as when everyone has their tightly scripted part.  Some of the fancier stuff can't be done without bandwidth.  Banks fail for this reason, people simply lose interest, to recycle an old pun.\n\nThe story is one of Mind continuing to pull the rug from under merely copied or habitual behaviors.  A given Brain might be happy doing the same thing every day, but the humans' gift is to receive grace, no need to argue if it's divine.  Of course it is, if by this means we shed the old reflexes and habits in favor of and in service of, some actual will, a chooser / decider, some executive function.  That means there might be somebody home, albeit non-computable / unpredictable, and therefore a plan of action, and not just action.  We need both.  \"Computable\" is in contrast to.\n\nThoughts that hold water need not always hold water.  The Holy Spirit keeps moving, as some religious might put it, meaning the forms continue to reform.  Morphing happens.  The beats change and draw us onward.  And let us remember that in morphing may be healing; not all change is injurious.  Letting go of conversations that displace more worthy conversations:  a spontaneous / emergent process.\n\nEnough metaphysics for one evening's blog post I'd say.  My focus needs to turn towards the morrow.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}