{
  "id": "6314023630187254106",
  "title": "Wittgenstein (movie review)",
  "published": "2011-03-03T01:02:00.000-08:00",
  "updated": "2013-04-22T16:11:30.035-07:00",
  "content": "I finally got to see [this](http://www.imdb.com/title/tt0108583/), after complaining to Alex Aris that no movie had been made of the guy's life.\n\n\"There is one\" he informed me, relaying details, and a generally positive review (good leading actor).\n\n\"It's more like a play\" he cautioned.\n\nAs it turns out, I was on my way [to Movie Madness](http://www.flickr.com/photos/17157315@N00/3795594021/in/photostream/) (on my bicycle), which specializes in hard to find videos, and there it was, a dvd filed [by director Derek Jarman](http://www.imdb.com/name/nm0418746/).\n\nHaving Ludwig's skeptical students (including Maynard and Bertie) sitting on deck chairs, like poolside, was a funny touch.\n\nHe keeps exiting stuffy Cambridge, stage left, disgusted by mediocrity and the dialed back \"polite company\". He goes looking for craggy cliffs more like a Fortress of Solitude, and finds them in Norway, later Ireland.\n\nIs Wittgenstein our superman then, ready to stare down the internal self-believing solipsist?\n\nWhat's harder:  \"egocide\" ([per Fuller](http://www.grunch.net/synergetics/bio.html)) or \"killing God\" ([per Heller](http://www.press.uchicago.edu/ucp/books/book/chicago/I/bo3632122.html) on Nietzsche)?  A question for another day perhaps.\n\nI respected the script for working hard to communicate something of what he teaches, beyond doing a biography.\n\nBeautiful Mind?  Sort of.  The scene in the Soviet Union was interesting.  The play casts somewhat scary and/or disapproving women.\n\nI liked how it starts with a young boy character and never really gives that up, ending with like a bed time story.\n\nThere, I'm reminded of A Cosmic Fairy Tale by Fuller, his [Tetrascroll](http://www.flickr.com/photos/17157315@N00/3483595185/) (a collaboration).\n\nHe goes to Russia to be a manual laborer but fails to meet the requirements.  \n\nKeynes is as important as Russell to the plot.\n\nThen there's some guy he befriends, like a protege maybe, whom he's trying to liberate from the fly bottle (to escape academic philosophy and get a real job).  He's considered a corrupting influence by academic recruiters, obviously.\n\nLike what about the protege's parents who gave up everything to give him this opportunity?  Parents hate Wittgenstein lets remember, because he was so mean to that little girl, scared her witless.\n\nAll in all, I'm reminded quite a bit of [Logicomix about Bertrand Russell](http://coffeeshopsnet.blogspot.com/2010/05/buzz-about-shops.html), in which Wittgenstein also features. \n\n\"Compare and contrast the war scenes (before he was taken prisoner) in each fictional account\" could be a writing assignment.\n\nThe movie alludes to some of the scholarship:  same history teacher [as Hitler](http://en.wikipedia.org/wiki/The_Jew_of_Linz), with Cambridge a [spies nest](http://controlroom.blogspot.com/2006/11/space-needle.html).\n\nRegarding these latter rumors, you've gotta remember that McCarthyism had it's [British incarnation](http://controlroom.blogspot.com/2006/04/v-for-vendetta-movie-review.html) (with \"commie symps\" everywhere, riddling fascist [fandoms](http://xkcd.com/367/)).\n\nThe comedy is understated, although Wittgenstein's thinking to kill himself because people were flipping him off with \"a V sign\", driving him to self doubt, is beyond hilarious (laughter too high frequency to make any noise).  Thinking of Adam Bellow for some reason (yeah, son of Saul and [fellow alum](http://worldgame.blogspot.com/2005/05/princeton-25th-reunion.html)).\n\nHe's definitely cast within the \"tormented saint\" archetype (suffering from an excess of virtue), again not unlike the treatment of John Nash in A Beautiful Mind (we empathize with these projected \"crazies\", our certified shamans).\n\nIf there's a strong word for this Wittgenstein guy, it's \"abrupt\" (as in \"I'm moving to Ireland\" or \"our friendship is over\") but also -- and this is what the young boy establishes -- \"flamboyant\" and \"theatrical\".  \n\nTo just say \"moody\" is really too \"broody\" -- he's got an ET friend after all, and a beautiful mind.\n\nMaybe the funniest line is at the end, delivered with [Steven Wright like dead pan](http://www.youtube.com/watch?v=F5ErMolRE8M&feature=related):  \n\n\"I wanted to write a philosophy book that was nothing but jokes.\"  Pause.  \"So why didn't you?\"  \"(sigh) I didn't have a sense of humor.\"\n\n[Badaboom](http://badaboom.urbanup.com/483956).  Applause.\n\nI told Alex I found it somehow ironic when people kept \"questioning the obvious\" in this film (thereby sounding philosophical) and yet the truly obvious  (\"this studio\") is barely mentioned.\n\nA die-hard truth-teller might want to point that out:  that for all this talk of \"language picturing facts in reality\" these were actors in a Made for TV world (or language), with Wittgenstein himself nowhere directly depicted.\n\nIs he not even present between the lines?  OK, maybe there is some \"rhinoceros in the room\", but there's still no \"pointing\" in this direction.\n\n\"Read more Hegel?  That would drive me mad\" -- another throwaway from Mr. Loony Tunes himself, in response to yet another Nurse Ratchet type, who didn't like his bringing up Trotsky for some unfathomable reason.\n\nI still can't get over the Martian (almost like a Yellow Submarine character, foreshadowing a more psychedelic future perhaps, where they / we breathe a different air?).  \n\nThis jolly green ET is a private language court jester, an imaginary friend, a projected homunculus imagined since boyhood, a font of wisdom & nonsense (like an oracle) tapping into a more cosmic, more secret, sense of self.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}