{
  "id": "4390558402153035652",
  "title": "Workshop News",
  "published": "2010-04-05T20:08:00.000-07:00",
  "updated": "2010-04-11T23:07:13.877-07:00",
  "content": "Randy, lets call her, at first found the CubeIt! \"creepy\" because of the magnets, but then took to exploring it with gusto, while taking in my explanation of its 24 Mites as minimum space-fillers.  Another guy, lets call him Kyle, was likewise comprehending.It's not that this stuff is particularly hard; it's just not shared very widely, [not even on Math World](http://groups.yahoo.com/group/synergeo/message/57935) (a situation we have [recently addressed](http://controlroom.blogspot.com/2010/04/suggesting-change.html)).All talk of irregular polytopes aside, [this educational tool](http://mybizmo.blogspot.com/2009/04/sao-meeting.html) from the Huntar Company is simply fun to play with.The octahedral Flextegrity model triggered some discussion of a landmine detector / destroyer.  One of our number, a company president and sponsor, had worked on a prototype at a national lab in his spare time some years ago, basing his design on a clever kids' toy.A rotating weight caused the scaled up version to flip from face to face unpredictably, generating a random walk across a field, possibly detonating a charge along the way.These devices would be inexpensive / dispensable and could be put to work in large numbers.  But would they find them all?  Landmines are another legacy technology today's world despises.The motorcycle engineer also shared a few thoughts with our group, though I had some trouble with his accent, wish I were better with languages.  Speaking of which, here [some Japanese kanji](http://mybizmo.blogspot.com/2010/02/more-musings-about-television.html) I've been getting recently:polyhedra       多面体tetrahedron     正四面体decahedron      10面体dodecahedron    正十二面体rhombic dodecahedron    菱形十二面体many    多surface 面body    体regular 正twelve (ten, two)       十二four    四diamond shape 菱形A reporter from Baghdad shared horrific stories.  People blame the political process, but such levels of violence are hardly political, or a process.  [The electrical grid](http://controlroom.blogspot.com/2005/02/proposal-baghdad-grid-monitor.html) is still in a shambles, city services are greatly impaired, despair is running high.The Colin Powell \"you break it you buy it\" policy cannot be enacted from a purely military standpoint.  The Coalition will probably need something more like a Marshall Plan (ERP), making use of those [bases as staging areas](http://mybizmo.blogspot.com/2010/03/world-lifestyles.html).  Some of the same [logistics used in Haiti](http://worldgame.blogspot.com/2010/03/morning-meetings.html) might apply, including emergency evacuations to better medical facilities (the \"mega hospitals\").Scholarships for future health care workers will be needed across the board just to deal with America's aging boomers, many of whom currently seek quality care overseas.  Anyone now in the military who qualifies, and wants to follow in the footsteps of Air Force hero Charlie Clements, should get a boost.The know-how to build and repair civilian infrastructure is in danger of being lost, in America too.  Per a voice from Denver, both Hewlett-Packard and TRW CEOs were suggesting decades ago that out-of-control military spending is economically and ecologically ruinous.  Civil society is under attack, and quasi-defenseless around the world.The Python component is [still under development](http://worldgame.blogspot.com/2009/04/mapping-gnu-math.html) and probably needs more Numpy.  Dick and I were discussing the nuances in Cyberia.  The functional programmers object to polyhedra changing \"in place\" and returning None, akin to going some_list = ['a', 'b', 'c']; some_list.sort( ).  They hate stuff like that. I expect the Scheme camp will continue to compete.  Congrats to MF for getting that award by the way.  I sure could use some big prizes (jealous).Not all of this [Radical Math](http://mathforum.org/kb/thread.jspa?threadID=2059352&tstart=0) occurred on the Pauling Campus.  97214 offers other facilities, though we hardly compete with Reed College when it comes to computer labs.  The Java workshop the other night (related to work in genetics) was on [the Pauling Campus](http://mybizmo.blogspot.com/2010/03/campus-household.html), as was my Python workshop.  Today though, I didn't once set foot in that board room.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}