{
  "id": "7281286450413016186",
  "title": "Working Out",
  "published": "2024-07-29T12:38:00.000-07:00",
  "updated": "2024-08-13T18:31:51.762-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgz4zS4jMk0GBPwthZXUFq7gAERX2gVPlZn96mEUNN2unYGGRj8s94rVKgoFFmf9Y9cK8u1e3aqDTx8X64YBc-Ylu4dyrEnIL88QRBQhSQENawEVUeMM9eqaJC0Zu1i-zvE8z_0SIk3pigUAnavsMbMz1XKmELwEZbT8QhSvYDRCDfcpHQRKzVn/s1536/buddha_in_gym.png)\nYou've probably had the same thought I have, when working out in the gym: gee, here's a lot of energy expenditure going nowhere, a lot of wasted watt-hours. One has fantasies of hooking those exercycles directly to the power grid, at least the building one, and keeping the lights on or something. Those espresso machines take power.\n\nA better solution for some demographics, a Venn Diagram intersection of identity components: age, gender, occupation, current state of health, set goals, expected outcomes, is probably doing housework. This way, you'll kill multiple virtual birds with one stone, reaching moving and standing goals, while adding negative entropy to your space.\n\nIf you're anything like me, a guy with internal real estate (several rooms, basement, attic, detached garage), then housework is an endless spigot of chores of varying size and duration, and I'm not only counting or thinking about stereotypical \"guy work\" just because I'm a male.\n\nI'm talking about vacuuming, sorting books, dusting, excavating old storage piles periodically and recycling their contents from inventory. That all takes work and also hand-eye coordination. \n\nOn the other hand, enough tasks are repetitive to permit daydreaming, and its within these structured daydreams that we plan out what to do next. Unless, that is, you want to surrender your daydreaming time to the studios. Sometimes that's a refreshing alternative, given how professional daydreamers know their business.\n\nLet's set the actual physical tasks aside for a moment and suggest that no matter what your line of work, there's some way to plan your workflow ahead of time. \n\nAs with exercising in the gym, \"mental muscles\" come in groups (work together) and get tired with overuse (a tautology almost). \n\nYour faculties benefit from a round robin approach, a spiral staircase, wherein you upgrade gently and gradually when you can, which doesn't close the door on relatively more jarring overhauls and stress tests.\n\nWorkout-aholics know to come in with a \"lesson plan\" or \"to do list\" and it will likely involve a well-planned sequence of \"stations\", meaning exercise machines each with a specific muscle group focus.\n\nIn computer world, the webserver has to allocate some amount of total bandwidth to each client browser that connects with it. In operating system jargon, you might allocate a process or a thread. A whole process subdivides into threads and is therefore in principle \"heavier\" than a thread.\n\nDo you have an intense dislike for meetings wherein the way to gain or regain the floor is to interrupt others, even mid-sentence, interjecting somehow? \n\nWomen, on average, trained to be more demur within the patriarchy, were suddenly in management roles without the right default level obstreperousness, and had to take trainings in how to up their level of \"bitchiness\".\n\nThink about mostly male engineers working all day with operating systems that are indeed \"interrupt driven\". Everything just chugs along, until the next interruption, in which case the operating system may switch its attention to some other process.\n\nThink of doing housework and getting a call on your cell. Or the doorbell rings. Cell calls go to voicemail but doorbell rings may be harder to ignore, especially if a knock follows. \n\nPlanning models that do not allow for unforeseen interruptions in their conceptualization likely lack enough sophistication for many types of operation, both military and civilian.\n\nRemember, it's your attention span. Consider carefully, not only which machines you'll visit, and in roughly what order (making it up as you go is OK, as long as you know when you've fallen off the path), but also what you'll be doing in your head, with regards to earbuds, VR goggles, or whatever else your workout space comes with. \n\nSometimes it'll just be you alone with your imagination. You're ignoring the overhead TVs. What do you plan to think about? Multi-tasking? Event planning? Cosplay? Protein-folding? Your next blog post or YouTube? Explorations in the geometry of thinking?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}