{
  "id": "6235538814535001626",
  "title": "Work / Study in Global U",
  "published": "2017-11-20T11:30:00.000-08:00",
  "updated": "2017-11-20T11:37:14.391-08:00",
  "content": "I continue to both work and study, in my Global University, my metaphor for home sweet home: Nuthouse Earth.\n\nI'm upgrading the Python stuff to a next level, so that those liking my on-ramp, might continue the tour.\n\nYoutube is a goldmine, unlike anything I enjoyed at Princeton (because we hadn't created the Internet yet, not really), so I dig in it avidly.\n\nMy beat takes me in a wandering cycle through a set of topics:  computer stuff, Bucky stuff, [education politics](http://mathforum.org/kb/message.jspa?messageID=10283328), and more recently, [climate change](http://controlroom.blogspot.com/2015/08/climate-change.html).\n\nFor those new to these blogs, which go back a couple decades, I haven't written a whole lot about climate change other than to remember the theories of Hamaker-Weaver.  So there's [lots to catch up on](https://youtu.be/BiKfWdXXfIs) around that.\n\nEducation politics includes looking at religious movements:  Falun Gong, Hizmet, Unification Church, Quakers...  a mixed bag to say the least.  All exert at least some form of political influence, either as targets for government attacks, and/or as lobbyists.  Quakers have FCNL.\n\nI had no idea how close [Henry Wallace](https://youtu.be/dSjTZ6uC0ZY) got to being VP during FDR's fourth term.  What would have happened minus President Truman wanting to prove how tough he was?\n\nRené Guénon: newly a blip on my radar.  More BBC Palast on how the US is incapable of having free and fair elections.  [We knew that](http://worldgame.blogspot.com/2005/01/happy-new-year.html). \n\nWhat if the [Hizmet STEM curriculum](http://mathforum.org/kb/thread.jspa?threadID=2897052) started to pick up on the Bucky stuff more?  In a memo this evening, to other faculty, I wrote (those not interested in math may tune out here):\n\nThe canonical conversion constant for cube\n -> tet volume conversion is sqrt(9/8) i.e. a cube of face diagonals \n2R, edges sqrt(2)R, has volume 3, not sqrt(2)**3. I.E. cube of edges R (1x1x1) is slightly bigger than unit tet of edges D (D=2R).  ~1.06066Sphere volume is sqrt(2) pi r^3 by this conversion.  R=radius of unit sphere of said volume. Quadrays go from center of 2R edged tet to corners.So the tetrahedron made by connected 4 inter-tangent unit sphere is: 1Octahedron from six such unit spheres: 4Rhombic Dodecahedron (encasement for each sphere, voronoi cell): 6Cuboctahedron (12 spheres packed around a nuclear one): 20\n\nHow\n the 5-fold symmetric shapes slot in to the above relates to \nCuboctahedron --> Icosahedron by Jitterbug, and the Rhombic \nTriacontahedron made from said Icosa and its Platonic dual.  Volume 15 *\n sqrt(2).\n\nInteresting that CO of volume 20 * sqrt(9/8), the aforementioned volume conversion constant = same RT volume (15 * sqrt(2)).\n\nThat's\n the \"art school\" CAD system some people wanna work with.  I don't blame\n 'em for finding it simple.  Tetrahedron, Octahedron and RT also explode\n into wedges / slivers, easy to reason about and assemble with.  Lots of\n fun ratios you can carry around in your head.\n\nNo harm converting back and forth.  XYZ is always there when you need it, spherical coordinates too.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}