{
  "id": "8685641839388293353",
  "title": "Workaday World",
  "published": "2011-10-17T09:21:00.001-07:00",
  "updated": "2011-12-12T11:41:31.408-08:00",
  "content": "Long time readers know [I champion GST](http://mybizmo.blogspot.com/2009/10/econovergence.html), pulled down from its dusty shelf, a little used abbreviation (\"general systems theory\"), as competition for Econ.[Econ deserves competition](http://mybizmo.blogspot.com/2011/04/meetup-in-woodstock.html), by its own reasoning, yet college catalogs don't make room for such a discipline.  They used to be smarter in colleges, at least relatively.  Why those high tuitions again?  A question for your Philosophy departments (ethics included).Anyway, GST is heisting this word \"work\" (also used by Economists) to bring it closer to the Physics department meaning of \"expending energy\", or just \"energy\" (some work is potential, held back by a dam).  There's no such thing as \"not working\", even in sleep.\"Unemployment\" is with reference to an entirely different \"cult concept\":  that of \"the job\".  A \"job\" sounds like something out of the Bible (Book of Job).  All the connotations of slavery, of servitude, of travail, get vested in \"job\".  And yet we want them, desperately.  This looks like a job for the Psych department.  [Calling Erich Fromm](http://en.wikipedia.org/wiki/The_Fear_of_Freedom).At least everyone is working though (so relax), employed in a job or not.  [Non-humans are working too](http://worldgame.blogspot.com/2009/03/more-on-quaker-animism.html), sometimes very hard (lots of power out, takes nutrients).  Work is not about money necessarily, although it may well be about making long term investments.  \"Wealth is livingry\" said Fuller, using a word his \"peers\" (snicker) refused to adopt, in contrast to \"killingry\" (their nest egg in many cases -- \"peers\" who think of \"Barfie Doll\" [tm] [Richard Perle](http://worldgame.blogspot.com/2011/10/esozone-talk.html) as a role model).Hey, is it true Mercy Corps is sending recruiters [around PDV](http://mybizmo.blogspot.com/2011/10/checking-in.html)?  [Anthropologists maybe](http://controlroom.blogspot.com/2011/04/roller-coaster-at-reed.html).  Or was it [Medical Teams International](http://mybizmo.blogspot.com/2008/05/field-trip.html)?  There's already overlap in staffing I'd think, twixt some of these old time volunteers and the Portland-based [disaster relief industry](http://mybizmo.blogspot.com/2010/02/more-musings-about-television.html) (bigger here than Seattle's).If I were head of UNESCO or UNHCR, I'd be studying [Occupation logistics](http://controlroom.blogspot.com/2006/12/techietown.html) with an eye towards cross-fertilization.  These are peacekeeper occupations, unlike #OccupyAfghanistan or #OccupyIraq, more Business Plot endeavors (the business-run Occupations get to use violence as much as they like, is one of the differences, even in contravention of [international law](http://worldgame.blogspot.com/2011/12/protecting-lawyers.html)).The vets in #OccupyPortland have a lot of influence on others of recruiting age.  Getting to camp out, learn skills, get trained, manage infrastructure, supply food, sanitation, telecomm, education services, fly around the world doing good:  would you rather do this in the spirit of #OccupyPortland or #OccupyIraq?I can see where lots of troops would be willing to jump ship, maybe bringing the Navy with them, as one of the more honorable services.  The mercenaries might get left behind.  #Glitterbomb Blackwater (yeah, I know, a new LLC these days, shares sold by wimpy Wall Street no doubt).[I couldn't find Time or Newsweek](http://worldgame.blogspot.com/2011/10/another-october-maneuver.html) at Freddie's either.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}