{
  "id": "6564457804972712023",
  "title": "Worldly Affairs",
  "published": "2017-04-10T10:20:00.000-07:00",
  "updated": "2017-04-10T10:24:57.350-07:00",
  "content": "Derek (aka \"Deke the Geek\") received a welcome donation of fresh Chinese food, thanks to restaurateur neighbors, and called me at the right time to share some.  I was in a funk, having Youtube issues, however by the time we'd finished, those issues had resolved.\n\nToday I start two new gigs, a third this Wednesday, plus there's the MOOC, also starting, so I have a full plate to say the least.  However, unless I pace myself, I'm sure to burn out, so let's see how smoothly I'm able to time-share.  Yes, multi-tasking may be an illusion, but task-switching is not, and may be more or less \"interrupt driven\".\n\nThe MOOC is on IoT (\"Internet of Things\") and promises to get me into Arduino country, so I hope I'm up to it. My skills are only so-so in so many areas.  I wouldn't take myself skiing for example. Let's hope I'm not a total clod on the bicycle again, like that time with Suzanne (I wiped out twice).\n\nSo far so good, with the Cannondale from Sam (the two previous bikes were stolen, Tinkerbell from my own backyard, and the one Lindsey worked on from Jay when on Food Not Bombs duty. I'm not keeping up any gym memberships.\n\n[SourceTree by Atlassian](https://www.sourcetreeapp.com/), the makers of JIRA, may be my solution when it comes to Git. My coding career reached its peak, in the medical research area, before Github was even a gleam in some Youtuber's reflecting glasses. I'm wanting to branch my Python5 repo but am unclear on the sequence.\n\nPatrick is in the batters' box as opening hitter on my evening gig, in case traffic delays me today. I'm dreading the drive from Beaverton back to Blue House, given bridge repairs. In theory I have plenty of time, but that's only theory.\n\nThe opportunity to learn new skills is welcome and I'm grateful, and our theme in Meeting on Sunday, yesterday, amidst many concerns. My work is to orchestrate my learning experience in such a way as to not overtax my limited capabilities.  Stress is a positive in a gymnasium sense, because it's well-managed. Stress in the wild, i.e. life during wartime, takes its toll on us all.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}