{
  "id": "3144103375956611879",
  "title": "World Game Museum (WGM)",
  "published": "2022-07-22T08:00:00.000-07:00",
  "updated": "2022-07-22T20:16:48.554-07:00",
  "content": "I've toured a lot of propaganda museums in my day.  We lived in Europe and every chance we got (\"we\" = my nuclear family), we'd load the car, including the car's rooftop with a family-sized tent (German made), and off we'd go.  \n\nOne trip took us across the Adriatic by car ferry from Italy to Greece, I'm guessing that was also the Turkey trip, thence to Bulgaria, Romania, Hungary... probably Prague that time too.  You get the idea.  Along the way, we'd visit museums.  Some were about defunct ideologies, and the social engineering that kept them going in their day.\n\nSuch educational touring is itself a world game activity, or call it playing, versus warring.  Warring is deadly serious whereas playing contains a lot of lightness.  \n\nIn the gray zone in between, war involves playing with war toys in a simulation (training, playing a game), knowing one is bound for a theater.  There's a whole curriculum about making you a hero.  \n\nThat's what a War Game Museum might curate:  the many brands of toy soldier they would factory-make or hand-craft, for the benefit (\"\") of little children (scare quotes on the side in case any become pawns in someone else's game).\n\nI remember a page from TV and movie star Adam West's auto-bio, cited in a documentary film, in which he's being shot from a cannon, in the circus, in his batman suit, when he realizes his whole shtick is self demeaning. He's allowing his fate to be determined in too passive a tense. He resolves to \"play a different character\" so to speak.  \n\nAn awakening sometimes happens when children find themselves scripted into someone else's fantasy, forced to play along.  They may not have had that perspective at first, initially imagining themselves a co-author, or peer screen writer.  To retain integrity and self respect, they maybe have to drop out or peel off.  Such is their transition to adulthood.\n\nIn other words, the transition from war game to world game may involve escaping serious child abuse. \n\nIf you discover you're just a guinea pig in some weapons factory's field testing experiment, in a scenario wherein the factory managers and investors become your commanders through rotation, then you might start looking for an escape route.\n\nAn underground railroad usually develops in response to any serious master-slave situation, to help funnel said slaves to freedom while frustrating master power grabs.  The WGM will help memorialize some of these railroads, as a source of new recruits (ex slaves).  \n\nFighting for freedom is not necessarily a weaponry game, as Muhammad Ali could tell you (along with MLK).  Livingry plays a role too, especially psychologically.\n\nMajor General Smedley D. Butler had the courage of his convictions when he penned War is a Racket, more a pamphlet than a book, and a message to future generations.  \n\nHe had served in the American-Philippine war, prototypical of the war in Vietnam in testing the readiness of the home folks for Empire. The Anti-imperialist League (Mark Twain & Co.) signaled the home folks weren't ready (and never would be) but signals can be ignored. \n\nThe empire-minded had a New American Century (the 1900s) in their sights, even before any plans for a next Reich in Europe.  The UK had set the bar, with a first globe-spanning example.  Some thought the USA was destined to inherit the UK's mantle.  Others thought said mantle smelled a lot like a dead albatross.  The Revolutionary War had been about escaping, not fostering, an imperial mindset.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}