{
  "id": "1355065497009449023",
  "title": "World Game Planning",
  "published": "2022-03-30T11:12:00.009-07:00",
  "updated": "2025-01-01T10:17:28.985-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj71dBbnE8XoFD_3DLIhGUS3vl_D52QVQ7ZnvsI3guhc5e7czUjTMpHWcjiPuIu2k3nGqxH61eP9cCmNWLWMr5OsHMi_6lPiy1CEMdNUXZd7ZWFtxlAmYl5CyxkhztMMKDsmdu2eBtL5cBb1rUCrJi--ktPj5fpI3fWxbh0W5GiMZHv6DuuFA/s2048/Nixon_and_Krushchev_(46792026815).jpg) Soviet Premier Nikita Khrushchev and  Vice President Richard Nixon tour \nthe U.S. National Exhibition in Sokolniki Park, Moscow, July 1959\nfrom [Wikimedia Commons](https://commons.wikimedia.org/wiki/File:Nixon_and_Krushchev_(46792026815).jpg), cc-by-2.0 license\n\nPer my Facebook comment on Cynthia Lazaroff's profile (another 2D alum), I don't see in current affairs any reason to slow our GENI plans to effect greater electrical grid integration, including across the Bering Strait eventually.  \n[](http://www.geni.org/globalenergy/issues/global/Dymaxion-grid-sm.png)from the GENI website\nPlans are inexpensive, which is why the Pentagon churns them out to keep the incinerators fired up.  We're free to dream in other words.  Plus there's no way to slow something that's already stationary.\n\nOn TrimTab (a listserv), we picked up on the Kitchen Debates and their backdrop, the Moscow Dome and these yurt-like kiosks, suspended from utility poles, that don't get remarked upon by most historians, but which I'll take as a throwback to the Dymaxion House idea.\n\nPersonally, I'm still bullish on Nord Stream 2 (as of this writing, they're talking about closing Nord Stream 1, let alone opening its twin).  I have nothing to do with the natural gas lobby behind all those senatorial gasbags in the Puppet Kingdom (aka the District of Columbia).\n\nI'm seeing a day when we're able to work more dispassionately in the infrastructure sector, without all the faux nationalism.  I call it faux because it rings hollow.  There's a difference between true children and children who didn't mature, but spoiled instead.  To remain a true child in adulthood, one must regain or retain wisdom.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}