{
  "id": "111422508772454077",
  "title": "World Game 1970",
  "published": "2005-04-22T20:06:00.000-07:00",
  "updated": "2006-11-15T11:44:08.917-08:00",
  "content": "John Braley on [Synergeo](http://groups.yahoo.com/group/synergeo/) posted a link to [World Game](http://www.motherearthnews.com/top_articles/1970_November_December/World_Game), this by now ancient article by Hal Aigner, which appeared in Mother Earth News in 1970. I was still living in Italy back then, attending middle school at the Overseas School of Rome (OSR). Fuller did appear on my radar, briefly, thanks to Fred Craden (my sociology teacher) and company. But I hadn't tuned in World Game per se -- just the Club of Rome ([Jay Forrester](http://www.systemdynamics.org/DL-IntroSysDyn/origin.htm) et al), the topic of my 8th grade independent learning project. By 9th grade I'd be in Bradenton, Florida, but only for a semester. Then on to Manila.Hal's article is amazingly ambitious in scope, taking in Einstein, Heisenberg, Von Neuman, a global electrical grid, and of course Buckminster Fuller, all in one fell swoop. Ah those were the days. Plus we were looking forward to utopia by the 1980s!All these people in their 20s and 30s when this article came out, are now in their 40s and 50s, looking back on a not-so-utopian end of a millenium and start of a new one. So was world game a failure? What other game do we have? Sure, we may be incompetent players (improving?), but the way I see it world game is still the only game in town (locally anyway, in our [podunk](http://www.answers.com/podunk&r=67) solar system).I posted some [follow-up comments](http://groups.yahoo.com/group/synergeo/message/21827) to synergeo, but I'm not sure what it takes to access that archive, in terms of joining Yahoo or whatever.I need to remember to watch Foreign Exchange with Fareed Zakaria on OPB in about 30 minutes.  My friend Glenn is the producer.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}