{
  "id": "1071635546372037123",
  "title": "Wreck It Ralph (movie review)",
  "published": "2013-01-13T13:12:00.001-08:00",
  "updated": "2013-01-13T20:38:54.797-08:00",
  "content": "This Disney / Pixar animation was perfect for my head space at the time.  On Synergeo, we were looking at Geoscopes (what Bucky called them), basically globes, or orbs, upon which whole Earth data may be projected, but also mind maps, [networks of a more alien kind](http://tech.groups.yahoo.com/group/synergeo/message/70889), or call them Worlds, or Namespaces as the case may be.  Planet Pauling would be the world according to Pauling, including the molecular aspects of diet he cared about (he knew it was all one ecosystem, inside and out).\n\nAnyway, to the film:  each [Namespace](http://worldgame.blogspot.com/2006/04/another-wittgenstein-essay.html) / Planet (ala Little Prince) is a computer game or arcade game like [at Avalon](http://www.flickr.com/photos/kirbyurner/3182545429/). When the humans go away, the game characters (the avatars, the coded puppets) continue to have identities, politics, motivations, needs.  This is Disney's World, after all, and the premise of Toy Story etc., going back, way back.\n\nEach game has not only it's \"rules\" (boring back of the box stuff) but its aesthetics.  There's the girly pink world of sweets, like the pink aisle at the toy store.  There's the more urban world of tenants, tightly packed, caught between forces of decay and destruction, and miracle repair people, who make it so they don't need to move out.\n\nRalph is the principle of decay (he actively wrecks stuff), the need to demolish and destroy, because things get tired, worn out.  But the characters in the story are blind to the fact that he's as much a principle as they are, and without him, there'd be no game.  Internally, he experiences this blindness as lack of appreciation, as loneliness, motivations just about any audience member can appreciate at some level.\n\nSo Ralph decides to not return to his game from Game Central, as he's supposed to, and to hop into another game, in search of a sign of his right to appreciation and respect.\n\nOnce we've engaged that premise, that \"game hopping\" is possible, the script tastefully exploits that.  We don't collide every game with every other.  There's no NFL football, though we do have a \"team play\" type game, nor do we have much in the way of martial arts, though those types of games are recognized.\n\nIndeed, the Grand Central scenes do a good job of recognizing the genres, but then we settle on just three of them: Aliens (Sigourney Weaver country), Wreck It Ralph's home planet (Fixit world), and Pink Aisle girl-sugary (a raceway).\n\nHow fun, because Female gets these two contrasting sources.  It's like [a three body problem](http://mybizmo.blogspot.com/2006/10/terminal-movie-review.html) in Newtonian gravity and the texture goes fractal.  Disney is anything but unsophisticated.  He stays safely hetero in his attractions, but you know he'd as easily not, were it not for an audience he'd like to hold onto.\n\nThe nutty King is a character we've met before in Disney films.  The plot has its intricacies, good exercise for new-to-the-movies viewers (and/or new-to-life-itself). \n\nThis isn't to say the film has lost all uniformity of look and feel.  Even across Game Worlds, it keeps a steady cosmology, with human world (the players) included.  Games themselves live and die, and a sign saying Out of Order, seen backwards from within the console, is a known Kiss of Death.  Some game figures are already unemployed.\n\nThe film plays (just a little) on the longings and nostalgia of older kids in the audience, i.e. adults with their kids, as the Pong era type characters may no longer have a home.  Someday we'll find [Kirby](http://kirby.nintendo.com/) under a bridge, no longer employed by Nintendo (he's 20 this year).  Who will take him in?\n\nThe Sigourney Weaver as Ripley type character develops a thing for the Fixit guy and vice versa (happily -- so often these things are one way).  Wreck It Ralph is kind of shreky, and there's a sweet Beauty and the Beast aspect to his story (she might be under age).\n\nAgain, this is all Disney's world in the final analysis and the script tells a wholesome tale.  Arcade games tend to be less scary or demented compared to the ones you can buy for your home e.g. the ones [by Valve](http://worldgame.blogspot.com/2004/12/interface-designs.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}