{
  "id": "6055082058320389196",
  "title": "X-Men Origins: Wolverine (movie review)",
  "published": "2009-05-01T21:10:00.000-07:00",
  "updated": "2009-05-01T22:22:31.906-07:00",
  "content": "The Architect by deusWithout rehashing plot details, let me just point out the perennial nature of this story line, of children with secret gifts, getting sucked in to government experiments, with clueless generals at the top.  Yes, it's a Marvel comic.  What did you expect?You get a similar plot in [The Incredible](http://mybizmo.blogspot.com/2005/02/incredibles-movie-review.html)[s](http://mybizmo.blogspot.com/2005/02/incredibles-movie-review.html) though, and in Harry Potter, with muggles versus the outcasts, the geeks like Hermione or whatever.  Yes, it's an old story.So then I get home from the movie [at Pioneer Place](http://www.flickr.com/photos/17157315@N00/3492609273/), and [Dr. Nick](http://controlroom.blogspot.com/2009/04/positive-developments.html) reminds me of The Architect by a group called deus.  Why not revisit and work that in?I call this the \"slow superman\" telling of Bucky's story, in that he goes into some privacy booth, then comes out with a plan (a solution), but it takes him like a whole year to get changed.  Lots can change in a year.The X-Men saga is a long one and this is a prequel.  I saw another part on an airplane [that time](http://worldgame.blogspot.com/2006/10/our-big-new-york-adventure.html).And hey, I'm not saying kids aren't secretly gifted or that government programs don't secretly exist.  [Geeks](http://mybizmo.blogspot.com/2009/04/cywar-in-cyberia.html) like this genre for a reason, way more than Revenge of the Nerds say.How I explained it to Kirk Petersen (old Princeton friend) [on Facebook](http://www.flickr.com/photos/17157315@N00/3493362690/):  Weird Al makes fun of [nerds](http://www.youtube.com/watch?v=Lp6eswhgOKk), but is [a geek](http://www.youtube.com/watch?v=z9rfGP7Xe2w).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}