{
  "id": "819307339456042453",
  "title": "XRL:  Meeting Space",
  "published": "2008-06-05T13:30:00.000-07:00",
  "updated": "2008-11-15T02:36:01.417-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj8l95NZ-ktN0RYXuRsZTqANSFj75xch_dRgYeJe2s6L7jT4qlE1esvj2JX7I-jPZ3fiSEzn3qSeT9Ko08tFq_XxOq7ozfBGIwM8256z6ozSz_3KvQGnz_mI0qpEUR_m2zKFm8Z/s1600-h/wanderers_meeting_facility.png)upper level[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiQQeWggi0ZGhYtEfb02ZD5sUfXhYj2FI1KTY7aYb2C_pRCegi-CBuMc6P-J2STWmyLg3mQ5170_OGR3lbq1K9HvWXmgXr8Bt6HzllMDfGgIladRTrKDJvW0zcxtMwqMS_SbZRK/s1600-h/wanderers_meeting_facility_lower.png)lower levelThese were like back of a napkin type sketches from my meeting for business with Glenn Stockton today.  We also walked to the hardware store on Division for a new flapper for my downstairs toilet tank, the one with the big rock in it.Just to explain a bit, the \"L.P.\" on the meeting room table means \"Linus Pauling\" as in \"like the table we use at [Linus Pauling house](http://mybizmo.blogspot.com/2006/08/linus-pauling-house.html) for [Wanderers meetings](http://worldgame.blogspot.com/2006/10/libyan-eclipse.html)\" except I'm suggesting an elongated hexagon, symmetrical around the short axis (it's not pentagonal, or \"coffin shaped\").  I just like the Klingon motif.The reception area forks to an L-shaped art gallery and/or hall of fame, or museum, with flatscreens on the wall, showing customized content.  I put a spiral staircase and/or elevator in the far corner (depends on the [ADA rating](http://mybizmo.blogspot.com/2006/07/more-brainstorming-about-ecovillages.html)).    We'd likely want another \"W.C.\" on the upper floor in a next draft.Viewing facilities for two different kinds of projection, \"2D\" and \"3D\" really add to the flavor and functionality of this mass producible facility.  2D is like the usual Hollywood style format, maybe 16:9, whereas 3D displays are still emergent.Rear projection may be the best way to go in both cases -- there's an option to sell these parts separately.  The design of the facility needn't dictate such choices, just as the same model of car might come with different transmission options (automatic versus manual -- [Razz's](http://mybizmo.blogspot.com/2006/09/razz_07.html) is manual).I didn't spend much time sketching the lower floor.  There's a dumb waiter from the kitchen up to the meeting room (the Pauling House had that too, although it wasn't operational in our day), plus a larger dining area (\"D.A\"), a space for a server rack, which serves the gallery, projection and meeting rooms.This is quite a small facility.  Some will complain that the meeting room is windowless.  Variants might address this \"shortcoming\".  Sometimes you want a meeting area free of distractions though.  The table top itself might include recessed displays, in a space easily darkened.Glenn asked me about location and I said this was for the Great Slave Lake area, but that's just in the one particular storyboard.As this unit provides no living quarters, there's the implication we have other [free-standing units nearby](http://controlroom.blogspot.com/2007/11/etcha-sketch-view.html).  I don't get into those details here.  There's also a totem pole outside (not shown).The more spherical projection room (more like a \"flight simulator\" in providing a more \"wrap-around\" view) would likely be an omni-triangulated geodesic as seen from outside, or perhaps a hexapent.The [Hunter Art Museum](http://mybizmo.blogspot.com/2006/03/hunter-art-museum-chattanooga.html) in Chattanooga may have been an unconscious influence here, in terms of suggesting a shape and/or dramatic perch for our meeting facility.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}