{
  "id": "4045469707642831525",
  "title": "Yakking Trekkies",
  "published": "2009-05-08T13:01:00.000-07:00",
  "updated": "2009-05-08T13:49:00.791-07:00",
  "content": "...or locking horns or whatever [is Cliff a trekkie?], excerpt from Synergeo, fixed a typo, hyperlinks added: Re: operational math --- In [synergeo@yahoogroups.com](http://groups.yahoo.com/group/synergeo/post?postID=iDoIhtiUPGc4wiyDDqMC86gF-i9JzAg-zDD-EJtX3u_lOTZZfyg7TLa9feKvidx8HioNFe5WdwEVgoFPIA8), Clifford Nelson  wrote:>> Cubical volume times Sqrt[72] is the> tetra-volume when the edge length> of the tetrahedrons is one. When> the edge length of the tetrahedrons> is two the volume of the tetrahedron> is eight times more, so you multiply> cubical-volume by Sqrt[72]/8 => Sqrt[9/8] = 3/(2*Sqrt[2]).>> Cliff Nelson>In hammering together an XYZ <-> IVM bridge for two-way travel, Fuller began where he often began, with 4 [CCP](http://worldgame.blogspot.com/2009/01/techie-toons.html) balls ([IVM \"spheres\"](http://www.grunch.net/synergetics/ivm.html)) in inter-tangency, forming the 6-edged simplex of edges 2 PVR i.e. twice the prime vector radius.This is home base or unit volume in Synergetics, so then the next question is how to relate it back to XYZ training you might have gotten in high school. Given Cartesians love to fill space with cubes and fixate on rectilinear as \"normal\", we should just do the usual and intersect our home base tetrahedron with its own dual, thereby supplying the 8 points to hang a cube frame.The geometry to prove this cube has volume 3, given the opening tetrahedron had volume 1, is really easy, is sometimes done as an animation (per Synergetics Folio and/or [color posters](http://www.rwgrayprojects.com/synergetics/plates/figs/plate03.html) in Synergetics2).So here's the Cartesian, staring at this sculpture, four tuned in balls, two tetrahedra, a cube. Given he knows the balls are unit radius (that's a given), it occurs to him that the cube's face diagonals are all edge length two (given they interconnect the centers of adjacent IVM spheres). This is one sphere diameter or one interval (0 Frequency), but it's [also unity-2](http://mybizmo.blogspot.com/2006/07/practicing-multiculturalism.html), so go with the 2 why not? Using Pythagorean Theorem, that gives edges of sqrt(2) and that to the 3rd power would be the sought-for volume, ergo sqrt(2)**3. So, if my toMAHto is 3 and your toMAYto is sqrt(2)**3 (or vice versa), then now we have the basis forconverting any polyhedron at all. Your volume will be a little smaller. Fuller liked 'em kinda close (easy on the memory -- \"we rule, but only by a tad\").Where this sqrt(72) comes from in the original two volumes I have no idea, but I'm guessing this is something from [your Synergetics Coordinates contraption](http://mybizmo.blogspot.com/2006/08/name-collisions.html), which lives elsewhere in the literature (e.g. on MathWorld and Wikipedia, though that Wikipedia page needs a champion -- you were rather critical of it in this archive, no one else seems to know what it means).Kirby[](http://www.flickr.com/photos/17157315@N00/3505487428/)new from [Hop David](http://controlroom.blogspot.com/2009/03/quadpod.html)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}