{
  "id": "8535631895114071511",
  "title": "Yes Men Fix the World (movie review)",
  "published": "2012-02-12T19:06:00.000-08:00",
  "updated": "2012-02-20T12:16:54.356-08:00",
  "content": "I recommend [seeing both](http://worldgame.blogspot.com/2004/11/yes-men-movie-review.html) if you can deal with either.  These films are great satire, but then the clowns are really high on that wire, which had better stay taut.\n\nThere's a Sesame Street air about the whole thing, a kind of lecturing to moral imbeciles.  How does one get across a sense of top management? \n\nCopy TV.  Those newscasters are so good at pontificating -- there's a reason the preacher is in the pulpit.\n\nThe [Halliburton disaster suits](http://youtu.be/H6wWOvU-Mf0) are especially rolling-in-this-aisles funny. \n\nWe watched it [at Blue House](http://worldgame.blogspot.com/2012/02/calendar-dates.html), LW & M snuggled on the couch, me slogging through a standard workflow [on the Air](http://mybizmo.blogspot.com/2012/01/on-air.html), chuckling along the way.\n\nDow tried to take 'em out, with the \"cruel hoax\" line (against the people of Bhopal -- I'd thought of that too), delivered perfectly. \n\nThat could have sunk 'em, and their only recourse was to head to Bhopal and hang out, actually get the reaction.  Yes, some had wept for joy, but then understood the heroics, like the heroics behind that [Other Tomorrow](http://controlroom.blogspot.com/2009/01/salons-dot-net.html) New York Times edition. \n\nShades of Sasha Cohen (another brave heart).\n\nThe guys express their fear levels in several ways, including during the opening credits.  The fear of losing one's head, to the guillotine, for using it, is not empty paranoia [when you really are](http://youtu.be/7QjUF6dGATk) about to address a few million people as the faux representative of an evil empire.\n\nBut then the real representatives have their fears too, in looking so greedy-inept with their lame form of [faux capitalism](http://controlroom.blogspot.com/2011/05/cowardly-capitalism.html) (which is about using other peoples' heads, mostly -- Milton Friedman's especially if you can afford the look).\n\nI understand the nightmare these guys live in.  They win their battle over and over, keep making their point.  But what really changes?  The goal isn't winning then?  It comes as a revelation.  Conditioned reflexes don't change that fast and the three laws of robotics get broken left and right (positronic might have been better dontcha know (yes, an Asimov allusion)).\n\nThere's a Doppler Effect at work.  Every event is also a potential time bomb, [MIRVed](http://worldgame.blogspot.com/2006/06/on-job.html) to hit (have some impact) in multiple elsewheres in a chain reaction, leading to tipping points and avalanches.  They teach about these patterns in Systems, [at Wanderers](http://mybizmo.blogspot.com/2005/12/avalanche-awareness.html), common as rain.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}