{
  "id": "586062871443766549",
  "title": "Zardoz (movie review)",
  "published": "2015-09-17T23:35:00.002-07:00",
  "updated": "2015-09-19T13:29:52.639-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/21371670445/in/dateposted-public/)\n\nThis is an [oldie but goldie](http://www.imdb.com/title/tt0070948/) I'd probably never have seen were it not for Alan Potkin of Brooklyn NY (by birth) becoming a lightning bolt in my reality, joining me at Horse Brass out of the blue (we set it up by cell) along my Belmont Street descent from Mt. Tabor (local hill), getting back in shape from a bout of ankle-itus.\n\nAlan and I always have lots to talk about.  He's been in these blogs [before](http://worldgame.blogspot.com/2015/07/july-4-2015.html).\n\nAlan's wife, from France originally, is a distinguished scholar of that region of the world we think of as [mostly Burma](http://worldgame.blogspot.com/2011/01/beyond-rangoon-movie-review.html) (Myanmar) these days, a region where ethnic strife continues, with world religions in the blender, mixing it up to make puree.\n\nAlan shares her deep love for this region and goes there to pursue projects.  They married in our living room in Thimphu in the 1980s.\n\nThe fact that humans adapt to their world differently and then get flung together by fate, as is happening now in [the EU](http://controlroom.blogspot.com/2015/09/pedestrian-thinking.html), how the US was formed, has never been smooth, to say the least, though in isolated cases (e.g. specific marriages) it can work out well and serve as an inspiration to others.\n\nSomehow the conversation turned to Zardoz, a film, and since we were but a block away from Movie Madness, I was eager to prove its \"we have everything\" reputation, and indeed it did, filed by Hollywood Director, [John Boorman](http://www.imdb.com/name/nm0000958/), who wrote, produced and directed it.\n\nBoorman is of British heritage Alan wanted me to know (i.e. he didn't only work through Hollywood's institutions), continuing our conversation later, with Carol, at Maru, the Japanese restaurant (Alan was ecstatic about the squid).  We'd watched the DVD, sans Carol, in my living room.\n\nLets see if I can get this right after only one viewing (I'm tempted to watch it again but hey, I'm not making a living as a movie critic and have to keep moving).\n\nZed (Sean Connery), a badass outlander, gets angry and disillusioned when his preferred lifestyle, with the Pentagon (by analogy, not mentioned), is disrupted by the stupid Sky Head, which now wants them to try agriculture.  The Sky Head used to barf guns, telling them to go crazy.\n\nInstead of shooting the Brutals and raping their women (maybe the best part), Zed now has to teach them to farm, which is tedious and without shooting.  However by this time he's literate himself and knows the stupid Sky Head is really like some Wizard of Oz instrument of control, and the civilization behind it is just using him.  So he resolves to stowaway and get revenge against higher management.  This he does.\n\nHigher management, in the meantime, has existential worries of its own, having tricked itself into immortality without sex.  They're bored, plagued with a serious death wish.  Apathy and senility are claiming their people, or they become renegades, which is also not fun.\n\nReal death without coming back simply as another copy of the same worn-out persona, the same goon, would be a blessing and Zed, and those like him, may be the answer to their prayers.\n\nThe film ends on an up note, as needs dovetail and sex is back in the picture.  Everyone seems to get what they wanted.\n\nAlan has been checking up on the hydrological projects, i.e. the hydroelectric dams, in South / Southeast Asia that have occupied his attention for the past few decades.\n\nHis technique is to boost the efficacy of environmental impact statements by pushing the PDF format to its limit, including movies of the waterfalls and waterwheels, the cultures, that might be lost if engineering fails to optimize for tourism and local welfare.\n\nFortunately, in many cases, by using pipe-fed turbines, as in Bhutan, engineers may take advantage of drops in the topography, i.e. of gravity, without a massive dam.  The pipe fills to capacity, but is not sucking down or backing up the whole river and thereby develops sufficient pressure for at least a micro-hydel-style turbine.\n\nOf course this solution is not always relevant.   I'm just glad people have been thinking outside the box a little.\n\nThe Feng-shui of optimal power generating, that takes everything into account, is something we would hope the Chinese would be good at, but engineering needs to advance in its understanding of itself too?  [We shall see](http://mybizmo.blogspot.com/2015/05/engineering-as-moral-enterprise.html).  From my viewpoint, Alan has been encouraging the engineering to improve.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}