{
  "id": "2398193235677936401",
  "title": "Zenith (movie review)",
  "published": "2012-09-10T21:24:00.000-07:00",
  "updated": "2012-09-13T09:47:00.785-07:00",
  "content": "This is an atmosphere film reflective of the times.  The theme of the film is how an authoritative voice seems controlling, especially when it comes from some hidden source, such that the true powers of the speaker remain concealed.  The vision of a murky \"they\" is formed yet to speak of \"them\" is to invite the view that one is paranoid -- a plot by \"them\" to make them think I'm crazy.  And so on.  That's the ballpark anyway.\n\nThe protagonist is gradually assembling a puzzle, in which his father figures as a similar lonely crusader.  The assemblage takes the form of videotapes.\n\nThis film revels in the cliches that film itself has richly textured.  Abandoned urban vistas.  The list of names, some already dead.  Obsession with one's own story, filming oneself.  The transformation of the dad, from priest to haunted unabomber-like figure, a lone hero against the machine, is striking, and as the \"Making Of\" feature makes clear (DVD version) was filmed in reverse, i.e. the dad gets more clean cut as we go back in time.  Shades of Memento.\n\nI think a Wittgenstein reader might get something from this film as it turns reciting the dictionary meanings of thought-provoking words into a subversive activity (shades of Fahrenheit 451).  The mainstream is barely shown, as we're confined to an underworld, but what we're given to understand is the majority is in a state of perpetual oblivion, a kind of state-crafted happiness, imposed by the success of medical science.\n\nThis was the semi-somnambulistic state we've been promised.  The fact that these words barely survive as recited definitions reminds us to think about meaning through use.  Use 'em or lose 'em.\n\nZenith is reminiscent of Zion in The Matrix in some ways, less a place than a direction, but in this case sinister rather than a last refuge.  To ask about Zenith is merely to mark oneself as another ranting 2012er, another prophet, medically treatable, in an age when speaking in tongues seems about the best anyone can muster.  The rest is pure banality.\n\nUnder the torpor and sex are the sordid secrets and sadnesses, the sins, the broken taboos, for which we no longer have the words, a sin in itself.  The saints are not dragon slayers.  They're paupers and mentally ill who still speak truth in their innocence.  The down and outers have a special ability to see Satan, always a peripheral figure, beyond idols and avatars.  As I was saying, the currency is cliches, but exquisitely wrought and therefore able to forge lightning bolts in the unconscious.\n\nThe director is eloquent in the \"Making of\":  his purpose is to contribute the kind of movie we can all read into, such that when we discuss it later, over pizza, we don't just have pat and shallow opinions.  He wants to wake us from our Matrix a little, in the spirit of film-making (and theater) as a vehicle for heightening self awareness, expanding consciousness.  Exploring the unconscious with steadicams:  a way to go.  Shades of [Chernobyl](http://controlroom.blogspot.com/2012/06/more-movies-mcmenamins.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}