{
  "id": "2713229676917904752",
  "title": "Zero Dark Thirty (movie review)",
  "published": "2013-02-24T22:42:00.004-08:00",
  "updated": "2017-05-31T21:04:46.370-07:00",
  "content": "I thought I might miss this one but JS at the Meeting said it was good and not all that biased in his view.  Not sure what to make of that, my curiosity piqued, I made time after a Hilton lunch at ApacheConNA, where Alexia and [Christine](http://worldgame.blogspot.com/2013/03/argo-movie-review.html) and I joined up with director Holden.  Christine had her own truck and took Alexia onward, while I ducked into the Regal in Fox Tower.\n\nKatherine Bigelow has already made a name for herself in the war movies department, [with Hurt Locker](http://controlroom.blogspot.com/2010/11/hurt-locker-movie-review.html).\n\nEveryone gets what they want to some level.  Letting the solo agent make the positive identification of UBL was a good touch.  Did she have much choice in that being who he was at this point?  The big plane seems a little hollow at the end, when the whole point of her career until now has been to reach this point, so now what?  Make a movie about it?\n\nPakistan is properly alert to having some airspace invaded.  Choppers always have problems so don't call me a spoiler.  It's not like the U2.  Remember the President Carter thing with the helicopters?  The movie makes some literate allusions into the lore,  [Charlie Wilson's War](http://mybizmo.blogspot.com/2007/12/charlie-wilsons-war-movie-review.html) isn't far in the background.\n\nHad UBL actually died years before, this would have been the better story then too, and there would not have been much to cross-check its authenticity.  This movie is far from claiming to be an historical rendering of events.\n\nThat followup movie would talk more about who got what out of the deal.  The CIA is portrayed as having been made to look bad after 911, when it falsely claimed WMDs were being stockpiled (remember that dog and pony show at the UN?  They watch that in grad school now and learn that NATO intelligence was clearly inferior, jealous of UNSCOM and Scott Ritter).\n\nSo now it was all up to this [Lindsey Moran type](http://worldgame.blogspot.com/2005/02/methodist-morning.html) to not be so wrong this time.  She needed her loyal fans.  The (movie) director counts on at least some being won over.  She's the UBL hunter, straight from high school.  Not necessarily a gun nut either.\n\nSpeaking of the director, the actor, Gandolfini (Tony Soprano), looked [not unlike Panetta](http://worldgame.blogspot.com/2017/03/wading-around.html) as CIA director I thought, if maybe rounder.  The NSA had a role too, as a skeptic and reality check.  We were back to the embassies and [Fortress America](http://worldgame.blogspot.com/2004/12/team-america-world-police-movie-review_04.html) (I remember those under-car mirrors).  Not too hard to understand.  The US president was close at hand, was the feeling (as thoughtful, analytical).  The narrative looks for its boosters within White House circles.\n\nMaya is not totally unsympathetic (more would say the exact opposite) in that she does net better treatment for the first torture victim, who starts getting some decent treatment eventually, though not Hilton quality certainly.  Being truly amicable goes a long way.  Not that we see much of that in this film.  USAers are an unfriendly bunch for the most part, as cast, eager to detain you or at least snatch your cell phone at gun point (not shown).\n\nAlthough persistent, Maya is not expected to have paranormal abilities (Casey was known to look for ESP on one's resume), there's no remote viewing except what comes in from satellites, nor does she need to speak or read other languages.  She has to go through translators and her collection of torture CDs would need to be dubbed.  She's an attainable role model maybe.  There's no assumption she's expected to bed-bounce her way to the top either.  She's more like a good Muslim in that way.\n\nThe birthday cake plot element again seemed to echo back to Iran and Ollie North during Reagan's term.  They (he and McFarlane) were hoping to butter up some arms trader in that storyline.  Or was it Ayatollah Khomeini himself they were hoping to charm?  I'm Googling old articles as [I think back](http://worldgame.blogspot.com/2006/06/on-job.html) to [those days](http://www.foreignaffairs.com/articles/53099/eliot-a-cohen/a-spy-for-all-seasons-my-life-in-the-cia).  There's a sense of betrayal.  Iran is a still a \"bad guy\" in Washington's simple \"friend or foe\" neural logic (simpler than Drosophila's probably).\n\nI should see that other new spy movie about that op (rescuing hostages), which I remember learning about closer to the time in early public accounts.\n\nAnyway, the movie hopes we're at least friendly enough to buy some of these images of who and what Americans are supposed to be.  There's this hunt for UBL.  Now it's over.  They shoot a lot of parents coldly, telling the children it's OK.  The Pakistanis aren't so sure this is acceptable.  They're told to stay back.\n\n[US military helicopters](http://worldgame.blogspot.com/2012/09/the-love-song-of-rbf-movie-review.html) have become a cliche and/or trope, thanks to Vietnam War movies.  This film takes the challenge of the chopper sound to heart and explores \"stealth chopper\".  Can a helicopter be made quieter than a dog barking?  The soundtrack poses that as a kind of physics question, testing our willingness to suspend disbelief (another variable, a wild card).\n\nI know many of the events mentioned were real enough.  Nancy Irving herself told me what it was like [at Friends House](http://worldgame.blogspot.com/2006/04/london-knowledge-lab.html), after that bus explosion in London.\n\n[Tony Soprano](http://mybizmo.blogspot.com/2011/09/my-character.html) is perceptive, noticing the ISI is close to UBL's secret hangout. There's a negotiated flavor to this settlement.  Something for everyone.  Washington DC continues to play some imperial headquarters full of bossy types.  The film suggests [spunky women](http://mybizmo.blogspot.com/2012/04/world-affairs-afghanistan.html) (who know when to cuss correctly) have a bright future at Langley, [token blacks](http://controlroom.blogspot.com/2009/11/spook-who-sat-by-door-movie-review.html) too, and OK to be Muslim (Wolf a nice touch).\n\nI returned to ApacheCon in time for the whiskey social.  A lot of the guests are from other time zones and some are furiously working on their talks.  I empathize.  We later joined Ashley at Rock Bottom.  Both her parents were or are in the military.  Mom is a medic.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "control_room"
}