{
  "id": "5290951485524797717",
  "title": "4D Meme",
  "published": "2016-05-16T17:04:00.005-07:00",
  "updated": "2016-05-17T08:47:11.126-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/26779956810/in/album-72157624750749042/)\n\nFig 1: three number lines\n\nIf three number lines are place tip-to-tip in a zig-zag (non-coplanar), a half-tetrahedron (pink) will be defined, complemented by the other half (black).\n\n[](https://www.flickr.com/photos/kirbyurner/26994976021/in/dateposted-public/)\nFig 2: three-vector zig-zags\nfrom [Fig 110A](http://www.rwgrayprojects.com/synergetics/s01/figs/f1000.html) of Synergetics \n\nPicture the three number lines (each made of two rays), starting as line segments, then growing or subdividing without limit.\n\nThese same three number lines, made mutually orthogonal, define the origin (0,0,0) in XYZ.  These number lines likewise extend without limit to define volume or [all-space](http://link.springer.com/chapter/10.1007/978-1-4684-7485-5_12).\n\nGiven six number-line edges define volume (3 + 3), we may say space is 3D.  The pink zig-zag of three segments might even feature two right angular turns.  The set {(1,0,0),(0,1,0),(0,0,1)} is cast as the basis set for spanning this space.  Every point is reachable by (x i, y j, z k) where x,y,z are Real numbers.\n\nAlternatively, we may highlight the four vertexes and faces of the full tetrahedron and define [res extensa](http://coffeeshopsnet.blogspot.com/2009/03/res-extensa.html) as inherently 4D (self-evident fourness), with quadrays ([caltrop coordinates](http://mybizmo.blogspot.com/2015/09/manga-on-mul.html)) emanating in four directions from origin (0,0,0,0) and spanning space in linear combinations, no negating operation required.\n\n[](https://upload.wikimedia.org/wikipedia/commons/9/99/Quadray.gif) \n\nFig 3: Q-rays\n\nIn Fig. 1, R3 is shown as a \"4D\" tetrahedron (pink and black). In Fig. 3, the four basis vectors (1,0,0,0), (0,1,0,0), (0,0,1,0), (0,0,0,1) with \nscalar multiplication by non-negative numbers are sufficient to span R3 through linear combinations.\n\nAlthough we may consider space 4D, given the iconic stature of the tetrahedron, upon subdividing the edges to show growth by subdivision, we obtain a 3rd power sequence relative to the frequency of the edges.  3rd powering is [likewise illustrated](http://www.rwgrayprojects.com/synergetics/s09/figs/f9001.html) with a tetrahedron.\n\n[](https://www.flickr.com/photos/kirbyurner/26788519750/in/dateposted-public/)\n\nFig 4\nFig. 4: 3rd Powering\nfrom [Fig. 990.01](http://www.rwgrayprojects.com/synergetics/s09/figs/f9001.html) in Synergetics\n\nIn the shoptalk of XYZ, we say R3 is 3D.  However, the all-positive basis vectors remain helpless to reach 7/8ths of space without the operation of negation -- flipping 180 degrees -- an operation provided by scalar multiplication in conventional linear algebra, and providing the additional -i, -j, -k of the familiar \"jack\" pattern.\n\nIn the shoptalk of Synergetics, we say the IVM is 4D, given the self-evident fourness of the tetrahedron, yet without denying 1:2:3 power aspect of linear : areal : volumetric growth.  The four all-positive basis vectors do not require the flipping operation of negation (by definition rotation) to span all-space, only vector scaling and vector addition.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}