{
  "id": "6349445546633859226",
  "title": "A Quick State of the Union",
  "published": "2013-10-18T22:56:00.000-07:00",
  "updated": "2013-10-18T22:56:50.401-07:00",
  "content": "This blog evolves rather slowly compared to the several others I write for.  Hello, I'm the Chief Marketing Officer (CMO) for this non-existent yet nascent network of coffee shops, emblematic of Philosophy (French influence) and of intellect more generally.  Portland, Oregon is a great place to experience the culture, but so is Rome, Italy.\n\nI'm not clamoring to be a Church although that's probably the easiest way to get an easement in some of the controlled substances acts, but this is not about rushing communities to accept new standards.  If you want to experiment, try a cruise ship or charter maybe, but make sure your captain and crew don't drink the kool-aid, whatever that may be, i.e. there's a line between those experiencing the show, and those putting on the show (staff and guests, thespians and audience, newscasters and news viewers).\n\nI mention controlled substances (like alcohol and tobacco) because the next think you imagine I'll talk about is gambling.  They go together right?  But then your Church basement was typically smoke filled, i.e. consenting adults are allowed to make wagers in some game of chance like context.  It's the shape of that wagering that states like to control.  Can you bet on dogs?  Off track?  I barely know what that means.  You had people \"running numbers\" in all the old cop shows.  What were they doing exactly.  Ask an anthropologist.\n\nBut yes, I'm going to mention games of change and skill both, arcade game style and other, wired up to donate to charities.  Yes you can do this from home.  Generous people right now are playing games to give money.  My late wife assiduously played a few each day.  Small amounts were presumably being made, to feed the hungry, to save the wolves, that kind of thing.\n\nThe business plan here is the product sellers, the brands behind the counter, are using games to help build brand loyalty and brand recognition.  The whiskey company maybe doesn't own the rights to the game inside, but the company logo is still a game element, product placement one could say.  Companies aren't bound to stay literal.  If an elephant is your mascot, why not go with that?\n\nPatrons may pony up their own funds, but a lot of turns at play are sponsored.  Getting that Voodoo Donut includes a spin or two of the wheel, or maybe something more involved.  The point is you're engaged in an heroic episode at the same time the sponsor is pledging your winning to charity.  That's actually a potent mix.  Doing well to do good.  People enjoy that kind of challenge, with or without a Coffee Shop setting.\n\nYou could say the point is to give ordinary people a sense of what it's like to be a philanthropist and give generously, changing the course of human events thereby.  We can't all expect to steer at the same level in the same way, but a game with the point of giving, and requiring at least virtual heroics, is potentially quite exciting.  One could say giving to charity is addictive in this new form, but if that's the case, I can think of worse forms of addiction.  Lets have this form of addiction (unable to stop charitably giving) be a new problem, one we'd like to have.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}