{
  "id": "471822841320425036",
  "title": "A Technology in Snapshot (CSN)",
  "published": "2022-11-07T17:28:00.003-08:00",
  "updated": "2022-11-10T10:56:24.350-08:00",
  "content": "You might be wondering about the embedded YouTube, assuming it's still there (assuming too much?), which is about using a Python computer language framework named Flask as a front end to some back end defined by its API.  This would model a Food Cart in a Pod (or out by its lonesome).  Flask shows the menu and talks to a back end to complete the transaction.  Crypto-currencies might be involved (that was the thinking anyway).\n\nThis architecture was somewhat my focus as __CMO__ (chief marketing officer) as I tried to wrap my head around how front and back ends got along, in a language in which I was fluent (Python, and to some extent Flask).\n\nCSN (Coffee Shops Network), some of you will recall, is a Philosophy wrapping a Business Model that involves building your profile as both a player risk taker and charitable giver, a philanthropist.  \n\nCoffee Shops are a science fictional cross between an arcade game parlor and a coffee shop.  My locale had both Avalon and Quarter World within walking distance (for reference), and lots of coffee shops.  To say they're science fictional doesn't mean you can't create them for real, just that the imaginary component stays relevant, going forward.\n\nA Coffee Shop is expected to serve various goodies along with the beverages, as we've all (\"all\") experienced at a StarBucks by now (not that this chain invented the combo -- Dunkin Donuts is a parallel implementation of the vision).  \n\nPortland features many coffee shop bakery combos, with fresh made from scratch baked goods to accompany professionally brewed blends.  \n\nExtrapolating along those lines, we get the more \"science fictiony\" versions (more speculative), encompassing the idea of \"study drugs\" or whatever local universities experiment with.  The hypertoons with optionally tunable soundtracks, review a lot of topics in high bandwidth, including medical stuff.  Not every \"study hall\" is themed the same way.\n\nThe focus might be the games themselves, or the meta-game of having the games net usable income streams for actual players in the field.  This isn't all funny money.  Work gets done.  \n\nSupportive players that direct funds through arcades may later (or before) have a role at the other end, so to speak, e.g. where the orangutans are getting protected.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}