{
  "id": "2346622302250779937",
  "title": "A Writing Exercise",
  "published": "2022-01-17T09:45:00.012-08:00",
  "updated": "2022-01-17T10:22:40.088-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/a/AVvXsEjTzz_HZFN5lKUql5jYIqynkk4BP46YDrsHB_YZs2l_d3heGVki7QJxe8bOq76pu1Bbzq5qnm66gCSKMQC8_9Yt0p3u58V1hJmcSddltfwGIuohJnV3CBJXtNglr30IW9__Elf7seJYD0BnhYtV6QwLIUHZyu9bpb1GUXv2APUN8U_rKpTJ2ZfOZfZKBw=s323)\nI like the exercise / workout involved.\n\n\"What is it that we could be sharing from the Fuller syllabus that would accelerate humanity in a direction most would consider positive, relative to our direction today?\"\n\nFor example, since 1983 I've been fascinated by the fact that an American who wrote that \"the USA we have known is now bankrupt and extinct\" (giving his rationale, including on Constitutional grounds), also was awarded a Medal of Freedom from a president of the USA, right around the same time.   What a hoot!\n\nThat fact alone is too exotic and fun to not share, but no one does, which to me proves Bucky was right, as a real USA wouldn't be so dweeby-phony as to suppress this interesting historic fact that every high schooler should know.\n\nI also find it entertaining that we had years of \"Q anon\" talking about Mockingbird as a CIA project, without anyone doing enough research to connect our own Edgar with said Mockingbird, and to further connect him (a former Deputy Inspector General of the CIA it says on the dust cover of Synergetics 2) to the so-called \"deep state\" (which we could also say is very shallow, as in superficial) or to Synergetics (what's that, duh?).\n\nThat our Medal of Freedom winning OSS-affiliated cold warrior also came up with a new way to model 3rd powering, after literally millennia of casting only cubes for that job, but that universities are afraid to take this topic with anything like the seriousness it deserves, thanks to politics, is further proof that overspecialization just leaves even the most intelligent people feeling helpless and not in a role where it could ever be up to them to make a real difference.  The professoriate deserves to be called out.  More than canceling student debt, I say they all deserve a refund.  Remember, \"lack of money\" is not the issue.\n\nI watched Chris Hedges again last night, and although he's good at sounding the death knell for American democracy, he's not willing to acknowledge that Bucky was circling the idea of \"corporate personhood\" contemporaneously with Ralph Nader in pointing out that the soulless non-humans were now running the show.\n\nIn short, Fuller's story has all the elements we need to create those interesting and disruptive narratives that shift us onto new tracks.  It's not at all Bucky's fault that we're too phony-dweeby to take advantage of this legacy.  We sit around like deaf-mute idiots instead.  That's our legacy.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}