{
  "id": "8929582539752578013",
  "title": "Americana",
  "published": "2009-05-30T07:00:00.000-07:00",
  "updated": "2014-06-12T14:34:39.547-07:00",
  "content": ":: project earthala, work in progress ::\n\nRecall the early days of CSN if you will (the time of this writing): a sick and twisted bunch was still bullying stoic Americans into no-win situations while the writings of a decorated cold warrior (Medal of Freedom), inventor and designer (architect, philosopher, [cartographer](http://www.flickr.com/photos/17157315@N00/3409769661/in/set-72157616066135225/)), were kept away from [most](http://www.flickr.com/photos/17157315@N00/3292180674/in/photostream/) high schools by a jealous gulag professoriate, leaving us vulnerable to nightmare policymaking by these semi-secret cabals of uber-cowards. Not a pretty time.\n\nAs patriots, we fought back through self schooling, got ourselves an education despite all the censorship and refusenik anti-intelligence (idiocratic) biases. We formed our own networks, our own underground, complete with [esoterica](http://coffeeshopsnet.blogspot.com/2009/02/more-inside-story.html) and [lore](http://www.flickr.com/photos/17157315@N00/sets/72157607350755934/), and CSN was proudly a part of that, helping rescue a great country from the clutches of the mendacious and unwise.\n\nSo yeah, it's OK to display the flag now and then, other patriotic symbols. That \"Don't Tread on Me\" snake is a favorite, ties in with our [Cult of Athena theme](http://coffeeshopsnet.blogspot.com/2009/03/boot-track.html) (meme), given [Athena's protector](http://www.flickr.com/photos/17157315@N00/3526413823/). Even if you're not an American, you're likely better off now that we're emerging from tyranny, have regained the freedom to teach our own heritage, make [our own history](http://worldgame.blogspot.com/2009/07/wanderers-2009729.html).\n\n[](http://www.flickr.com/photos/17157315@N00/3552043523/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}