{
  "id": "4278546823760699367",
  "title": "At the Bird Feeder",
  "published": "2017-02-20T18:09:00.002-08:00",
  "updated": "2017-02-20T20:29:07.626-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/32898181141/in/dateposted-public/)\n\nHere I am, an Oregon-based math teacher, flapping around the bird feeder [looking for cyber-currency ](http://coffeeshopsnet.blogspot.com/2016/06/donate-to-csn.html)to keep my Internet channels alive.\n\nThat I had to replace the Android and lost my mycelium wallet bitcoin app is no help, and now I've lost the bitcoin public key. I just need to start over.\n\nNot that I expect anyone has slipped coinage into that particular begging cup, deeply buried and now lost.\n\nOCN ([Oregon Curriculum Network](http://www.4dsolutions.net/ocn)) has gotten as far as it has with mainly me as its principal sponsor, though I acknowledge the booster rockets have helped.\n\nThese days I'm with Coding with Kids and helping middle-schoolers acclimate to [eye-balling source code](http://mybizmo.blogspot.com/2017/02/prime-numbers.html).\n\nHaving the topic be akin to what they're covering in class anyway, helps reinforce both the relevance and potential familiarity of the \"learning to code\" branch.\n\nLast week was Prime Numbers.  This week is Triangles.\n\n[](https://www.flickr.com/photos/kirbyurner/32898181641/in/dateposted-public/)\n\nI also teach older adults at night, so sometimes bill myself as \"pedagogue by day, andragogue by night\".\n\nThe more \"adult version\" of the Triangle class both includes more concepts about triangles, and uses more of the Python language.  I've got that [at Github](https://github.com/4dsolutions/Python5/blob/master/tetrabook.py).\n\nCodesters is not a full implementation of core Python, plus includes many __builtins__ that core Python does not have.  Sprites for example. And a stage.\n\nYou'd think as CMO of [the CSN](http://coffeeshopsnet.blogspot.com/2016/06/donate-to-csn.html), I'd be doing that full time, but lets remember this was 2017 and most adults were not informed about American Transcendentalism.  We were still bootstrapping back then.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}