{
  "id": "2678860618635257087",
  "title": "Autobiography Night",
  "published": "2009-11-14T10:33:00.001-08:00",
  "updated": "2009-11-14T12:00:20.714-08:00",
  "content": "An autobiography is a subtype [of travelogue](http://coffeeshopsnet.blogspot.com/2009/03/travel-bar.html), or vice versa if you prefer, and both tend to use the first person, by which I mean:  an autobiographer usually assumes the role of the \"I\" when telling the story, which the listener will presume contains an individual bias, but doesn't begrudge, as we're each entitled to a point of view.The \"objective voice\" in contrast, or third person, is more self effacing and authoritative, so is more likely to be challenged or critiqued by those disagreeing with the implied narrator's views.  A typical autobiography will contain a mix of both, with the author shifting to more omniscient tones when needing to provide more context.Not every coffee shop will want to program these circles, but we increasingly have customers prepared with five minute thumbnails about their lives.  Onlookers who realize this is an emerging genre will get to work on their own.The short versions are often distillations of the longer ones.For example, [here's a link](http://www.jflory.org/family_history.htm) to a family history with autobiographical components by Jim Flory.  He and I have worked together around several Quaker events and have in common this attribute of growing up in the Philippines, myself as the son in a post-WW2 technical family doing development planning, himself as the son of prisoner of war missionaries (heading for China) in a Japanese internment camp in Baguio (the USA federation had [some similar camps](http://worldgame.blogspot.com/2005/02/adult-first-day-program.html) for those of Japanese heritage during this same time period).In a kind of [cross-roads coffee shop](http://coffeeshopsnet.blogspot.com/2009/05/lunar-coffee-shop.html), with visitors from many corners, you'll get some exotic autobiographies and these will tend to tie together for listeners, as they come to see a common backdrop of history.Do not underestimate the value of this opportunity, probably worth some energy and work on fine tuning.If your shop keeps an archive on the web, remember to invite your guests to post links to their web sites.  Sometimes a Wiki is the best structure, perhaps a part of the larger web site.  Notice how [Python.org](http://www.python.org/) includes [a MoinMoin](http://coffeeshopsnet.blogspot.com/2009/05/lunar-coffee-shop.html) with volunteers tasked with keeping it updated.Providing every customer with direct access, even via a guest login, may not be the preferred system i.e. a wiki with restricted access is not a contradiction in terms, never mind what others may have told you.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}