{
  "id": "8467027753614013426",
  "title": "Base Camp Meets Coffee Shop",
  "published": "2016-03-29T15:05:00.002-07:00",
  "updated": "2016-03-29T15:07:49.128-07:00",
  "content": "I find it both anomalous and fitting that my \"math is an outdoor sport\" scouting meme, and my Coffee Shops Network meme, are floating together.\n\nThe scouting meme connects to the more discipline experience of life on base, training, a boot camp, with the coffee shop a place to relax and unwind, off base, a [safe retreat](http://coffeeshopsnet.blogspot.com/2014/03/gi-coffeeshops-tour-2014.html).\n\nThe two institutions balance one another.  Student union.  Back stage (off script).\n\nThe reveries on the LCDs help with studying, with some reveries doubling as thinly veiled PR for whatever superstar course.  Come to space camp or whatever.  Remember we have winner philanthropists in the room.  Even if they don't sign up themselves, they might sponsor.\n\nIf you're looking for opportunities, just watching these screens will give you ideas sometimes.\n\nHowever there's no need to be too impulsive.\n\nA good boot camp is surrounded with a gradient, different levels of commitment.  Help students feel their way forward.  Road maps:  also a good idea.  Take the Introduction to Programming course, find out which \"full stack\" or \"tool chain\" might best fit your dreams.\n\nI'm using \"code school\" and \"boot camp\" almost interchangeably, but then injecting more from the cooking and camping arenas, more farming.  The Internet of Things does not always mean tiny things.\n\nCooking in an industrial kitchen teaches about concurrency (kept promises trigger what to do next), as does theater whereas coding for exceptions handles promises not kept.  Things happen.\n\nAs I was mentioning on mathfuture earlier this morning, we want a Tractor class in part because we may be using a real tractor later that same day, or in a next work/study stint.\n\nSoftware engineering, sensors, tracking inventory, weighing costs (trade-offs):  this is systems analysis and agile, all rolled into one.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}