{
  "id": "7728329026570585555",
  "title": "Bookkeeping Cartoons",
  "published": "2010-01-08T12:14:00.000-08:00",
  "updated": "2010-01-14T13:40:39.495-08:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/4261248028/)I'm at Muddy Waters listening to an afternoon performance by Amy Bleu while communicating with Saturday Academy regarding this [\"future math\" option](http://worldgame.blogspot.com/2010/01/back-to-future.html) (\"time machine\" theme, summer math camp).Regarding the post below, re Adrenaline Week, there's this hand-drawn thermometer showing whatever funds have come in, but is that really sufficient?  Obviously one needs to account for the pennies, show what's coming in, what's going out.In the utopian future of philanthropic coffee shops, the story might be given a more visual form.  If someone makes an earmarked donation at the point of sale, some control panel shows that amount going to that particular bucket, adding to the total.Because this is open source software, geeks know this visualization isn't fudged.  These are real numbers tied to real accounts, and if you need the transactions in spreadsheet form, or as csv files, that might be arranged.The model needs to be reconfigurable.  Running a fundraiser for the house is different than hosting a teach-in and committing the funds to some worthy cause or charity.Having the books in \"cartoon form\" is what CEOs and CFOs hope to get as well -- some synoptic colorful visualization that shows clearly what's going on with the company.That's a difficult challenge sometimes.Coffee shops might be able to pull it off though, given the relatively simple business model.The software should be replicable to multiple shops and not completely ad hoc.  Economies of scale enter in.As CMO for CSN, am I able to write all this software and put it on line?  Are my Python visualizations LCD-ready?  Do I have all the Javascript written and ready to go?  Nope.I've been harping on this idea of more game-like front ends for bookkeeping systems for quite awhile now.  Yes, it's a great idea.Given the TV-soaked world we live in, I'm thinking a tilt towards the graphical might rescue the lexical.  Making money management a kind of video game is not a waste of bandwidth, it's a way of including the TV-literate public.Absent transparency, fundraisers tend to fizzle, as do the organizations behind them.Amy Bleu grew up in Hawaii and plays a mean ukelele.  She's donating any proceeds from sales, of CDs or T-shirts, to [Muddy's](http://www.muddywatersportland.com/).  Maybe the thermometer will go up a tick.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}