{
  "id": "4303682359793166248",
  "title": "Boot Track",
  "published": "2009-03-19T07:57:00.001-07:00",
  "updated": "2009-06-24T23:41:09.532-07:00",
  "content": "Welcome to the boot track for Coffee Shops Network.  Should Starbucks [be worried](http://controlroom.blogspot.com/2006/09/this-land-is-your-land-movie-review_28.html)? Maybe  Starbucks [could join](http://controlroom.blogspot.com/2006/09/this-land-is-your-land-movie-review_28.html)?We market philosophy, a buzz, and spread by academic citation, by URL, by footnote.  One \"becomes\" CSN simply by [talking turkey](http://controlroom.blogspot.com/2007/08/which-hollywood-star-for-president.html) the way we do, and that includes helping your sister shops come up to speed, both in marketing and in getting those game tables going.FAQ: \"What if I don't want 'game tables' or 'flatscreen TVs'\"?This is more about the philosophy than any specific claptrap.  An \"all things to all people\" approach is not good marketing.  [Esoterica](http://coffeeshopsnet.blogspot.com/2009/03/franchise-motifs.html) is not about \"safety in numbers\".In terms of buzz, this is a [Cult of Athena branch-off](http://controlroom.blogspot.com/2008/01/greek-polytheism.html), thinking of Nashville as a home in some ways, in terms of music.  On the other hand, we're influenced by McMenamins, Backspace, Laughing Planet, Missing Link... Gold Door in Portland, Oregon.  The game culture is brought to you by local area casinos, at least in terms of lighting levels and bling, so yes, there's a NavAm component, along with Pacific Northwest.Visually, we're vested in \"Neoplatonist eye candy\" by which I mean the new kind of geometry woven in through this boot track.  We connect to American Transcendentalism through Bucky and his great aunt Fuller, other co-conspirators ([Marshall McLuhan](http://controlroom.blogspot.com/2006/01/quotable-quotes.html)... [Barbara Marx Hubbard](http://controlroom.blogspot.com/2008/10/some-missing-history.html)).  We allude to the Apollo Project quite a bit, a tie to the space program.  Our kitchens owe plenty to naval submarines.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgc6z1w2iHG5Ag2YlpJp6YRC-a2yVl-U334RllhYNhSs036bIjEyy9b-3NSxRVWp-JVKPoKIPe-EjtIoWwkHf23QWSZjWMWV_2Y_Jjoxc1FxE4CKhpbBiGvjQmlEm_93h-WVHQLHgUCuYjf/s1600-h/bfuller.png)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}