{
  "id": "4996737757675049147",
  "title": "Business Model in Bitcoin",
  "published": "2016-05-16T18:22:00.003-07:00",
  "updated": "2016-05-17T08:43:36.391-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/26456798344/in/dateposted-public/)\n\nAlthough suggestive of Bitcoin in particular, the CSN model operates with any currency, [crypto](https://www.ethereum.org/) or not.\n\nCustomers of the Coffee Shop buy vended goods (e.g. snacks + coffee), with a percentage of the sale price committing to a Service Pool, which the vendor tallies as after-profit charitable contributions or Good Will (a legit line item in most charts of accounts).\n\nCustomers have the option to multiply winnings, drawing from the Service Pool, with said winnings committed to the service organization (or Cause) of the player's choice.  The shop is doubling as a center for engaging in philanthropic behaviors.\n\nNot shown in this diagram:  the customer's option to add victories (donations) to a profile (chronology).  What better way to advertise one's values?  Show a track record of philanthropic giving, thanks to CSN infrastructure.\n\nOther posts spell out more details as to how pooled Good Will might aggregate faster than payout in some phases, slower in others.  Imagine aggregate player ability as a variable, like collective IQ.  Would we want to re-normalize the games i.e. make them harder or easier, to control payout?   Changing the rules punishes those specializing in mastering a given sport.  Changing the payout is easier, though one may argue devaluing a game's relative payout is a change in the rules.\n\nYou'll likely notice that Casinos which do feature skill aspects to some games, face similar queries, which is why CSN is sometimes branded a casino chain, even with proceeds going to worthy causes other than self in most transactions, and not \"the house\" either, as the customers get to earmark and profile accordingly.\n\nCSN shops (nodes) do have some control over the menu however i.e. the range of worthy causes to which winners may commit their winnings.  Customers are free to shop around and/or play from home so shop constraints are not that onerous, merely reflective of a shop's own profile (a way of branding).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}