{
  "id": "2889047962730550863",
  "title": "Charitable Gaming",
  "published": "2016-07-31T12:24:00.003-07:00",
  "updated": "2016-07-31T22:05:23.562-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/28273311041/in/dateposted-public/)\n\n:: empowering the network ::\n\nOne might think the gamification of philanthropy would have inspired a huge number of businesses by this time.  What better way to be a hero, right?  In a thriving yet studious atmosphere.  Or in your personal workspace ([your cubby](http://coffeeshopsnet.blogspot.com/2011/10/cubbies.html)).  Play, win, donate winnings, self profile.  And repeat.\n\nThis blog has been promulgating the business plans in an open source manner, to inspire imitators and create the institutions necessary.  Some argue the churches, Catholic especially, that raise funds through bingo, are already in the game.  Let me point out [the differences](http://coffeeshopsnet.blogspot.com/2013/10/a-quick-state-of-union.html).\n\nIn philanthropy, unlike in Video Poker run by the state, funds are earmarked by the winner, the person having the game-winning skills.  The winnings don't go to some central coffer administered by intermediaries.  Vote your conscience.\n\nChurch bingo likewise puts the House (in the sense of Casino) in charge of winnings, forcing players into a selfish role.  Having players contemplate which philanthropies are most worthy inspires doing homework, on the part of the Study Hall as well.\n\nDid I just say \"Study Hall\"?  What is this, Hogwarts?  I meant \"Coffee Shop\" of course, in that we have vended goods.  Part of the business plan is to involve the vendors.  They're donating to charity and accounting that under Good Will, per standard bookkeeping practices.\n\nHowever, the vendors are willing to have players do the work of playing the games, playing to win, and committing the winnings to charitable organizations.  Buy a Voodoo Donut, get a chance at bat.\n\nThe vendors may have access to the analytics, for market research purposes, in itself a value.  Some companies may see their advertising budgets as backing these games.  CSN shouldn't have to busy itself with how others choose to keep score.\n\nWhat games?  Where?\n\nThe would-be philanthropic have no idea where to go, to send winnings to refugee camps, in Messy-potamia or wherever.  Hey, sorry for the somewhat crummy pun.  Potamia is a mess these days, I think we'd agree, thanks to the undisciplined use of airspace and sinking groundwater. \n\nMeso means Middle, as in Mesoamerica.  The \"meso\" became \"middle\" as in \"Middle East\", with Potamia always a popular name, used by [many places](https://en.wikipedia.org/wiki/Potamia).\n\nHowever there's no reason a charitable donation has to go half way around the world.  Sometimes those closest to the action have more perspective.  Support projects close to home.  Let people know that you've done so.  Tell the world who you are, by sharing a track record of [whom you back](http://coffeeshopsnet.blogspot.com/2014/10/quakernomics.html). \n\n[](https://www.flickr.com/photos/kirbyurner/16849027251/in/photolist-rETEMR-oCevSK-bviRwD-9BjcKG-9s3TSF-6XAiwP-6VKWzG)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}