{
  "id": "2833738759383886970",
  "title": "Conversation Corner",
  "published": "2020-11-22T19:29:00.003-08:00",
  "updated": "2020-11-23T09:27:55.368-08:00",
  "content": "Lionel Wolberger was kind enough to take me up on my offer, to share my Google slides.  Perhaps some teacher in Vilnius (Lithuania) wants to present about Synergetics, or a civic organizer in Berlin or Singapore. I may never meet these people, nor learn of their activities, even though they've undertaken to share with my slides.  Lionel, on the other hand, has visited me in Portland, and is addressing me directly, taking advantage of our partially overlapping scenarios. I appreciate that a lot, but  keep in mind that's not a requirement or expectation on my end, i.e. you need not include me your audience.Let's look at one of Lionel's observations, that Bucky was not that much of an institution builder.  I'm going to consider some of his other points too, in a next Youtube video.  For example I like his distinction between a folk or pop (popular) culture, and something more organized.  Tensegrity is a happening movement in pop culture, with or without academia.At the apex of Bucky's career (as seen from many an angle) he was the public face of an American futurism, as expressed in the World's Fairs.  As such, he emanated a semi-governmental vibe, as if he worked with NASA or one of those.  But then he was a self made man besides, the holder of patents.  He dressed like a capitalist and rubbed shoulders same.  He was avuncular, not unlike Disney.  To some, he was the friendly, happy face, of the military industrial complex, a cold warrior.As time went on, though, we see more of the arc in his trajectory. He did not expect our contemporary ideas about nation states to withstand the crush, or crunch (or \"grunch\") of giants, meaning the global supranational entities operating using global strategies.  He became another Nietzsche in prophesying a twilight of the idols, a transformation beyond the everyday soap opera of \"good versus bad people\" (see the Critical Path introduction). This wasn't the politics of winners and losers.He's pretty up front about his long term views from the start, but his speculations seem far fetched and unrealistically long term in the 1940s and earlier.  He was projecting into that mythical distant future, that no man's land.  Did humans really need to think and plan that far ahead in their lifetimes?  For what purpose?  Now that we're actually here in the future, in late 2020, it feels more like he could have been right in his predictions.In short, he started sounding less like an establishment figure and more like a subversive as time went on. By the 1970s he was butting heads with LAWCAP (\"lawyer-capitalism\" the next phase after FINCAP), while anticipating GRUNCH (the next synergy).  What would be left in his wake, institution wise?  Would humanity be here at all, in a form worthy of the moniker?In today's terms, we might say he took the tack of self branding and/or building his own brand.  He became a Youtube personality.  He'd always been into showbiz.  Both \"Dymaxion\" and \"4D\" were among his trademarks.  He wanted to build an individual's portfolio, not so much that of a team, company or tribe, in order to hammer home his chief contention: that the individual human was the integral unit of consciousness and inventiveness aboard Spaceship Earth, not our social constructs, not universities or corporations.That sense of the worth of an individual could sound imbalanced, and indeed many considered Fuller to be on an egomaniacal journey, a lost soul.  The balancing perspective, if there is one, enters the picture with intuition. Individual free agency is within the context of a transcendental gravity, which provides a compass.  This Emersonian or Quaker thesis, that each individual human has a sense of the whole (that of God) internally, is experiential and experimentally known, through testing, through trial and error.Bucky considered himself in a game of 4D chess aiming to maximize humanity's chances. That's a hero's journey for sure, but he didn't consider himself out of synch with the cosmos either.  He was working with nature, in service of mega-trends.  He saw the Apollo Project as not about conquering the Moon but coming to better understand her role in our story. With reductionism (the search for \"a bottom\") now off the table in Synergetics, intuitionism is what remains.  The major shifts he expected, heralded, catalyzed, would be attributed to the workings of the human spirit (or zeitgeist) working to fulfill its cosmic destiny. He thought humans had a purpose in Universe, having to do with its eternal regeneration.  The pilot waves he'd ridden would continue on. He retained his hopeful and combative posture. Might we say now that he succeeded?  Some would say it's too early, while others already see the signs.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}