{
  "id": "1687626525148975102",
  "title": "CSN Marketing",
  "published": "2018-07-11T20:57:00.001-07:00",
  "updated": "2018-07-29T20:06:53.760-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/28659277984/in/photolist-VrM5X4-TAyhxA-KEwhSu-KAoSBU-Kj6yvj-Jx87k5-mhBB6v-m1jX4K-dAphER-dAped8-dapQGV-d3p8jS-cz9neQ-cw1Tm5-82C1U6-6vq7dH)\n\nThe Coffee Shops Network is about paying you to be good at computer games.  Maybe that sounds like heaven to some people, or an impossible utopia, but hear me out:  it has always been that way, we've just had changing meanings for \"computer\" and \"games\" and \"good\" (also \"paying\").\n\nYou're rewarded for making computations that work out.  Great, so now we're talking like tautology.\n\nBeing good at computer games means you're good with your winnings.  You have fans following how you spend your credits, on your own reputation sure, by giving to causes.  We pay in you \"pass through\" money:  it's for charity, but you get to decide which ones, in proportion to your exercise of good judgement.  What you get paid for.  Back to tautologies again.\n\nIn a typical casino, the winner walks out with the cash and presumably buys flashy cars, cuff links, mink stoles, perfumes, other luxury items.  However, given the dire need for serious engineers and engineering, those making money that way don't get as much long term support, nor do politicians.\n\nPeople want institutions they might believe in, and in winning computer games, get an opportunity to show their support for same.  Other players watch and learn.\n\nA typical arcade game is an anonymous affair.  You may claim a high score, but probably won't have the necessary bona fides.  Formal sports are another matter.  Everyone knows the score.  A Coffee Shop may host a variety of games, however some of them may require that various records be kept, including the player's identity, especially where giving credit is concerned.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}