{
  "id": "8811817795588972582",
  "title": "CTO in PDX",
  "published": "2011-08-13T10:43:00.000-07:00",
  "updated": "2011-08-14T08:46:22.396-07:00",
  "content": "Welcome back to PDX, Nirel.  Good to catch up some. Related chatter on the design science and fashion meme: a focus on utilitarian gear, like the old fashioned Boys Life, but far more diversified and internationalized.   \"Survivalist\" conjures the wrong image as it's more just about perpetuating DIY skills, developing self reliance as well as a healthy sense of community (they go together).   Learning to grow one's own food or how to fix a farming tool is hardly \"radical\" unless you've been boxed in by supermarkets your whole life and don't know any different. Synchronofile has published [some data](http://synchronofile.com/fuller-in-fashion/) on design science fashion elements.  Groups like to differentiate on the basis of costume (or uniform).  I see no sign of convergence or conformity to a single standard. [Patrick Barton](http://mybizmo.blogspot.com/2009/08/ppug-2009811.html) (Portland Energy Strategies) and I have been yakking about the \"smart meter\" as related to \"smart house\" concept for quite awhile, with \"urban, semi-urban, rural and wilderness\" one of the spectra, when contemplating \"dwelling machines\" or \"sheltering systems\". What do these eco-village (not cube farm) installations have to do with CSN?   They're potentially [financially powered by games](http://coffeeshopsnet.blogspot.com/2011/04/q.html) pulled from stock, with heroics logged (journaled), values reflected, in the profile of the player.  CSN games may not be available through other venues or may only be playable as group activities (some games aren't for solo play). By analogy, you go to a sports bar for more that what's on the LCD. You and your peers (friends, chronies, co-conspirators) win for these tribes, help sponsor, even as you go and live among them sometimes, as a valued community member (MVP).   My [Project Earthala meme](http://mybizmo.blogspot.com/2007/04/ecovillage-update-synergeo-33452.html) is well developed in sister journals.  Think of some school for future diplomats in the Oregon high desert, as one of many worthy funding recipients, accredited through CSN circuits. Part of the equation is STEM and/or STEAM ([= STEM + Anthropology](http://groups.google.com/group/mathfuture/browse_thread/thread/785b1af1d3eae727/4cd7f223eb2657c8?lnk=gst&q=STEAM#4cd7f223eb2657c8)):  what is [a \"mathematician\"](http://worldgame.blogspot.com/2011/08/fnb-2011811.html) in this day and age, and might she likewise be an \"energy strategist\" (an optimizer, a doing-more-with-less pioneer). Speaking of more-with-less, I was sharing with Steve Holden about my friendship with [Kenneth Snelson](http://kennethsnelson.net/) last night, while sitting in the Blue House parking area (where we store the bike trailers, a small part of the fleet). [Kenneth](http://www.grunch.net/snelson/) grew up in Pendleton, Oregon, but upon becoming [a world class artist](http://controlroom.blogspot.com/2008/07/more-curriculum-cartoons.html) with an international following, he settled in Manhattan.  In so doing, he picked up a lot of Jewishisms in the form of sayings and memes, some of which he would teach me about in our at times extensive correspondence.  We talked about \"mitzvah\" quite a bit. Today, I'm attending what I call [an \"install mitzvah\"](http://mybizmo.blogspot.com/2011/08/pug-97214-launch-event.html) where we help someone through the initiation process required to get some new process running on their computer (in this case Python on a Mac).  Chairman (Rabbi) Steve will be present.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}