{
  "id": "2354509511548128891",
  "title": "Dissecting Volumes",
  "published": "2021-10-18T12:57:00.007-07:00",
  "updated": "2024-02-17T06:46:19.606-08:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/3175007640/in/album-72157612330643992/)\n\nIn Synergetics we closest pack (densely pack) a lot of ideas together. Arthur C. Clarke mentions that in his blurb, on the back of the volume. \n\nMuch of that work is done using tetrahedral wedges or volumes known as modules, sometimes known as \"quanta modules\" because they quantify discretely. You're welcome to keep it Platonic by not hopping over to quarks right away.  \n\nFuller is entitled to speculate, but we're likewise free to think more in terms of a game of cellular automata in 3D, using Mite-shaped cells, ala Stephen Wolfram (a new kind of science) and J.H. Conway (a game of life).  \n\nMites fill space with clones of themselves, possibly by way of other space-filling shapes they build along the way, such as the Cube (3), Coupler (oblate octahedron, volume 1) and the Rhombic Dodecahedron (6).\n\nBucky himself links his Mite to Donald Coxeter's Regular Polytopes in one of his captions (see below), where Coxeter introduces an orthoscheme of the cube made of half-Mites, or Smites as we might playfully call them (as in \"smitten, into semi-Mites\").  \n\nCoxeter was into kaleidoscopic reflections, and an orthoscheme, kaleidoscopically reflected, often tends to make a characteristic shape. \n\nThe A module reflects to make a tetrahedron of 24As, 12+ and 12- (left and right), and As are orthoschemes, meaning there's a way to visit all four of its verts by making only 90 degree turns. \n\nIf three right angles meets at a single vertex, it's a trirectangular tetrahedron, but not an orthoscheme.\n\nThe B module alone is not an orthoscheme, but an A and B face-bonded together make the 1/48th orthoscheme of the regular octahedron, canonically our volume 4.  1/48 of 4 = 1/12 = 1/24 + 1/24.  A and B are both 1/24.\n\nFig 950.12 Three Self-Packing, Allspace-Filling Irregular\nTetrahedra: There are three self-packing\nirregular tetrahedra that will fill allspace without\nneed of any complementary shape (not even with the\nneed of right- and left-hand versions of themselves).\nOne, the Mite (A), has been proposed by Fuller and\ndescribed by Coxeter as a tri-rectangular tetrahedron\nin his book Regular Polytopes, p.71. By joining\ntogether two Mites, two varieties of irregular tetrahedra,\nboth called Sytes, can be formed. The tetragonal\ndisphenoid (B), described by Coxeter, is also called\nthe isosceles tetrahedron because it is bounded by\nfour\ncongruent isosceles triangles. The other Syte is formed\nby joining two Mites by their right-triangle faces\n(C). It was discovered by Fuller that the Mite has a\npopulation of two A quanta modules and one B\nquanta module (not noted by Coxeter). It is of interest\nto note that the B quanta module of the Mite may\nbe either right- of left-handed (see the remarks of\nArthur L. Loeb). Either of the other two self-packing\nirregular tetrahedra (Sytes) have a population of four\nA quanta modules and two B quanta modules, since\neach Syte consists of two Mites.\nSince the Mites are the limit case all space-filling\nsystem, Mites may have some relationship to\nquarks. The A quanta module can be folded out of one\nplanar triangle, suggesting that it may be an\nenergy conserver, while the B quanta module can not,\nsuggesting that it may be an energy dissipator.\nThis gives the Mite a population of two energy conservers\n(A quanta module) and one energy dissipator\n(B quanta module).\n\nDid Fuller think the Mite and its derivative Sytes (Bite and Rite) where the only self-packing allspace-filling irregular tetrahedrons?  He appears to miss both the half and the quarter Rite, as a self-packing space-fillers.  \n\nIn these vZomes by David Koski, the tan triangles are Rite halvers, whereas the two blue planes in the bottom canvas (one of darker shade) slice the Rite into four clone quarters. \n\n[](https://www.flickr.com/photos/kirbyurner/51610684562/in/dateposted-public/)\n\n[](https://www.flickr.com/photos/kirbyurner/51611507336/in/dateposted-public/)\n\nThe Mite and two Sytes, Rite and Bite, plus the half- and fourth-Rite summarize the five space-filling tetrahedrons known, right before Michael Goldberg introduced a new family.\n\n[](https://www.flickr.com/photos/kirbyurner/50927520376)\n\nDavid Koski has helped us cross-index the Smite's volume in terms of the concentric hierarchy, as also equal to that of the 1/4 Rite, and also to that of each of the 120 E-mod shapes (but bigger) building the rhombic triacontahedron of volume 7.5. \n\nThis RT of volume 7.5 (not focused upon in the first two volumes of Synergetics) is sized up by 3/2 (or by a 3rd root of same as a linear scale factor) from the RT of volume 5 (a star of Synergetics 2) which latter is made of 120 T modules (likewise volume 1/24, same as A and B).  \n\nThe 7.5 RT pleasingly shares verts with the volume six space-filling RD, another \"circuit closer\" in our geometric, mnemonic spatial mandala, i.e. the concentric hierarchy.  Four Rites make the Coupler.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}