{
  "id": "9001243854260224398",
  "title": "Explorations in the Geometry of Thinking",
  "published": "2022-09-07T11:39:00.009-07:00",
  "updated": "2022-09-07T12:28:24.048-07:00",
  "content": "A philosopher friend once told me that Alfred North Whitehead had intended to do for geometry what Bertrand Russell was doing for logic:  distill everything to a primitive most-minimal vocabulary.  With operations.  An operational mathematics, perhaps more right brained (graphical) than left (lexical).\n\nIf we start with the most-minimal idea of \"container\" i.e. that which occupies and contains space, by dividing inner space from outer space, by what we might call a \"membrane\" (why not? -- synonyms proliferate quickly because we're talking core grammar) then what other ideas follow naturally (organically), given ordinary language? \n\nFrom container come not just \"inside\" and \"outside\" but connecting around, in order to divide (contain) i.e. concave and convex.  \n\nThe rods and spheres used to make your first triangle are already containers on their own i.e. stretched out 4eyes if we wanna systematize it.  Container = 4eyes = minimal sphere (least fingers) = the container's anchoring concept. \n\n milk containers \n\nMaking the 4eyes the core beginning of containment is not at all weird.  The arrowhead (four directional) marks a beginning (an origin) at the center of our 12-directional compass (gyro).Then come the proper names we might want to wire in to this structured vocabulary, the formatted memory zone. \n\nSuch as Descartes for his famous Deficit, Euler for his V+F=E+2 (which Descartes likely knew too but made secret), and Gibbs for getting the chemical components involved in a more tactile dimension.   That's what Fuller does, contrary to false rumors that he doesn't reference other thinkers.  He wires the 4eyes itself to Plato in one passage, suggesting why the triangle is always predictive of that fourth eye we don't see, because it's the one seeing the triangle (the observer aka camera is oft forgotten, a logical error -- per G, remember thyself). \n\nThen Fuller wires in Avogadro for the ideal uni-density diffusion that is the IVM as a gas; the ball centers suggest average centers of mass in a statistically uniform stochastic pattern, regardless of the actual kinetics.\n\nI'm happy that humanities teachers have all this raw material to work with independently of STEM, which seems hellbent on wiring Fuller out more than in, because of NIHS (not invented here syndrome). \n\nThat's true: Synergetics is an experimental language in the humanities, with the powers of prose, right in there with Finnegans Wake (Joyce) and Ezra's Cantos, David Wallace's Infinite Jest and Neal Stephenson's The Baroque Cycle -- all experiments in hammering out new (even useful) ways of using language. \n\nThe Stemites (tribes of STEM) tend to fuss about Dr. Fuller's use of language, complaining he should operate with words the same way they do if he expects flattering treatment.  We call them Philistines (some of them): i.e. \"[people] hostile or indifferent to culture and the arts, or who [have] no understanding of them.\" (to quote the dictionary).STEM becomes STEAM (A = Anthropology, not Art, sorry), and intersects with PATH:  Philosophy Anthropology Theater -- including politics -- and History.  A new drop-in for all that trivium-quadrivium jazz.\n\nA is their intersection (dance and music fit here too): the study of humans in Universe.  Their \"universe of discourse\" one might put it; i.e. their \"space\" (logical, semantic), their cultures (semantic spaces). I agree that Universe need not fit in (be captured by) any special case System (sorry Hegel, if that's a problem). This Universe is less a culminating climax (a big bang), and more an insignificant, eternally aconceptual (lost) footnote in some concluding unscientific postscript.   \nA system is always missing at least one marble (720 degrees), leaks sense, is entropic, has a half life.I'm thinking Synergetics has a bright future in PATH-side literacy and movie-making classes, and that these liberal arts graduates will be much better informed about STEM topics than those who squeaked by with just \"physics for poets\" i.e. without much university-level Synergetics. \n\nLike Fuller's biographies, Synergetics itself is a great switchboard for connecting to all manner of readings, an unlocker of new fluencies, a great gymnasium for exercising one's prose-reading and prose-writing muscles, and with a lot of computer stuff (and crystallography) filtering in between the lines.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}