{
  "id": "5730173962153133197",
  "title": "Fighting Fatalism",
  "published": "2009-04-06T09:04:00.000-07:00",
  "updated": "2009-04-07T17:01:11.539-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhvPTg8RKQp2-GrkJTdhsuxOxdSRo9BHM-l_ftzgvH95G9AMog0s7fQ6qeMmL9rycKOMEweWOZdwHfZripEzgXAwuc3DhUVPvox7a-CIzfqdHC05HT9FxWKAUPJgifVhDDqJZCYmf1lhdn-/s1600-h/00013.jpg):: statue of [Jimmy Stewart](http://www.imdb.com/name/nm0000071/), Indiana, PA ::Whereas we're galvanized by all this spirited talk of [ending the reign of nuclear  weapons](http://controlroom.blogspot.com/2009/04/positive-developments.html), so conducive to blackmail, we're confronted with opaque institutions that gobble money then smile, ready for more.  Where does it all go?Engineers relish the rare opportunity for [greenfield development](http://en.wikipedia.org/wiki/Greenfield_project), starting with diagrams and blueprints, then manga code (prototyping), then some alphas, some betas, a release candidate, a rollout.CSN is an example of such an opportunity, is a goldmine for FOSS bosses ready to commit to new concepts in the design of social networking institutions.Our goal is to harness the engine of ordinary commerce, such as we study [in Supermarket Math](http://mathforum.org/kb/thread.jspa?threadID=1446722&tstart=0), and use that to fund field operations that require discipline and skills, are transparently about assisting humanity in some way.The work is clearly valuable and philanthropic, and those tuning in with a spectator mentality, may find themselves drawn in as investors as well.In directing your winnings to some NGO in the field, you're perhaps signifying your willingness to be recruited by these very same teams. GOs and ~GOs (NGOs) get data about player heroics.  The games are designed as prep in some way, or some of them are.  You sometimes play hoping to get noticed (the NFL / NBA model).The US Army uses this same technique, so don't tell me this is pie in the sky.  This is just how our culture operates:  fantasies (TV), interactive cartoons (video games) and then some choice of career (and repeat, through multiple career changes sometimes).It's more a question of what do you think is a more cost effective (energy efficient) way of achieving more sustainable and satisfying ecosystems.  However you steer is likely to move you closer to the front lines in those institutions you most support.\"Front lines\" has a negative connotation when the battles are hopelessly uphill, whereas \"out in front\" in a circus context might get you a date with [Britney Spears](http://mybizmo.blogspot.com/2008/10/pythonic-math.html).  Context matters.In green field development, we get to design what \"the front\" will actually look like.  Perhaps it's a research facility, a clinic, a staging area for delivering medical supplies?  The web sites will show you.  [Google Sketchup](http://controlroom.blogspot.com/2007/05/olpc-on-cbs.html) is a useful tool.This is where investors start seeking a prospectus, a game plan.  In terms of screen writing, we look for pilots, doable television, product placements.  In terms of software, we're looking for geeks with vision, coding skills, [driving skills](http://mybizmo.blogspot.com/2005/09/rethinking-cyberbookmobile-concept.html), self discipline.Do we find our new recruits at OSCON, GOSCON, or maybe through CSN, where heros leave calling cards, having aced their way through [some puzzling fragatorium](http://controlroom.blogspot.com/2009/03/from-rivendale.html)?Capitalism's invisible army of the future comes out of the woodwork, when the ambiance ([e.g. the coffee shop](http://linuxcaffe.ca/)) is properly tuned (\"capitalism\" as in \"using your own head\", as in \"doing your own thinking\" -- borrowing from Bucky again).Could the military become more involved in humanitarian work?  Of course it might, as our response to the tsunami in Asia clearly showed.  More typically \"helping orphans\" goes on as a side show, whereas the primary mission is to find approved applications for [name brand killingry](http://www.washingtonpost.com/wp-dyn/content/article/2009/04/06/AR2009040603246.html).Large standing armies tend to become showcases for specific tool sets and skill sets, a kind of marketing force with machine guns for Tupperware (Marines as good girl scouts, [Avon ladies](http://mybizmo.blogspot.com/2009/02/wanderers-2009211.html) at your door).  If inventory piles up, unadvertised, start a new war for product placement purposes.  Such is the \"reality television\" of our day.When that glorious state-owned helicopter lands in your public school's football field, and the men jump out with their painted faces and guns, they're suggesting a possible future of don't ask don't tell fun and games on the job.The civilian services traditionally get nowhere near this level of government funding, except for intelligence work, which most consider [paramilitary](http://worldgame.blogspot.com/2007/12/xmas-2007.html) in any case.  You'll know things have changed when more civilian recruiters come to your school, from NSA for example, yakking about those [fun computer camps](http://www.nsa.gov/research/selinux/list-archive/0307/thread_body6.shtml) in the Gorge (learn about RSA from the pros maybe?).The day [the State Department](http://mybizmo.blogspot.com/2008/08/new-kind-of-charter.html) has twice the budget of the Pentagon, is the day you'll wonder why your living standards just doubled.  In the meantime, prepare to stay poor and enlisted, perhaps assigned to [a Middle East wasteland](http://worldgame.blogspot.com/2005/11/jarhead-movie-review.html), rather than enjoying wine and cheese with your diplomatic counterparts.Civilization without wine and cheese is inconceivable, whereas we were getting along fine without those nuclear WMDs.  Putting the genie back in the bottle ain't that hard in this case. Dr. Evil types need those secret caves, like in Bond movies, which few can afford. Refining uranium is hardly an easy process.Those caves already on the map are closely inspected, on the watch list.  Cover ups require a high degree of loyalty whereas if the game is to build banned WMDs, you're likely to have moles with a strong sense of idealism.  Defectors will spill the beans, rat you out.  We saw this every day during [the Cold War](http://worldgame.blogspot.com/2009/02/u2.html).This idea that it's mindlessly easy to proliferate nuclear weapons is somewhat misguided, probably because Hollywood doesn't talk to the [Scott Ritter types](http://mybizmo.blogspot.com/2009/03/uncovered-movie-review.html), doesn't care if it \"stays real\".  We probably wouldn't have fallen under the spell of bad screen writing, had we a more sophisticated TV viewing audience, rather than an unruly mob with a diet of mostly fiction on Fox.  Unrealism (escapism) is a kind of vulnerability.  Predators take advantage.So, are you yourself a dupe for those hot-headed nuke heads?  Consider enrolling in some [IQ booster classes](http://mybizmo.blogspot.com/2008/10/studious-nation.html), like at Cubespace or somewhere.  Become more of a geek engineer, less of a fearful nerd.  \"Step into yourself\", as we say [on those posters](http://mybizmo.blogspot.com/2006/01/wanderering-in-pdx.html).  Get a life. Take some pride in your humanity.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiWenMzmVPvxtpHpHapOmE0jB_u9J3ZyeDmlsheKjDfQ986tcLlkdu6nOUj8IPQFbGYnjNZK1NGfX8B6VahgY2Vxqfn2Fno8c_3cSMsaJraebLFTnsVzzv92nWZ7ZHh7ZTAi8zwFutX9HdR/s1600-h/00007.jpg)@ Fred's",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}