{
  "id": "7988535008645870084",
  "title": "From the CodaCombs",
  "published": "2024-04-30T12:21:00.000-07:00",
  "updated": "2024-05-01T12:21:36.672-07:00",
  "content": "Decoding [my pun](https://controlroom.blogspot.com/2024/04/catacombs.html).The Catacomb Codas. I've stuffed many a deep chamber with some of this Synergetics stuff. Detractors (or even entomologists) might picture me barfing up pabulum, weighed in tetra-somethings, anticipating this nurturing content will empower the colony going forward, the hive mind or whatever.\n\n[Synergetics](https://coda.io/d/_d0SvdI3KSto/_su5DS#_luREh) is a namespace used by “anticipatory design scientists” (cliche phrase) to explore a geometry of thinking.Synergy (the concept) suggests unanticipated (surprising) developments when the (perhaps already analyzed) parts cohere and inhere in the form of newly emergent wholes, meaning the unexpected is to be expected, if not precisely.Chance and randomness play a role, sometimes for the better (luck, windfall, boost) leading to new scientific discoveries (e.g. radio, penicillin) that transform our continuation strategies. A good science lab is a studio within which to produce and confirm surprising (novel) findings.Between an inside (concave) and outside (convex) comes our Markov blanket membrane, our [omnidirectional halo](https://flic.kr/p/2n1WbrG) model, our system of relevance between twilight zones, that takes its own manifestation, its own existence, as further evidence if its suitability as a model (life form).  [](https://www.flickr.com/photos/kirbyurner/51785386131/in/photolist-2mU6D82-2n1WbrG-2ohNvMf-2jxsRi9)We may always recurse to say a model itself relies on models. A model is a set of biases, preferences, simulations, generalizations,  generative vectors, forming a semantic alchemical space, internally to a containing model. Models have a natural half-life, a decay curve, unless updated, presuming a continually changing environment.  Sense decays towards nonsense and obsolescence unless actively tuned and maintained.Our system’s context might be “the village” (township, base, outpost) organized around various types of seer, chief or shaman, each of whom internalizes (models) the village, its procedures and ceremonies, rules of government, and its context (the rest of the world). Their collective steering produces [synergetic results](https://nbviewer.org/github/4dsolutions/m4w/blob/main/gadzooks.ipynb).In general systems theory ([GST](https://grunch.net/synergetics/gst1.html)), the personal workspace (PWS) may be variously interpreted, as a lab or studio, game pod or cubicle, an individual on the beach (with a dog maybe).  Synergy comes from the “value added” i.e. between the energy in (including sensory input, food calories, art supplies) and energy out (including action, making, crafting, cooking), i.e. from the gap between energy in and energy out filled by work (personal activity) of whatever nature.   Work is potentially value adding (varying criteria apply). Energy throughput may also be entropic, as when a dam or bridge gives way, and no longer serves a purpose.A follow-up message to Andrius, who asked about Wittgenstein's private language argument:Wittgenstein’s so-called “[private language argument](https://en.wikipedia.org/wiki/Private_language_argument)” is much debated as a topic, as Wikipedia is quick to point out. He’s countering the idea that there’s a private “known to me alone” basis for language e.g. no ”private ostensive definitions” e.g. this is what “pain” means to me (maybe a philosopher pinches himself or bites his own tongue at this point, to emphasize the private nature of the associated qualia) — Wittgenstein wants to break the hold of this picture, which he thinks derives from illusions and confusions. His views seem most counterintuitive to those who believe the meanings of words spookily appear even as the words are uttered, side-by-side as it were. Related conversation: LW’s “beetle in a box” thought experiment. Being the last speaker of a language going extinct is not considered a counter-argument by Wittgenstein’s defenders. Can a language in principle be understandable only by the person who knows it? Do we even recognize there’s a language there?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}