{
  "id": "8167249907773123237",
  "title": "From Agora on Quora",
  "published": "2021-08-30T20:15:00.006-07:00",
  "updated": "2021-08-30T20:16:26.640-07:00",
  "content": "Are the philosophical needs of Americans being met?\n\nNot really.\n\nFor one thing, “philosophy for children” is still considered arcane and off beat. Montclair University has been a key player in that movement.\n\nWe do teach metaphysics to children however, ancient Greek metaphysics. We call it mathematics and dress it up as not-philosophy.\n\nBut at the fundamental level, when you introduce points, lines, planes and volumes, as 0, 1, 2, 3 dimensional, you’re doing metaphysics. Philosophical debates belong here, not authoritarian commandments to not question the authorities.\n\nIt’s a “spooky” metaphysics, this ancient Greek stuff, in that you’re told you’ll never meet or experience the reality of some of these lower dimensional phenomena.\n\nEven 3D can’t happen outside of Time (they’ll tell you).\n\nSo it’s like you’re learning about ghosts.\n\nSince you mention Americans, and since the people who like to call themselves Americans the most are the North Americans who conquered the several territories and turned them into 48 states plus Canada, I should point out that some of the most important American philosophers are not studied as philosophers.\n\nFor example, Doctor of Philosophy (PhD) programs tend to overlook Ralph Waldo Emerson as a philosopher of note, and even though Nietzsche admired him.\n\nWalt Whitman studied some Hegel.\n\nThe New England Transcendentalists, as they’re called, were imbued with German Idealism and came to their anti-slavery / anti-imperialist views without the influence of Marxism.\n\nOne of the few American philosophers who acknowledges this lineage is the late Richard Rorty in his slim tome Achieving Our Country. He’s a leading pragmatist who incorporates the later Wittgenstein’s anti-representationalism when it comes to his philosophy of language.\n\nFinally, American philosophy departments are horrible when it comes to Buckminster Fuller, grand nephew of the Transcendentalist Margaret Fuller. They typecast him as some kind of Technocrat who had naive beliefs about politics and who simply popularized others’ great ideas.\n\nMy view, in contrast, is if you haven’t studied his Grunch of Giants and its precursors, you’re missing out on some of the greatest philosophy of the 20th century — a bold claim I realize. That’s the satirical work wherein he declares the USA bankrupt and extinct, around the same time he gets the Medal of Freedom from president Reagan. Who knows about that?\n\nThis all ties together in that the spooky metaphysics we teach in grade school, without admitting it’s philosophy in disguise, forms the perfect segue to alternative ideas in geometry, including Bucky Fuller’s alternative paradigm regarding our use of the word “dimension”.\n\nHe champions the tetrahedron over the cube as the more secure basis for our logic. Who ever learns that in their wonky PhD academy?\n\nThe old bridge to German Idealism is still there too, only now it’s to Bubbles, Globes and Foams by Peter Sloterdijk.\n\nThanks to Youtube and Cyberia in general, I think Americans are waking up to their denied heritage and will not so gullibly enroll in degree programs that perpetuate this sad state of affairs.\n56 viewsView 1 upvote",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}