{
  "id": "8955804558750504457",
  "title": "Future Projections",
  "published": "2010-02-08T22:30:00.000-08:00",
  "updated": "2010-04-28T15:16:22.346-07:00",
  "content": "I've been going over use cases with a pro in the business, former owner of the Venetian Theater in downtown Albany.  The profit margin on coffee shops is extremely thin, especially if you subtract adult consumables such as mixed drinks, which most shops do not offer.The budget for start ups will have to be for advertising, with the vendor beneficiaries winning the good will sweepstakes, for having taken some initiative.  The games will be family friendly and we probably will not have those adult beverages, except maybe in the usual segregated areas, more like Spaghetti Factory in some ways.  YMMV.  Depends on zip code quite a bit.[What's on the LCDs](http://coffeeshopsnet.blogspot.com/2010/04/smart-bar-lcds.html) is what matters most to some of the stakeholders, and we expect to find alcoves, diversity in tastes.   Not everyone is studying the same topics or cares about the same things.  Geometry cartoons featuring classic polyhedra, no matter for what product (if any), have their own cultish following.  [The NFL](http://worldgame.blogspot.com/2010/02/more-from-97214.html) has another, partially overlapping fan base.From the sound of it, one might expect universities to jump in, say the MIT student union.  Screens showing hypertoons have that geeky aesthetic one would not be surprised to encounter, if wandering Cambridge or Woodstock (near Reed).I have also suggested a military lineage, in that some mission-accomplished watercraft, equipped with great kitchens, might retire as tourist attractions in a next chapter, while prototyping whatever kind of philanthropic engine the management has seen fit to test out.Some aircraft might go this route as well.  Serving people in their seats, without leaving the ground -- the model for many a restaurant.  Some who fear flying, might get used to it this way.Decisions do not bottleneck through me praise Allah, except in the few venues where a management team might include me.  Like with Visa, there's no uber-boss, plus I'm mostly just wearing a marketing hat (CMO is my title).The sharpness of HDTV is something else to think about.  They change the atmosphere considerably.By this time one may have asked whether religious establishments might use this same infrastructure.Many a monastery had and/or has a vendor aspect.  By contributing jam, beer, honey, cheese or whatever goods to the local economy, in barter for wine, exotic beans (or whatever other provisions not obtainable through tended fields), a religious establishment was creating a market niche for itself, creating one or more brands.This mixing of temple and commercial trade is/was not frowned upon in principle, across multiple branches (denominations) so long as the products remained benign and prayerfully considered (incense... special remedies).  Putting any surplus into wise disbursements, as a result of concentration and study, is what religious academicians do as well as non-religious, however self-labeling.The community service nonprofit (or NGO) is a close relative of the religious establishment, another arm for social service.  Many lawmakers would rather have government not compete with more private players, whereas others see too much privacy as a source of abuse.  Either way, one could see where a philanthropic institution might partake of this status.In an effort to reach customers where these customers want to be (at sports bars for example), these market leaders will need to test working prototypes, fine tune.  We already have many examples (e.g. BackSpace and CubeSpace).  The payoff will be getting into the game early, in an adjacent space (close to sports bars in some ways, yet different).My Cult of Athena memes were meant to guide an aesthetic.  The Oracle of Delphi escaped Apollo, meaning these are relaxed venues, not too spartan.  Read back in the archives if curious.  This is a philosophy blog, is not just about business.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}