{
  "id": "8456522672571625032",
  "title": "Ghosts of Now",
  "published": "2024-07-22T09:23:00.000-07:00",
  "updated": "2024-07-22T09:34:01.226-07:00",
  "content": "Ghosts of previous nows in the now haunt our daydreams in a recursive manner.Another etymological connection worth remembering: \"to haunt\" and \"to frequent\". To frequent a place is to come back to it often, but then one may abandon past haunts for other frequencies, only to encounter their ghosts in future terms (times).Oblique to \"frequency\" in Synergetics is \"angle\" or \"shape\" which comes across as liminal, transitory, given our experience is in-universe episodic. We're tuned in. What's \"out\" is what might enable our next leap through a portal, to some other world (frequency, channel, system, plot).What evokes our sense of \"time machines\" i.e. of different times coexisting in parallel, reachable from one to another, is a sense of the timeless, what unites all the times with a physics we maybe wouldn't recognize on paper. The new world has its rules, all too familiar in the sense that our codification of them has always been incomplete, in the old world as well. The sense we might expand our appreciation for the underlying physics take us into [a twilight zone](https://controlroom.blogspot.com/2024/07/keep-portland-queer.html) of non-consensus reality, the private language of solipsistic research.The criterion that runs through liminal space collections, defining their genre, is their depopulated nature. We have the specific angle and viewpoint of the individual, somewhat forgotten and storyless, and likely no one else. Phenomena get reduced to a bare minimum, drained of ideation to become \"suchness\", and a sense of  claustrophobia (or maybe freedom) comes from the missing plot, the absence of any sense of eventual convergence to some resolution. What's to resolve?In the timeless liminal spaces of the interwebs, nothing ever happens that would disturb its equanimity. This resting in peace is offset by the Matrix, or rather the many matrices or worlds, the sound stages, that ornament and implement the rules (explore their consequences) in recursively fractal specificity.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}