{
  "id": "8411114653502627943",
  "title": "Graph Theory",
  "published": "2023-11-06T16:44:00.000-08:00",
  "updated": "2024-02-21T16:33:16.215-08:00",
  "content": "In case you're unsure what Graph Theory is, it's a lot of games with dots and arrows, showing how stuff connects. Arrows become directional and start to mean specific things such as \"is friends with\", \"was employed by\".  Arrows might be weighted, to show how much energy it takes to travel along them (think of roads).When thinking about [Graph Theory](https://nbviewer.org/github/4dsolutions/DigitalMathematics/blob/master/MartianMath.ipynb), just think of the Web and its hypertext transfer protocol (HTTP). Here you are, reading a node or dot (it's OK for dots to have content). Any hyperlink you click takes you to a neighboring node, along an edge.  Think \"circuit diagram\". The data structure we call a \"tree\" is not supposed to have cycles -- adding them turns a tree into a web.How to read a graph: by the conventions of topology, the exact route an arrow follows in a diagram need not be significant i.e. need not be \"to scale\" (which is why added numeric labels, showing info such as mileage or time, are not at all redundant).The YouTube suggests the genre where the \"dots\" are various people, say mathematicians or chess players or... no special category need apply, or perhaps many do. This is hardly a new idea. A lot of graphs are precisely in this ballpark of wanting to record vast and evolving networks (they could be vast) of interpersonal relationships. Large databases are sometimes committed to discovering these inter-connections internally. Think of Ancestry dot com and such projects.One could claim or state, as a matter of definition, that fleshing out the arrow relationships among the objects in question, is to \"systematize\" the information. Getting \"systematize\" to connote \"adding edges to a graph\" helps concretize the idea of \"systems\".The embedded YouTube, only a minute and a half long with no sound, with each slide set for three seconds, also includes an early draft of the speaker notes i.e. provides a set of captions. This YouTube is a \"preview\" in the sense that the slides being filmed have [since evolved](https://docs.google.com/presentation/d/e/2PACX-1vS22mKDAaU-tOfs2pghuRX6S854RTZoHzF0ntzZACFarJdBMOtli0nuwus00d3h3JJGOH0Pu-RyYh1k/pub?start=true&loop=false&delayms=5000&slide=id.g297610e14a7_0_201), developing more nodes and edges. I can use these slides on the road and/or in meetings, in the role of tour guide.  I'm far from super knowledgeable regarding all the partially overlapping graphs.  [Let's explore them together](https://coffeeshopsnet.blogspot.com/2023/11/introducing-some-players-school-of.html).In the Youtube comments, I chat with Andrius about whether I'm being egotistical in throwing my hat in the ring as it were, showing how I'm potentially one of the nodes in the system.  Andrius sees this enterprising behavior as more a labor of love than purely one of self promotion.I would encourage thinkers to develop maps like this of their own, for the benefit of researchers looking for a way to fit them into a bigger picture. Sometimes it's not that easy an exercise, to think in terms of \"influences\" as this may call into question one's own originality in some existential way. I'd suggest not worrying about it. Provide some guidance why not? I know many of you have already done so (in which case, bravo and keep it up, why not?).Finally, as of this early edition, I have a long way to go in graphing out my relationships (if that were really my central ambition -- maybe not in this project). I've not gone into any detail regarding my Python community affiliations for example, nor Wanderers in my Portland context, [nor Quakers](https://flic.kr/s/aHsk6bwm1s) (other than through dad and Kenneth Boulding that is -- some Quakers claim Walt Whitman as one of their own). Having computer science in the picture (Babbage, Ada, Hinton, The Turk...) is already an invitation to keep exploring.More to the point though, is I've gone into more detail already in my YouTube channel, so in that sense \"preview\" means more like \"welcome to my world\". In the meantime, the network I'm providing is an invitation for others to connect theirs to mine, or to share a network that doesn't connect at all. The web facilitates such mergings and divergings.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}