{
  "id": "8336942938332750458",
  "title": "Happy Leap Day",
  "published": "2012-02-29T22:03:00.000-08:00",
  "updated": "2012-02-29T22:03:03.783-08:00",
  "content": "I'm somewhat surprised how little is made of Leap Day.  Why isn't it a big festival day, every four years (caveats apply)?\n\nI'm booked in to US Pycon this month, coming a little late but in time for the main keynotes.  I've been learning a lot about charitable giving and Internet infrastructure as a member of the PSF (Python Software Foundation).\n\nCSN is about providing infrastructure similar to video poker run by the Oregon State, except the player is expecting to donate winnings, normally considered losings, to worthy programs.  Winnings for self may be a part of some games as well, as may one be a recipient of others' directed winnings, perhaps ear-marked for some purpose. \n\nYes, the rules could get complex, but then it's a game we're already playing, simply formalized with new infrastructure and software (and games).\n\nIn the physics namespace, it's about energy transformation, information theory, and value added.  You have the energy that drives your day, and the work that you do with that energy. \n\nThese concepts trace back to early GST writings in personal workspace 284 (like a time-share) in the early 1980s -- is how it worked out in my case. \n\nGiven the Noosphere, it'll have come to others in other ways. \n\nSome of these concepts matured into First Person Physics, which got the attention of Dr. Bob Fuller, a man of much experience, including in Burma.  I follow his progress on CareCalendar these days, following a serious medical event.\n\nI'm booked into Philadelphia tomorrow.  I don't know how that will go, but I do expect to make some valuable headway.  Watching the AFSC do its business, contributing here and there, is another way I observe philanthropy in action.\n\nI've had recent visits will all my officers except Jody.  The financials aren't that complicated yet, when it comes to real properties on the ground.  Cyberia doesn't require much of a footprint, when it comes to testing ideas.  More servers in the cloud are but a finger snap away.\n\nI have a new bio on-line.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}