{
  "id": "4824589255677862044",
  "title": "HP4E Update",
  "published": "2016-06-12T07:31:00.001-07:00",
  "updated": "2016-06-12T10:09:59.128-07:00",
  "content": "[](http://i783.photobucket.com/albums/yy111/danshep8/Civ_5_Hex_World/hex_world.png)\n\n :: [link](http://forums.civfanatics.com/archive/index.php/t-354175.html) for more discussion ::\n\nA decade ago, I started a media campaign known as HexaPents for Everyone or [HP4E](http://mybizmo.blogspot.com/2006/08/hp4e.html).  The Hexapent is another name for a BuckyBall or Fullerene.  The former, Bf, or C60 is the soccer ball topology, however more fullerenes of higher frequency (more hexagons) are conceivable.  There's a C72 and so on.\n\nThe gamer community is where HP4E took off, with or without my campaign.  Hexagons have long been a feature of two-dimensional game boards.\n\nSeen from a gods-eye point of view, the player hovers over a plane of hexagons, moving assets around, building or destroying a civilization, as the case may be.\n\nMany gamers realized that, given the Earth is spherical, there was maybe a way to have the hexagonal tiling close back on itself in all circumferential directions.  Those who explored the most deeply discovered the twelve pentagons needed for this closure to occur.\n\nProposals were floated on the Internet suggesting that Civilization itself, a popular commercial game, adopt this hexapent format.\n\nThe HP4E memeplex likewise has become a part of various global models of a more scientific bent, as carving the Earth into tetrahedral wedges, of which the hexagons and pentagons are composed, makes for a cellular data structure subject to various algorithmic techniques.\n\nThe mapping giants, [Google Earth and ESRI](http://controlroom.blogspot.com/2012/03/occupy-silicon-valley.html), have offered somewhat muted support for hexapent displays.\n\n[](https://www.flickr.com/photos/kirbyurner/27002579183/)\n\nThe commercial mapping world is still fixated on spherical trapezoids, which become more square towards the equator.  These are no more equi-angular or equi-area than the hexagons and pentagons, but lat / long is what we're used to.\n\nFortunately, given the power of computer algorithms, it's not an either / or relationship and the hexapent matrix has a bright future even in the commercial sector (my prediction).\n\nFinally, I've long been waiting for the crystal ball, also known as the \"disco ball\", to come out in hexapent form.\n\nWith CAD and laser cutters, getting the mirrors to be hexagons and pentagons, or even triangles, is not impossible.  A new brand could establish itself almost overnight.  I scan the Web for adverts.\n\n[](https://www.flickr.com/photos/kirbyurner/2931204744)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}