{
  "id": "1692540779783188314",
  "title": "Hypertoonery",
  "published": "2012-05-27T16:21:00.001-07:00",
  "updated": "2023-10-23T09:29:34.347-07:00",
  "content": "Le Hypertoon is classically conceived of as an animation consisting of segues twixt a set of key frames.  It's not like you, as a viewer, necessarily know which frames are key, however over time this may become more clear, as some of the vistas are definitely deja vu.\n\nDepending on the design, key frames my show up less than once a minute (one can imagine really long loops) or many times a second, though that's reaching a threshold for even short attention spans.\n\nIn the rarified world of pure geometry hypertoons, which may act as a kernel, anchoring a broader sampling of STEM topics, we have the concentric hierarchy hypertoon, somewhat signature within CSN as a part of its decor, blends well with a McMenamins style, an influence on your first CMO (moi).\n\nImagine tetrahedrons, variously sized, and spinning.  They glom together in certain ways.  Turns out they have interesting capabilities, to assemble one another.\n\n[Koski's U, V and W](http://www.youtube.com/watch?v=EbDKiOCcfBY) all build one another using phi-scaled versions of themselves.   They make a spiral.  They make the fat and thin hexahedrons of quasi-crystalline fame.  The U may be considered 2 K modules in volume where 1 K = 1 T module scaled by 1.5 i.e. K + K = T + T + T = A + A + B = [1 Mite in volume](http://controlroom.blogspot.com/2010/06/aristotle-was-right.html).\n\nA self-referential pool like this will take you to high speed geometric hypertoons at various singularities.  Then the show will slow down again.\n\nA nice jungle scene with parrots, some foreground discussion of the ecosystem's feedback loops, with cutaways to animations.  Humans have done a lot of homework here, but without doing permanent damage.  We feel happier every time that happens.\n\nNote that there's nothing to say a hypertoon can't use live action, in the sense of adding physics rules. Classic hypertoons are based in pure geometry because the makes the key frame connections reversible whereas documentary footage tends to run best one way (not always).\n\nMy Python prototypes compute their frames on the fly allowing for real time interactivity, with the user spinning and zooming as the action unfolds.  Higher resolution hypertoons or \"reveries\" might be pre-rendered and streamed by a kind of player / reader that doesn't need to recompute.\n\nHybrids use a combination, say a computed foreground against a pre-rendered background.  This gets us into game territory pretty quickly. \n\nBack to Koski modeles, some equations from the Poly list, in lightly edited form:\n\nI use this method for differentiation of the various sizes of phi-scaled tetrahedron:\n. . . U6, U3, \nU, u3, u6 . . .\nsince volume changes by phi to the 3rd, 6th, 9th power when linearly scaling by up phi. \n\nU3 > U (U=u) > u3 and so on.\nThe U,V, W tetrahedra are composed of these amounts of lessor sized U, V, W:\n\nU = (2)w3 + (5)u6 + (4)v6 + (2)w6\nV = (2)v3 + (3)u3 + (1)w3\nW = (2)w3 + (3)v3 + (1)u3\nThe Fat rhombohedron  = (18)W + (6)u3 + (6)v3 + (6)w3\nThe Thin rhombohedron = (6)W + (12)u3 + (6)v3 + (6)w3\nThanks\n\nDave",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}