{
  "id": "8496792113985751797",
  "title": "Hypertoon City",
  "published": "2024-10-21T07:21:00.001-07:00",
  "updated": "2024-12-10T18:57:12.723-08:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiwnIvJg6dYsUmVPOsrm9AVBs5UhVbvIKx5kUzMoqgtY3nkgEePJINdyMKAIFhCI3NRyg6HVmsSZIz_bNQ91moCKPXHUbXPEn2lwAwRi9h72UA5cxhEIobyManYduruUlIl5N_1blmEGOETlMFci5DNtLcVnBlJRFeRvJcny_BzzUwp1V6MqbsB42or0WN7/s1144/tips_database.png)\nGiven I'm back in the wheelhouse, steering a cohort through rites of passage in the cult of coding (Python) and stats (statistics, data science), I'm once again reintroducing the tools of the trade, such as pandas and numpy. And the datasets in seaborn. Such as tips, penguins and titanic.\n\nThinking about tips gave me a prompt for the above AI graphic, but in my head I was imagining a tips-based hypertoon. Imagine a black and white (meaning grayscale) film in which 1950s dressed urban characters frequent a busy restaurant. \n\nConsider a camera shot of one table with five people, two smoking, three dressed as males. In one scenario, a woman gets up, espying a good friend at another table. She begs pardon from her table mates, saying she'll be right back, and she takes an empty seat at a nearby table, striking up a conversation with her friend. \n\nThe camera is following all these and sees her return. We might even see a cut, letting viewers know time has passed, but not much.\n\nIn the diagram, that would be like an arrow from a circle, looping back into itself. She gets up, the action takes us away from the table, but we come back, almost as if nothing had happened, and indeed, lets have at least a few frames that never change. \n\nThis immutable segment, of people sitting just so, with just these expressions, is what we keep coming back to, which adds a dimension of eerie dreaminess to this film. This isn't the only keyframe we keep revisiting; it's one hub among many. We in a looping environment such that we'll eventually have seen every scenario, but there might be hundreds of them, of varying length.\n\nThe general idea is you have keyframe immutable sequences from all over the restaurant, including outside on the snowy sidewalk, in the restrooms, where women gossip and men stare stoically at urinal advertisements, in the kitchen, in the back alley with the dumpsters. \n\nThen you have a playhead, which travels within the spaghetti ball of scenarios that interconnect all these keyframes in a graph, a network, a topology. We might have five scenarios that take us to the dumpsters, and three that take us back inside. Each scenario has a direction, an arrow marking time's flow. In geometry hypertoons, these scenario transformations might all be reversible, but when it comes to humans in a restaurant, most action is one-way.\n\nHere's the random element: when the movie player, the playhead, enters a keyframe sequence, it has more than one way to go next. The viewer will recognize the table, the people, but last time she got up, whereas this time she doesn't. A waitress shows up instead. \n\nNext time a waiter appears, whom this time we follow back into the kitchen (and there's that same chef -- we keep seeing him, and those pancakes...). We don't get back to that table for quite awhile, revisiting other tables, and those dumpsters again, before we get there. We end up following that lady back, like the first time, from the table she'd been visiting. It's exactly the same scenario. We're on rails. \n\nYou get the idea.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}