{
  "id": "1850721387301813277",
  "title": "Hypertoons on 3DTV",
  "published": "2020-04-01T18:06:00.001-07:00",
  "updated": "2020-04-01T18:26:39.203-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgXUgKMLJyEs1jkd1ETkvx6pE5cVVQv0GH6VLI_-j638WuS95mCvb9xYgf9O7OPWtH9rp86BPag35Skj9i5eOFzT5hrC4w-mIWM_VPQw5ZHn_MO4ifIztq21rxuobRt4PrM5IFfXHNp0pBe/s1600/anim6.gif)\n\nI've usually shared hypertoon reveries as a flat screen experience, as if on an HDTV.  You'll find an earlier blog post on [LCD aesthetics](https://coffeeshopsnet.blogspot.com/2016/11/self-contained-lcds.html).  However we need not confine our imaginations to such prosaic devices.  Won't 3DTV be here soon?\n\nWhen you imagine a pixelated surface, do you think of squares or hexagons?  We can tell a lot about your personality based on that, just kidding.  As when tiling a bathroom floor, we have our reasons for going with one or another tiling pattern.\n\nSpace comes with \"tiling\" patterns too.  Instead of pixels, we have voxels?\n\nWhen you imagine a voxelated volume, do you think of cubes or rhombic dodecahedrons?  I'd say a majority will think of cubes and don't know much about that other thingamajiggy.\n\nHowever rhombic dodecahedrons are more neighborly in the sense of sharing more faces.  Cubes share six faces with neighbors (why we call them hexahedra).  Dodecahedrons (of this space-filling voxel kind) share twelve.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg5MPvr1durBCc39vBg2GIuBs7Ff_h8dBBoDTthsO9L8T5HCJ3lqKcoHjgoXnMuMBi8CJXlLa6HBvrWp1_faRnsMVB19B6mSEGiaELVdM3mKsAEDxzGgB3iLrfE3OLvZWpYvclkCug_aS4m/s1600/4fold.png)\n\nAs soon as you start filling space with some repeated shape, you're likely to think \"honeycomb\" or even \"lattice\" whereas an engineer might think \"space frame\".  Different professions teach different words, but we all know what it means to \"brick a volume\" with some shape, even if said shape has all diamond faces.\n\nThe sculptors at Flextegrity Labs, the informal name for your builders' skunkworks, know all about modeling sculptures in 3D, given [C6XTY](https://c6xty.com/) and its progenitors came from a 3D imagination in the first place, via CAD and industrial processing.\n\nHaving the CCP (another name for our lattice, not a political party) pre-implemented in software, with each icosahedron or ball position selectively illumined, is a kind of 3DTV in its own right.\n\nThe sculpture supports its own weight.\n\nWe don't need to wait, to experiment with sound and light shows.  [Our gallery](https://flic.kr/p/2hnURs6) was in the nightclub district, after all.\n\nWho knows, perhaps 3D hypertoons could be in our future?\n\nOr shall we say 4D, switching to the Bucky brand, wherein the Tetrahedron anchors our sense of \"dimension\" in a four directional volume, our \"space\"?  We've learned that \"namespaces\" coexist and that an either/or mindset may be unnecessary in the long run.\n\nSo sure, 4D it is.  Too.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgbeEbct0x-o3QhIR6EOjEDBIrTEe0VCj-v_uggEMBmSRXY9NGZZfEwsnGGSL6A0HcHYyK7_-95Rc9Hqf5kbRVcxHhl64HSx_cQEwQixfVSQKn0Ww8zFLFvANAB6BERwp9yFHmRzOHNgBjM/s1600/39996671341_afe824ea39_o.jpg)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}