{
  "id": "9222777241501256714",
  "title": "Ignite Portland 11",
  "published": "2012-09-20T00:05:00.000-07:00",
  "updated": "2013-05-22T22:03:42.165-07:00",
  "content": "[](http://www.flickr.com/photos/kirbyurner/8006362783/)\n\nCivic participation was galvanized by [the Ignite event format](http://mybizmo.blogspot.com/2010/11/goscon-2010.html), which featured pre-screened five minute talks by an interesting cross-section of willing presenter.\n\nOur line up tonight included people giving advice based on hard won experience regarding mountain climbing, designing voting systems, spying electronically, mothering, computer game playing, naked bike riding and Muppets.\n\nSome of the talks expanded historical horizons by reaching back through time, while others expanded our sense of today's geography.  Antarctica was a feature this evening.  One of the first talks was by a dad who has been collecting data about a toddler, exploring her new world.\n\nAn engineer spoke on the innards of slot machines, which I thought was pretty interesting.  He reaffirmed what I often say, that the gambling industry has every incentive to keep the games based purely in the mathematics of chance.  Theoreticians have developed criteria to prevent control beyond what the laws themselves would dictate, but this doesn't prevent designers from make the games as alluring as possible.  A near win (i.e. a loss) is more motivating than an actual win in some ways, so the games do have ways to make the loss look like an \"almost win\".\n\nThe Muppetologist referred to Muppets from after my time, which proved my advanced age to myself.  I'd watched Sesame Street in high school a lot, in the Philippines, but Sam the Eagle, Gonzo and Animal had not yet joined the cast.  I knew who Elmo was, and Kermit of course...\n\nAn organizer for Portland's Naked Bike Ride went over some of the history and safety tips in a humorous fashion.\n\nThe voting / election infrastructure expert emphasized that free and fair elections alone do not a democracy make.  High levels of civic participation remains key.\n\nThe talk about coding slot machines connected to the voting machines in that the former are subject to more scrutiny than the latter.\n\n[The Brony talk](http://youtu.be/gkv8mvzjttQ) opened some insights into the Django world, although the thinking there is \"pony\" stands for \"feature request\" and \"not getting one\" is reflective of Django's conservative, not-promising-the-moon culture.  There's another joke about half-empty versus half-full, with the optimist saying \"there's gotta be a pony in here some place\".  That's a nice way of saying you've been digging through a steaming pile of something obnoxious and remain hopeful that there will be some sort of payoff down the road.\n\nBen, with our company, was a chief organizer, though through Stumptown Syndicate.  I attended with our out of town school principal, a mentor in chief.  We call ourselves \"graders\" in that we have some control over steepness (\"grade\") and calculus is all about the gradient at each point (our school teachers calculus, though that's not what I do for them).  And speaking of grades, cousin Lee sent out a picture of a grader tonight, a type of road equipment I've always found somewhat fascinating.\n\nCollagen:  a family of proteins, more or less tightly wound, making bone, ligament, skin.  A triple helix hey?  I made [a note of that](http://tech.groups.yahoo.com/group/synergeo/message/70500) on Synergeo.\n\nLets not forget [FLAC](http://flac.sourceforge.net/), the new lossless codec.\n\nLast but not least, I want to mention the talk about living in one's RV in an urban area, as a lifestyles.  The seeds of the bizmo idea were being planted, as this guy indeed runs his web site design business out of his remodeled Rialta.  He has designed a handsome interior.  He made a good case that \"minification\" i.e. \"more with less\" is the way to go.\n\nAn important point:  he doesn't drive it that much (yes, it needs short trips to the RV dumping ground to empty sewage).  An average bizmo may relocate more often than a mobile home (unmotorized) but may stay put for weeks or months at a time.  If you're Dave Ulmer, you pull a trailer with motorcycle and snowmobile for your radius around a base camp.  In Portland, a bicycle + rain gear would serve that purpose.  Upshot:  larger numbers of people working from bizmo bases does not necessarily translate into greater per capita fuel consumption.\n\nI salute the bizmo lifestyle evangelist for tackling the issue of stereotypes head on.  He didn't mention Breaking Bad, a fictional made-for-TV series in which a bizmo stars from the opening scene (a mobile biological weapons lab, one might call it, in that it's used to make neurotoxins) but he did address a cultural tendency to associate wandering RVs with \"hippie badsters\" of some kind.  And yet our speaker was not of that breed.  Nothing scuzzy or untoward.  One could almost see the lights going on in peoples' heads.  That's why it's called Ignite, although some make a connection to Burning Man as well.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}