{
  "id": "8834355550146373630",
  "title": "Learning from Friends",
  "published": "2011-05-07T21:19:00.000-07:00",
  "updated": "2011-05-08T18:32:44.614-07:00",
  "content": "I participated in the fundraising event at the Multnomah Friends Meeting, not as CSN CMO, though we did use the company laptop and car, but as a proud dad.My daughter is a member of this delegation, headed for Central America. We were raising funds to sponsor the group.In a relaxed CSN setting one might dial up reports from the field from a large database of well crafted presentations. Yes, some of these might be on Youtube, such as [the CDCA one](http://vimeo.com/8368660) we showed this evening.CSN might have its more exclusive stashes as well, some local to a specific shop. Why? Because some causes mean the most to local players, or because the opportunities are restricted to specific friends, an inner circle.I was mainly gleaning ideas. Serving refreshments, other goodies, from the sponsored locale, is one way to go. While we're talking about coffee, why not show the whole process up the line? CSN is into transparency.Some people come to our shops just to browse those popular infrastructure videos, [watch the web cams](http://researchmaniacs.com/Oregon/Webcams.html). Remember penny alley? We're not embarrassed to offer peeps.Does you city have cams on the landfill, at the treatment plants, cleanup sites? One response to more surveillance of the public is to make the feed more available to said public.Rather than some \"us\" spying on some \"them\", it's just ourselves, watching ourselves. Watch those webcams at the Oregon Zoo.Followup:  I was on projector crew for the Friends again today, this time for Tara and Luci presenting on their trip Jamaica (not as tourists).  The circumstances were ad hoc and Tara jerked out the projector chord without using the cooling fan.  Being a startup is difficult. Larry took me to StarBucks and showed me his \"iBad\".  The flying app is especially impressive, takes some of the fear out of it (less likely to get lost maybe?).  He left me here, working for CSN.Instead of \"delegation\" I might say \"away team\", aware of the Star Trek associations.  The Friends Meeting is like the mother ship, and these people slip off, to distant lands and climes, and return, reporting.  Tara and Luci did a wonderful job, were top notch reporters.  We salute Jamaica and its avid application to sports and health care.  The world could use more principled athletes and physicians of many casts and sheens.I had a quick meeting with the CHR on Hawthorne Bridge, staying friendly.  CSN is no tiny tune when you're up close to the trumpets.  I was [on my way to see Stallman](http://worldgame.blogspot.com/2011/04/richard-stallman-at-psu.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}