{
  "id": "3744518120311185013",
  "title": "Media Literacy",
  "published": "2024-10-16T06:09:00.000-07:00",
  "updated": "2024-10-16T06:10:41.547-07:00",
  "content": ":: breakfast viewing ::\n\nWe probably needed a term like 'media literacy' because 'literary criticism' left out movies, radio, all the new media. Literature means books, and literary meant literature. No one wanted to confine themselves in that way. Semiotics was too egghead, but was a good runner-up. One of the professional videographers I know was a Semiotics major.\n\nLiterary criticism came from such writers as Norman O. Brown and Hugh Kenner. They would know how to connect the dots and make sense of a dense piece of writing. But then Marshall McLuhan came along, pointing out the great disconnect taking place within the sensorium. \n\nWho would be able to preserve linear discursive thought patterns in an age of quick cuts, channel changes, kaleidoscopic nonlinear, some might say chaotic, input order? EST people? That was a book. Bucky Fuller was an EST person, wrote the author, and Fuller agreed, by writing a blurb for the book's cover.\n\nMy pitch to the American Friends Service Committee back in the day, was along the lines of the above Youtube essay: the be media literate, one needs to create, not only consume, these communications. Don't just study the propaganda others disseminate, make your own propaganda. Make ads. Just for fun. See what it takes to be persuasive.\n\nAFSC was quite receptive and we enjoyed the challenge of making television, in Spanish, for a local cable TV youth audience. Voz Juvenile was the name of the show. At CUE, we adapted the idea for seniors. Why not let elderly folks write and record their own show, again for community television. Media literacy involves learning how to edit, run a camera.\n\nAdding spin to facts, thereby doctoring them, does not have to mean outright falsification. Think of a pep talk. Sometimes your job is to put a bright face on things. Does that mean you're lying? What happened to conjuring? What happened to casting spells? Halloween approacheth.\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjR0AJbJnLeFEO8lxZKJ9HAiTlQ-wqv3kfjCTWbrpuu3-mDdaABewWnKHAB54MohcK2IZ5BN1bjAHYjr6XJ-w08e6IG86Ky5ey4my1A7aanE9Hc-o7vSqHekLYgsPw8Yeb6j8gQ1Y1zNE27tkHeCM4BqjV0ZXfxixQbSBLrFHhPCMiT6gB4XYZDMbkMfhHD/s1144/world_game_room_1.png)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}