{
  "id": "4870766191060413968",
  "title": "Meeting with CSO",
  "published": "2010-05-19T20:38:00.001-07:00",
  "updated": "2010-05-20T21:49:27.808-07:00",
  "content": "Glenn (CSO) was perturbed by a petitioner in front of Fred Meyers (these days Kroger) today.  The petition was to help public schools, he was told, but the fine print revealed the plan was to stick a casino in some abandoned school, thanks to some amendment to the state constitution.  There seemed to be a lack of truth in advertising in this approach.This triggered more discussion of the CSN model and the degree of state regulation that might be needed, in Kerala or wherever.  In a USA context, I can imagine vendors stipulating and/or designating a set of recipients (charities, worthy causes) as a way of positioning their own brands.  Some of the obscure beer companies might take greater risks, with the causes they might support, leading to loyal followings among some specialized breeds of game player.  Not everyone supports Greenpeace, or even this or that religious group.  Could a local temple, synagogue, church, mosque and/or meetinghouse benefit from CSN infrastructure? The current model wouldn't forbid it, but local regulations and community standards well might.  That's the thing about CSN:  it might be more malleable than you think, or than your neighborhood might permit.The basic model has vendor payloads, already tax deducted (if that notion is applicable), and heading to the CSN pool.  When you boot a game, thanks to some purchase of product X, you have possible objectives A, B, C.  Choose your mission and be a star.  If you're quite new at the game or just practicing and score really low (perhaps intentionally), most if not all of the payload returns to the pool, available to future players (perhaps yourself).  If you advance through several levels, the causes you're wanting to benefit will be more highly compensated.  When you cross a pretty high threshold, then the vendor takes notice and celebrates your achievements with offers of branding on your Facebook account or wherever you're storing victories.The last wrinkle is somewhat subtle.  We don't want vendors begrudging players scoring high and committing payloads to chosen charities.  That's because these are charities the vendor set out to support, an original purpose of CSN being to benefit worthy causes.  In between, the CSN circuitry permits public participation in exchange for vendor goods and services, combined with support for the venue (the shop nets a percent for its operating budget).  One reward for taking an indirect route like this is the valuable psychometrics coming back from the field.  You learn more about your customers, in aggregate or by studying their public-facing accounts (as would anyone).  That helps you fine tune.  Feedback is valuable.Coffee shops will distinguish themselves by what assortment of vendors they've got, and therefore what beneficial purposes their games might support.Not every vendor wants to spend time researching causes or lending its name directly to NGOs.  In these cases, the Shop itself may be selected for the company it keeps.  A vendor seeks trusted peers in the philanthropy business.The model actually presumes give and take, cues from the field, shifting positions.  When a vendor gets feedback, perhaps negative, for not supporting a specific cause, that's not a crisis or break in the system.  That's what psychometrics are for:  to give the Shops a clearer picture of where the customer base is at, vis-a-vis this or that issue of the day.A separate aspect of the CSN business, though related, is [the \"reverie\" streaming of curriculum materials](http://coffeeshopsnet.blogspot.com/2010/04/smart-bar-lcds.html).  I mentioned the Periodic Table, cuts to other topics.  Lots of artistry will go in to some of these.  How much goes for product placement in the sense of advertising is a part of the equations.  As someone who looks at marketing, I like to send my own logos across sometimes, adding my brands to segments I'm proud to be associated with.  The idea of branding, of logos, does not offend me, though a particular logo or brand well might.In your typical casino, the game is players against the house, with odds tipped towards the house.  One may also play other customers in some games.  I'm actually not posing as a casino expert.If you yourself are a worthy cause, i.e. you have the ability to play for credits to yourself, then the game has that casino-like flavor.  On the other hand, if you have some control over where your losings go, once they become part of the casino's power to invest, then you have a different angle, perhaps that of a tribal elder.  In the CSN model, you invest your own funds through purchases of goods and services coming from vendors.  If the good or service is the game itself, rather than a perk for having put credit towards a class or course, then this too is more like casino gambling, where drinks and food may be off to the side and free of charge, courtesy of the management as it were.These being Coffee Shops, the idea of procurement, with games more optional than the whole point, takes us away from a strict casino model.   However, if \"the self\" is a possible beneficiary, then perhaps some state regulations apply (depends on the state).  Perhaps we're in Python Nation?  What then?My inclination would be to see some CSN facilities as non-profit schools, such that \"credits to self\" were seen as credits to a student working for privileges, access, opportunities to practice. Faculty are students somewhat more advanced along some specific path.   The work/study model (of a scenario) still applies.Some of these courses may be hard work, quite demanding.  It stands to reason that one might find compensation of various kinds, and not simply for \"being lucky\" in some game of chance.However, given the planned-for relaxed atmosphere, a more strictly controlled test-taking center might be required for some parts of the schooling.  Other environments besides that of a Coffee Shop will be a encountered -- a truism.Not all kinds of study are possible within some CSN venue.  On the contrary, NGOs recruiting personnel through CSN education programs will be showing or simulating environments outside the Coffee Shops domain.  This is what it means to prepare for assignments: you may study in a CSN venue, but you're preparing to do something else... the possibilities are myriad.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}