{
  "id": "5516964191737184820",
  "title": "Memo from Richmond",
  "published": "2009-05-24T19:14:00.000-07:00",
  "updated": "2011-11-18T11:45:35.373-08:00",
  "content": ":: fine grind and environs, Hawthorne District, Portland ::Running an art café in Portland takes G&G (guts and genius) of a certain kind, the hard work of sustaining working relationships, with vendors, artists, a staff, your customers, perhaps a back office. Not just anyone is cut out for such work. I'd probably last about a day?Portland's business community prides itself on weirdness, especially here in 97214 around Hawthorne, the birth place of the Silicon Forest in some ways. We're home to some of the finest coffee shops in Portland: Common Ground, Chance of Rain, Fresh Pot, Pied Cow, a Starbucks and Peet's [on opposite corners](http://worldgame.blogspot.com/2006/08/street-corner-tetrahedron.html), plus a spanking new one just around the corner from Linus Pauling House, which I still need to check out (stay tuned).When you're ready to jump in, I recommend [Fine Grind](http://pdxfinegrind.blogspot.com/) as the perfect place to get the flavor of our homey yet cosmopolitan neck of the woods. I started going there when it was still called Wired, then watched Jody and her staff take it to new heights, then turn it over to this highly qualified (partially overlapping) team.Keiko hails from São Paolo, loves life in a big city (Santa Barbara too small) and finds Portland fits that description (without the dreary uniformity of Miami say, with mostly chain stores). Yes, she knows about [the whale](http://mybizmo.blogspot.com/2008/01/one-whale-of-wanderer.html).Keiko works with Joe, a veteran of the Portland art scene, to bring some stellar, truly collectible pieces into our neighborhood. We are blessed.Even if you're a professional gallery or sister café, don't feel shy about checking out this hub of activity. Compare notes, pick up some ideas. Help us keep Portland on the map as an art capital, not just a music capital.[From my perspective](http://mybizmo.blogspot.com/2009/05/corner-office.html), Fine Grind continues to feed [the \"CSN grid\"](http://coffeeshopsnet.blogspot.com/2009/02/launch.html) with memes and dreams, weaving into the mix, adding to our collective joy. It's clearly a philanthropic endeavor, a source of good will, a cornucopia.If you're wanting to sharpen your Japanese, consider joining their language circle. Richmond school's nearby Japanese immersion program might mean some parents need practice. Keiko writes, of their meeting on May 6:In this second meeting, as suggested, we will prepare a short introduction about ourselves and home (“katte”) and/or tell a story about a trip (“ryoko”).Her Portuguese is even stronger than her Japanese, so that's another circle to consider. We need these all over town, in many more languages. Portlanders [take lots of trips](http://worldgame.blogspot.com/2005/01/inside-iraq-untold-stories-movie.html), have coffee shops to share them in, potentially (Costello's has [a travel theme](http://coffeeshopsnet.blogspot.com/2009/03/travel-bar.html)).Speaking of community, this just in from [Kimaster George](http://worldgame.blogspot.com/2004/12/twenty-wall-posters-digital-art.html):HOTLIPS Pizza has pledged to donate 100% of their revenue for June 21 to energy-saving improvements in their store (hopefully solar panels, if we get enough money).I presume he means the one on Hawthorne. This is a CarrotMob Project, something coordinated through Facebook. More details to follow.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}