{
  "id": "6468634490765595436",
  "title": "Mind the Gap",
  "published": "2015-07-12T13:03:00.000-07:00",
  "updated": "2015-07-17T12:11:47.036-07:00",
  "content": "Our family begins with begats, with Tetrahedron being self dual and so mating with itself, our initial Herm, to give a Cube, the tips of a Stella Octangula (the star these two make).\n\nDuo-Tet Cube is the Synergetics moniker.  These Tetra-tanks (tank = container) are each volume One.  The resulting Cube is relatively Three in volume.  We call these units \"tetra-volumes\" in our IVM Ocean (our extensible spatial Matrix), in contrast to the \"unit cube-volumes\" of XYZ fame. On may likewise 2nd power [with triangles](https://youtu.be/2B1XXV2Eoh8), instead of squares.\n\nCube takes a wife, Octahedron (its dual), and their progeny is the Rhombic Dodecahedron (RD).  The duals combine to give a derived shape.  Cube + Octa = RD, by this meaning of \"addition\".  The RD's dual is the Cuboctahedron, defined by twelve unit-radius spheres around one.  Its edges are 1D (one diameter) or 2R (two radii).\n\nWe've introduced volumes 1, 3, 4 and 6 so far with 1 (Tetra) and 4 (Octa) being omni-triangulated, with all edges 1D, with our 3 (Cube) and 6 (RD) being space-fillers.  The face diagonals of the Cube are 2R (1D).  The long diagonals of RD's rhombs are likewise 1D (squares are also rhombs i.e. a cube is a rhombohedron, as well as a hexahedron).\n\n[](http://photos1.blogger.com/blogger/1134/545/1600/vols.gif)[relative volumes](http://worldgame.blogspot.com/2005/12/iq-test.html)\n\nIcosahedron, the final omni-triangulated system of 20 equi-angular triangles (edges D), takes a wife (dual), in the form of a Pentagonal Dodecahedron, the last of the five Platonics (Tetrahedron, Cube, Octahedron, Icosahedron, Pentagonal Dodecahedron).\n\nTheir progeny, of the Icosahedron + its dual, is the Rhombic Triacontahedron (RT) of 30 diamond faces (the Rhombic Dodecahedron has diamond faces too, i.e. \"rhombic\" means \"diamond faced\").\n\n[](https://www.flickr.com/photos/kirbyurner/4148457444/in/photolist-97TTvV-7jzVSm)\n\nIf we go with saying 5-fold symmetric shapes are of the female genre (gender), with the cuboctahedron and 4-fold shapes trending male, then we might speak of the \"VE Guy\" of volume 20 (\"Vector Equilibrium\" = [cuboctahedral wire-frame](http://www.4dsolutions.net/ocn/numeracy0.html) of edges 1D with 1D internal radials) having \"two Gals\" for company, one askew, and one a-jitter (referring to the Jitterbug Transformation.\n\nEvery gal is likewise betwixt two guys so it's not unbalanced but is rather a dance of alternation.\n\nThey're all \"Dolls\" lets say (i.e. Polyhedrons, Tanks, Containers) which have Dolls inside Dolls (Russian influence).  Dolls in tanks, tanks in dolls (stomachs, bladders, guts of any kind).  Ghords.\n\nThe containers in our story may be organized concentrically and thereby form a Concentric Hierarchy of relative volumes.\n\n[](http://photos1.blogger.com/blogger/1134/545/1600/ch6.gif)\n\nnesting scheme\n\nOur IVM Ocean is likewise a Dollhouse (a gigantic \"inside\"), i.e. another Universe (a Space, a World), bounded in size and in time (time/size is a unified concept [in Synergetics](http://wikieducator.org/Synergetics), as distinct from shape which is \"pre-frequency\" i.e. eternal).\n\nUniverse is ultimately eternally a-conceptual in Synergetics (not conceivable as a container) but we allow ourselves these Models anyway.\n\n[](http://www.4dsolutions.net/ocn/graphics/cubanim.gif)1, 12, 42, 92, 162...\n\n:: Growth of the IVM (= fcc, = ccp) ::\n\n[SkewGal](http://coffeeshopsnet.blogspot.com/2015/06/sfactor-svol-evol.html) has faces co-planar with her CuboctaGuy (VE Guy if volume 20) and a volume about 1.08 x 1.08 times larger (precisely sFactor to the 2nd power).\n\nJitterGal has same-length edges as VE (of volume 20) and a smaller volume of ~1/1.08 i.e. about 18.51.\n\nThe so-called sFactor is in fact the volume ratio of VE / JitterGal i.e. 20 / ~18.51 or, equivalently the Svol / Evol ratio.  Svol / Evol > 1.  sFactor = 2√2⧲ˉ² = 1.080363026951 (rounded).  Svol = ⧲ˉ⁵/2. Evol =  (√2/8)⧲ˉ³. Where ⧲ is the golden mean (1 + √5)/2.\n\nNote that we've covered all the Platonic Five -- and then some -- in the above storytelling.\n\nWith the Coupler of 8 Mites, we may enter the game of space-filling [honeycombs of Archimedean Duals](http://www.steelpillow.com/polyhedra/AHD/AHD.htm).\n\nThe Mite is a space-filling irregular tetrahedron ([a Sommerville tetrahedron](http://demonstrations.wolfram.com/SpaceFillingTetrahedra/)) made of (A+) + (A-) + either B+ or B- (B for Bias), suggesting handedness, yet all Mites are superficially congruent.  Volumes of A, B and T are all 1/24 so Mite = 1/8 and Coupler volume is One (same as Tetrahedron).\n\nAristotle was right, remember the Mite. \n\nNote also that we used more wholesome whole numbers than some readers may be used to, owing to their \"[Qyooban](http://controlroom.blogspot.com/2010/06/end-qyooban-embargo.html)\" upbringing (over-fascination with The Cube, or Al Qyoob, as a focus of one's religion has some downsides, despite what [its devotees](http://mybizmo.blogspot.com/2008/02/quaker-geometry.html) and disciples will tell you).\n\nAn RT of 120 T modules will be our volume 5, vs. that of 120 E modules.  Mind the Gap.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}