{
  "id": "8417804251897728075",
  "title": "More Market Research",
  "published": "2011-11-18T09:52:00.001-08:00",
  "updated": "2011-11-18T12:01:38.150-08:00",
  "content": "I don't usually review [ISEPP talks](http://controlroom.blogspot.com/2011/10/intuition-and-science.html) in this blog, but Gabe Zichermann's talk was too apropos to CSN work to log elsewhere.  Tara and I parked quite a view blocks away in a downpour, plus I'd forgotten my raincoat so showed up wet in my dark suit coat and [bright orange T](http://coffeeshopsnet.blogspot.com/2009/05/more-on-t-shirts.html) (with a collar -- [a reunion relic](http://worldgame.blogspot.com/2005/05/princeton-25th-reunion.html)).Gabe is quite hip in the pre-hipster sense of \"tuned in\" (also pre-hippie), and carried his audience pretty effortlessly through his presentation.  Folks had no trouble following.  He included a long excerpt from Storage Wars, a televised game based on the auctioning and purchase of storage units.  In this case, I'd say the game serves a legitimizing function in that people empathize with the back end vulture culture that preys on lapsed units.  Reminds me of Six Feet Under in some ways, another deftly edited TV series.During the dinner, I wanted to run by [our business model](http://coffeeshopsnet.blogspot.com/2009/03/open-source.html):  vendor profits [prime the pump](http://coffeeshopsnet.blogspot.com/2009/03/proprietary-games.html), with contributions to player-selected targets commensurate with performance (heroics rewarded), self profiling (\"what type of philanthropist am I?\").  He encouraged us to [use Twitter](http://www.flickr.com/photos/17157315@N00/6359241897/in/photostream) for this purpose and I will do so later.[Tara](http://www.flickr.com/photos/17157315@N00/6359244505/in/photostream/) asked about military applications and whether gamification could lead to the breeding of an especially cowardly subspecies of drone nazi, a kind of subhuman (paraphrase).  Gabe acknowledged that militaries had been using gamification for dark purposes since forever and yes, he shares her concerns.  Tara has grown up around Quakers and is interviewing for Earlham College tomorrow, so you can see where [our household](http://mybizmo.blogspot.com/2006/09/investments.html) might not be especially enamored of keeping a devolved idiocracy in a controlling capacity where outward weapons are concerned.Gabe cracked an Occupy joke or two, knowing [Portland was friendly](http://controlroom.blogspot.com/2011/11/virtual-opdx.html) to this global blowback operation.  He also knew we're too elitist about coffee to think of Starbucks as inner circle.  Having studied this market, I welcome the influx of coffee drinkers [Starbucks](http://coffeeshopsnet.blogspot.com/2009/05/memo-from-richmond.html) provides, plus I'm not against [Starbucks](http://coffeeshopsnet.blogspot.com/2009/04/targeting-2012.html) adopting a few game kiosks, with our without the CSN imprimatur (just remember, you saw it here first).  We could use some of that muscle to get past [Oregon Lottery zealots](http://coffeeshopsnet.blogspot.com/2011/08/sounding-off.html) who cannot abide the competition.  That would take some of the pressure off the reservations to host all the parking (plus some of our best game studios can only be reached by bicycle, or electric ATV -- [approach quietly please](http://controlroom.blogspot.com/2007/11/etcha-sketch-view.html), serious studying ahead).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}