{
  "id": "7302500540191777564",
  "title": "More Poly of the Month",
  "published": "2009-04-17T09:44:00.000-07:00",
  "updated": "2009-04-17T16:31:52.705-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEifBAbyUvkHkN728g95ifLPILnYS3EaKZkx8GAsud5yEm8qgNC70Cn2TeDsc8NgJrb7I-MB8MEbWwR0eqtoVWzUzpP1S5Czrd_NCiVAKyZlqAm62jCAeN1w049Lz7Pr4vFGy8YxU-UCjftp/s1600-h/trunc_zono.jpeg)dissection of truncated octahedra into hexahedra using vZome by D. KoskiD. Koski has taken some of his precious free time, between hard hat construction gigs (he's an HVAC engineer), to spell out his game with the axes, with permuting hexahedra, applying it to our [Polyhedron of the Month](http://coffeeshopsnet.blogspot.com/2009/04/featured-polyhedron.html).You get \"more than one way to do it\" (MTOWTDI) closer to the middle of the build-out, with fewer degrees of freedom at the start or at the end.  Plus by the end you've got a lot of [ghost zomes](http://mybizmo.blogspot.com/2009/01/ghost-zomes.html), flat against their faces. Takes time to go into, more details on the Poly list.David's game with the multi-axis hexahedral buildout of zonohedra was influenced by [The Rhombic Enneacontahedron and relations](http://www.orchidpalms.com/polyhedra/rhombic/rh90/rh90.htm), a study which later incorporated some of his results.  He used his analysis to tackle the great rhombicosadodecahedron (in which the above zonohedron embeds), which lived up to expectations in terms of connecting the right dots.  More recently, he's performed a similar analysis on the truncated octahedron, giving CSN an insider track on his results (thx!).If you're building these in vZome or what have you, consider going to a three frequency octahedron and truncating from there.  You'll slice off six arrow tips, perhaps made from ping pong balls, or something similar.  Remember your CCP is both [a squaresville and a triville](http://www.grunch.net/synergetics/sphpack.html), depending how you slice it.  Four balls in a square is your intersection set twixt neighboring 3-frequency assemblies (pre-truncation).[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgkl6yCjPiZDtxdXEgnb2tzW0VAgXQL5qQbUS8DXNMI4bo6tA_sfiJOU63RrsOsuAWdTMRIHBJBg-1vwGzSQPGXt7vbwAXHqoR6TVs-UBGvh5sda1ayLA_IpnjpYRo6tH7lg9YZF9NXf8I/s1600-h/ian_clown.jpg):: [bubblz](http://www.bubblztheclown.co.uk/) w/ ian @ atm conference (uk), post Pycon ::sent by cell",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}