{
  "id": "917851139332205656",
  "title": "More QM in Portlandia",
  "published": "2011-03-29T23:07:00.000-07:00",
  "updated": "2011-04-01T19:58:18.739-07:00",
  "content": "I met with the CFO today, starting from an old geocaching site, the \"man pointing\", top of Mt. Tabor.  She's been bouncing around, will continue to do so.  I appreciate the Alaska connection, which our CHR shares, in a different way.  I'm glad she's found family.I hope I get to AK at some point.  That Hubble guy had gone there, to some edge of the Universe kind of place (it's all \"an edge\" when you're a cosmographer like that).Some bristle when I, a founder of DENSA (by my own accounts), start yakking about IQ.  Am I being sarcastic?  With regard to CSN, there's a kind of IQ test going on, with some getting in on the ground floor as we speak.  Or call it the Doppler Effect.  Or are things heating up in 97214, birthplace of the Silicon Forest?  I told her about our live in exchange student (\"torture taxi\" refugee) and the new work / study program I've embarked on.Wanderers was interesting tonight.  Steve, for some time a ward of the state, is back to his quantum mechanics (QM) teaching, trying to make it accessible to high schoolers.  Just using bra ket notation gets him some kudos with our Silicon Forest crowd, though we had our registered skeptics, as usual.  I gave him Rhett's number to follow up on some of those Bell Theorem interpretations.  Maybe it could be a comic book?  We'd need characters, and not just the usual suspects.Earlier, I'd checked into Wired (Conde-Naste) to read up on that anthrax scare, which claimed some real lives (not \"just a cartoon\").  Advances in bioinformatics resulted, as people learned more about sequencing that lethal bacterium.  The Russians get blamed for stockpiling in Siberia, though they could always take the \"just making vaccine\" defense like the Americans do.  Nasty toxins like that have a Matrix feel about them, their handlers a lot like those men in black.  I'd also picked Mental Floss from the rack, but a meeting with the CSO kept me moving.Now, I need to attend to my queue.  This may be one of those up-all-night working times.  It happens.  The service industry.  [Red Eye](http://worldgame.blogspot.com/2005/09/red-eye-movie-review.html) flights.Good hearing from Sam, Dawn's bro, while I was walking by Portland Energy Strategies (Patrick was joining us for the QM talk).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}