{
  "id": "7863696766571188129",
  "title": "Navigating the Lattice",
  "published": "2020-04-11T17:44:00.001-07:00",
  "updated": "2020-04-23T13:45:19.242-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiovrnfj3re0xsZ3dAlM_5E_5ME8i40xAbBUh_4TVOvWTTTksyHINRMPUfcp7baVE0b5IHk8GUVYfHeG2q2_2vw2HDt9msVSI7GC5sIGSXaPMmtbsLFUdMtKd4BOCrme8MVHEuuoBZ-1FWH/s1600/anim_slower.gif)\nYou have no doubt played a 2D game on a grid of squares, chess or checkers for example. Not every piece moves the same way perhaps, however in principle each square has four neighbors over the edge, and four more along the diagonals.\n\nBishops know those diagonals...\n\n[](https://media.giphy.com/media/DnMWFYg1bDvd6/giphy.gif)\n\n...whereas Knights move over one and then two, at ninety degrees.  The horse-mounted cavalry has surprising moves.\n\n[](https://media.giphy.com/media/VylQoDnVi9t6w/giphy.gif)\n\nFewer casual gamers, but most ardent players, know the hexagonal grid just as well. A lot of tank games, drawing from our dark ages history, take place on a board of hexagons.\n\n[](https://media.giphy.com/media/2xPY9uUtBfknDaHYiF/giphy.gif)\n\nWith the advent of computer games, the job of moving and tracking position, went from piece on the board, to avatar.  The games themselves went from 2D to 3D, with ever more elaborate floor plans.\n\nHowever, consider the humble 2D chess board and tank wargame terrain.\n\nWhat would be the 3D correlates?\n\nThe chess board suggests a 3D world of cubes, hexahedrons.\n\n[](https://media.giphy.com/media/3ohs85MNgUeodW5Ryo/giphy.gif)\n\nThe tank game suggests a 3D world of dodecahedrons, diamond faced.  From every position in space, twelve possibilities suggest themselves.\n\nWhat keyboard keys should we use?  One possibility: ERT for three \"above\", ASDFGH for six on the \"same plane\", and XCV for \"three below\".\n\nWhen R. Buckminster Fuller took up the topic of \"the will\" in Synergetics, he stayed in his own namespace and shared his input in game playing terms.\n\nGame Theory was already an accepted academic area of focus by that time, with World Game branching off as Fuller's innovation, and inheriting from War Games as well (logistics savvy and operations research).\n\n\"I always have twelve directions to choose from\" Fuller explained (paraphrasing).  He imagined himself as a chess piece, an avatar in the IVM.\n\nIt is clear to me that most humans tend to think in a linear, Go-or No-go, greenlight-redlight manner. To me, will is an optionally exercisable control by mind over brain__by wisdom over conditioned reflex-that becomes realizable when mind is adequately convinced regarding which of the 12 alternatives will produce the most comprehensively considerate vital advantage for all. (Synergetics 537.52)\nIn the [Flextegrity system](http://c6xty.com/), both the 3D cubes and dodecahedrons feature together.  The cube domains encase the compression islands, interconnected by springs or struts.\n\n[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiTIx6FMCK45oUzWLv2iLsXpCrkG18PXSuhQal9y1bnthUbS6Zc4qd-NZ4TA_OXQ8nRO4g-9PtE65wSQ61g8GgDdNSDqeIr5d1r1EGBv9N_QEceko4sJyihfVX_i7D48d6-Y8CbJ2NsO-CR/s1600/anim.gif)\n\nGiven every move from Icosahedron X may be represented by a single vector, perhaps represented in [Quadray Coordinates](https://en.wikipedia.org/wiki/Quadray_coordinates), the game engine should allow multiple frequencies to interpenetrate, multiple webs, each with its avatar spider.\n\n[](https://media.giphy.com/media/pPsDpMSPVz3CE/giphy.gif)\n\n[via GIPHY](https://giphy.com/gifs/synergetics-dodecahedron-rainbow-jnEANQMFlX4rbwEdhX)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}