{
  "id": "5646513669451452853",
  "title": "Nomadic Villages",
  "published": "2015-12-31T23:02:00.003-08:00",
  "updated": "2016-01-06T20:37:51.393-08:00",
  "content": "How does CSN inter-operate with the \"nomadic village\" initiative?  Remember the purpose of CSN:  to provide opportunities for philanthropic investments.\n\nCompanies allow their customers to rise towards stardom as players in various computer games that pay out to board-approved worthy causes.\n\nProfit-sharing includes building an asset called Good Will in traditional economics textbooks.  How this gets done is an evolving process, affected by innovations in software and hardware.\n\nDonations to charitable causes adds to a company's PR.  Corporate persons express their values through their patterns of funding, a form of image-making.\n\nValving donations through micro-investments made by customers, as facilitated by the Coffee Shops Network, makes for a more open environment, as players share their profiles and portfolios.\n\nNomadic villages are designed with a TTL (time to live) in any given site, after which they fold up their tents (figuratively speaking, though some do use actual tents) and move on.\n\nSome villages maintain their identity when they move, while others fork and branch.\n\nThe thinking behind the architecture is different when a village is designed from the ground up to be nomadic.  How small a footprint is left behind?  What traces are left?\n\nWhat goes into making a village mobile?  The idea of a caravan, gypsy wagons, hippie buses, suggests a \"traveling road show\".  What goes by shipping container.  Do helicopters have a role?\n\nAnother model is more \"World's Fair\" in that usable infrastructure is left behind by intent.  Landscaping.  An airstrip and/or helipad.  A next village will occupy the same digs, but with different gear.\n\nA typical mindset when it comes to \"new settlements\" is open-ended longevity, whereby structures get built with no plan for their eventual demolition and/or removal.  The \"nomadic village\", in contrast, is at a location on a schedule, with start and end times.\n\nWhen villages are choreographed to move around, like cruise ships, but with less cohesion, the technology becomes more agile.  Weight and structural integrity matter more.\n\nAs a matter of logic, refugee camps would be among the first in line to test prototypes.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}