{
  "id": "2828079904781139346",
  "title": "Number Lines",
  "published": "2009-02-25T14:13:00.000-08:00",
  "updated": "2009-02-28T10:26:46.003-08:00",
  "content": "A \"number line\" need not be \"infinite\" in order to be useful, nor must it be \"perfectly straight\". A good example:  the equator, or line around the edge of a clock, with notches for hours and minutes.On a [24 hour dial face clock](http://staticfree.info/projects/24h_clock/), you could keep the solar disk at high noon and show which time zone was \"on top\" as the world kept turning, with midnight directly opposite, at the antipode.A number line that goes all the way around the world is [locally straight enough](http://worldgame.blogspot.com/2009/01/phantom-band.html) to serve as a ruler, or we might look at actual rulers as short segments taken from this great circle line.In \"[arrowhead geometry](http://www.grunch.net/synergetics/quadintro.html)\" we point four number lines out from a common origin at (0,0,0,0), use 4-tuples for vector tip addressing.  Michelle, Jason and I were comparing notes on whether to say \"toople\" or \"tuhple\" after [the last PPUG meeting](http://controlroom.blogspot.com/2009/02/ppug-2009210.html) (and how about Ubuntu?: Michelle says \"oobuntoo\" whereas I say \"ooboontoo\").We're not \"anti-Euclid\" just because our school inclines towards Karl Menger's \"[claymation station](http://worldgame.blogspot.com/2009/01/proposal-re-dimension.html)\" approach to points, lines and planes.  They're all \"lumps\" as otherwise they wouldn't reflect rays the way they do, and this is [a ray tracing geometry](http://www.4dsolutions.net/ocn/pymath.html) that we're learning here, and so want our axioms and definitions to fit the application.It's an innocuous enough move, but [the dogmatists](http://www.grunch.net/synergetics/hypercross.html) will start barking at this juncture, as \"dimensionless points\" are an article of faith for them, a perceived foundation for [hyperdimensional polytopes](http://home.inreach.com/rtowle/Zonohedra/zonohedra.html) and all the rest of their edifice.I tend to make reassuring remarks at this point, reminding viewers that it's not either/or, plus in gnu math we have [APL and J](http://www.jsoftware.com/), hungry consumers of  \"hyperdimensional arrays\" i.e. there's no reason to let \"[extended Euclideanism](http://worldgame.blogspot.com/2004/11/matrix.html)\" fall by the wayside, even as we pioneer in different namespaces.What we're doing is mostly backward compatible, is what I'm endeavoring to put across, even if individual notations, such as Python's, have their quiet breaks with the past.When it comes to simple non-rationals (irrationals, incommensurables) such as 2nd and 3rd roots of simple integers, [phi](http://mybizmo.blogspot.com/2007/04/phi-guy.html) and pi, the natural place to begin is with simple diagrams constructible with string and a scribing surface (\"a sandbox\" or \"white board\").Our CSO Glenn Stockton does some [good teaching](http://coffeeshopsnet.blogspot.com/2009/02/glass-bead-game.html) in this domain, including drawings in perspective.  From here, it's but a small step to constructing Polyhedra, with toyz like Zome, vZome and StrangeAttractors.Our exploratory constructivism has a soft spot for such geometric constructions, embraces Euclid like a favorite teddy bear.  We don't forget about [Euclid's Method for the GCD](http://mathforum.org/kb/thread.jspa?threadID=1906306&tstart=0) either, like using Guido's Pythonic implementation thereof.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}