{
  "id": "4343629696882417589",
  "title": "OS Bridge Conference",
  "published": "2009-06-17T12:48:00.000-07:00",
  "updated": "2009-07-25T20:29:02.662-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjwE4qkxvPmmETFO0aCH99zvC0h6XWUITd0BIfV8bUvbfenHJOeN0AmWp9gs6jNLWexdaCEHtzKriEQMyNZfIOUAjGkneXMRzeRBy7nZzWBQLj11e9WZ7mWBNdXOwJVK65UsR7fkkMfoPhF/s1600-h/cto.png)We're sharing some of [our marketing strategies](http://coffeeshopsnet.blogspot.com/2009/04/ongoing-campaign.html) at [OS Bridge](http://opensourcebridge.org/), a way to promote socially responsible gaming (and Python) as a means of community service i.e. a mode of working (and playing) [more women](http://worldgame.blogspot.com/2008/07/women-and-foss.html) might appreciate (a theme of this slide).For more context, here's a link to [the PDF version](http://www.4dsolutions.net/presentations/osbridge2009.pdf) of the entire presentation (6.5 MB), where our open source [business model](http://coffeeshopsnet.blogspot.com/2009/03/open-source.html) figures in passing (we have lots of imitators already).Followup:  so I attended [Gabrielle Roth's talk](http://opensourcebridge.org/sessions/115) on this very topic of women in FOSS, her local \"code 'n splode\" giving techy women some venting time to compare notes on various outrages and offenses (men are allowed, but don't get to sit in front).  She gave a thumbs up on the \"FOSS covens\" meme, part of how the witches are beating the priests in the \"good works\" department these days (sorry Charlie, go whine to the Pope if you have a problem with that).Interesting group dynamic in that this gay guy in the audience they all knew assumed interrupt privileges, even after all those slides about directly countering such privilege-taking.  He tried to hijack the speaker's workflow during the Q&A, an explicit no-no.  I shushed him real loud, like \"hey, loud guy!\" (finger across the neck motion).  I might get in trouble for doing that, but hey, I'm a guy, so who cares.Speaking of group dynamics, apparently some OSCON 2007 BOF on Women in FOSS kind of degenerated, still part of the lore among this inner circle.  I wasn't at said BOF, dunno what went down, but do think of [OSCON 2008](http://worldgame.blogspot.com/2008/07/women-and-foss.html) as a turning point in some ways, in getting us back on track vis-a-vis our core motivation (world domination).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}