{
  "id": "163276402235594639",
  "title": "Place Based Influences",
  "published": "2019-01-03T13:18:00.001-08:00",
  "updated": "2019-01-03T13:50:56.206-08:00",
  "content": "The local Fred Meyer (Asylum District) has done something smart, especially in light of how much they stirred the customer base in rearranging where everything gets filed.\n\nI'm talking grocery store here, with other sundries, Supermarket Math.\n\nFreddie's, as the locals know it (a Kroger), has made its Cork & Tap more customer friendly, staffing it with more bartender aesthetics and throwing a great happy hour.  Remember, OLCC does not permit supermarkets to sell so-called \"hard liquor\" whereas such markets can in many states.  \"Do some Cork and Taps in other states serve whiskey?\"  I had that question for \"Jenni-saurus\" (one of the star servers).\n\nThis experimental API gives customers a chance to unwind and talk about their shopping experience, not that every conversation need wander to that topic.\n\nWhy do you think lawyers step up to the bar and pass the bar exam?  Is that because some ear listens and takes the word back?\n\nWasn't that also the barber's job?  Not everyone drinks.  The Bertrand Russell thing was not a show stopper in practice.\n\nHave at least two barbers, and then no one has to cut their own hair.  I know that wasn't the paradox but the pragmatist in me doesn't want to bring Westworld to a standstill over some race condition.\n\nOur Bishops offers customers a beer while waiting, just a gift, like you would offer any visitor looking to relax.  The business is all about cutting and styling hair, nothing to do with serving alcohol. Canned low alcohol stuff, sipped for entertainment.\n\nWhy not add a cider or two, or even a couple wines?  Wines require glasses and suddenly the world is not so simple.  Actually, Fred's (another name for it) sells wines in their own container, same as canned beer.  Hawthorne already has plenty of the old fashioned cocktail rooms, no need to go overboard.\n\nCoffee Shops Network goes with bar aesthetics some of the time.  Think of Avalon at one end of the spectrum (no alcohol last I checked) and Quarterworld at the other (full bar).  Both feature arcade games, and CSN definitely traffics in those.\n\nThe charitable giving games are a hallmark, with the more adult settings borrowing from casino aesthetics.  I'm not against magic shows and other distractions. \n\nI'm less interested in forcing an agenda, than in creating a space in which more agendas might happen.\n\nHow will we know which are the good ones without some chance to show off?  Strut your stuff (show us your blend of science fiction).  The \"got talent\" shows have helped people refine their judgement to some extent, regarding what's worthwhile.\n\nSo yes, \"bartender\" is not a role to make an afterthought.  Design from the inside out, starting from different viewpoints, with bartender one of them.  There's a therapist aspect, as well as pharmacologist.  There's knowing when to cut someone off.  You might need to flag a bouncer.  They say the highest IQ guy in the world is a bouncer (I saw that on an Elon Musk biography).\n\nSome of the most skilled and wonderful people I've met have \"bartender\" on their resume.\n\nYou learn a lot about people, and about the town, in some Westworlds (alluding to [the TV series](https://mybizmo.blogspot.com/2018/01/curating-credits.html) again -- akin to [Machine World](https://worldgame.blogspot.com/2005/12/more-about-narnia.html)). \n\nIf you're not familiar with any of the establishments I've mentioned and are looking for tourism opportunities, Asylum District is worth a gander.  Eyeball the Linus Pauling House while it still stands (my [Unilever plan](https://worldgame.blogspot.com/2017/08/expanding-access.html) never went anywhere) and Alpha Helix, in front of the body art studio next door.  Bishops, Fred Meyer, Quarterworld, Avalon... and many more, are all nearby.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}