{
  "id": "6494307021837617253",
  "title": "Playing It Forward",
  "published": "2011-11-23T10:56:00.001-08:00",
  "updated": "2011-11-23T16:54:31.857-08:00",
  "content": "The criticism I get the most is \"isn't it heartless and cruel to make a worthy cause dependent on income from games of chance?  Why not just give them the money directly?\"Despite the economy of abundance we sketch as a backdrop, with the sun giving enough, in principle, to finance our surf, there's still the matter of triage and opportunity cost.  The cost of whatever I'm doing now is whatever I'm not doing -- a tautology, and therefore more properly the business of philosophy than economics, but we can discuss that some other time.Remember:  the games tend to be didactic, in the sense of encouraging thought, though not necessarily about the worthy cause at the receiving end (someone in need of dialysis?), your wins redound to your benefit on your karma profile, nor need this funnel / tube be considered, ever, a sole means of garnering support.  Reach beyond CSN, by all means. And finally:  yes, there's a kind of Darwinian process in that some games won't attract loyal players and/or players with skill, and nor will the causes connected to them.  This may be for a host of reasons. It's not my job to predict every corner case that might arise.Remember: some people are philosophically opposed, on principle, to this or that.  A chief benefit of playing it forward is getting to designate, even if only in the sense of [a ballpark](http://coffeeshopsnet.blogspot.com/2011/01/storyboarding-lcds.html).  If you don't want such-and-such a \"charity\" to be piggy-backing, taking advantage of your talents and skills, then here's a way to dodge those tentacles, to be free of those shackles.  Drop charities.  Turn your back.  Adopt others.  You have a lot of choice in the matter.  CSN puts you in the driver's seat.  Manage your own karma profile.Speaking of tautologies, it's easy to map this model to life itself.  You're playing world game 24/7 and your playing has ripple effects that may benefit various projects and initiatives to some degree.  Others may study your profile to figure out what you're up to.  Some may learn from your role modeling -- another way to have ripple effects.  Others may work to counter your biases, for example by attending to causes you seem to have no patience for, or which seem to rank low on your totem pole.  You might be a member of a team wherein the players have their individual biases yet, overall, the whole is greater than the some of its parts and lots of bases get covered.Nirel looked like Mary Poppins [tonight](http://worldgame.blogspot.com/2011/11/reality-based-economics.html).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}