{
  "id": "22053371182074065",
  "title": "Python: Still Relevant",
  "published": "2024-08-04T18:11:00.000-07:00",
  "updated": "2024-08-04T18:12:57.037-07:00",
  "content": "This professor works in the same ballpark as I do: [Python](https://worldgame.blogspot.com/2024/06/just-use-it.html) as applied to data science, Machine Learning (ML) and Deep Learning (DL: a subtype of ML) in particular.  However my bailiwick has been earlier in the pipeline, between data gathering and feeding said data to Machine Learning models. That includes: preliminary analysis, normalization, standardization, cleaning, reorganizing, visualizing.Statisticians didn't have all these fancy ML tools until recently and their discipline up until then hasn't faded so much as abetted what has of late become center ring: deep learning. In practical terms, what used to be managed in spreadsheets (volatile) and databases (more secure) is now managed with a hybrid of the two: the programmable DataFrame. Bring your rows and columns into a single complex object, and work with it in code, rather than with fleeting mouse clicks or other unreplicable magic dust.Why am I plugging Python in the philosophy blog? For many obvious reasons, but let's just say because the School of Tomorrow, powered by latter day American Transcendentalism (a kind of intuitionism), is using Python to yak up the 4D meme. Yes, I'm referring to Quadray Coordinates and so on, not to be confused with (x, y, z, w) coordinates within the hypercube, or Quaternions. Disambiguation is important at this point, or you'll get rather lost in the 4D jungle.A less obvious reason: I think the philosophers' obsession with such as propositional calculus, ala Russell, Wittgenstein, Frege et al, was really about laying the groundwork for Turing and Von Neumann types to add the electronic dimensions. Logic meets circuit boards, giving us logic boards, and eventually the CPUs and GPUs we think about, and program, today. Philosophers should learn to program, in other words, if only to keep in touch with the atomic layer, the domain of Democritus.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}