{
  "id": "6530165807542436782",
  "title": "Quakernomics",
  "published": "2014-10-23T19:33:00.005-07:00",
  "updated": "2014-10-24T04:59:03.731-07:00",
  "content": "Quakerism is proving a useful namespace in which to investigate various forms of ambivalence, attitudes which may contain nuggets of wisdom and insight if successfully cracked.\n\nFor example, the puritanical prohibition against gambling, thought retrograde, contains the healthy suspicion of psychological manipulation, expertly employed by hidden persuaders, aimed at misleading people far more than at bettering their lives, PR to the contrary.\n\nIn other words, in the late 1700s, the Quakers were masters of the art of intelligent risk-taking and were seeing their investments in steel, rail and mining, paying off handsomely in real terms.  In that sense, they were \"gambling\" and in any given case, a scenario might take a turn for the worse and investments would be lost.  But ain't that just a picture of \"business in a nutshell\"?\n\nNo one has a plan to remove risk from the picture, not even God apparently (or He'd have acted by now, right? -- like some [deus ex machina](http://www.merriam-webster.com/dictionary/deus%20ex%20machina)).\n\nSo gambling is both an inevitability woven into the human condition, and is regarded as a temptation.  You have to do it, and it's a sin.  Where have we heard that before?\n\nGiven the Coffee Shops Network inherits from \"casino\" as one of its parent blueprint institutions, as well as from \"video arcade\" and \"church bingo\" (all mixins) we should look more deeply at this ambivalence around \"gambling\".\n\nAs [Penn & Teller](http://worldgame.blogspot.com/2014/10/good-without-god.html) the stage magicians put it, following in the footsteps of Remarkable Randi, staged illusions are harmless as long as the audience is in on the secret that they're being hoodwinked.\n\nThat's not the same as telling the secrets behind the magic tricks.  It's just there's no premise to the show that you in the audience have been wrong about physics all these years, and the universe just doesn't operate by the principles you imagined.  Now watch these spoons bend as proof of your ignorance.\n\nVery true: one may be wrong and off about principles, way off sometimes, but when people willfully deceive others into thinking wrongly, the word \"malicious\" has to come to mind.\n\nPerhaps two enemies that deserve each other have been using deceptive techniques for a long time now, so the alternative, of truth telling, seems bizarre.  But again, to say \"we're deceiving you\" is not the same as saying how or even why.\n\nSince Quakers prize honesty and have a history of risk taking, we can say the \"intelligent gamble\" is not discouraged, but how about selectively withholding information, as that's often away to backhandedly sabotage another's gamble.  What's allowed in a spirit of \"friendly competition\".  Do we all agree on the rules?  Manifestly we do not, though we share areas of overlap in that regard.\n\nQuakers seem logically bound to see the open source movement as a way of leveling the playing field at least in terms of tools.  You won't have a winning hand simply because you deprive the other guy of even getting to hold any cards.  This \"equality of opportunity\" standard is part of most democratic rhetoric i.e. \"in a democracy\" one works to not institutionalize a lot of secrecy and \"insiders only\" information.  Democratic government is open government.\n\nAnother reason Quakerism is fruitful is it encompasses the [non-profit business model](http://worldgame.blogspot.com/2014/10/revised-org-chart.html), which other for-profits may use for tax write-off purposes.  A coffee shop, if non-profit, may have an easier time highlighting the \"church bingo\" aspect of its heritage, whereas the for-profit version might seem a little more \"casino-like\" in its operations.\n\nBut then in my part of the world, casino profits were oft used for charitable purposes, like supporting OMSI or returning over-cultivated lands to a more wild state, friendlier to salmon.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}