{
  "id": "6640369495705989562",
  "title": "Random Facebook Comment",
  "published": "2024-09-16T07:45:00.000-07:00",
  "updated": "2024-09-16T07:52:52.292-07:00",
  "content": "Talking philosophy with Ivana, Epistemology group.\n\nIvana: and what about the mind then?:D Who controls it? Isn't it a product of brain activity?\n\nMe: I’d say there’s no global universal meaning to these terms “brain” and “mind”. Sure, “brain” is the name of that fatty organ in the skull, we all know that, but the meaning of that word stretches far beyond such denotations e.g. look at “Pepsi” — so much more than a dark carbonated sugary juice in a bottle. Think of the bottle as the skull. Then think of the PR army that makes Pepsi compete with Coke. The logo alone is a major signifier. We don’t have widely accepted icons (logos, brands) for each organ, but we could (some part of Unicode). That’d change the meaning of brain, the way I think of meaning.  \n\nIn the case of “mind”, the situation is even more clear: no specific organ need be referenced (although one might be). It all depends on the local namespace we’re in i.e. “who is talking?”. For example, a namespace I’m steeped in draws an important distinction between “brain” and “mind” and develops these differences through various published titles — not Foucault, not Derrida, and not theosophy, although developed contemporaneously with the Gurdjieff-Ouspensky stuff. \n\nLet me say here that I consider “brain” and “mind” two very different words and it’s a waste of good English to conflate them to mean the same thing i.e. to use them as synonyms. “Is your world really so simple that you can afford to erase that distinction?” Is the kind of questions I’d have upon encountering such an alien namespace. \n\nI’m also influenced by Freud and the psychoanalytic movement, which I trace back to Nietzsche in many dimensions. But that’s just me. I wouldn’t claim that my usage patterns match those of your random epistemologist. A lot depends on one’s ontology (I’ll conflate “ontology” with “vocabulary” in this paragraph).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}