{
  "id": "3650075326036719911",
  "title": "Rapid Qualitative Inquiry",
  "published": "2014-12-18T22:37:00.002-08:00",
  "updated": "2014-12-18T22:52:39.515-08:00",
  "content": "I attended a talk on Rapid Qualitative Inquiry this evening, by an expert on the topic, Dr. James Beebe.  His partner has presented to Wanderers on [her work in Afghanistan](http://mybizmo.blogspot.com/2010/08/foss-in-afghanistan.html).\n\nI came to the talk fresh from exploring a new CSN siting possibility:  Bangalore.  The LCD reveries featuring the IVM would likely go over well with proper prep, given the receptivity of this city to trends in high technology and early adoption.\n\nHowever, the local chief of GST (general systems theory, a discipline) is somewhat hostile to the Bucky stuff and is circling the wagons to protect his turf.  We engage in [our public quarreling](http://mathforum.org/kb/thread.jspa?threadID=2662930) on math-teach.\n[](http://rapidqualitativeinquiry.com/2.html)\n[Rapid Qualitative Inquiry](http://rapidqualitativeinquiry.com/2.html) replaces the solo researcher with a team and does not begin with questions, but with techniques for eliciting emic storytelling (emic means \"insider\" I learned).  One might call it \"accelerated anthropology\" and it comes from USAID wanting to make interventions in short order, without the luxury of months of study, let alone years.\n\nJames had been a student of Bob Textor, founder of [this think tank](http://worldgame.blogspot.com/2013/01/thirsters-gather.html) and Bob, as an architect of the Peace Corps program, was faced with challenges around rapid deployment leading to [interventions](http://controlroom.blogspot.com/2014/12/men-were-too-slow.html) in that historic context.\n\nThe [new CHR candidate](http://coffeeshopsnet.blogspot.com/2014/10/byzantine-delights.html) did not work out I'm told.  I liked the old one just fine anyway and didn't see where the CEO was coming from in proposing turnover (perhaps this wasn't coming from the CEO in the first place?).\n\nThe ability to distinguish affective emotion from logic, in the heat of an argument, is an important skill.  The way to remain cool is to calmly accept differences in naming conventions, not to defensively rally around one's own [namespace](http://worldgame.blogspot.com/2006/04/another-wittgenstein-essay.html) as the \"one and only\".\n\nDifferent city-states use different axioms (maxims) to govern their internal affairs.\n\nRQI is by definition a team exercise, not the job of a solo practitioner.  One can fake it as a solo investigator but we're talking about something more akin to police work (detective work) and that takes multiple perspectives and a willingness to keep those perspectives jockeying for attention (more like the White House in that regard). \n\nBohmian Dialog does not insist on a minimum threshold of participants for nothing.  When the number of points of view falls to too low a number, one loses the advantage of partially overlapping narrative accounts, and in RQI work, multiple narratives makes all the difference.\n\nJames stressed an important point:  to earn the trust of participants, one should never promise them the moon, nor even that the results they most ardently wish for will in fact be the eventual results.\n\nBuy-in on objectives is important nevertheless.  For example, the CSN [reveries on LCD screens](http://coffeeshopsnet.blogspot.com/2010/04/smart-bar-lcds.html) tend to reinforce a lot of the \"design science\" memes launched by Fuller e.g. 1, 12, 42, 92... CCP (i.e. IVM lattice).\n\nWould more exposure to such memes benefit the children of Bangalore as they grow into adulthood?  Only if the answer is yes would I consent to move forward.  So far I'm thinking \"yes\" is the answer.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}