{
  "id": "2760811049385848589",
  "title": "Self Booting Startup",
  "published": "2020-03-09T18:56:00.004-07:00",
  "updated": "2020-03-09T18:57:23.161-07:00",
  "content": "Everyone believes in the dream of booting, as we somewhat do that through being born, and we hope making it to adulthood.  All from a couple of cells.  We intuit that organizations work somewhat the same way, to develop critical mass and then take off somehow.  We explore for the right business model designs, the right chemistry.\n\nPhilanthropy for Everyone\n\nThe Coffee Shops Network is a philosophy based in the idea of Philanthropy for Everyone, meaning no matter how meager your means, you deserve opportunities to commit to projects that express your values in some way.  That your contribution might be amplified through higher scores, within some exciting game playing experience, is an added bonus, one could say thrill, giving you that added \"chance to win big\" possibility.\n\nFor those used to a Video Lottery, perhaps state permitted and used to raise funds for the state, winning the lottery is akin to having a fortune to divvy up among your lucky recipients. Their job, as a partial consequence, is to live up to their potential and prove their worth to investors.  However charitable ventures are not designed to reward with interest.  They're aiming to achieve specific results.  Successful projects tend to come with metrics:  ways to evaluate their success.\n\nGambling for Charity\n\nSay I walk into a Coffee Shop and buy a bagel.  The purchases feed my gaming account, which I may pay into outright.  Once I've chosen a game, I have some ability to amplify more gift in accordance with performance, and some games help build skills I need anyway, such as typing faster, or recognizing rare birds.  I buy more coffee and play some more.  I rack up winnings for beneficiaries.  I am literally a hero.  The psychological benefits of giving to charity are well known.\n\nYou might object that I'm actually describing a lot of church operations here, in giving opportunities to amplify prayers with the right add-ons.  Philosophy has always been a close neighbor of the religions, given its focus on ethics and aesthetics.  Believing your contributions are actually doing some good requires some trust in the framework.  Do you actually see the crypto-currency going over the wire?  What assurances do you have that the transaction has gone through?\n\nClearly for a Coffee Shops Network to build out, it has to partake of solutions pioneered by FinTech, giving organizations ways to channel some token of value in ways that make sense to the power brokers.  If you're thinking \"someone, somewhere is making money\" you're probably thinking in terms of whether your generosity is being exploited or taken advantage of.  Possibly so.  In other words, we're back to whether you have trust in the organization. Those organizations that fall apart over time seem too much like pyramids.\n\nYour Profile\n\nDon't forget your profile matters.  Your record as a donor of winnings, a contributing player, may come back to haunt you, and take you into \"deleted tweet\" territory.  The social media aspect of backing effective projects is worthy of much exploration.  You may well develop imitators, but then some designs may give you backers.  In committing their winnings to your kitty, you get all that much more to forge ahead with.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}