{
  "id": "8875479591486093314",
  "title": "Serving Buzz",
  "published": "2009-03-22T08:49:00.000-07:00",
  "updated": "2024-04-29T07:06:29.769-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/479677094/in/dateposted/)\nCoffee shops share [a constructivist heritage](http://coffeeshopsnet.blogspot.com/2009/02/about-constructivism.html) in that here is where people congregate to compare notes and weave memes.\n\nAfter WW1 in Paris, a kind of existentialism took root, as the devastated and war torn tried to reboot. [The movie Jarhead](http://worldgame.blogspot.com/2005/11/jarhead-movie-review.html) makes a lot of allusions to this literature, which was insufficient to keep WW2 from happening. WW3 was at least colder in some dimensions.\n\nIf you're fortunate, your shop will have some networking pros, including on staff, [Romany Marie types](http://coffeeshopsnet.blogspot.com/2009/03/franchise-motifs.html) such as some of our CSN co-founders here (others more grumpy and back office).\n\n\"Meme weaving\" or \"dream weaving\" or \"day dreaming\" (as in conversation, or as in just [doodling and noodling](http://mybizmo.blogspot.com/2009/03/noodling-and-doodling.html)) connotes politics. In Portland that means [projects like DemocracyLab](http://mybizmo.blogspot.com/2009/02/democracy-engine.html) or the operations of PDC, [Metro](http://mybizmo.blogspot.com/2008/11/town-meeting.html), PPS, the City Council... lots of players, takes time to surf the blogs, sample the buzz, before chiming in, starting to build a constituency.\n\nPutting too many conversations into one space, plus [doing some gaming](http://mybizmo.blogspot.com/2006/07/visitors.html), sounds like a recipe for pure hubbub, like Laughing Planet on steroids. But of course I'm assuming there's a virtual aspect to all this, that personnel touch base in the shops, through smalltalk or whatever, and then follow up over time, perhaps moving among the shops.\n\nLarger and [more programmed events](http://www.isepp.org/) are occurring off camera in this scenario, often in rented facilities, meeting rooms, at facilities such as CubeSpace on SE Grand, or [at Lucky Lab](http://controlroom.blogspot.com/2006/05/lucky-lab.html) on SE Hawthorne.\n\nHowever, if your shop runs some [communal LCDs](http://mybizmo.blogspot.com/2006/12/caf-philosophique.html), like at airports, then there's the option to telecast customer \"business cards\" as commercial shorts, cameos, accepting a fee for the service, perhaps in terms of accrued tokens on the gaming account.\n\nCustomers may also stream travelogues, not necessarily at a charge, with the corresponding web page pointing to the scheduled presentation, should such info be semi-public. Portlanders still travel a lot, come back with their stories.\n\n:: portland barcamp @ cubespace ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}