{
  "id": "6695062667204189467",
  "title": "Show &amp; Tell Lounge",
  "published": "2009-04-13T17:02:00.000-07:00",
  "updated": "2009-04-13T17:40:25.209-07:00",
  "content": "Show & Tell Lounge is shorthand for a section of your shop that doubles as an ad hoc TV studio.  Informal presentations, or formal ones, might be captured to file with this setup, blessing your establishment with a library of favorite hits, accumulating over time.We've been testing this setup in [the ISEPP Pauling House](http://coffeeshopsnet.blogspot.com/2009/02/glass-bead-game.html), having captured quite a few presentations to tape over the years.  Pycon, from whence I've recently returned, opened my eyes to [what money might buy](http://pycon.blip.tv/file/1957605/).  Not every shop needs the same setup.  We're not a cookie cutter operation.So say you have this rant you've been wanting to share.  Sure, it's somewhat [paranoid and esoteric](http://controlroom.blogspot.com/2007/08/esozone.html).  You'll have some friends in the audience maybe.  Bring some slides, strut your stuff, walk away with a memory stick, upload it to Youtube?  Google Video?... ShowMeDo? The hope is our customer will get a record, in exchange for scheduling a performance and delivering the goods.  Shop staff get to screen by default, don't have to serve all comers.  Try another shop maybe?  Sometimes we're all booked up well in advance.Again, a shop is a place to practice, to study, to share the buzz.  We're mostly not competing with professional recording studios that do only this kind of stuff for a living.  An off-Hollywood shop that goes further in this direction, one or two standard deviations, might even be owned by a studio.  Here's a way to pre-screen while hosting a relaxing, less demanding kind of talent show, less judgmental, less at stake (at least from the studio's standpoint).Customers need to know when extra cameras are running, as simmering down might be the polite thing to do.  Ambient levels of surveillance, quite apart from karaoke, lightning talks, will depend on whether we're in a casino or not, on a cruise ship, other contexts. CSN doesn't always know your precise circumstances. Video summaries, suitable for public flatscreen review, would be welcome.  I'll contact the Portland Knowledge Lab to suggest this as a new category.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}