{
  "id": "7518564075639412236",
  "title": "Smart Bar LCDs",
  "published": "2010-04-12T10:59:00.000-07:00",
  "updated": "2010-04-12T12:01:44.655-07:00",
  "content": "Some of you may remember the \"smart bar\" phenomenon.  I was out of the country, never made it to Goa or wherever the headquarters was.  The Coffee Shops Network, in being about philanthropy, is more about heart than mind in some ways.  However, those LCDs need a steady stream of interesting content, more than just \"weather, news and sports\" -- we need art.The \"science-minded reverie\" is an emerging genre.  Video dissolves, plus my hypertoon thing, suggest a stream of consciousness or dream-minded state.  Assuming the ambient noise of the shop provides sound, we assume no narrative \"glue voice\" to explain what we're seeing.  In a theatrical context, we might have a custom soundtrack.  The version behind the bar might be a re-cut or shortened version of what's available in full length.During this morning's meeting near Mt. Tabor, I proposed anchoring many of the reveries to a concentric hierarchy of polyhedra.  The five Platonics contain their own duals.  By a process of combining these duals edge-wise, the rhombic dodecahedron and triacontahedron get produced, of 12 and 30 diamond faces respectively.  The cuboctahedron, so far not produced, provides the stage and setting (like \"the holodeck\" on Star Trek), is more the backdrop than what's at the center of the action.  Carving the rhombics into four tri-rectangular tetrahedra to produce \"exploding diagrams\" and other effects, creates additional fractional components, called \"modules\" in much of the literature.  Other transformations apply -- I'm not aiming to be exhaustive in this context.  Art schools will teach you this stuff.  Golden cuboids etc.Other reveries might center around the Periodic Table of the Elements.  We might likewise look for and stream visuals regarding similar summary patterns at the nano-sized level, [per Dr. Tomolia's suggestions](http://worldgame.blogspot.com/2010/03/towards-nanoscience.html).Reveries drawn from nature will of course be among the most popular.  Computer animations of sub-visible and/or purely conceptual phenomena need not monopolize.CSN patrons sipping their coffees, teas, juices will have spaces to converse, LCDs in the background, unobtrusive with sound.  Casual viewers will be reminded of chemistry, mathematics they might have learned, animals of the forest, flowers and their names, some information about them.  Resting your gaze on one of these monitors will definitely provide you with information, sometimes teasers for longer-running specials you might want to order for more private viewing, where you could add more sound.  The information may bore you or not be anything you care about.  You are free to look away, to return to your philanthropic enterprising, your conversation, your drink.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}