{
  "id": "132523781697268726",
  "title": "Sounding Off",
  "published": "2011-08-27T13:00:00.001-07:00",
  "updated": "2017-06-18T11:12:28.821-07:00",
  "content": "We have a delegation in Nicaragua looking into development projects.  This might be through Friends, though perhaps through FWCC to better protect overseas investors from Americans' xenophobia (have you noticed how guru yogis from India get demonized, whereas the Protestants fan out across the globe \"saving souls\"?).\n\nThe CSN is likely to be accused of offering gambling, given the heroics have variable outcomes (sometimes you wipe out) and there's money involved.\n\nThe USA is actively defying the WTO these days, which has pointed out the hypocrisy of harboring casinos in properly zoned zip codes, but then saying similar facilities are disqualified from providing their services over the Internet.\n\nTight regulations, left over from [Prohibition Days](http://mybizmo.blogspot.com/2009/08/before-prohibition.html) (ongoing) have turned many normal human activities into social crimes against the state.  The USA is one of the most illiberal nations on the books, thanks to its chief hypocrites.\n\nIn any case, to have brick and mortar studios on the ground, we only need prototype in private residences, by invitation, to get around the OLCC and so forth.  We have already done this many times, as you will find [memorialized in this blog](http://coffeeshopsnet.blogspot.com/2009/09/coffee-shop-show.html), so no news there.\n\nThe \"Duke's Equations\" (as some of us call them -- a reminder of [Duke's Landing days](http://mybizmo.blogspot.com/2010/06/rad-portland.html)) have already been mastered.  The games come over the wire, and the money goes from some place where it's authorized, and not in contravention to any law of the seas.  Ships helping other ships in distress, is what it comes down to.  We should not be prevented from offering humanitarian aid, even if we don't demand obedience to some Christian hierarchy (or whatever religious old guard).\n\nAnyway, enough fulminating and pounding the podium or I'll sound like I'm just another preacher with a large choir to back me up.  That's not my usual style of marketing, I can assure you.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}