{
  "id": "6913199137344449051",
  "title": "Spherical Pinball Machine",
  "published": "2024-12-07T14:44:00.007-08:00",
  "updated": "2024-12-07T15:16:43.548-08:00",
  "content": "If you’ve been jumping around inside these blogs, and you’ll know the ones I mean if you’ve been doing that, then you’ve seen the statistical material seeping in by osmosis, as the author, yours truly, is placed in sink or swim mode vs-a-vs some objective reality we know not, being not omniscient.\n\nI summarize data science for my students as the business of predicting the future, which may seem too narrow given all the data sifting we’re doing to get better pictures of the past. But that’s the thing: where will we expect to get those better pictures? In our future. The past is already over, and is immutable. In that sense, anticipating what will be is redundant. We face forward in time, try turning that around. Not easy right?\n\nEnter the Active Inference lingo, where we partition off future from past (priors) with a Markov blanket. Your energy budget is to spend on countering entropy within your own model, which you might as well call the action (sometimes gradual, sometimes steep) of gradient ascent, as descent, these are as left vs right conventions (gotta pick one, just be consistent within your own namespace). \n\nTo the extent you’ve not reached an apex, you’ve got free energy left to try. Once in equilibrium, you’re not tapping out savings so quickly, yet every belief system leaks. Your hand is always needed on the tiller even if your touch is light. It’s that experience of free agency that keeps us from calling it autopilot, which isn’t to say the pilot is forbidden from taking cat naps.\n\nThe active agent’s response to sensory or “sent-int” is action, preferably constructive such as to restore mental model applicability. No one wants to throw out a mental model and start over from scratch, except in sandbox areas, such as we provide in some of our workshops. \n\nThe agent actively shapes her, his or their world to conform to expectations, and only resorts to backup responses if no such restorations ensue. So then there’s shifting gears and taking a new position.\n\nWhich reminds me, when people ask me about the est Training (1970s mostly) what do I say? Not that I’m always able to predict my own banter (I learn what I’ll say when I say it), at the moment I’m gonna say it was all about “getting off it” which means owning one’s condition sufficiently to make a leap to a next condition not only feasible, but gracefully accomplished and already in the rear view mirror. Yes, that’s wishful thinking in many cases but at least we’re clear on for what we wish.\n\nOther times I’ll steer them to that steersman handbook, a relevant piece of 1970s published esoterica. Marshall McLuhan and Bucky Fuller overlapped a lot in the intellectual culture (IC) of that time. Werner Erhard got some big wheels turning, the Hunger Project being one of them.\n\nThe Bayesian (vs Frequentist) is dash boarding it, flying in some OODA loop, and adjusting en vitro, looking to optimize. The instruments on the dash keep updating, not just in content, but in makeup. Different instruments come along, providing new freedoms. Some instruments fade making room. Attention may be all you need, but it’s also finite. We’re not the omniscient ones.\n\nLike I said, the material is seeping in by osmosis, a stochastic process. Both 52LivingIdeas and Math4Wisdom chapters were about thinking schematically, meaning diagrammatically. TrimTab had some of that too, and of course FSI. We have this other way of thinking more graphically rather innately these days. The right brain is back from vacation.\n\nIt’s less about which structures you use, than about using such structures in the first place, and being willing to hop between them, as none in isolation is likely to sufficiently serve.  \n\nOne learns to bounce around in a spherical pinball machine of sorts. I tend to use that metaphor a lot in my YouTube channel (see above).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}