{
  "id": "5838410888166583800",
  "title": "Storyboarding LCDs",
  "published": "2011-01-05T21:47:00.000-08:00",
  "updated": "2011-01-16T11:04:22.045-08:00",
  "content": "[](http://www.flickr.com/photos/17157315@N00/5328877131/)The above figure, [by David Koski](http://mybizmo.blogspot.com/2008/01/koski-on-t-modules.html), developed in a Java application called vZome by Scott Vorthmann, shows several polyhedrons (polyhedra) sharing vertexes (vertices).  They are color coded for discernability.  The yellow lines, for example, form the diamond faceted rhombic dodecahedron of special interest to Kepler.  The green lines form an octahedron, the red lines a rhombic triancontahedron (30 rhombic faces). [](http://www.flickr.com/photos/17157315@N00/4148457444/)Their volume ratios are as follows:\n- Red rhombic triancontahedron : solid cyan cube :: 7.5 : 3.\n- Yellow rhombic dodecahedron : same cube :: 6 : 3.\n- Green Octahedron: 4.\nThese ratios are not in lowest terms and the last \"ratio\" implies 4 : 1, with 1 being our unit of volume, a tetrahedron of edges 1 CCP ball diameter (the tetrahedron is defined by [four inter-tangent balls of equal radius](http://www.flickr.com/photos/17157315@N00/4949799682/in/photostream/)).[](http://www.flickr.com/photos/17157315@N00/5329177580/)These computations relate the above shapes and ratios to an additional set of polyhedrons, three having the same shape as the red one above, but with different relative volumes:  5, 5.00+, and 21.21+.  To have a rhombic triacontahedron (RT) of volume 5, you need to shrink the 7.5 RT's volume by 2/3 and therefore all its linear measures by the 3rd root of 2/3.  The resulting RT's radius is very close to 1 (0.999+), assuming the diameter of any CCP sphere to be 2.  The shaded blue line labeled \"mind the gap\" is about the tiny difference between [the T-modules](http://www.4dsolutions.net/satacad/martianmath/mm14.html) RT and the E-modules RT, each \"module\" being 1/120th of its respective rhombic triacontahedron.[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEibh9awLunskAZdlhqtpKiH8QnJdZc_BMbJsReWi8mdsgLqIKCJH25lEuPhH1nZnTSP7KcslHzopbxc9RYD0jjT3S0Y1N5TKotulvfdI5elvLtujgX6MDWCj7YgQz56oX-3F0i-WXUWM1cc/s1600/mindthegap.png):: click for larger view ::Jitterbug Perfume is an allusion to the book by that title, by Tom Robbins, but also to Fuller's operational adaptation of that word, a dance style, to the [twisting-contracting motion](http://www.youtube.com/watch?v=FfViCWntbDQ&feature=related) whereby a skeletal cuboctahedron might be formed into an icosahedron using six additional equi-lengthed edges.  That icosahedron, combined with its intersecting dual, the pentagonal dodecahedron, its \"wife\", \"give birth\" to yet another rhombic triacontahedron, phi bigger than the E-moduled rhombic triacontahedron, or phi to the 3rd power bigger by volume (phi being the golden mean or golden ratio, pronounced \"fee\" by some, \"fie\" by me).Again in terms of our unit tetrahedron of 4 CCP spheres, this larger (or \"super\") rhombic triacontahedron has a volume of [15 times the second root of 2](http://controlroom.blogspot.com/2010/02/getting-phi-in-game.html).The E-mod rhombic triancontahedron \"phi down\" from the super one, has a radius (body center to face center) identical to that of the CCP spheres.[](http://www.flickr.com/photos/17157315@N00/5329469320/)To summarize:Four rhombic triacontahedrons have been discussed, with volumes 5, 5+, 7.5, and \"over 21\".  The 5 and 5+ are very close to the same volume (\"mind the gap\") and are each exploded into 120 tetrahedral modules, the Ts and the Es respectively (E for Einstein or maybe \"explodes\", T for triacontahedron).  The T-module RT has a close relationship with the red one up top, the 7.5.  [The T-modules](http://worldgame.blogspot.com/2006/11/t-module.html) have volume 1/24, identical to that of the [A](http://www.flickr.com/photos/17157315@N00/4883782209/in/set-72157624750749042/) & [B](http://www.flickr.com/photos/17157315@N00/4883783319/in/set-72157624750749042/) modules, which build the other shapes (besides the red one) in the top picture. The E-module RT has a close affinity for the \"jitterbug\" RT, the one that embeds the 18.51+ volumed icosahedron, with edges equal to the diameter of the unit-tetrahedron-defining CCP spheres.  CCP = closest cubic packing, the same as the IVM or \"isotropic vector matrix\" when comparing scaffolding or skeletons.  Architects may say \"octet truss\" for the same space frame, studied intensively by Alexander Graham Bell before Fuller got a patent for it.[](http://www.flickr.com/photos/17157315@N00/479693541/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}