{
  "id": "5769906999422138659",
  "title": "Study Hall",
  "published": "2009-06-14T08:47:00.000-07:00",
  "updated": "2009-06-14T16:08:45.880-07:00",
  "content": "from Ira Flatow's Science Friday:  snake locomotionSome of our more youthful readers are thinking this is just boring old study hall, dressed up with scones and/or Brazilian cheese bread (yum), and they're right in some ways.In today's world, we somewhat assume you're carrying a personal headset, so if you don't want to buy new or share the communal pair, simply jack in with your very own (like the ones in the seat pocket in front of you, that airlines just give away sometimes (but we lose them, rat pack the garage)).The overall effect, even with all that frenetic game playing under the surface, winning big time for your teams, is a somewhat hushed environment, meaning you have room for intimate conversation without shouting.  There's a buzz.  Sometimes there's a didjeridu (and not just on headphones).However, it's also in error to posit one steady ambiance for all times and seasons, as a shop has a life of its own, its rhythms, and you're not going to see the same Harry Potter types at all times of day (considering \"a day\" to be \"one 24 hour period\").  Maybe it's [karaoke night](http://coffeeshopsnet.blogspot.com/2009/04/show-tell-lounge.html) and your customers are singing their hearts out.If you have multiple CSN hangouts, you'll get a roving loyal base, with the quieter types frequenting the less loud locations, nothing to stop the Trappists from doing one.In terms of Harry Potter, my little [Slytherin group](http://www.flickr.com/photos/17157315@N00/sets/72157616066135225/) comes through only occasionally, in which case the shadows flicker and a film noir track kicks in on the sound system, activated by remote sensor (just jokin' with ya, adds to the tone).Or more likely, I'm perched in [the corner](http://pdxfinegrind.blogspot.com/2009/05/metal-plaster-wood-show-artworks.html), more like Bob Cratchet, trying to makes sense to this scrooge Uncle Sam.  Or am I more Mellville's [Bartleby](http://www.imdb.com/title/tt0230025/)?  Or maybe that'd be Matt?",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}