{
  "id": "1364184030307012114",
  "title": "Targeting 2012",
  "published": "2009-04-20T13:54:00.000-07:00",
  "updated": "2009-04-22T11:08:18.965-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjmCmTATQCBS7rLttus0Qb1jOqtirKThJbfhmBo3pZYHNXzUPhyphenhyphen8gyVXpm6p_n9ZIvmZHi007TEM1TvNJH1dzg7t0_AkC7DoJFRTa8fkDkUGiaq7fgUuApwkmzjSq912bC11ueMg4OpiogA/s1600-h/gis_2009_fgp.png)\"Is CSN a cloud computing application?\" people want to know.  Until recently, I might have said yes, but upon reading up [in the blogosphere](http://oubiwann.blogspot.com/2009/04/after-cloud-new-big.html), catching some Pycon talks, I'm thinking we're also looking at open source hardware.In my [Py3K talk](http://controlroom.blogspot.com/2008/10/scholarly-meetup.html) at Cubespace, a baptism for Jody, the model was \"free if you want bare bones, extra if you want preloaded with vendors\" where the latter are mostly local, at least half of them into organic gardening.Jody was ahead of the curve in working with a community gardener, gave us the back story when celebrating John Lennon's birthday, [a family event](http://www.flickr.com/photos/17157315@N00/2927641823/in/photostream/).This was before my bidding on FoodHub (thinking Django) and Michelle Obama's [strong forays](http://www.cbsnews.com/video/watch/?id=4935866n) in this direction.  We're in an [even stronger position today](http://worldgame.blogspot.com/2009/04/gis-meeting.html), in terms of promising home grown delicacies and healthier foods in school (and hospital) cafeterias.More to the point:  our students are becoming more aware of the full life cycle, developing more relevant life skills as a result.  Home economics is making a come back... as a high technology field (you can't beat nature, when it comes to high tech).As I've mentioned before, Fine Grind (previously [Wired](http://controlroom.blogspot.com/2006/03/back-wired.html)) is more a bakery disguised as a coffee shop, is also an art gallery.  This doesn't mean it's lying about what it is, but that coffee shops may have a deeper side, especially in Portland, a city of esoteric back spaces, missing links, underground comix and geocaching, not to mention lots of old bookstores.Some shops in Old Town may still connect to the tunnel system, from whence new salts were recruited.  The \"Chinese navy\" needed a few good men now and then, where the verb \"to shanghai\" comes from.In a more contemporary Portland, we still have our talent scouts and head hunters, and more often than not it's at meetups over coffee that some real deals get made (or over beers in some cases -- some people stay sharp sipping whatever's on tap, whereas others lose acumen even on ice water).My [DemocracyLab meetings](http://worldgame.blogspot.com/2008/12/wanderers-2008123.html), also that one [with Mosaic](http://www.flickr.com/photos/17157315@N00/3224156136/), were at Common Ground on Hawthorne, well known for its fine rack o 'zines, stellar baked goods, with a real theater around back.Sam Lanahan met me in Fine Grind, although he [more recently joined us](http://www.flickr.com/photos/17157315@N00/sets/72157607350755934/) at the Portland Fish House, a few doors down from Linus Pauling House which he [also frequents](http://www.flickr.com/photos/17157315@N00/3365476757/) when not sailing the ocean blue (another captain, like Barry and Don).I'm also quite fond of Costello's and Chance of Rain, as well as the two at 37th and Hawthorne:  the Peets and the Starbucks, with Oasis and Bagdad for beer and/or pizza.Uncle Bill and I go to Hawthorne Ale House, where we went with [Carla and Sam](http://mybizmo.blogspot.com/2006/11/back-to-silicon-forest.html), other close relatives.Many of my turning point decisions were made in such establishments, can't say I'm complaining.  I've recently added Coney Island to my repertoire (had a [Paranoid beer](http://www.flickr.com/photos/17157315@N00/3455135039/)), am planning to do a lot more with the new Fred Meyer's.Back to CSN:  the more ambitious prototypes need TV studio development with lots of designers present.  I've got [ideas about decor](http://coffeeshopsnet.blogspot.com/2009/03/franchise-motifs.html), as one would hope from a CMO, but I'm not the only stakeholder.I've already tipped my hat to some of my influences, just to give a heads up: we like Tlingit and Chinook, look to family-friendly places like Kaneetah (Warm Springs) for clues.  It's a two way street of course, or at least we hope it is.Obviously, given Google App Engine and Python, I'm thinking in terms of developing a look and feel by that means, immediately solving the ISP problem.However that doesn't entail any given local shop can't host a lot of its own code on some rickety old toaster farm.  Customers like the smell of authentic geek aracana, which you won't have if you outsource everything [to Canada](http://controlroom.blogspot.com/2008/06/xrl-meeting-space.html).My attitude:  if they're wanting to talk to our API out the back, they'll do so, and in whatever language (XML-RPC? -- maybe just a standard DBI).  Python on the server doesn't entail Python on the client, so go ahead and write and run Perl, have tables set aside for Perl divers wanting to show how it's done why not?A lot of the games will be [shipping in binary](http://coffeeshopsnet.blogspot.com/2009/03/proprietary-games.html) looks like, so we won't always know what tools were used to create 'em, nor do we need to know.  Sysadmins have control over ports so games needing to chat with the outside world may need to accommodate modest CSN sandbox requirements.We don't provide the Internet to just any random binary that comes down the pipe, plus we're monitoring the psychometrics ourselves, partly why vendors agree to supply a bonus with each payload (plus we're usually good for their image).Like don't go to a CSN affiliate expecting to load all your own games, familiar from the \"home alone\" context.  Many of our games will be exclusive to CSN.  That's part of how we support our client shops, by following the Grateful Dead model: go ahead and copy, but remember, you heard it here first.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}