{
  "id": "6948742734684161034",
  "title": "The Hunger (movie review)",
  "published": "2014-10-31T10:49:00.000-07:00",
  "updated": "2014-10-31T10:52:02.010-07:00",
  "content": "You'll notice I'm posting this on Halloween, October 31st, as is appropriate given the subject matter:  the fictive vampire phenomenon, acted out by some talented personages: David Bowie, Susan Sarandon; Catherine Deneuve.\n\nSomewhat like in the [most recent Godzilla](http://controlroom.blogspot.com/2014/05/godzilla-movie-review.html), we're finally in a scientific age when these mythical phenomena start getting real explanations.  Godzilla and friends feed off radioactivity and humans' discovery of this primordial \"fire\" has brought them to the surface.\n\nWith vampires, it's a blood thing, and transmitted through biting.  We actually look through the microscope and see that Susan's blood can't stand up to Catherine's, which has far greater immunological properties.\n\nThat's why Catherine's appearance belies her years, ditto Bowie's when the movie opens, somewhat \"in the throwness of things\" as Heidegger might have put it.\n\nWhat a lot of vampires don't understand is their beauty is still fragile, even if longevity is assured, and they're likely to end up in an \"out of sight out of mind\" box in an attic or basement or nursing home someplace.\n\nExactly what causes aging to catch up with one suddenly is still not explained, but data points get added when the \"queen\" falls to her \"death\" (entrapment), and this seems to release her former concubines from their entrapped condition.  A new queen takes her place.  In this way turnover occurs, but slowly.\n\nThe vampire myth allows working out in narrative form what it's like for some mortals to have much longer lifespans than others through blood replacement therapy, extra vitamin C and so on.  The inequities seem obvious, as David Bowie has to relinquish his queen to go on without him, already plotting to snag her next lover (vampires get lonely too).  \n\nIf your sense of karmic inertia suggests life after Bardo, then your desire to pour money into prolonging a given organism's arc might seem less wise or necessary.\n\nHorror films as a genre get to break taboos and cross lines.  Hitchcock's The Birds was one of the first commercial draws to show violence against children to the point of drawing blood.  Bowie's last victim is a brilliantly played fiesty young Beth Ehlers, only ten years my junior...",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}