{
  "id": "4164968962544796725",
  "title": "The Tesseract, the Time Machine and the Tetrahedron",
  "published": "2016-06-21T18:26:00.001-07:00",
  "updated": "2016-06-21T23:25:46.329-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/5650484698/in/photolist-9BjdeY-5ag2Gu)\n\nMy title above is reminiscent of The Lion, the Witch and the Wardrobe, at least in terms of mentioning three rather disparate things.  That's intentional.  [Welcome to Narnia](http://controlroom.blogspot.com/2008/05/prince-caspian-movie-review.html), chuckle.\n\nThis campfire story, suitable for children, is about many great minds and how they grappled with their intuitions in different ways, coming up with different games, yet with overlapping memes, such as \"dimension\" and even \"four dimensional\".\n\nWe associate a [Time Machine](https://en.wikipedia.org/wiki/The_Time_Machine) with [H.G. Wells](https://en.wikipedia.org/wiki/H._G._Wells), who also wrote [War of the Worlds](http://www.4dsolutions.net/satacad/martianmath/mm3.html), but also with Dr. Who I suppose, as [what's that Tardis](https://en.wikipedia.org/wiki/TARDIS) if not an inter-dimensional phone booth?  Milo had his [Phantom Tollbooth](https://en.wikipedia.org/wiki/The_Phantom_Tollbooth) with similar powers to transport.  If only [Gulliver](https://en.wikipedia.org/wiki/Gulliver%27s_Travels) could have had one, to escape the Lilliputians.\n\nHowever lets talk about Regular Polytopes and their rather gentrified neighborhood, in the sense of rectlinear, properly grided, with its main axial boulevards all meeting at right angles, as many as we need.  The upstanding L, as in perpendicular, rules in this multi-dimensional kingdom, of XYZ on steroids.  [Abbott's Flatland](https://en.wikipedia.org/wiki/Flatland) helps us get comfortable with our higher dimensional mental powers.\n\nThen Einstein came along with novel propositions about the relativity of simultaneity and therefore causation (as in \"who made whom do what\"), based on a new kind of dependency, that of one's own coordinate system.  One's point of view determined one's narrative more than we knew, even in physics.  Where you stand depends on where you sit.  Your angle on the action is therefore not \"negligible\" (nor off the table as a matter for peer review).\n\nLinear independence in the Euclidean sense of XYZ was no longer sufficient, as no one God's Eye  coordinate system (interpreted by His [duly appointed minions](http://controlroom.blogspot.com/2015/02/despicable-me-movie-review.html)) could deny the others their physics, and yet these others might nevertheless tell the story in different ways, with different villains and heroes.  Blasphemy!\n\nLogic was not forcing a unique or unitary result, and this seemed threatening to some, especially imperialists. Non-Euclidean geometry seemed subversive (Einstein was Jewish).  However the mathematicians were reassuring:  \"we always promised as many rose gardens as you can manage\" they said, \"given the right fertilizing axioms.\"\n\nJust the right set of axioms (no pun intended) or game rules, will fuel a fire that burns well, a game that plays.  Some won't become eternal favorites, whereas others may sit on a shelf pending rediscovery by players of matching mindset.  The time capsule effect.  Sleepers awaken.\n\nFinally: the Tetrahedron, and a third chapter in our wandering story.\n\nThe primacy of the rectilinear orthodoxy was further called into question.  Why should right angles be so consequential at the end of the day?  They're unavoidable, true, but should they be that definitive?\n\nOn Planet Earth, two perpendiculars to the surface are not parallel to one another.  The smaller one is, relative to the planet, the less difference that makes.  But humans had outgrown their flat earth fixations by 1999.  What if the IVM tetrahedron played as well or better with others vis-a-vis the XYZ cube?\n\nWell it turns out we have a choice of flavors.  Either / or is out the window (more a fallacy than a contradiction).  Enjoy them all, and more besides! \n\nReally, I'm just retelling the story of [4D vs. 4D vs. 4D](http://coffeeshopsnet.blogspot.com/2009/02/glass-bead-game.html) (\"three scoops\"), which is about three ways in which [this 4D meme](http://coffeeshopsnet.blogspot.com/2016/05/4d-meme.html) survived a 20th Century shakeout.  Different generalists commanded each namespace, keeping each coherent enough to avoid flaming out.\n\nThe polytope-minded gentry, many of them French, circled their n-dimensional wagons to protect their geometry from what they saw as time-degraded physics, the savage realm of Energy and Entropy.  Euclidean geometry is pre-Newtonian in its aloofness to temporal matters, almost Platonic in its relationships.\n\nThe Tetrahedron, meanwhile, wove back and forth somewhere in between, not needing a fourth perpendicular necessarily, for its additional degrees of freedom, yet sympathetic to the timelessness of Euclid and Plato.  The concentric arrangements of Platonics and their progeny was \"pre-frequency\" until some \"frequency\" was applied, giving spatiotemporal, special-case meaning.\n\nYes, this story is a deliberate simplification, as the \"dimension\" concept is slipperier than a slippery fish.  We have fractional dimensions today, perhaps even irrationally fractional (like pi).  The levels of indeterminacy and interdependency have also increased, with the discovery of quantum entanglement.\n\nBut hey, this was enough to get us going, and off to bed, to dream of swimming memes.\n\nVisit your local science museum or library, for more information on the Tesseract (4D hypercube), the Time Machine (piloted by Einstein), and the Tetrahedron (4D in a different sense, just count the arrow tips).",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}