{
  "id": "3031369578913339565",
  "title": "The US Civil War: A Study in Failed Social Engineering",
  "published": "2024-03-01T13:17:00.000-08:00",
  "updated": "2024-03-06T05:56:12.986-08:00",
  "content": "A central thesis of The Metaphysical Club [by Louis Menand](https://coffeeshopsnet.blogspot.com/2024/02/history-of-pragmatism.html), is that Pragmatism is in part a reaction to Dogmatism, where the latter typifies a mindset unable to avoid a Civil War. People pay too high a price for principle, based on a sense of self-righteousness. Not pragmatic.What had failed to prevent the US Civil War was in particular the Bible, used to inflame and promote zealotry on all sides. Everyone grew up learning from it, and all Sunday school programming derived from it, yet when push came to shove, a Bible-oriented upbringing (i.e. one's training in Christianity) didn't show the way out, and mayhem ensued. Cain rose against Abel as a great union (a federation), an experiment in social engineering if there ever was one, tore in half. So maybe the Bible didn't have all the answers? [Enter pragmatism](https://controlroom.blogspot.com/2024/02/assembling-puzzle.html).Even among theologians, a healthy skepticism arose: leaning on the saints, on the gospels, on the ancient Greeks (especially Aristotle) for all one's thinking could only be out of laziness. Times change. The new mantra: think for yourself. That's reliable because, per Transcendentalism (as well as Quakerism): you have your God within you (St. Aquinas had said much the same thing).Emerson's exhortations seemed to awaken a universal capacity lurking within the soul of everyman (to use a sexist vocabulary), whereas Whitman conveyed that freeing sense of a blank slate, or at least a new one, a fresh canvas, full of promise and adventure, a new world. A world without the blemish of slavery.Fast forward to our day and say we're in a Palestinian Studies class. The analogies are clear, as the headlines today are about the illegitimacy of forced displacement (what happened to many of these families in the first place) versus whether families have an inherent freedom to escape from harm's way. If Gaza has been an open air prison, then why not give everyone a travel pass and tickets to [some New Gaza](https://controlroom.blogspot.com/2023/10/new-gaza.html) of their choice, with those remaining the ones choosing to hold the fort, until sanity returns to the region? Help everyone stay in touch. Open the system to other refugee populations as well, as we boot up a system of routing hubs especially designed to help out in emergency situations.That may sound like a kind of Zionism, this proposal to facilitate establishing Palestinian colonies elsewhere (so \"ethnic cleansing\" then?), including well outside of West Asia. How about in Cuba for instance, at a place called [Guantanamo](https://controlroom.blogspot.com/2023/10/gazans-to-guantanamo.html), now used for R&R. Keep it a fun place, while putting it to a serious good use. Lose the \"bad neighborhood\" reputation built up for it by the torture taxi club. In considering all these issues, remember how President Lincoln thought: he was very open to the idea of Blacks leaving en masse, for Liberia, for Central America, for Haiti. So were a lot of the abolitionists.  End slavery; send them home. But Lincoln didn't want to \"send\" people against their wills. He might have been prophetic in many ways, but he didn't have twenty-twenty foresight; almost no one does. Not all of the time. If the opportunity were properly presented...Obviously, once you've invested your heart and soul in Alabama or Tennessee or whatever, it's not that easy to want to move anywhere else. But think of how part of the allure of the US military is the opportunities it offers to see the world. Some people will be up for it, especially if free to come back, if only for visits. The new libertarianism posits each human is born with an inherent right to explore the planet; and nation-states are not intended as barriers to this human right so much as facilitators thereof.As a Palestinian, opting for a stint or tour in Jordan or Kuwait was never seen as conceding that Palestine is no longer innately a state, if only [a diaspora state](https://worldgame.blogspot.com/2024/02/network-nations.html), much like Kurdistan, or Tibet are. Or Intel and Hilton.Palestine persists, but not as a synonym for any other entity. Palestine is not a caliphate, nor necessarily an ethno-state of any kind, which is how it manages to realistically aspire to provide a safe haven to a great many ethnicities, like the USA hopes to, and China, including new Islamic sects indigenous to North America, perhaps with histories tracing back to Black Panthers and Malcolm X in some cases. New branches of Judaism are welcome as well. These world religions are all good at getting along with each other, especially when they're not merely real estate agents and property management companies in disguise, using religion as more acceptable packaging or as a tax dodge.What I'm suggesting is that nextgen North Americans (and not only them) would benefit by using current events in West Asia to inform their own developing views of the US Civil War, which is quite a bit further back in time and sometimes much obscured by the gases and dusts of intervening generations. The thought patterns remain important. Read more Octavia Butler maybe?I underline \"North Americans\" because it's a history that's already readily accessible to you if you live here, through monuments (Statue of Liberty) and movies, and because \"[Refugees Я Us](https://controlroom.blogspot.com/2023/09/the-refugee-biz.html)\" i.e. accommodating refugees, migrants, people on the move, is part of our destiny, our role, as denizens of a New World, as polyglot pioneers from all genetic and epigenetic lineages. We wish to not fail hard as social engineers of our own futures, and we study history to learn from our track record as hominids etc. We see mistakes, and successes. We've been smart sometimes too.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}