{
  "id": "7083343419788680850",
  "title": "The Economics (and Psychology) of Philanthropy",
  "published": "2018-10-24T12:30:00.004-07:00",
  "updated": "2018-10-24T12:57:50.322-07:00",
  "content": "[](https://www.flickr.com/photos/kirbyurner/3576943542/in/album-72157618669074193/)\n\nThe way most people think of philanthropy is you first need to amass a fortune, like Dale Carnegie did, or Bill Gates.  Then you get to use that fortune to influence the future in a major way, through various foundations.  The rest of us get to be on the receiving end, begging for patrons.\n\nHowever, since the rise of electronic money (I'm including cryptocurrencies) and the ability to transact at the nickle and dime level (small amounts), it's become a lot easier for you and I, people without vast fortunes, to be philanthropists.  We may go on Patreon and support Youtube channels.  We see the results:  more programming of a kind we favor.\n\nThe Coffee Shops Network is about extending this ecosystem through the use of computer games.  You might not see the reasoning for putting a barrier between a would be donor and a programming channel.  Why can't I just give them the money?  Well of course you can.  Winning the computer game, or scoring high, lets you give others' money, that's the difference.\n\nWho's money?\n\nConsider a biscuit company that hopes you will buy their biscuits.  If you do, you get a token to play the game.  If you score high enough, you get to allocate an amount to charity, from a fund the biscuit company has set aside.  If the game is too difficult, people won't play.  If the game is too easy, the fund will be drained to quickly.  However, with this many parameters to play with, fine tuning occurs and before long, the biscuit company is happy with the increased sales.\n\nA respectable company sets aside money for charity anyway.  In classical Economics, that was called Good Will in the chart of accounts, either explicitly, or perhaps it was measured as such, when writing up the financial statements and prospectus.  Investors like to see their investments going to companies with a conscience.\n\nOne of the main benefits accruing to you, the player, is you're free to publish your track record.  Not only may others get some idea of your skill level, they get to see what charities you consider worthy.  Not everyone has as much time or talent for research.  You may attract imitators.  You may attract fans.  You're a hero after all.\n\nPart of what a Coffee Shop does is provide an environment for comparing notes, for doing research in the first place.\n\nWhat will be the psychological effects of having children think about giving charitable donations from an early age?  What will be the effect on adults?  We don't have all the answers yet.\n\n[](https://www.flickr.com/photos/kirbyurner/3016821511/in/album-72157618669074193/)",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}