{
  "id": "922224075794481893",
  "title": "Vendor Promos",
  "published": "2009-06-10T19:51:00.000-07:00",
  "updated": "2009-06-10T22:31:46.340-07:00",
  "content": "[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgkwZWNGv4SywoRfzcPAY-9kB40xaUDYr-v8ZrIW0bGRUDXWlZSVERuAofUhtJlcXqewpc3ePnt-T-UxFgF_XoVgZXoWD5up8BTP0QT6h-_G9_9VJFkWsZb3OFtZD2GDsQX2T7p97g_2xe5/s1600-h/Pioneer-SquareDaytime.jpg)pioneer courthouse square ([wikimedia](http://en.wikipedia.org/wiki/File:Pioneer-SquareDaytime.jpg))I was scoping some venues for ISEPP recently, given the [grant application](http://www.murdock-trust.org/) on my desk, also [wondering about PPUG](http://mail.python.org/pipermail/portland/2009-June/000726.html) given USB wants [its upper floor](http://coffeeshopsnet.blogspot.com/2009/05/local-politics.html) back, maybe for investment banking purposes ([Grand Avenue](http://worldgame.blogspot.com/2009/05/memorial-day-parade.html) location, heart of ToonTown, sweet).  Yes, this \"tension table\" (below) cries out for \"weighty decisions\" meetings, along with sake.You may have seen, from [archival Carosello reruns](http://www.youtube.com/watch?v=nM06csR74cA) (RAI TV), that commercials earn good will for a company orthogonally to the product itself in many cases, i.e. the charm of the story is what left a good taste, not its relevance to actually shaving or sneezing or whatever the good.Likewise the anime lead in to your promo needn't directly hype your cause, as we presume players usually come armed with foreknowledge.  They already know about BFI and [its campaigns](http://mybizmo.blogspot.com/2009/05/new-bfi-pr.html).The game is about having fun, R&R, enjoying some alternatives to violence (Quakers Play Quake).Of course some customers abhor tasteless cartoon violence or first person shooters of any kind, didn't enter a coffeeshop thinking to yuk it up with immature 14-year-olds in some goddamn arcade fer cryin' out loud.Lets acknowledge these stereotypes exist and take refuge in esoterica.  Our hallmark games give you food for thought first and foremost, have their puzzling elements.  Many are quite serene, [more like Myst](http://worldgame.blogspot.com/2009/06/windmills-r-us.html) or one of those.These aren't games of pure chance remember.  Heroics come at a cost.  Nor are all games equally hard, with some winnable in mere seconds (during a pause between sips, of a Red Bull or whatever -- a way to show off).Others abhor hentai, pokeman, anything Xboxy... [the list goes on](http://mathforum.org/kb/thread.jspa?threadID=1949077&tstart=45), mix 'n match.There's no sense \"imposing\" tastes, plus as any shop owner knows, you're also steering people away in some businesses.Your clientele is in some ways your loudest signal as to what your little shop purveys and with CSN that'd be a philosophy talk of a somewhat esoteric, far western variety, one with lots of geometry, maybe hypertoons -- lookin' good on [those HD flats](http://mybizmo.blogspot.com/2009/04/cywar-in-cyberia.html).[](http://www.flickr.com/photos/17157315@N00/3608303721/):: urban grind, near jantzen bldg ::",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}