{
  "id": "4477041426150736169",
  "title": "Wanderers 2012.8.22",
  "published": "2012-08-22T17:30:00.003-07:00",
  "updated": "2012-08-23T00:26:28.901-07:00",
  "content": "David DiNucci, the computer scientist, was asking me about where I did [Wanderers write-ups](http://controlroom.blogspot.com/2008/12/wanderers-2008129.html).  Mostly in three other blogs, but why not do something different?\n\nI've presented the basics of Coffeeshops Casinos or whatever we call them, a few times at Wanderers, which meets in a boyhood home of the Nobel Prize winning Linus Pauling (February 28, 1901 – August 19, 1994)).\n\nDavid has written a book on concurrency to help people think about the challenges of programming many processes to run in parallel, an exercise often undertaken, in life outside electronic computing.\n\nMy top people in this organization are people I consider top ranking.  They represent characteristics I would want in chiefs of some company, staff or tribe.\n\nOur topics were free ranging as usual.  Jon Bunce brought [one of his comical drawings](http://www.flickr.com/photos/kirbyurner/7841709734/in/photostream) from the 1980s.  I thought it was excellent.  Glenn had three books he's recently purchased.\n\nThere's only partial overlap twixt Wanderers and those whom I describe as my chiefs, with me chief marketing officer or CMO.\n\nThe CEO is entirely fictional and/or mythical, [like a deity](http://controlroom.blogspot.com/2009/10/subgenius-devival.html), so of course that means we cannot be a \"white man LLC\" i.e. a post Civil War corporation with personhood.  The CEO is manifestly a white man though, by the name of Dobbs, smokes a pipe.\n\nYou could call this a placeholder business or emulator (similar to incubator). \n\nYou might spin out a business based on the open source templates presented here.  Others might do the same, but differently.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}