{
  "id": "4436909883691868395",
  "title": "Want to Learn Orgo?",
  "published": "2019-06-30T16:35:00.001-07:00",
  "updated": "2019-08-19T12:24:23.088-07:00",
  "content": "I'm imagining a billboard, kind of funny, with people pulling off the road to satisfy their curiosity.\n\nThe booth brochures (freeway rest stop?) given a sense of it:  don some VR googles, kick back, and see how much organic chemistry you might learn in an evening, a meal included, and a badge or certificate, that you were a player.\n\nSchool of Tomorrow.\n\nYou'll recognize The House of Tomorrow theme perhaps.\n\nNana lives with her ward and believes in a future imagined by Buckminster Fuller, whom many (well, a few) dismiss as a CIA kook, I mean spook.  I mean, look at whom he hung out with.  A cold warrior, right?\n\nBut then, keeping wars cold is not always a bad calling.  Hot warriors want to end the experiments.\n\nAnyway, the movie doesn't look at Fuller especially critically, but nor does it really have much time for any curriculum.\n\nSo I made up a School of Tomorrow to serve as a companion guide to the Bucky stuff, meaning Synergetics and the \"omnidirectional halo\" style of thinking (holistic) it trains us in (No More Secondhand God).\n\nFAQ:\n\nQuestion: So why is my \"VR glasses\" scenario fixated on organic chemistry instead?\n\nAnswer:\n\n(A) It's not either/or and\n(B) I'm living in the old stomping grounds of one Linus Pauling, two-time Nobel Prize winner and discoverer of organic molecular structures.\n\nDr. Pauling (Oregon State University, Cal Tech) paved the way for people to imagine, and find, buckminsterfullerene as a molecule (C60).  That's a condensed version of the story, and a segue to the Bucky chapter.\n\nHe was on on the trail seeking the structure of DNA.  One of his published papers got it wildly wrong, but he wasn't afraid to speculate.  Science would get nowhere without people risking being wrong about stuff. \n\nHe wanted to be a part of the DNA party in the Europe, but the Feds denied him a visa.  The letter denying him said visa is still on display in the special collection at OSU.\n\nLinus was regarded as subversive, as he was always questioning the \"atomic program\" i.e. being honest about the real health effects.  His Peace Prize traces to all that in large degree.  He also spoke out against the internment of Americans of Japanese heritage during WW2, and tried to protect some friends from the wartime paranoia (the mental illness of his peers).\n\nDouglas Strain was very impressed by Pauling's integrity and for that reason committed estate resources to preserving both his and his wife's Ava's papers, and keeping the Linus Pauling House on Hawthorne in decent shape.  I mention that house in my video.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}