{
  "id": "8001854097546914857",
  "title": "Worthy Projects",
  "published": "2014-02-02T20:57:00.004-08:00",
  "updated": "2014-02-19T20:00:54.989-08:00",
  "content": "Two worthy projects came to my attention at Multnomah Meeting today.\n\nAnn Hyde gave me a copy of When a Peace Tree Blooms, a telling the story from the Japanese side, of being atom bombed.  Yet good relations are restored with the perpetrators, a representative of whom brings a gift of seeds that grow into beautiful and fruitful trees with healing powers.\n\nI'll pass this book to Carol and the Disarmament Day (August 6) Committee.  More libraries and gift stores than ours might be interested in this slender tome, the story by Hideko Tamura Snider, and illustrations by Mari Kishi.\n\nAll profits will be [donated to charities](http://www.osdinitiatives.com/) supporting the children of Fukushima. ISBN: 978-0-9894858-0-7.\n\nEven as Ann was sharing about this project, Lew Scholl was setting up the projector for our invited speaker, Dana Iglesias, MD MPH.\n\nThis young yet already experienced family practice doctor has done stints in Haiti, Peru and Nigeria, as well as in the US in some hardship areas.  Her parents hail from Panama.  She grew up in New York and started her medical training in North Carolina.\n\nAfter testing the waters and searching her soul, Dana feels ready to commit fully to the Egbe Hospital Revitalization Project.  Her participation is being [organized by SIM](http://www.sim.org/index.php/worker/5143164).  She needs to fund her own way, about $50K a year which covers travel.  The positive multiplier effects have huge potential.\n\nDana is especially focused on mothers giving birth and pediatric care, though she practices the full gamut of cradle-to-grave medicine.  She is skilled at several kinds of surgery, such as delivery by C-section.  However she feels she makes an even bigger long term difference when able to help influence public health through improved infrastructure and education.\n\nAs of this writing, she was just getting started on her website.\n\nI adjourned to a Peace and Social Concerns Committee after Dana's presentation, in my capacity as AFSC Liaison.  We'd had our meeting of the Area Program Committee since the last meeting and I was to report back.",
  "categories": [],
  "author": "Kirby Urner",
  "blog_name": "coffee_shops"
}